{
  "title": "The Havriliak-Negami and Jurlewicz-Weron-Stanislavsky relaxation models revisited: memory functions based study",
  "authors": [
    "K. Górska",
    "A. Horzela",
    "K. A. Penson"
  ],
  "submission_date": "2023-07-30T11:09:31+00:00",
  "revised_dates": [],
  "abstract": "We provide a review of theoretical results concerning the Havriliak-Negami (HN) and the Jurlewicz-Weron-Stanislavsky (JWS) dielectric relaxation models. We derive explicit forms of functions characterizing relaxation phenomena in the time domain - the relaxation, response and probability distribution functions. We also explain how to construct and solve relevant evolution equations within these models. These equations are usually solved by using the Schwinger parametrization and the integral transforms. Instead, in this work we replace it by the powerful Efros theorem. That allows one to relate physically admissible solutions to the memory-dependent evolution equations with phenomenologically known spectral functions and, from the other side, with the subordination mechanism emerging from a stochastic analysis of processes underpinning considered relaxation phenomena. Our approach is based on a systematic analysis of the memory-dependent evolution equations. It exploits methods of integral transforms, operational calculus and special functions theory with the completely monotone and Bernstein functions. Merging analytic and stochastic methods enables us to give a complete classification of the standard functions used to describe the large class of the relaxation phenomena and to explain their properties.",
  "categories": [
    "math-ph",
    "cond-mat.other"
  ],
  "primary_category": "math-ph",
  "doi": "10.1088/1751-8121/acdf9b",
  "journal_ref": "J. Phys. A: Math. Theor. (2023) 56 313001, (Topical Review, 43 pages)",
  "arxiv_id": "2307.16202",
  "pdf_url": "https://arxiv.org/pdf/2307.16202v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1028422,
  "size_after_bytes": 165890
}