{
  "title": "Detection of Children Abuse by Voice and Audio Classification by Short-Time Fourier Transform Machine Learning implemented on Nvidia Edge GPU device",
  "authors": [
    "Jiuqi Yan",
    "Yingxian Chen",
    "W. W. T. Fok"
  ],
  "submission_date": "2023-07-27T16:48:19+00:00",
  "revised_dates": [],
  "abstract": "The safety of children in children home has become an increasing social concern, and the purpose of this experiment is to use machine learning applied to detect the scenarios of child abuse to increase the safety of children. This experiment uses machine learning to classify and recognize a child's voice and predict whether the current sound made by the child is crying, screaming or laughing. If a child is found to be crying or screaming, an alert is immediately sent to the relevant personnel so that they can perceive what the child may be experiencing in a surveillance blind spot and respond in a timely manner. Together with a hybrid use of video image classification, the accuracy of child abuse detection can be significantly increased. This greatly reduces the likelihood that a child will receive violent abuse in the nursery and allows personnel to stop an imminent or incipient child abuse incident in time. The datasets collected from this experiment is entirely from sounds recorded on site at the children home, including crying, laughing, screaming sound and background noises. These sound files are transformed into spectrograms using Short-Time Fourier Transform, and then these image data are imported into a CNN neural network for classification, and the final trained model can achieve an accuracy of about 92% for sound detection.",
  "categories": [
    "eess.AS",
    "cs.LG",
    "cs.SD"
  ],
  "primary_category": "eess.AS",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15101",
  "pdf_url": "https://arxiv.org/pdf/2307.15101v1",
  "comment": "5 pages, 7 figures, PRAI 2023",
  "num_versions": null,
  "size_before_bytes": 1442187,
  "size_after_bytes": 826955
}