{
  "title": "Ballistic spin-transport properties of magnetic tunnel junctions with MnCr-based ferrimagnetic quaternary Heusler alloys",
  "authors": [
    "Tufan Roy",
    "Masahito Tsujikawa",
    "Masafumi Shirai"
  ],
  "submission_date": "2023-07-31T07:02:20+00:00",
  "revised_dates": [],
  "abstract": "We investigate the suitability of nearly half-metallic ferrimagnetic quaternary Heusler alloys, CoCrMnZ (Z=Al, Ga, Si, Ge) to assess the feasibility as electrode materials of MgO-based magnetic tunnel junctions (MTJ). Low magnetic moments of these alloys originated from the anti-ferromagnetic coupling between Mn and Cr spins ensure a negligible stray field in spintronics devices as well as a lower switching current required to flip their spin direction. We confirmed mechanical stability of these materials from the evaluated values of elastic constants, and the absence of any imaginary frequency in their phonon dispersion curves. The influence of swapping disorders on the electronic structures and their relative stability are also discussed. A high spin polarization of the conduction electrons are observed in case of CoCrMnZ/MgO hetrojunctions, independent of terminations at the interface. Based on our ballistic transport calculations, a large coherent tunnelling of the majority-spin $s$-like $Δ_1$ states can be expected through MgO-barrier. The calculated tunnelling magnetoresistance (TMR) ratios are in the order of 1000\\%. A very high Curie temperatures specifically for CoCrMnAl and CoCrMnGa, which are comparable to $bcc$ Co, could also yield a weaker temperature dependece of TMR ratios for CoCrMnAl/MgO/CoCrMnAl (001) and CoCrMnGa/MgO/CoCrMnGa (001) MTJ.",
  "categories": [
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": "10.1103/PhysRevMaterials.7.104410",
  "journal_ref": null,
  "arxiv_id": "2307.16442",
  "pdf_url": "https://arxiv.org/pdf/2307.16442v1",
  "comment": "24 pages, 13 figures",
  "num_versions": null,
  "size_before_bytes": 4335771,
  "size_after_bytes": 39334
}