{
  "title": "A GPS Alternative using Electrical Transmission Grids as Precision Timing Networks",
  "authors": [
    "Stephen Robson"
  ],
  "submission_date": "2023-07-26T20:44:39+00:00",
  "revised_dates": [],
  "abstract": "It is widely recognised that over-reliance on GNSS (e.g GPS) for time synchronisation represents an acute threat to modern society, and a diversity of alternatives are required to mitigate the threat of an outage. This paper proposes a GNSS alternative using time dissemination over national scale transmission or distribution networks. The method utilises the same frequency bandwidth and coupling technology as established power line carrier technology in conjunction with modern chirp Spread Spectrum modulation. The basis of the method is the transmission of a time synchronised chirp from a central substation. During GNSS operation, all substations can estimate the time of flight by correlating the received chirp with a time-synchronised local copy. During GNSS outage, time sychronisation to the central substation is maintained by correcting for the precalculated time of flight. It is shown that recent advances in chirp spread spectrum allow for a computationally efficient algorithm with the capacity to compute hundreds of thousand of chirp correlations every second, improving the resolution of the system. ATP-EMTP simulations of the method on large transmission networks demonstrate sub-$μ$s timing accuracy even in the presence of low SNR and impulsive noise. An FPGA based prototype is developed and experimental testing also demonstrates sub-$μ$s accuracy for time dissemination over a distance of 700 m. Averaging over time allows operation down to -20 dB, which could extend the range of the system to a national scale.",
  "categories": [
    "eess.SP"
  ],
  "primary_category": "eess.SP",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14495",
  "pdf_url": null,
  "comment": "11 pages",
  "num_versions": null,
  "size_before_bytes": 14304650,
  "size_after_bytes": 500105
}