{
  "title": "Unpinned Dirac-Fermions in Carbon-Phosphorous-Arsenic Based Ternary Monolayer",
  "authors": [
    "Amrendra Kumar",
    "C. Kamal"
  ],
  "submission_date": "2023-07-27T16:56:39+00:00",
  "revised_dates": [],
  "abstract": "We predict energetically and dynamically stable ternary Carbon-Phosphorous-Arsenic (CPAs2) monolayers in buckled geometric structure by employing density functional theory based calculations. We consider three different symmetric configurations, namely, inversion (i), mirror (m) and rotational (r). The low-energy dispersions in electronic band structure and density of states (DOS) around the Fermi level contain two contrasting features: (a) parabolic dispersion around highly symmetric Gamma point with a step function in DOS due to nearly-free-particle-like Schroedinger-Fermions and (b) linear dispersion around highly symmetric K point with linear DOS due to massless Dirac-Fermions for i-CPAs2 monolayer. The step function in DOS is a consequence of two-dimensionality of the system in which the motion of nearly-free-particles is confined. However, a closer look at (b) reveals that the ternary monolayers possess distinct characters, namely (i) massless-gapless, (ii) slightly massive-gapped and (iii) unpinned massless-gapless Dirac-Fermions for i, m and r-CPAs2 configurations respectively. Thus, the nature of states around the Fermi level depends crucially on the symmetry of systems. In addition, we probe the influence of mechanical strain on the properties of CPAs2 monolayer. The results indicate that the characteristic dispersions of (a) and (b) move in opposite directions in energy which leads to a metal-to-semimetal transition in i and r-CPAs2 configurations, for a few percentages of tensile strain. On the other hand, a strain induced metal-to-semiconductor transition is observed in m-CPAs2 configuration with a tunable energy band gap. Interestingly, unlike graphene, the Dirac cones can be unpinned from highly symmetric K (and K') point, but they are restricted to move along the edges (K-M'-K') of first Brillouin zone due to C2 symmetry in i and r-CPAs2 configurations.",
  "categories": [
    "cond-mat.mtrl-sci",
    "cond-mat.mes-hall"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15001",
  "pdf_url": "https://arxiv.org/pdf/2307.15001v1",
  "comment": "14 pages, 9 figures",
  "num_versions": null,
  "size_before_bytes": 26321060,
  "size_after_bytes": 60862
}