{
  "title": "First on-sky results of a FIOS prototype, a Fabry Perot Based Instrument for Oxygen Searches",
  "authors": [
    "Surangkhana Rukdee",
    "Sagi Ben-Ami",
    "Mercedes López-Morales",
    "Andrew Szentgyorgyi",
    "David Charbonneau",
    "Juliana García-Mejía",
    "Johannes Buchner"
  ],
  "submission_date": "2023-07-27T15:41:43+00:00",
  "revised_dates": [],
  "abstract": "The upcoming Extremely Large Telescopes (ELTs) are expected to have the collecting area required to detect potential biosignature gases such as molecular oxygen, $\\mathrm{O_2}$, in the atmosphere of terrestrial planets around nearby stars. One of the most promising detection methods is transmission spectroscopy. To maximize our capability to detect $\\mathrm{O_2}$ using this method, spectral resolutions $\\mathrm{R}\\geq 300,000$ are required to fully resolve the absorption lines in an Earth-like exoplanet atmosphere and disentangle the signal from telluric lines. Current high-resolution spectrographs typically achieve a spectral resolution of $\\mathrm{R}\\sim100,000$. Increasing the resolution in seeing limited observations/instruments requires drastically larger optical components, making these instruments even more expensive and hard to fabricate and assemble. Instead, we demonstrate a new approach to high-resolution spectroscopy. We implemented an ultra-high spectral resolution booster to be coupled in front of a high-resolution spectrograph. The instrument is based on a chained Fabry Perot array which generates a hyperfine spectral profile. We present on-sky telluric observations with a lab demonstrator. Depending on the configuration, this two-arm prototype reaches a resolution of R=250,000-350,000. After carefully modeling the prototype's behavior, we propose a Fabry Perot Interferometer (FPI) design for an eight-arm array configuration aimed at ELTs capable of exceeding R=300,000. The novel FPI resolution booster can be plugged in at the front end of an existing R=100,000 spectrograph to overwrite the spectral profile with a higher resolution for exoplanet atmosphere studies.",
  "categories": [
    "astro-ph.IM",
    "astro-ph.EP"
  ],
  "primary_category": "astro-ph.IM",
  "doi": "10.1051/0004-6361/202346619",
  "journal_ref": "A&A 678, A114 (2023)",
  "arxiv_id": "2307.14947",
  "pdf_url": "https://arxiv.org/pdf/2307.14947v1",
  "comment": "Accepted for publication in A&A; 12 pages, 13 figures",
  "num_versions": null,
  "size_before_bytes": 4038070,
  "size_after_bytes": 193886
}