{
  "title": "Theory of reactions between hydrogen and group-III acceptors in silicon",
  "authors": [
    "José Coutinho",
    "Diana Gomes",
    "Vitor J. B. Torres",
    "Tarek O. Abdul Fattah",
    "Vladimir P. Markevich",
    "Anthony R. Peaker"
  ],
  "submission_date": "2023-07-28T15:45:53+00:00",
  "revised_dates": [],
  "abstract": "The thermodynamics of several reactions involving atomic and molecular hydrogen with group-III acceptors is investigated. The results provide a first-principles-level account of thermally- and carrier-activated processes involving these species. Acceptor-hydrogen pairing is revisited as well. We present a refined physicochemical picture of long-range migration, compensation effects, and short-range reactions, leading to fully passivated $\\equiv\\textrm{Si-H}\\cdots X\\equiv$ structures, where $X$ is a group-III acceptor element. The formation and dissociation of acceptor-H and acceptor-H$_{2}$ complexes is considered in the context of Light and elevated Temperature Induced Degradation (LeTID) of silicon-based solar cells. Besides explaining observed trends and answering several fundamental questions regarding the properties of acceptor-hydrogen pairing, we find that the BH$_{2}$ complex is a by-product along the reaction of H$_{2}$ molecules with boron toward the formation of BH pairs (along with subtraction of free holes). The calculated changes in Helmholtz free energies upon the considered defect reactions, as well as activation barriers for BH$_{2}$ formation/dissociation (close to $\\sim1$ eV) are compatible with the experimentally determined activation energies of degradation/recovery rates of Si:B-based cells during LeTID. Dihydrogenated acceptors heavier than boron are anticipated to be effective-mass-like shallow donors, and therefore, unlikely to show similar non-radiative recombination activity.",
  "categories": [
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": "10.1103/PhysRevB.108.014111",
  "journal_ref": "Physical Review B 108, 014111 (2023)",
  "arxiv_id": "2307.15633",
  "pdf_url": "https://arxiv.org/pdf/2307.15633v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 990427,
  "size_after_bytes": 245927
}