{
  "title": "Street access, Informality and Development: A block level analysis across all of sub-Saharan Africa",
  "authors": [
    "Luis M. A Bettencourt",
    "Nicholas Marchio"
  ],
  "submission_date": "2023-07-30T22:05:01+00:00",
  "revised_dates": [],
  "abstract": "Sustainable development is an imperative worldwide but metrics and data on poverty and quality of life have remained too coarse and abstract to characterize challenges adequately and guide practical progress. Nowhere is this challenge greater than in Africa where we still know relatively little about the systematic spatial details and scope of development. Here, we leverage a complete, high-precision dataset of building footprints to identify infrastructure deficits and infer informal settlements down to the street level everywhere in sub-Saharan Africa. We identify a general pattern of informality with urbanized areas showing, on average, greater access to infrastructure and services than rural and periurban areas, each characterized by a statistically consistent spectrum of uneven local development. We show that our physical measures of informality are systematically associated with many indicators of low human development, and that these form a single principal component predicted by specific functional changes of the built environment. These results demonstrate that the localization of sustainable development is possible down to the street level at a continental scale and provide a general distributed strategy for accelerating progress in infrastructure and service expansion that taps local innovations in a way that is equitable and context appropriate.",
  "categories": [
    "physics.soc-ph",
    "cs.SI"
  ],
  "primary_category": "physics.soc-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16328",
  "pdf_url": "https://arxiv.org/pdf/2307.16328v1",
  "comment": "20 pages, 4 Figures (plus 6 supplementary)",
  "num_versions": null,
  "size_before_bytes": 27017951,
  "size_after_bytes": 521487
}