{
  "title": "RAWIW: RAW Image Watermarking Robust to ISP Pipeline",
  "authors": [
    "Kang Fu",
    "Xiaohong Liu",
    "Jun Jia",
    "Zicheng Zhang",
    "Yicong Peng",
    "Jia Wang",
    "Guangtao Zhai"
  ],
  "submission_date": "2023-07-28T09:50:06+00:00",
  "revised_dates": [],
  "abstract": "Invisible image watermarking is essential for image copyright protection. Compared to RGB images, RAW format images use a higher dynamic range to capture the radiometric characteristics of the camera sensor, providing greater flexibility in post-processing and retouching. Similar to the master recording in the music industry, RAW images are considered the original format for distribution and image production, thus requiring copyright protection. Existing watermarking methods typically target RGB images, leaving a gap for RAW images. To address this issue, we propose the first deep learning-based RAW Image Watermarking (RAWIW) framework for copyright protection. Unlike RGB image watermarking, our method achieves cross-domain copyright protection. We directly embed copyright information into RAW images, which can be later extracted from the corresponding RGB images generated by different post-processing methods. To achieve end-to-end training of the framework, we integrate a neural network that simulates the ISP pipeline to handle the RAW-to-RGB conversion process. To further validate the generalization of our framework to traditional ISP pipelines and its robustness to transmission distortion, we adopt a distortion network. This network simulates various types of noises introduced during the traditional ISP pipeline and transmission. Furthermore, we employ a three-stage training strategy to strike a balance between robustness and concealment of watermarking. Our extensive experiments demonstrate that RAWIW successfully achieves cross-domain copyright protection for RAW images while maintaining their visual quality and robustness to ISP pipeline distortions.",
  "categories": [
    "eess.IV"
  ],
  "primary_category": "eess.IV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15443",
  "pdf_url": "https://arxiv.org/pdf/2307.15443v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 35613100,
  "size_after_bytes": 146928
}