{
  "title": "DeepQMC: an open-source software suite for variational optimization of deep-learning molecular wave functions",
  "authors": [
    "Zeno Schätzle",
    "Bernát Szabó",
    "Matĕj Mezera",
    "Jan Hermann",
    "Frank Noé"
  ],
  "submission_date": "2023-07-26T11:43:14+00:00",
  "revised_dates": [
    "2023-09-25T00:22:31+00:00"
  ],
  "abstract": "Computing accurate yet efficient approximations to the solutions of the electronic Schrödinger equation has been a paramount challenge of computational chemistry for decades. Quantum Monte Carlo methods are a promising avenue of development as their core algorithm exhibits a number of favorable properties: it is highly parallel, and scales favorably with the considered system size, with an accuracy that is limited only by the choice of the wave function ansatz. The recently introduced machine-learned parametrizations of quantum Monte Carlo ansatzes rely on the efficiency of neural networks as universal function approximators to achieve state of the art accuracy on a variety of molecular systems. With interest in the field growing rapidly, there is a clear need for easy to use, modular, and extendable software libraries facilitating the development and adoption of this new class of methods. In this contribution, the DeepQMC program package is introduced, in an attempt to provide a common framework for future investigations by unifying many of the currently available deep-learning quantum Monte Carlo architectures. Furthermore, the manuscript provides a brief introduction to the methodology of variational quantum Monte Carlo in real space, highlights some technical challenges of optimizing neural network wave functions, and presents example black-box applications of the program package. We thereby intend to make this novel field accessible to a broader class of practitioners both from the quantum chemistry as well as the machine learning communities.",
  "categories": [
    "physics.chem-ph"
  ],
  "primary_category": "physics.chem-ph",
  "doi": "10.1063/5.0157512",
  "journal_ref": null,
  "arxiv_id": "2307.14123",
  "pdf_url": null,
  "comment": "17 pages, 12 figures",
  "num_versions": null,
  "size_before_bytes": 3310666,
  "size_after_bytes": 269190
}