{
  "title": "Agent-Based Modelling for Real-World Stock Markets under Behavioral Economic Principles",
  "authors": [
    "Tianlang He",
    "Fengming Zhu",
    "Keyan Lu",
    "Chang Xu",
    "Yang Liu",
    "Weiqing Liu",
    "Fangzhen Lin",
    "S. -H. Gary Chan",
    "Jiang Bian"
  ],
  "submission_date": "2023-06-05T13:38:51+00:00",
  "revised_dates": [
    "2024-10-15T00:53:50+00:00",
    "2025-10-14T01:43:47+00:00"
  ],
  "abstract": "The reproduction of realistic dynamics in financial markets is of great significance, as it enhances our understanding of market evolution beyond other physical processes, and facilitates the development and backtesting of investment strategies. Most existing literature approaches this issue as a time series forecasting problem, which often faces challenges such as 1) overfitting historical data, 2) failing to reconstruct stylized facts, and 3) limiting users' ability to conduct counterfactual analyses. To address these limitations, we employ agent-based modeling (ABM) for market simulation, where each trader acts as an autonomous agent guided by established behavioral-economic principles. The parameters of the agent model are subsequently calibrated using deep learning techniques. Additionally, we align our agent model with publicly available economic indices, such as the Consumer Price Index (CPI), to enhance the explainability of our system's outcomes. Our experiments demonstrate that the ABM method effectively reproduces market dynamics with a confidence level of 90%, accurately reflecting well-known stylized facts. Furthermore, the calibration process proves to be more computationally efficient compared to other existing methods that perform simulation-based inference. We also present case studies illustrating the correlation between agent parameters and economic indices.",
  "categories": [
    "cs.MA"
  ],
  "primary_category": "cs.MA",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12987",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 6614398,
  "size_after_bytes": 2340321
}