{
  "title": "The unseen host galaxy and high dispersion measure of a precisely-localised Fast Radio Burst suggests a high-redshift origin",
  "authors": [
    "Lachlan Marnoch",
    "Stuart D. Ryder",
    "Clancy W. James",
    "Alexa C. Gordon",
    "Mawson W. Sammons",
    "J. Xavier Prochaska",
    "Nicolas Tejos",
    "Adam T. Deller",
    "Danica R. Scott",
    "Shivani Bhandari",
    "Marcin Glowacki",
    "Elizabeth K. Mahony",
    "Richard M. McDermid",
    "Elaine M. Sadler",
    "Ryan M. Shannon",
    "Hao Qiu"
  ],
  "submission_date": "2023-07-27T08:46:42+00:00",
  "revised_dates": [
    "2023-08-01T04:01:24+00:00"
  ],
  "abstract": "FRB 20210912A is a fast radio burst (FRB), detected and localised to sub-arcsecond precision by the Australian Square Kilometre Array Pathfinder. No host galaxy has been identified for this burst despite the high precision of its localisation and deep optical and infrared follow-up, to 5-$σ$ limits of $R=26.7$ mag and $K_\\mathrm{s}=24.9$ mag with the Very Large Telescope. The combination of precise radio localisation and deep optical imaging has almost always resulted in the secure identification of a host galaxy, and this is the first case in which the line-of-sight is not obscured by the Galactic disk. The dispersion measure of this burst, $\\mathrm{DM_{FRB}}=1233.696\\pm0.006~\\mathrm{pc}\\ \\mathrm{cm}^{-3}$, allows for a large source redshift of $z>1$ according to the Macquart relation. It could thus be that the host galaxy is consistent with the known population of FRB hosts, but is too distant to detect in our observations ($z>0.7$ for a host like that of the first repeating FRB source, FRB 20121102A); that it is more nearby with a significant excess in $\\mathrm{DM_{host}}$, and thus dimmer than any known FRB host; or, least likely, that the FRB is truly hostless. We consider each possibility, making use of the population of known FRB hosts to frame each scenario. The fact of the missing host has ramifications for the FRB field: even with high-precision localisation and deep follow-up, some FRB hosts may be difficult to detect, with more distant hosts being the less likely to be found. This has implications for FRB cosmology, in which high-redshift detections are valuable.",
  "categories": [
    "astro-ph.HE",
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.HE",
  "doi": "10.1093/mnras/stad2353",
  "journal_ref": null,
  "arxiv_id": "2307.14702",
  "pdf_url": "https://arxiv.org/pdf/2307.14702v2",
  "comment": "14 pages, 6 figures. Revised based on referee's comments and accepted to MNRAS",
  "num_versions": null,
  "size_before_bytes": 3983304,
  "size_after_bytes": 2186614
}