{
  "title": "Optimizing parameter search for community detection in time evolving networks of complex systems",
  "authors": [
    "ItaloIvo Lima Dias Pinto",
    "Javier Omar Garcia",
    "Kanika Bansal"
  ],
  "submission_date": "2023-07-24T03:38:34+00:00",
  "revised_dates": [],
  "abstract": "Network representations have been effectively employed to analyze complex systems across various areas and applications, leading to the development of network science as a core tool to study systems with multiple components and complex interactions. There is a growing interest in understanding the temporal dynamics of complex networks to decode the underlying dynamic processes through the temporal changes in network structure. Community detection algorithms, which are specialized clustering algorithms, have been instrumental in studying these temporal changes. They work by grouping nodes into communities based on the structure and intensity of network connections over time aiming to maximize modularity of the network partition. However, the performance of these algorithms is highly influenced by the selection of resolution parameters of the modularity function used, which dictate the scale of the represented network, both in size of communities and the temporal resolution of dynamic structure. The selection of these parameters has often been subjective and heavily reliant on the characteristics of the data used to create the network structure. Here, we introduce a method to objectively determine the values of the resolution parameters based on the elements of self-organization. We propose two key approaches: (1) minimization of the biases in spatial scale network characterization and (2) maximization of temporal scale-freeness. We demonstrate the effectiveness of these approaches using benchmark network structures as well as real-world datasets. To implement our method, we also provide an automated parameter selection software package that can be applied to a wide range of complex systems.",
  "categories": [
    "q-bio.NC",
    "nlin.AO",
    "physics.data-an"
  ],
  "primary_category": "q-bio.NC",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12505",
  "pdf_url": null,
  "comment": "28 pages, 7 figures",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}