{
  "title": "Large sample properties of GMM estimators under second-order identification",
  "authors": [
    "Hugo Kruiniger"
  ],
  "submission_date": "2023-07-25T13:08:32+00:00",
  "revised_dates": [
    "2025-08-29T00:33:47+00:00"
  ],
  "abstract": "Dovonon and Hall (Journal of Econometrics, 2018) proposed a limiting distribution theory for GMM estimators for a p - dimensional globally identified parameter vector φ when local identification conditions fail at first-order but hold at second-order. They assumed that the first-order underidentification is due to the expected Jacobian having rank p-1 at the true value φ_{0}, i.e., having a rank deficiency of one. After reparametrizing the model such that the last column of the Jacobian vanishes, they showed that the GMM estimator of the first p-1 parameters converges at rate T^{-1/2} and the GMM estimator of the remaining parameter, φ_{p}, converges at rate T^{-1/4}. They also provided a limiting distribution of T^{1/4}(φ_{p}-φ_{0,p}) subject to a (non-transparent) condition which they claimed to be not restrictive in general. However, as we show in this paper, their condition is in fact only satisfied when φ is overidentified and the limiting distribution of T^{1/4}(φ_{p}-φ_{0,p}), which is non-standard, depends on whether φ is exactly identified or overidentified. In particular, the limiting distributions of the sign of T^{1/4}(φ_{p}-φ_{0,p}) for the cases of exact and overidentification, respectively, are different and are obtained by using expansions of the GMM objective function of different orders. Unsurprisingly, we find that the limiting distribution theories of Dovonon and Hall (2018) for Indirect Inference (II) estimation under two different scenarios with second-order identification where the target function is a GMM estimator of the auxiliary parameter vector, are incomplete for similar reasons. We discuss how our results for GMM estimation can be used to complete both theories and how they can be used to obtain the limiting distributions of the II estimators in the case of exact identification under either scenario.",
  "categories": [
    "econ.EM",
    "math.ST"
  ],
  "primary_category": "econ.EM",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13475",
  "pdf_url": null,
  "comment": "27 pages",
  "num_versions": null,
  "size_before_bytes": 231216,
  "size_after_bytes": 231688
}