{
  "title": "Structured Analysis Reveals Fundamental Mathematical Relationships between Wind and Solar Generations and the United Kingdom Electricity System",
  "authors": [
    "Anthony D Stephens",
    "David R Walwyn"
  ],
  "submission_date": "2023-07-12T07:49:19+00:00",
  "revised_dates": [],
  "abstract": "The use of wind and solar generation is fundamental to the decarbonisation of the United Kingdom electricity system. However, the optimal level of renewable energy as a proportion of total demand is still being debated. In this paper, several models, whose aims are to predict the efficiency of future system configurations, are explained. The models use historic records from the Gridwatch website for the year 2017, which are then scaled accordingly. The model predictions are first demonstrated for the 2035 Scenario as proposed by the National Grid in FES 2022. The analysis reveals that at least one third of the available wind and solar generation will exceed the ability of the electricity system to use it and will have to be shed. By defining an efficiency measure, the Marginal Decarbonisation Efficiency, which quantifies the incremental extent to which wind generation can decarbonise the electricity system, it is shown that the 2035 Scenario will have a low efficiency. Moreover, it will require the use of combined cycle gas turbines, which is at variants with the predictions of the National Grid steady state model. The paper also describes the derivation of a Generic Model, which allows the level of wind energy and dispatchable generation for all system configurations likely to be encountered in future decades, to be calculated without the use of computer models.",
  "categories": [
    "physics.soc-ph",
    "eess.SY"
  ],
  "primary_category": "physics.soc-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11840",
  "pdf_url": null,
  "comment": "17 pages, 7 figures, 1 table, unpublished paper",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}