{
  "title": "Primitive Skill-based Robot Learning from Human Evaluative Feedback",
  "authors": [
    "Ayano Hiranaka",
    "Minjune Hwang",
    "Sharon Lee",
    "Chen Wang",
    "Li Fei-Fei",
    "Jiajun Wu",
    "Ruohan Zhang"
  ],
  "submission_date": "2023-07-28T20:48:30+00:00",
  "revised_dates": [
    "2023-08-02T06:22:24+00:00"
  ],
  "abstract": "Reinforcement learning (RL) algorithms face significant challenges when dealing with long-horizon robot manipulation tasks in real-world environments due to sample inefficiency and safety issues. To overcome these challenges, we propose a novel framework, SEED, which leverages two approaches: reinforcement learning from human feedback (RLHF) and primitive skill-based reinforcement learning. Both approaches are particularly effective in addressing sparse reward issues and the complexities involved in long-horizon tasks. By combining them, SEED reduces the human effort required in RLHF and increases safety in training robot manipulation with RL in real-world settings. Additionally, parameterized skills provide a clear view of the agent's high-level intentions, allowing humans to evaluate skill choices before they are executed. This feature makes the training process even safer and more efficient. To evaluate the performance of SEED, we conducted extensive experiments on five manipulation tasks with varying levels of complexity. Our results show that SEED significantly outperforms state-of-the-art RL algorithms in sample efficiency and safety. In addition, SEED also exhibits a substantial reduction of human effort compared to other RLHF methods. Further details and video results can be found at https://seediros23.github.io/.",
  "categories": [
    "cs.RO",
    "cs.AI"
  ],
  "primary_category": "cs.RO",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15801",
  "pdf_url": "https://arxiv.org/pdf/2307.15801v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 22920952,
  "size_after_bytes": 674453
}