{
  "title": "Measuring Gravitational Wave Speed and Lorentz Violation with the First Three Gravitational-Wave Catalogs",
  "authors": [
    "Anarya Ray",
    "Pinchen Fan",
    "Vincent F. He",
    "Malachy Bloom",
    "Suyu Michael Yang",
    "Jay D. Tasson",
    "Jolien D. E. Creighton"
  ],
  "submission_date": "2023-07-24T19:41:13+00:00",
  "revised_dates": [
    "2025-01-03T01:39:57+00:00"
  ],
  "abstract": "The speed of gravitational waves $v_g$ can be measured with the time delay between gravitational-wave detectors. Our study provides a more precise measurement of $v_g$ using gravitational-wave signals only, compared with previous studies. We select 52 gravitational-wave events that were detected with high confidence by at least two detectors in the first three observing runs (O1, O2, and O3) of Advanced LIGO and Advanced Virgo. We use Markov chain Monte Carlo and nested sampling to estimate the $v_g$ posterior distribution for each of those events. We then combine their posterior distributions to find the 90% credible interval of the combined $v_g$ distribution for which we obtain $0.99^{+0.02}_{-0.02}c$ without the use of more accurate sky localization from the electromagnetic signal associated with GW170817. Restricting attention to the 50 binary black hole events generates the same result, while the use of the electromagnetic sky localization for GW170817 gives a tighter constraint of $0.99^{+0.01}_{-0.02}c$. The abundance of gravitational wave events allows us to apply hierarchical Bayesian inference on the posterior samples to simultaneously constrain all nine coefficients for Lorentz violation in the nondispersive, nonbirefringent limit of the gravitational sector of the Standard-Model Extension test framework. We compare the hierarchical Bayesian inference method with other methods of combining limits on Lorentz violation in the gravity sector that are found in the literature.",
  "categories": [
    "gr-qc"
  ],
  "primary_category": "gr-qc",
  "doi": "10.1103/PhysRevD.110.122001",
  "journal_ref": "Phys. Rev. D 110, 122001 (2024)",
  "arxiv_id": "2307.13099",
  "pdf_url": null,
  "comment": "Published version, 18 pages, 5 figures, 3 tables",
  "num_versions": null,
  "size_before_bytes": 8428824,
  "size_after_bytes": 291960
}