{
  "title": "Predicting Coupled Electron and Phonon Transport Using Steepest-Entropy-Ascent Quantum Thermodynamics",
  "authors": [
    "J. A. Worden",
    "M. R. von Spakovsky",
    "C. Hin"
  ],
  "submission_date": "2023-07-24T02:24:35+00:00",
  "revised_dates": [
    "2023-07-27T00:01:11+00:00",
    "2023-09-04T00:07:01+00:00",
    "2023-10-03T01:00:54+00:00",
    "2024-07-16T00:05:51+00:00",
    "2024-11-05T01:43:00+00:00"
  ],
  "abstract": "The principal paradigm for determining the thermoelectric properties of materials is based on the Boltzmann transport equations (BTEs) or Landauer equivalent. These equations depend on the electron and phonon density of states (e-DOS and p-DOS) derived from ab initio calculations performed using density functional theory and density functional perturbation theory. Recent computational advances have enabled consideration of phonon-phonon and electron-phonon interactions in these calculations. Leveraging these DOS, the single species BTE or Landauer equivalent can ascertain key thermoelectric properties but overlooks the intrinsic coupling between the e-DOS and p-DOS. To account for this, the multispecies BTE paradigm has, despite its substantial computational burden, been utilized, yielding excellent results in agreement with experiment. To alleviate this computational burden, the steepest-entropy-ascent quantum thermodynamic (SEAQT) equation of motion (EOM), which inherently satisfies both the postulates of quantum mechanics and thermodynamics and predicts the evolution of non-equilibrium states, can be used. Employing the e-DOS and p-DOS as input as well as calculated SEAQT electron and phonon relaxation parameter values that are based on ab initio values of relaxation times, group velocities, and effective masses found in the literature, the EOM accurately computes material transport properties, accounting for the e-DOS and p- DOS coupling. It does so at a significantly reduced computational cost across multiple spatial and temporal scales in a single analysis. A succinct overview of the SEAQT framework and its EOM with comparisons of its predictions to measured data for the transport properties of Si, doped Si, and Bi2Te3 is given.",
  "categories": [
    "physics.comp-ph",
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "physics.comp-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12478",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 19634706,
  "size_after_bytes": 5675953
}