{
  "title": "Long-Range Attraction between Graphene and Water/Oil Interfaces",
  "authors": [
    "Avishi Abeywickrama",
    "Douglas H. Adamson",
    "Hannes C. Schniepp"
  ],
  "submission_date": "2023-07-28T16:39:02+00:00",
  "revised_dates": [
    "2023-12-23T18:37:53+00:00"
  ],
  "abstract": "We directly measured the interactions between a hydrophobic solid and a hydrophobic liquid separated by water using force spectroscopy, where colloidal probes were coated with graphene oxide (GO) to interact with immobilized heptane droplets in water. We detected attractions with a long range of ~0.5 microns, which cannot be readily explained by standard Derjaguin-Landau-Verwey-Overbeek (DLVO) theory. When the GO was reduced to become more hydrophobic, these forces increased in strength and ranged up to 1.2 microns, suggesting that the hydrophobic nature of the involved surfaces critically influences the observed long-range forces. Previous studies have addressed such hydrophobic attractions, but were limited to solid/water/solid and solid/water/air scenarios. Here we expand this knowledge to include the solid/water/liquid situation. Based on our results, we propose air bubbles attached to the colloidal probe and molecular rearrangement at the water/oil interface as possible origins of the observed interactions. The proposed mechanism expands insights gained from previous to the solid/water/liquid situation and is universally applicable to describe attractive interactions between hydrophobic bodies of any kind separated by water. Our work will be useful to understand and motivate the formation of many colloid and interface phenomena, including emulsions using 2D materials and other amphiphilic/hydrophobic particles.",
  "categories": [
    "cond-mat.soft",
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.soft",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15658",
  "pdf_url": "https://arxiv.org/pdf/2307.15658v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 7612244,
  "size_after_bytes": 4452393
}