{
  "title": "Freespace Optical Flow Modeling for Automated Driving",
  "authors": [
    "Yi Feng",
    "Ruge Zhang",
    "Jiayuan Du",
    "Qijun Chen",
    "Rui Fan"
  ],
  "submission_date": "2023-07-29T13:49:48+00:00",
  "revised_dates": [
    "2023-08-03T02:59:21+00:00"
  ],
  "abstract": "Optical flow and disparity are two informative visual features for autonomous driving perception. They have been used for a variety of applications, such as obstacle and lane detection. The concept of \"U-V-Disparity\" has been widely explored in the literature, while its counterpart in optical flow has received relatively little attention. Traditional motion analysis algorithms estimate optical flow by matching correspondences between two successive video frames, which limits the full utilization of environmental information and geometric constraints. Therefore, we propose a novel strategy to model optical flow in the collision-free space (also referred to as drivable area or simply freespace) for intelligent vehicles, with the full utilization of geometry information in a 3D driving environment. We provide explicit representations of optical flow and deduce the quadratic relationship between the optical flow component and the vertical coordinate. Through extensive experiments on several public datasets, we demonstrate the high accuracy and robustness of our model. Additionally, our proposed freespace optical flow model boasts a diverse array of applications within the realm of automated driving, providing a geometric constraint in freespace detection, vehicle localization, and more. We have made our source code publicly available at https://mias.group/FSOF.",
  "categories": [
    "cs.RO",
    "cs.AI",
    "cs.CV"
  ],
  "primary_category": "cs.RO",
  "doi": "10.1109/TMECH.2023.3300729",
  "journal_ref": null,
  "arxiv_id": "2307.15989",
  "pdf_url": "https://arxiv.org/pdf/2307.15989v2",
  "comment": "This article has been accepted by IEEE/ASME Transactions on Mechatronics (T-Mech)",
  "num_versions": null,
  "size_before_bytes": 9089171,
  "size_after_bytes": 545274
}