{
  "title": "z-GAL -- A NOEMA spectroscopic redshift survey of bright Herschel galaxies: [I] Overview",
  "authors": [
    "P. Cox",
    "R. Neri",
    "S. Berta",
    "D. Ismail",
    "F. Stanley",
    "A. Young",
    "S. Jin",
    "T. Bakx",
    "A. Beelen",
    "H. Dannerbauer",
    "M. Krips",
    "M. Lehnert",
    "A. Omont",
    "D. A. Riechers",
    "A. J. Baker",
    "G. Bendo",
    "E. Borsato",
    "V. Buat",
    "K. Butler",
    "N. Chartab",
    "A. Cooray",
    "S. Dye",
    "S. Eales",
    "R. Gavazzi",
    "D. Hughes",
    "R. Ivison",
    "B. M. Jones",
    "L. Marchetti",
    "H. Messias",
    "A. Nanni",
    "M. Negrello",
    "I. Perez-Fournon",
    "S. Serjeant",
    "S. Urquhart",
    "C. Vlahakis",
    "A. Weiss",
    "P. van der Werf",
    "C. Yang"
  ],
  "submission_date": "2023-07-28T18:00:01+00:00",
  "revised_dates": [],
  "abstract": "(Abridged) Using the IRAM NOEMA interferometer, we measures the redshifts of 126 bright galaxies detected in the Herschel H-ATLAS, HeLMS, and HerS surveys. We report reliable spectroscopic redshifts for a total of 124 of the Herschel-selected galaxies. The redshifts are estimated from scans of the 3 and 2-mm bands (and, in one case, the 1-mm band) and are based on the detection of at least two emission lines. Together with the Pilot Programme (Neri et al. 2020), including spectroscopic redshifts of 11 sources, our survey has derived precise redshifts for 135 bright Herschel-selected galaxies, making it the largest sample of high-z galaxies with robust redshifts to date. Most emission lines detected are from 12CO (mainly from J=2-1 to 5-4), with some sources seen in [CI] and H2O emission lines. The spectroscopic redshifts are in the range 0.8<z<6.55 with a median value of z=2.56 +/- 0.10. The line widths of the sources are large, with a mean value for the full width at half maximum Delta(V) of 590 +/- 25 km/s and with 35% of the sources having widths of 700 km/s < Delta(V) < 1800 km/s. Most of the sources are unresolved or barely resolved on scales of 2 to 3 arcsec (or linear sizes of 15-25 kpc, unlensed). Some fields reveal double or multiple sources and, in some cases, sources at different redshifts. Taking these sources into account, there are, in total, 165 individual sources with robust spectroscopic redshifts, including lensed galaxies, binary systems, and over-densities. We present an overview of the z-GAL survey and provide the observed properties of the emission lines, the derived spectroscopic redshifts, and an atlas of the entire sample. The data presented here will serve as a foundation for the other z-GAL papers in this series reporting on the dust emission, the molecular and atomic gas properties, and a detailed analysis of the nature of the sources.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.1051/0004-6361/202346801",
  "journal_ref": "A&A 678, A26 (2023)",
  "arxiv_id": "2307.15732",
  "pdf_url": "https://arxiv.org/pdf/2307.15732v1",
  "comment": "Accepted for publication on A&A; 63 pages",
  "num_versions": null,
  "size_before_bytes": 41639080,
  "size_after_bytes": 309074
}