{
  "title": "Antiferromagnetic $α$-MnTe: Molten-Salt-Assisted Chemical Vapor Deposition Growth and Magneto-Transport Properties",
  "authors": [
    "Shuaixing Li",
    "Jianghua Wu",
    "Binxi Liang",
    "Luhao Liu",
    "Wei Zhang",
    "Nasrullah Wazir",
    "Jian Zhou",
    "Yuwei Liu",
    "Yuefeng Nie",
    "Yufeng Hao",
    "Peng Wang",
    "Lin Wang",
    "Yi Shi",
    "Songlin Li"
  ],
  "submission_date": "2023-06-25T06:32:02+00:00",
  "revised_dates": [],
  "abstract": "Antiferromagnetic (AF) materials are attracting increasing interest of research in magnetic physics and spintronics. Here, we report controllable synthesis of room-temperature AF $α$-MnTe nanocrystals (Néel temperature ~ 307 K) via molten-salt-assisted chemical vapor deposition method. The growth kinetics are investigated regarding the dependence of flake dimension and macroscopic shape on growth time and temperature. The high crystalline quality and atomic structure are confirmed by various crystallographic characterization means. Cryogenic magneto-transport measurements reveal anisotropic magnetoresistance (MR) response and a complicated dependence of MR on temperature, owing to the subtle competition among multiple scattering mechanisms of thermally excited magnetic disorders (magnon drag), magnetic transition and thermally populated lattice phonons. Overall positive MR behavior with twice transitions in magnitude is observed when out-of-plane external magnetic field ($B$) is applied, while a transition from negative to positive MR response is recorded when in-plane $B$ is applied. The rich magnetic transport properties render $α$-MnTe a promising material for exploiting functional components in magnetic devices.",
  "categories": [
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": "10.1021/acs.chemmater.1c04066",
  "journal_ref": "Chemistry of Materials, 34, 873 (2022)",
  "arxiv_id": "2307.13615",
  "pdf_url": null,
  "comment": "15 pages, 4 figures",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}