{
  "title": "Temporal and Spectral Properties of the Persistent Radio Source Associated with FRB 20190520B with the VLA",
  "authors": [
    "Xian Zhang",
    "Wenfei Yu",
    "Casey Law",
    "Di Li",
    "Shami Chatterjee",
    "Paul Demorest",
    "Zhen Yan",
    "Chenhui Niu",
    "Kshitij Aggarwal",
    "Reshma Anna-Thomas",
    "Sarah Burke-Spolaor",
    "Liam Connor",
    "Chao-wei Tsai",
    "Weiwei Zhu",
    "Gan Luo"
  ],
  "submission_date": "2023-07-31T00:31:38+00:00",
  "revised_dates": [
    "2023-10-23T06:53:01+00:00"
  ],
  "abstract": "Among more than 800 known fast radio bursts (FRBs), only two, namely FRB 20121102A and FRB 20190520B, are confirmed to be associated with a persistent radio sources (PRS). Here we report evidence of apparent temporal variability in the PRS associated with the bursting FRB 20190520B based on the Karl G. Jansky Very Large Array (VLA) observations taken in 2020 and 2021. Based on the analysis of epoch-to-epoch variability of the PRS at L, S, C, and X band in 1-12 GHz, we detected not only overall marginal variability but also a likely radio flux decrease ($\\sim$ 3.2 $σ$) between the observations taken in 2020 and 2021 at 3 GHz. Assuming no spectral variation in the PRS during these observations, we found the evidence for an overall broadband radio flux decrease by about 20 percent between the 2020 and the 2021 observations, suggesting that the PRS probably evolves on the yearly time scale. If we attribute the marginal variability at 3 GHz as intrinsic or due to scintillation, the size of potential variable component of the PRS is constrained to be sub-parsec. On the other hand, the size of the PRS can be also constrained to be larger than about 0.22 parsec from the averaged radio spectrum and the integrated radio luminosity in the 1-12 GHz band based on equipartition and self-absorption arguments. We discuss potential origins of the PRS and suggest that an accreting compact object origin might be able to explain the PRS's temporal and spectral properties. Confirmation of variability or flux decline of the PRS would be critical to our understanding of the PRS and its relation to the bursting source.",
  "categories": [
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.HE",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16355",
  "pdf_url": "https://arxiv.org/pdf/2307.16355v2",
  "comment": "12 pages, 3 figures, accepted for publication in ApJ",
  "num_versions": null,
  "size_before_bytes": 3600701,
  "size_after_bytes": 1791623
}