{
  "title": "BOURNE: Bootstrapped Self-supervised Learning Framework for Unified Graph Anomaly Detection",
  "authors": [
    "Jie Liu",
    "Mengting He",
    "Xuequn Shang",
    "Jieming Shi",
    "Bin Cui",
    "Hongzhi Yin"
  ],
  "submission_date": "2023-07-28T00:44:57+00:00",
  "revised_dates": [
    "2023-11-20T03:30:24+00:00"
  ],
  "abstract": "Graph anomaly detection (GAD) has gained increasing attention in recent years due to its critical application in a wide range of domains, such as social networks, financial risk management, and traffic analysis. Existing GAD methods can be categorized into node and edge anomaly detection models based on the type of graph objects being detected. However, these methods typically treat node and edge anomalies as separate tasks, overlooking their associations and frequent co-occurrences in real-world graphs. As a result, they fail to leverage the complementary information provided by node and edge anomalies for mutual detection. Additionally, state-of-the-art GAD methods, such as CoLA and SL-GAD, heavily rely on negative pair sampling in contrastive learning, which incurs high computational costs, hindering their scalability to large graphs. To address these limitations, we propose a novel unified graph anomaly detection framework based on bootstrapped self-supervised learning (named BOURNE). We extract a subgraph (graph view) centered on each target node as node context and transform it into a dual hypergraph (hypergraph view) as edge context. These views are encoded using graph and hypergraph neural networks to capture the representations of nodes, edges, and their associated contexts. By swapping the context embeddings between nodes and edges and measuring the agreement in the embedding space, we enable the mutual detection of node and edge anomalies. Furthermore, BOURNE can eliminate the need for negative sampling, thereby enhancing its efficiency in handling large graphs. Extensive experiments conducted on six benchmark datasets demonstrate the superior effectiveness and efficiency of BOURNE in detecting both node and edge anomalies.",
  "categories": [
    "cs.SI",
    "cs.AI"
  ],
  "primary_category": "cs.SI",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15244",
  "pdf_url": "https://arxiv.org/pdf/2307.15244v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 19652018,
  "size_after_bytes": 944431
}