{
  "title": "Catalog of Unconventional Magnons in Collinear Magnets",
  "authors": [
    "Xiaobing Chen",
    "Yuntian Liu",
    "Pengfei Liu",
    "Yutong Yu",
    "Jun Ren",
    "Jiayu Li",
    "Ao Zhang",
    "Qihang Liu"
  ],
  "submission_date": "2023-07-23T16:27:19+00:00",
  "revised_dates": [],
  "abstract": "Topological magnons have garnered significant interest for their potential in both fundamental research and device applications, owing to their exotic, uncharged, yet topologically protected boundary modes. However, their comprehension has been hindered by the absence of fundamental symmetry descriptions of magnetic materials, which are primarily governed by isotropic Heisenberg interactions in spin Hamiltonians. The ensuing magnon dispersions enable gapless magnon band nodes that go beyond the scenario of representation theory of the magnetic space groups (MSGs), thus referred to as unconventional magnons. Here we developed spin space group (SSG) theory to elucidate collinear magnetic configurations, classifying the 1421 collinear SSGs into four types, constructing their band representations, and providing a comprehensive tabulation of unconventional magnons, such as duodecuple points, octuple nodal lines, and charge-4 octuple points. Based on the MAGNDATA database, we identified 498 collinear magnets with unconventional magnons, among which over 200 magnon band structures were obtained by using first-principles calculations and linear spin wave theory. Additionally, we evaluated the influence of the spin-orbit coupling-induced exchange interaction in these magnets and found that more than 80% are predominantly governed by the Heisenberg interactions, indicating that SSG serves as an ideal framework for describing magnon band nodes in most 3d, 4d and half-filled 4f collinear magnets. Our work offers new pathways for exploring uncharged transports in magnonic systems, holding promise for advancements in next-generation spintronic devices.",
  "categories": [
    "cond-mat.mtrl-sci",
    "cond-mat.mes-hall"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": "10.1038/s41586-025-08715-7",
  "journal_ref": "Nature 640, 349 (2025)",
  "arxiv_id": "2307.12366",
  "pdf_url": null,
  "comment": "The manuscript contains 28 pages, 3 figures and 2 tables. The supplementary information contains 349 pages, 15 figures and 245 tables. The databases for all 1421 collinear spin space groups and the magnon band structures are provided on https://www.findspingroup.com/",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}