{
  "title": "Simulation-based Inference for Cardiovascular Models",
  "authors": [
    "Antoine Wehenkel",
    "Laura Manduchi",
    "Jens Behrmann",
    "Luca Pegolotti",
    "Andrew C. Miller",
    "Guillermo Sapiro",
    "Ozan Sener",
    "Marco Cuturi",
    "Jörn-Henrik Jacobsen"
  ],
  "submission_date": "2023-07-26T02:34:57+00:00",
  "revised_dates": [
    "2023-08-01T00:14:44+00:00",
    "2024-12-31T02:08:47+00:00"
  ],
  "abstract": "Over the past decades, hemodynamics simulators have steadily evolved and have become tools of choice for studying cardiovascular systems in-silico. While such tools are routinely used to simulate whole-body hemodynamics from physiological parameters, solving the corresponding inverse problem of mapping waveforms back to plausible physiological parameters remains both promising and challenging. Motivated by advances in simulation-based inference (SBI), we cast this inverse problem as statistical inference. In contrast to alternative approaches, SBI provides \\textit{posterior distributions} for the parameters of interest, providing a \\textit{multi-dimensional} representation of uncertainty for \\textit{individual} measurements. We showcase this ability by performing an in-silico uncertainty analysis of five biomarkers of clinical interest comparing several measurement modalities. Beyond the corroboration of known facts, such as the feasibility of estimating heart rate, our study highlights the potential of estimating new biomarkers from standard-of-care measurements. SBI reveals practically relevant findings that cannot be captured by standard sensitivity analyses, such as the existence of sub-populations for which parameter estimation exhibits distinct uncertainty regimes. Finally, we study the gap between in-vivo and in-silico with the MIMIC-III waveform database and critically discuss how cardiovascular simulations can inform real-world data analysis.",
  "categories": [
    "stat.ML",
    "cs.LG",
    "q-bio.QM"
  ],
  "primary_category": "stat.ML",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13918",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 52936515,
  "size_after_bytes": 619433
}