{
  "title": "Direct and Indirect methods of electrocaloric effect determination and energy storage calculation in (Na0.8K0.2)0.5Bi0.5TiO3 ceramic",
  "authors": [
    "Pravin Varade",
    "Adityanarayan H. Pandey",
    "N. Shara Sowmya",
    "S. M. Gupta",
    "Abhay Bhisikar",
    "N. Venkataramani",
    "A. R. Kulkarni"
  ],
  "submission_date": "2023-07-30T13:44:56+00:00",
  "revised_dates": [],
  "abstract": "The coexistence of multiple structural phases and field induced short-range to long-range order transition in ferroelectric materials, leads to a strong electrocaloric effect (ECE) and electrical energy storage density (Wrec) in the vicinity of ferroelectric to non-ergodic phase transition in NKBT ceramic. Structural analysis using X-ray diffraction, Raman spectroscopy and TEM studies ascertained the coexistence of tetragonal (P4mm) and rhombohedral (R3c) phases. Dielectric study has revealed a critical slowing down of polar domain dynamics below a diffuse phase transition. Present investigation reports ECE in lead-free (Na0.8K0.2)0.5Bi0.5TiO3 (NKBT) ceramic by direct and indirect methods, which confirm the multifunctional nature of NKBT and its usefulness for applications in refrigeration and energy storage. A direct method of EC measurement in NKBT ceramic exhibits significant adiabatic temperature change (ΔT) ~ 1.10 K and electrocaloric strength (ξ) ~ 0.55 Kmm/kV near the ferroelectric to non-ergodic phase transition at an external applied field of 20 kV/cm. A highest recoverable energy (Wrec) ~ 0.78 J/cm3 and electrical storage efficiency (η) ~ 86% are achieved at 423 K and an applied field of 20 kV/cm. This behavior is ascribed to the delicate balance between the field induced order-disordered transition and the thermal energy needed to disrupt field induced co-operative interaction.",
  "categories": [
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16232",
  "pdf_url": "https://arxiv.org/pdf/2307.16232v2",
  "comment": "Need to modify",
  "num_versions": null,
  "size_before_bytes": 2591506,
  "size_after_bytes": 1523793
}