{
  "title": "Constraints on Tidal Quality Factor in Kepler Eclipsing Binaries using Tidal Synchronization: A Frequency-Dependent Approach",
  "authors": [
    "Ruskin Patel",
    "Kaloyan Penev",
    "Joshua Schussler"
  ],
  "submission_date": "2023-07-24T18:53:50+00:00",
  "revised_dates": [],
  "abstract": "Tidal dissipation in binary systems is the primary source for synchronization and circularization of the objects in the system. The efficiency of the dissipation of tidal energy inside stars or planets results in significant changes in observed properties of the binary system and is often studied empirically using a parameter, commonly known as the modified tidal quality factor ($Q_\\star'$). Though often assumed constant, in general that parameter will depend on the particular tidal wave experiencing the dissipation and the properties of the tidally distorted object. In this work we study the frequency dependence of $Q_\\star'$ for Sun-like stars. We parameterize $Q_\\star'$ as a saturating power-law in tidal frequency and obtain constraints using the stellar rotation period of 70 eclipsing binaries observed by Kepler. We use Bayesian analysis to account for the uncertainties in the observational data required for tidal evolution. Our analysis shows that $Q_\\star'$ is well constrained for tidal periods > 15 days, with a value of $Q_\\star' \\sim 10^8$ for periods > 30 days and a slight suggested decrease at shorter periods. For tidal periods < 15 days, $Q_\\star'$ is no longer tightly constrained, allowing for a broad range of possible values that overlaps with the constraints obtained using tidal circularization in binaries, which point to much more efficient dissipation: $Q_\\star' \\sim 10^6$.",
  "categories": [
    "astro-ph.SR",
    "astro-ph.EP"
  ],
  "primary_category": "astro-ph.SR",
  "doi": "10.1093/mnras/stad2194",
  "journal_ref": "Monthly Notices of the Royal Astronomical Society, p.stad2194 (2023)",
  "arxiv_id": "2307.13074",
  "pdf_url": null,
  "comment": "Accepted for publication in MNRAS 16 pages, 9 figures",
  "num_versions": null,
  "size_before_bytes": 6920024,
  "size_after_bytes": 112694
}