{
  "title": "TDiff in the Dark: Gravity with a scalar field invariant under transverse diffeomorphisms",
  "authors": [
    "Darío Jaramillo-Garrido",
    "Antonio L. Maroto",
    "Prado Martín-Moruno"
  ],
  "submission_date": "2023-07-27T13:46:24+00:00",
  "revised_dates": [
    "2024-02-23T11:04:07+00:00"
  ],
  "abstract": "We reflect on the possibility of having a matter action that is invariant only under transverse diffeomorphisms. This possibility is particularly interesting for the dark sector, where no restrictions arise based on the weak equivalence principle. In order to implement this idea we consider a scalar field which couples to gravity minimally but via arbitrary functions of the metric determinant. We show that the energy-momentum tensor of the scalar field takes the perfect fluid form when its velocity vector is time-like. We analyze the conservation of this tensor in detail, obtaining a seminal novel result for the energy density of this field in the kinetic dominated regime. Indeed, in this regime the fluid is always adiabatic and we obtain an explicit expression for the speed of sound. Furthermore, to get insight in the gravitational properties of these theories, we consider the fulfillment of the energy conditions, concluding that nontrivial physically reasonable matter violates the strong energy condition in the potential domination regime. On the other hand, we present some shift-symmetric models of particular interest. These are: constant equation of state models (which may provide us with a successful description of dark matter or dark radiation) and models presenting different gravitational domains (characterized by the focusing or possible defocusing of time-like geodesics), as it happens in unified dark matter-energy models.",
  "categories": [
    "gr-qc",
    "astro-ph.CO"
  ],
  "primary_category": "gr-qc",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14861",
  "pdf_url": "https://arxiv.org/pdf/2307.14861v2",
  "comment": "V2: 26 pages, 1 figure, new comments included, appendix added, conclusions unchanged, version accepted for publication in JHEP",
  "num_versions": null,
  "size_before_bytes": 3440181,
  "size_after_bytes": 302012
}