{
  "title": "Chiral Tunneling through Double Barrier Structure in Twisted Graphene Bilayer",
  "authors": [
    "A. Bahlaoui",
    "Y. Zahidi"
  ],
  "submission_date": "2023-07-27T19:20:28+00:00",
  "revised_dates": [],
  "abstract": "The paper discusses the chiral tunnelling of charge carriers through double barrier structure in twisted graphene bilayer. The theoretical analysis investigates the transmission probability for various system parameters under both symmetric and asymmetric barrier conditions. The results reveal that the transmission probability of quasiparticles in the $K$ cone is mirror symmetric to that of $K_θ$ cone about $\\varphi =0$. Furthermore, the study shows that the transmission changes gradually from perfect transmission to perfect reflection in the normal direction by increasing the incident energy and the barrier height, which is different from the case of monolayer and AB-stacked bilayer graphene. It is also found that the double barrier structure remains, only in certain cases, perfectly transparent for normal or near-normal incidence. The chiral nature of the quasiparticles in graphene causes the tunneling to be highly dependent on the direction and also on the double barrier structure. Interestingly, this characteristic provides additional parameter that allows us to tune the electronic properties of the twisted graphene bilayer. Additionally, we found that the transmission exhibits some sharp resonance peaks, the number and amplitude of which depend on the system parameters. Our results provide a better understanding of the chiral tunnelling in twisted graphene bilayer through double barrier structures and can help in designing efficient electronic devices.",
  "categories": [
    "cond-mat.mes-hall"
  ],
  "primary_category": "cond-mat.mes-hall",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15159",
  "pdf_url": "https://arxiv.org/pdf/2307.15159v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 4704787,
  "size_after_bytes": 1256697
}