{
  "title": "Detection of astrophysical gravitational wave sources by TianQin and LISA",
  "authors": [
    "Alejandro Torres-Orjuela",
    "Shun-Jia Huang",
    "Zheng-Cheng Liang",
    "Shuai Liu",
    "Hai-Tian Wang",
    "Chang-Qing Ye",
    "Yi-Ming Hu",
    "Jianwei Mei"
  ],
  "submission_date": "2023-07-31T13:07:33+00:00",
  "revised_dates": [
    "2023-12-01T02:40:25+00:00"
  ],
  "abstract": "TianQin and LISA are space-based laser interferometer gravitational wave (GW) detectors planned to be launched in the mid-2030s. Both detectors will detect low-frequency GWs around $10^{-2}\\,{\\rm Hz}$, however, TianQin is more sensitive to frequencies above this common sweet-spot while LISA is more sensitive to frequencies below $10^{-2}\\,{\\rm Hz}$. Therefore, TianQin and LISA will be able to detect the same sources but with different accuracy depending on the source and its parameters. We consider some of the most important astrophysical sources -- massive black hole binaries, stellar-mass black hole binaries, double white dwarfs, extreme mass ratio inspirals, light and heavy intermediate mass ratio inspirals, as well as the stochastic gravitational background of astrophysical origin -- that TianQin and LISA will be able to detect. For each of these sources, we analyze how far they can be detected (detection distance) and how well their parameters can be measured (detection accuracy) using a Fisher Matrix analysis. We compare the results obtained by the three detection scenarios (TianQin alone, LISA alone, and joint detection by LISA and TianQin) highlighting the gains from joint detection as well as the contribution of TianQin and LISA to a combined study of astrophysical sources. In particular, we consider the different orientations, lifetimes, and duty cycles of the two detectors to explore how they can give a more complete picture when working together.",
  "categories": [
    "gr-qc",
    "astro-ph.HE",
    "astro-ph.IM"
  ],
  "primary_category": "gr-qc",
  "doi": "10.1007/s11433-023-2308-x",
  "journal_ref": null,
  "arxiv_id": "2307.16628",
  "pdf_url": "https://arxiv.org/pdf/2307.16628v2",
  "comment": "49 pages, 63 figures",
  "num_versions": null,
  "size_before_bytes": 5057213,
  "size_after_bytes": 1132298
}