{
  "title": "Tipping in a Low-Dimensional Model of a Tropical Cyclone",
  "authors": [
    "Katherine Slyman",
    "John A. Gemmer",
    "Nicholas K. Corak",
    "Claire Kiers",
    "Christopher K. R. T. Jones"
  ],
  "submission_date": "2023-07-28T14:29:53+00:00",
  "revised_dates": [],
  "abstract": "A presumed impact of global climate change is the increase in frequency and intensity of tropical cyclones. Due to the possible destruction that occurs when tropical cyclones make landfall, understanding their formation should be of mass interest. In 2017, Kerry Emanuel modeled tropical cyclone formation by developing a low-dimensional dynamical system which couples tangential wind speed of the eye-wall with the inner-core moisture. For physically relevant parameters, this dynamical system always contains three fixed points: a stable fixed point at the origin corresponding to a non-storm state, an additional asymptotically stable fixed point corresponding to a stable storm state, and a saddle corresponding to an unstable storm state. The goal of this work is to provide insight into the underlying mechanisms that govern the formation and suppression of tropical cyclones through both analytical arguments and numerical experiments. We present a case study of both rate and noise-induced tipping between the stable states, relating to the destabilization or formation of a tropical cyclone. While the stochastic system exhibits transitions both to and from the non-storm state, noise-induced tipping is more likely to form a storm, whereas rate-induced tipping is more likely to be the way a storm is destabilized, and in fact, rate-induced tipping can never lead to the formation of a storm when acting alone. For rate-induced tipping acting as a destabilizer of the storm, a striking result is that both wind shear and maximal potential velocity have to increase, at a substantial rate, in order to effect tipping away from the active hurricane state. For storm formation through noise-induced tipping, we identify a specific direction along which the non-storm state is most likely to get activated.",
  "categories": [
    "math.DS"
  ],
  "primary_category": "math.DS",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15583",
  "pdf_url": "https://arxiv.org/pdf/2307.15583v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 3805771,
  "size_after_bytes": 96398
}