{
  "title": "Bifurcation analysis of a conceptual model for the Atlantic Meridional Overturning Circulation",
  "authors": [
    "John Bailie",
    "Bernd Krauskopf"
  ],
  "submission_date": "2023-07-31T05:48:02+00:00",
  "revised_dates": [],
  "abstract": "The Atlantic Meridional Overturning Circulation (AMOC) distributes heat and salt into the Northern Hemisphere via a warm surface current toward the subpolar North Atlantic, where water sinks and returns southwards as a deep cold current. There is substantial evidence that the AMOC has slowed down over the last century. We introduce a conceptual box model for the evolution of salinity and temperature on the surface of the North Atlantic Ocean, subject to the influx of meltwater from the Greenland ice sheets. Our model, which extends a model due to Welander, describes the interaction between a surface box and a deep-water box of constant temperature and salinity, which may be convective or non-convective, depending on the density difference. Its two main parameters $μ$ and $η$ describe the influx of freshwater and the threshold density between the two boxes, respectively.\n  We use bifurcation theory to analyse two cases of the model: instantaneous switching between convective or non-convective interaction, where the system is piecewise-smooth (PWS), and the full smooth model with more gradual switching. For the PWS model we derive analytical expressions for all bifurcations. The resulting bifurcation diagram in the $(μ,η)$-plane identifies all regions of possible dynamics, which we show as phase portraits - both at typical parameter points, as well as at the different transitions between them. We also present the bifurcation diagram for the case of smooth switching and show how it arises from that of the PWS case. In this way, we determine exactly where one finds bistability and self-sustained oscillations of the AMOC in both versions of the model. In particular, our results show that oscillations between temperature and salinity on the surface North Atlantic Ocean disappear completely when the transition between the convective and non-convective regimes is too slow.",
  "categories": [
    "math.DS"
  ],
  "primary_category": "math.DS",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16414",
  "pdf_url": "https://arxiv.org/pdf/2307.16414v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 9329561,
  "size_after_bytes": 1481421
}