{
  "title": "Bound isoscalar axial-vector $bc\\bar u\\bar d$ tetraquark $T_{bc}$ from lattice QCD using two-meson and diquark-antidiquark variational basis",
  "authors": [
    "M. Padmanath",
    "Archana Radhakrishnan",
    "Nilmani Mathur"
  ],
  "submission_date": "2023-07-26T11:51:23+00:00",
  "revised_dates": [
    "2024-05-27T00:19:59+00:00"
  ],
  "abstract": "We report a lattice QCD study of the heavy-light meson-meson interactions with an explicitly exotic flavor content $bc\\bar u\\bar d$, isospin $I\\!=\\!0$, and axialvector $J^P=1^+$ quantum numbers in search of possible tetraquark bound states. The calculation is performed at four values of lattice spacing, ranging $\\sim$0.058 to $\\sim$0.12 fm, and at five different values of valence light quark mass $m_{u/d}$, corresponding to pseudoscalar meson mass $M_{ps}$ of about 0.5, 0.6, 0.7, 1.0, and 3.0 GeV. The energy eigenvalues in the finite-volume are determined through a variational procedure applied to correlation matrices built out of two-meson interpolating operators as well as diquark-antidiquark operators. The continuum limit estimates for $D\\bar B^*$ elastic $S$-wave scattering amplitude are extracted from the lowest finite-volume eigenenergies, corresponding to the ground states, using amplitude parametrizations supplemented by a lattice spacing dependence. Light quark mass $m_{u/d}$ dependence of the $D\\bar B^*$ scattering length ($a_0$) suggests that at the physical pion mass $a_0^{phys} = +0.57(^{+4}_{-5})(17)$ fm, which clearly points to an attractive interaction between the $D$ and $\\bar B^*$ mesons that is strong enough to host a real bound state $T_{bc}$, with a binding energy of $-43(_{-7}^{+6})(_{-24}^{+14})$ MeV with respect to the $D\\bar B^*$ threshold. We also find that the strength of the binding decreases with increasing $m_{u/d}$ and the system becomes unbound at a critical light quark mass $m^{*}_{u/d}$ corresponding to $M^{*}_{ps} = 2.73(21)(19)$ GeV.",
  "categories": [
    "hep-lat",
    "hep-ex",
    "hep-ph"
  ],
  "primary_category": "hep-lat",
  "doi": "10.1103/PhysRevLett.132.201902",
  "journal_ref": "Phys.Rev.Lett. 132 (2024) 20, 201902",
  "arxiv_id": "2307.14128",
  "pdf_url": null,
  "comment": "8 pages, 6 figures, 1 table, plus supplemental material (4 pages, 5 figures, 1 table). v2: version accepted to be published in Physical Review Letters. Results and conclusions unchanged",
  "num_versions": null,
  "size_before_bytes": 2415472,
  "size_after_bytes": 428958
}