{
  "title": "It's Not Just GitHub: Identifying Data and Software Sources Included in Publications",
  "authors": [
    "Emily Escamilla",
    "Lamia Salsabil",
    "Martin Klein",
    "Jian Wu",
    "Michele C. Weigle",
    "Michael L. Nelson"
  ],
  "submission_date": "2023-07-26T19:17:02+00:00",
  "revised_dates": [],
  "abstract": "Paper publications are no longer the only form of research product. Due to recent initiatives by publication venues and funding institutions, open access datasets and software products are increasingly considered research products and URIs to these products are growing more prevalent in scholarly publications. However, as with all URIs, resources found on the live Web are not permanent. Archivists and institutions including Software Heritage, Internet Archive, and Zenodo are working to preserve data and software products as valuable parts of reproducibility, a cornerstone of scientific research. While some hosting platforms are well-known and can be identified with regular expressions, there are a vast number of smaller, more niche hosting platforms utilized by researchers to host their data and software. If it is not feasible to manually identify all hosting platforms used by researchers, how can we identify URIs to open-access data and software (OADS) to aid in their preservation? We used a hybrid classifier to classify URIs as OADS URIs and non-OADS URIs. We found that URIs to Git hosting platforms (GHPs) including GitHub, GitLab, SourceForge, and Bitbucket accounted for 33\\% of OADS URIs. Non-GHP OADS URIs are distributed across almost 50,000 unique hostnames. We determined that using a hybrid classifier allows for the identification of OADS URIs in less common hosting platforms which can benefit discoverability for preserving datasets and software products as research products for reproducibility.",
  "categories": [
    "cs.DL"
  ],
  "primary_category": "cs.DL",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14469",
  "pdf_url": null,
  "comment": "13 pages, 7 figures, pre-print of publication for Theory and Practice of Digital Libraries 2023",
  "num_versions": null,
  "size_before_bytes": 1474541,
  "size_after_bytes": 131486
}