{
  "title": "Discerning media bias within a network of political allies and opponents: Disruption by partisans",
  "authors": [
    "Yutong Bu",
    "Andrew Melatos"
  ],
  "submission_date": "2023-07-31T01:24:53+00:00",
  "revised_dates": [],
  "abstract": "An individual's opinions about media bias derive from their own independent assessment of media outputs combined with peer pressure from networked political allies and opponents. Here we generalize previous idealized, probabilistic models of the perception formation process, based on a network of Bayesian learners inferring the bias of a coin, by introducing obdurate agents (partisans), whose opinions stay fixed. It is found that even one partisan destabilizes an allies-only network, stopping it from achieving asymptotic learning and forcing persuadable agents to vacillate indefinitely (turbulent nonconvergence) between the true coin bias $θ_0$ and the partisan's belief $θ_{\\rm p}$. The dwell time $t_{\\rm d}$ at the partisan's belief increases, as the partisan fraction $f$ increases, and decreases, when multiple partisans disagree amongst themselves. In opponents-only networks, asymptotic learning occurs, whether or not partisans are present. However, the counterintuitive tendency to reach wrong conclusions first, identified in previous work with zero partisans, does not persist in general for $θ_0 \\neq θ_{\\rm p}$ in complete networks; it is a property of sparsely connected systems (e.g.\\ Barabási-Albert networks with attachment parameter $\\lesssim 10$). In mixed networks containing allies and opponents, partisans drive counterintuitive outcomes, which depend sensitively, on where they reside. A strongly balanced triad exhibits intermittency with a partisan (sudden transitions between long intervals of static beliefs and turbulent nonconvergence) and asymptotic learning without a partisan.",
  "categories": [
    "physics.soc-ph"
  ],
  "primary_category": "physics.soc-ph",
  "doi": "10.1016/j.physa.2023.128958",
  "journal_ref": null,
  "arxiv_id": "2307.16359",
  "pdf_url": "https://arxiv.org/pdf/2307.16359v1",
  "comment": "36 pages, 17 figures",
  "num_versions": null,
  "size_before_bytes": 7157746,
  "size_after_bytes": 172923
}