{
  "title": "Quantum Kernel Estimation With Neutral Atoms For Supervised Classification: A Gate-Based Approach",
  "authors": [
    "Marco Russo",
    "Edoardo Giusto",
    "Bartolomeo Montrucchio"
  ],
  "submission_date": "2023-07-28T23:56:26+00:00",
  "revised_dates": [],
  "abstract": "Quantum Kernel Estimation (QKE) is a technique based on leveraging a quantum computer to estimate a kernel function that is classically difficult to calculate, which is then used by a classical computer for training a Support Vector Machine (SVM). Given the high number of 2-local operators necessary for realizing a feature mapping hard to simulate classically, a high qubit connectivity is needed, which is not currently possible on superconducting devices. For this reason, neutral atom quantum computers can be used, since they allow to arrange the atoms with more freedom. Examples of neutral-atom-based QKE can be found in the literature, but they are focused on graph learning and use the analogue approach. In this paper, a general method based on the gate model is presented. After deriving 1-qubit and 2-qubit gates starting from laser pulses, a parameterized sequence for feature mapping on 3 qubits is realized. This sequence is then used to empirically compute the kernel matrix starting from a dataset, which is finally used to train the SVM. It is also shown that this process can be generalized up to N qubits taking advantage of the more flexible arrangement of atoms that this technology allows. The accuracy is shown to be high despite the small dataset and the low separation. This is the first paper that not only proposes an algorithm for explicitly deriving a universal set of gates but also presents a method of estimating quantum kernels on neutral atom devices for general problems using the gate model.",
  "categories": [
    "quant-ph",
    "cs.LG"
  ],
  "primary_category": "quant-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15840",
  "pdf_url": "https://arxiv.org/pdf/2307.15840v1",
  "comment": "Version accepted for presentation at IEEE QCE23 conference",
  "num_versions": null,
  "size_before_bytes": 4333672,
  "size_after_bytes": 377764
}