{
  "title": "Active fractal networks with stochastic force monopoles and force dipoles: Application to subdiffusion of chromosomal loci",
  "authors": [
    "Sadhana Singh",
    "Rony Granek"
  ],
  "submission_date": "2023-07-23T12:46:03+00:00",
  "revised_dates": [
    "2024-04-12T00:27:27+00:00",
    "2024-10-15T02:05:21+00:00"
  ],
  "abstract": "Motivated by the well-known fractal packing of chromatin, we study the Rouse-type dynamics of elastic fractal networks with embedded, stochastically driven, active force monopoles and force dipoles that are temporally correlated. We compute, analytically -- using a general theoretical framework -- and {\\it via} Langevin dynamics simulations, the mean square displacement (MSD) of a network bead. Following a short-time superdiffusive behavior, force monopoles yield anomalous subdiffusion with an exponent identical to that of the thermal system. In contrast, force dipoles do not induce subdiffusion, and the early superdiffusive MSD crosses over to a relatively small, system-size-independent saturation value. In addition, we find that force dipoles may lead to \"crawling\" rotational motion of the whole network, reminiscent of that found for triangular micro-swimmers and consistent with general theories of the rotation of deformable bodies. Moreover, force dipoles lead to network collapse beyond a critical force strength, which persists with increasing system size, signifying a true first-order dynamical phase transition. We apply our results to the motion of chromosomal loci in bacteria and yeast cells' chromatin, where anomalous sub-diffusion, MSD$\\sim t^ν$ with $ν\\simeq 0.4$, was found in both normal and ATP-depleted cells, albeit with different apparent diffusion coefficients. We show that the combination of thermal, monopolar, and dipolar forces in chromatin is typically dominated by the active monopolar and thermal forces, explaining the observed normal cells vs the ATP-depleted cells behavior.",
  "categories": [
    "cond-mat.soft",
    "cond-mat.stat-mech"
  ],
  "primary_category": "cond-mat.soft",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12310",
  "pdf_url": null,
  "comment": "21 pages, 18 figures",
  "num_versions": null,
  "size_before_bytes": 46167556,
  "size_after_bytes": 438960
}