{
  "title": "Flow states of two dimensional active gels driven by external shear",
  "authors": [
    "Wan Luo",
    "Aparna Baskaran",
    "Robert A. Pelcovits",
    "Thomas R. Powers"
  ],
  "submission_date": "2023-07-24T16:09:13+00:00",
  "revised_dates": [],
  "abstract": "Using a minimal hydrodynamic model, we theoretically and computationally study active gels in straight and annular two-dimensional channels subject to an externally imposed shear. The gels are isotropic in the absence of externally- or activity-driven shear, but have nematic order that increases with shear rate. Using the finite element method, we determine the possible flow states for a range of activities and shear rates. Linear stability analysis of an unconfined gel in a straight channel shows that an externally imposed shear flow can stabilize an extensile fluid that would be unstable to spontaneous flow in the absence of the shear flow, and destabilize a contractile fluid that would be stable against spontaneous flow in the absence of shear flow. These results are in rough agreement with the stability boundaries between the base shear flow state and the nonlinear flow states that we find numerically for a confined active gel. For extensile fluids, we find three kinds of nonlinear flow states in the range of parameters we study: unidirectional flows, oscillatory flows, and dancing flows. To highlight the activity-driven spontaneous component of the nonlinear flows, we characterize these states by the average volumetric flow rate and the wall stress. For contractile fluids, we only find the linear shear flow and a nonlinear unidirectional flow in the range of parameters that we studied. For large magnitudes of the activity, the unidirectional contractile flow develops a boundary layer. Our analysis of annular channels shows how curvature of the streamlines in the base flow affects the transitions among flow states.",
  "categories": [
    "cond-mat.soft"
  ],
  "primary_category": "cond-mat.soft",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12910",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 44647147,
  "size_after_bytes": 2033032
}