{
  "title": "Reduced stress propagation leads to increased mechanical failure resistance in auxetic materials",
  "authors": [
    "Suzanne M. Fielding"
  ],
  "submission_date": "2023-07-27T14:56:20+00:00",
  "revised_dates": [
    "2024-05-01T15:56:43+00:00"
  ],
  "abstract": "Materials with negative Poisson ratio have the counter-intuitive property of expanding laterally when they are stretched longitudinally. They are accordingly termed auxetic, from the Greek auxesis meaning to increase. Experimental studies have demonstrated auxetic materials to have superior material properties, compared with conventional ones. These include synclastic curvature, increased acoustic absorption, increased resilience to material fatigue, and increased resistance to mechanical failure. Until now, the latter observations have remained poorly understood theoretically. With this motivation, the contributions of this work are twofold. First, we elucidate analytically the way in which stress propagates spatially across a material following a localised plastic failure event, finding a significantly reduced stress propagation in auxetic materials compared with conventional ones. In this way, a plastic failure event occurring in one part of a material has a reduced tendency to trigger knock-on plastic events in neighbouring regions. Second, via the numerical simulation of a lattice elastoplastic model, we demonstrate a key consequence of this reduced stress propagation to be an increased resistance to mechanical failure. This is seen not only via an increase in the externally measured yield strain, but also via a decreased tendency for plastic damage to percolate internally across a sample in catastrophic system-spanning clusters.",
  "categories": [
    "cond-mat.stat-mech",
    "cond-mat.mtrl-sci",
    "cond-mat.soft"
  ],
  "primary_category": "cond-mat.stat-mech",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14914",
  "pdf_url": "https://arxiv.org/pdf/2307.14914v2",
  "comment": "7 pages, 5 figures; accepted for publication, Proceedings of the National Academy of Sciences of the United States of America",
  "num_versions": null,
  "size_before_bytes": 2659002,
  "size_after_bytes": 164651
}