{
  "title": "Dynamical theory of single-photon transport through a qubit chain coupled to a one-dimensional nanophotonic waveguide",
  "authors": [
    "Ya. S. Greenberg",
    "O. A. Chuikin",
    "A. A. Shtygashev",
    "A. G. Moiseev"
  ],
  "submission_date": "2023-07-27T10:21:16+00:00",
  "revised_dates": [
    "2024-02-07T04:07:57+00:00"
  ],
  "abstract": "We study the dynamics of a single-photon pulse travelling through a linear qubit chain coupled to continuum modes in a one-dimensional (1D) photonic waveguide. We derive a time-dependent dynamical theory for qubit amplitudes and for transmitted and reflected spectra. We show that the requirement for the photon-qubit coupling to exist only for positive frequencies can significantly change the dynamics of the system. First, it leads to an additional photon-mediated dipole-dipole interaction between qubits which results in the violation of the phase coherence between them. Second, the spectral lines of transmitted and reflected spectra crucially depend on the shape of the incident pulse and the initial distance between the pulse center and the first qubit in the chain. We apply our theory to one-qubit and two-qubit systems. For these two cases, we obtain the explicit expressions for the qubits' amplitudes and the photon radiation spectra as time tends to infinity. For the incident Gaussian wave packet we calculate the line shapes of transmitted and reflected photons.",
  "categories": [
    "quant-ph",
    "cond-mat.mes-hall"
  ],
  "primary_category": "quant-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14752",
  "pdf_url": "https://arxiv.org/pdf/2307.14752v2",
  "comment": "16 pages, 12 figures, 54 references. This version is the deeply revized version of the previous paper Dynamical theory of single-photon transport through a qubit chain coupled to a one-dimensional nanophotonic waveguide. Beyond the Markovian approximation",
  "num_versions": null,
  "size_before_bytes": 2101383,
  "size_after_bytes": 156597
}