{
  "title": "Programmable Quantum Processors based on Spin Qubits with Mechanically-Mediated Interactions and Transport",
  "authors": [
    "F. Fung",
    "E. Rosenfeld",
    "J. D. Schaefer",
    "A. Kabcenell",
    "J. Gieseler",
    "T. X. Zhou",
    "T. Madhavan",
    "N. Aslam",
    "A. Yacoby",
    "M. D. Lukin"
  ],
  "submission_date": "2023-07-23T00:52:19+00:00",
  "revised_dates": [],
  "abstract": "Solid state spin qubits are promising candidates for quantum information processing, but controlled interactions and entanglement in large, multi-qubit systems are currently difficult to achieve. We describe a method for programmable control of multi-qubit spin systems, in which individual nitrogen-vacancy (NV) centers in diamond nanopillars are coupled to magnetically functionalized silicon nitride mechanical resonators in a scanning probe configuration. Qubits can be entangled via interactions with nanomechanical resonators while programmable connectivity is realized via mechanical transport of qubits in nanopillars. To demonstrate the feasibility of this approach, we characterize both the mechanical properties and the magnetic field gradients around the micromagnet placed on the nanobeam resonator. Furthermore, we show coherent manipulation and mechanical transport of a proximal spin qubit by utilizing nuclear spin memory, and use the NV center to detect the time-varying magnetic field from the oscillating micromagnet, extracting a spin-mechanical coupling of 7.7(9) Hz. With realistic improvements the high-cooperativity regime can be reached, offering a new avenue towards scalable quantum information processing with spin qubits.",
  "categories": [
    "quant-ph",
    "cond-mat.mes-hall"
  ],
  "primary_category": "quant-ph",
  "doi": "10.1103/PhysRevLett.132.263602",
  "journal_ref": "Phys. Rev. Lett. 132.26 (2024): 263602",
  "arxiv_id": "2307.12193",
  "pdf_url": null,
  "comment": "7 pages, 4 figures",
  "num_versions": null,
  "size_before_bytes": 6771425,
  "size_after_bytes": 161980
}