{
  "title": "CorrFL: Correlation-Based Neural Network Architecture for Unavailability Concerns in a Heterogeneous IoT Environment",
  "authors": [
    "Ibrahim Shaer",
    "Abdallah Shami"
  ],
  "submission_date": "2023-07-22T19:23:06+00:00",
  "revised_dates": [],
  "abstract": "The Federated Learning (FL) paradigm faces several challenges that limit its application in real-world environments. These challenges include the local models' architecture heterogeneity and the unavailability of distributed Internet of Things (IoT) nodes due to connectivity problems. These factors posit the question of \"how can the available models fill the training gap of the unavailable models?\". This question is referred to as the \"Oblique Federated Learning\" problem. This problem is encountered in the studied environment that includes distributed IoT nodes responsible for predicting CO2 concentrations. This paper proposes the Correlation-based FL (CorrFL) approach influenced by the representational learning field to address this problem. CorrFL projects the various model weights to a common latent space to address the model heterogeneity. Its loss function minimizes the reconstruction loss when models are absent and maximizes the correlation between the generated models. The latter factor is critical because of the intersection of the feature spaces of the IoT devices. CorrFL is evaluated on a realistic use case, involving the unavailability of one IoT device and heightened activity levels that reflect occupancy. The generated CorrFL models for the unavailable IoT device from the available ones trained on the new environment are compared against models trained on different use cases, referred to as the benchmark model. The evaluation criteria combine the mean absolute error (MAE) of predictions and the impact of the amount of exchanged data on the prediction performance improvement. Through a comprehensive experimental procedure, the CorrFL model outperformed the benchmark model in every criterion.",
  "categories": [
    "cs.LG",
    "cs.DC",
    "cs.NI"
  ],
  "primary_category": "cs.LG",
  "doi": "10.1109/TNSM.2023.3278937.",
  "journal_ref": "IEEE Transactions on Network and Service Management, vol. 20, no. 2, pp. 1543-1557, June 2023",
  "arxiv_id": "2307.12149",
  "pdf_url": null,
  "comment": "17 pages, 12 figures, IEEE Transactions on Network and Service Management",
  "num_versions": null,
  "size_before_bytes": 3331631,
  "size_after_bytes": 520306
}