{
  "title": "Semi-simplicial combinatorics of cyclinders and subdivisions",
  "authors": [
    "Jose Manuel Garcia Calcines",
    "Luis Javier Hernandez Paricio",
    "Maria Teresa Rivas Rodriguez"
  ],
  "submission_date": "2023-07-25T18:18:31+00:00",
  "revised_dates": [],
  "abstract": "In this work, we analyze the combinatorial properties of cylinders and subdivisions of augmented semi-simplicial sets. These constructions are obtained as particular cases of a certain action from a co-semi-simplicial set on an augmented semi-simplicial set. We also consider cylinders and subdivision operators in the algebraic setting of augmented sequences of integers. These operators are defined either by taking an action of matrices on sequences of integers (using binomial matrices) or by taking the simple product of sequences and matrices. We compare both the geometric and algebraic contexts using the sequential cardinal functor $|\\cdot|$, which associates the augmented sequence $|X|=(|X_n|)_{n\\geq -1}$ to each augmented semi-simplicial finite set $X$. Here, $|X_n|$ stands for the finite cardinality of the set of $n$-simplices $X_n$. The sequential cardinal functor transforms the action of any co-semi-simplicial set into the action of a matrix on a sequence. Therefore, we can easily calculate the number of simplices of cylinders or subdivisions of an augmented semi-simplicial set. Alternatively, instead of using the action of a matrix on a sequence, we can also compute suitable matrices and consider the product of an augmented sequence of integers and an infinite augmented matrix of integers. The calculation of these matrices is related mainly to binomial, chain-power-set, and Stirling numbers. From another point of view, these matrices can be considered as continuous automorphisms of the Baer-Specker topological group.",
  "categories": [
    "math.CO",
    "math.CT"
  ],
  "primary_category": "math.CO",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13749",
  "pdf_url": null,
  "comment": "46 pages, 4 figures",
  "num_versions": null,
  "size_before_bytes": 196130,
  "size_after_bytes": 129234
}