{
  "title": "Enhanced Size Uniformity for Near-resonant Planets",
  "authors": [
    "Armaan V. Goyal",
    "Fei Dai",
    "Songhu Wang"
  ],
  "submission_date": "2023-07-29T02:58:15+00:00",
  "revised_dates": [
    "2023-08-15T21:59:56+00:00"
  ],
  "abstract": "Super-Earths within the same close-in, compact planetary system tend to exhibit a striking degree of uniformity in their radius, mass, and orbital spacing, and this 'peas-in-a-pod' phenomenon itself serves to provide one of the strongest constrains on planet formation at large. While it has been recently demonstrated from independent samples that such planetary uniformity occurs for both configurations near and distant from mean motion resonance, the question thus remains if the strength of this uniformity itself differs between near-resonant and nonresonant configurations such that the two modes may be astrophysically distinct in their evolution. We thus provide in this work a novel comparative size uniformity analysis for 48 near-resonant and 251 nonresonant multi-planet systems from the California Kepler Survey catalog, evaluating uniformity both across systems and between planetary pairs within the same system. We find that while multiplanet configurations exhibit strong peas-in-a-pod size uniformity regardless of their proximity to resonance, near-resonant configurations display enhanced intra-system size uniformity as compared to their analogous nonresonant counterparts at the level of both entire systems and subsystem planetary pairs and chains. These results are broadly consistent with a variety of formation paradigms for multiplanet systems, such as convergent migration within a turbulent protoplanetary disk or planet-planet interactions incited by postnebular dynamical instabilities. Nevertheless, further investigation is necessary to ascertain whether the nonresonant and near-resonant planetary configurations respectively evolve via a singular process or mechanisms that are dynamically distinct.",
  "categories": [
    "astro-ph.EP"
  ],
  "primary_category": "astro-ph.EP",
  "doi": "10.3847/1538-4357/acebe2",
  "journal_ref": null,
  "arxiv_id": "2307.15875",
  "pdf_url": "https://arxiv.org/pdf/2307.15875v2",
  "comment": "15 pages, 6 figures. Accepted to ApJ July 2023",
  "num_versions": null,
  "size_before_bytes": 2158594,
  "size_after_bytes": 955906
}