{
  "title": "Breathing Green: Maximising Health and Environmental Benefits for Active Transportation Users Leveraging Large Scale Air Quality Data",
  "authors": [
    "Sen Yan",
    "Shaoshu Zhu",
    "Jaime B. Fernandez",
    "Eric Arazo Sánchez",
    "Yingqi Gu",
    "Noel E. O'Connor",
    "David O'Connor",
    "Mingming Liu"
  ],
  "submission_date": "2023-07-28T08:52:07+00:00",
  "revised_dates": [
    "2023-07-31T09:09:14+00:00",
    "2023-08-04T17:36:57+00:00",
    "2024-07-18T13:27:35+00:00"
  ],
  "abstract": "Pollution in urban areas can have significant adverse effects on the health and well-being of citizens, with traffic-related air pollution being a major concern in many cities. Pollutants emitted by vehicles, such as nitrogen oxides, carbon monoxide, and particulate matter, can cause respiratory and cardiovascular problems, particularly for vulnerable road users like pedestrians and cyclists. Furthermore, recent research has indicated that individuals living in more polluted areas are at a greater risk of developing chronic illnesses such as asthma, allergies, and cancer. Addressing these problems is crucial to protecting public health and maximising environmental benefits. In this project, we explore the feasibility of tackling this challenge by leveraging big data analysis and data-driven methods. Specifically, we investigate the recently released Google Air Quality dataset and devise an optimisation strategy to suggest green travel routes for different types of active transportation users in Dublin. To demonstrate our achievement, we have developed a prototype and have shown that citizens who use our model to plan their outdoor activities can benefit notably, with a significant decrease of 17.87% on average in pollutant intake, from the environmental advantages it offers.",
  "categories": [
    "physics.soc-ph"
  ],
  "primary_category": "physics.soc-ph",
  "doi": "10.1109/ITSC57777.2023.10421940",
  "journal_ref": null,
  "arxiv_id": "2307.15401",
  "pdf_url": "https://arxiv.org/pdf/2307.15401v4",
  "comment": "The manuscript has been accepted by the IEEE ITSC 2023",
  "num_versions": null,
  "size_before_bytes": 43973226,
  "size_after_bytes": 1259984
}