{
  "title": "Dynamics of Minimal Networks of Limit Cycle Oscillators",
  "authors": [
    "Andrea Elizabeth Biju",
    "Sneha Srikanth",
    "Krishna Manoj",
    "Samadhan A. Pawar",
    "R. I. Sujith"
  ],
  "submission_date": "2023-07-30T03:06:53+00:00",
  "revised_dates": [],
  "abstract": "The framework of mutually coupled oscillators on a network has served as a convenient tool for investigating the impact of various parameters on the dynamics of real-world systems. Compared to large networks of oscillators, minimal networks are more susceptible to changes in coupling parameters, the number of oscillators, and network topologies. In this study, we systematically explore the influence of these parameters on the dynamics of a minimal network comprising Stuart-Landau oscillators coupled with a distance-dependent time delay. We examine three network topologies: ring, chain, and star. Specifically, for ring networks, we study the effects of increasing nonlocality from local to global coupling on the overall dynamics of the system. Our findings reveal the existence of various synchronized states, including splay and cluster states, a partially synchronized state such as chimeric quasiperiodicity, and an oscillation quenching state such as amplitude death in these networks. Moreover, through an analysis of long-lived transients, we discover novel amplitude-modulated states within ring networks. Interestingly, we observe that increasing nonlocality diminishes the influence of the number of oscillators on the overall behavior in these networks. Furthermore, we note that chain networks, unlike ring networks, do not exhibit perfect synchrony among the coupled oscillators. In contrast, star networks demonstrate greater stability and are unaffected by the number of oscillators within the network. The insights from this study deepen our understanding of the dynamics of minimal networks and have implications for various fields, ranging from biology to engineering.",
  "categories": [
    "nlin.AO",
    "physics.comp-ph"
  ],
  "primary_category": "nlin.AO",
  "doi": "10.1007/s11071-024-09641-5",
  "journal_ref": null,
  "arxiv_id": "2307.16113",
  "pdf_url": "https://arxiv.org/pdf/2307.16113v1",
  "comment": "14 pages, 11 figures",
  "num_versions": null,
  "size_before_bytes": 26194923,
  "size_after_bytes": 286235
}