{
  "title": "Non-Markovian Quantum Gate Set Tomography",
  "authors": [
    "Ze-Tong Li",
    "Cong-Cong Zheng",
    "Fan-Xu Meng",
    "Han Zeng",
    "Tian Luan",
    "Zai-Chen Zhang",
    "Xu-Tao Yu"
  ],
  "submission_date": "2023-07-27T08:34:32+00:00",
  "revised_dates": [
    "2023-07-28T09:01:55+00:00",
    "2023-11-23T14:49:02+00:00",
    "2024-04-14T06:37:44+00:00"
  ],
  "abstract": "Engineering quantum devices requires reliable characterization of the quantum system, including qubits, quantum operations (also known as instruments) and the quantum noise. Recently, quantum gate set tomography (GST) has emerged as a powerful technique for self-consistently describing quantum states, gates, and measurements. However, non-Markovian correlations between the quantum system and environment impact the reliability of GST. To address this, we propose a self-consistent operational framework called instrument set tomography (IST) for non-Markovian GST. Based on the stochastic quantum process, the instrument set describes instruments and system-environment (SE) correlations. We introduce a linear inversion IST (LIST) to describe instruments and SE correlations without physical constraints. The disharmony of linear relationships between instruments is detected. Furthermore, we propose a physically constrained statistical method based on the maximum likelihood estimation for IST (MLE-IST) with adjustable dimensions. MLE-IST shows significant flexibility in adapting to different types of devices, such as noisy intermediate-scale quantum (NISQ) devices, by adjusting the model and constraints. Experimental results demonstrate the effectiveness and necessity of simultaneously describing instruments and SE correlations. Remarkably, real-chip experiments indicate that a polynomial number of parameters with respect to the Markovian order are sufficient to characterize non-Markovian quantum noise in current NISQ devices. Consequently, IST provides an essential and self-consistent framework for characterizing, benchmarking, and developing quantum devices in terms of the instrument set.",
  "categories": [
    "quant-ph"
  ],
  "primary_category": "quant-ph",
  "doi": "10.1088/2058-9565/ad3d80",
  "journal_ref": null,
  "arxiv_id": "2307.14696",
  "pdf_url": "https://arxiv.org/pdf/2307.14696v4",
  "comment": "Quantum Science and Technology 2024",
  "num_versions": null,
  "size_before_bytes": 9899575,
  "size_after_bytes": 4154465
}