{
  "title": "Identifying the discs, bulges, and intra-halo light of simulated galaxies through structural decomposition",
  "authors": [
    "Katy L. Proctor",
    "Claudia del P. Lagos",
    "Aaron D. Ludlow",
    "Aaron S. G. Robotham"
  ],
  "submission_date": "2023-07-24T07:55:41+00:00",
  "revised_dates": [
    "2023-12-08T01:11:42+00:00"
  ],
  "abstract": "We perform a structural decomposition of galaxies identified in three cosmological hydrodynamical simulations by applying Gaussian Mixture Models (GMMs) to the kinematics of their stellar particles. We study the resulting disc, bulge, and intra-halo light (IHL) components of galaxies whose host dark matter haloes have virial masses in the range $M_{200}=10^{11}$-- $10^{15}\\,{\\rm M_\\odot}$. Our decomposition technique isolates galactic discs whose mass fractions, $f_{\\rm disc}$, correlate strongly with common alternative morphology indicators; for example, $f_{\\rm disc}$ is approximately equal to $κ_{\\rm co}$, the fraction of stellar kinetic energy in co-rotation. The primary aim of our study, however, is to characterise the IHL of galaxies in a consistent manner and over a broad mass range, and to analyse its properties from the scale of galactic stellar haloes up to the intra-cluster light. Our results imply that the IHL fraction, $f_{\\rm IHL}$, has appreciable scatter and is strongly correlated with galaxy morphology: at fixed stellar mass, the IHL of disc galaxies is typically older and less massive than that of spheroids. Above $M_{200}\\approx 10^{13}\\,{\\rm M_\\odot}$, we find, on average, $f_{\\rm IHL}\\approx 0.45$, albeit with considerable scatter. The transition radius beyond which the IHL dominates the stellar mass of a galaxy is roughly $30\\,{\\rm kpc}$ for $M_{200}\\lesssim 10^{12.8}\\,{\\rm M_\\odot}$, but increases strongly towards higher masses. However, we find that no alternative IHL definitions -- whether based on the ex-situ stellar mass, or the stellar mass outside a spherical aperture -- reproduce our dynamically-defined IHL masses.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12584",
  "pdf_url": null,
  "comment": "16 pages, 11 figures. MNRAS published",
  "num_versions": null,
  "size_before_bytes": 6906890,
  "size_after_bytes": 4337577
}