{
  "title": "Uncertainty Quantification in the Road-level Traffic Risk Prediction by Spatial-Temporal Zero-Inflated Negative Binomial Graph Neural Network(STZINB-GNN)",
  "authors": [
    "Xiaowei Gao",
    "James Haworth",
    "Dingyi Zhuang",
    "Huanfa Chen",
    "Xinke Jiang"
  ],
  "submission_date": "2023-07-25T20:56:14+00:00",
  "revised_dates": [],
  "abstract": "Urban road-based risk prediction is a crucial yet challenging aspect of research in transportation safety. While most existing studies emphasize accurate prediction, they often overlook the importance of model uncertainty. In this paper, we introduce a novel Spatial-Temporal Zero-Inflated Negative Binomial Graph Neural Network (STZINB-GNN) for road-level traffic risk prediction, with a focus on uncertainty quantification. Our case study, conducted in the Lambeth borough of London, UK, demonstrates the superior performance of our approach in comparison to existing methods. Although the negative binomial distribution may not be the most suitable choice for handling real, non-binary risk levels, our work lays a solid foundation for future research exploring alternative distribution models or techniques. Ultimately, the STZINB-GNN contributes to enhanced transportation safety and data-driven decision-making in urban planning by providing a more accurate and reliable framework for road-level traffic risk prediction and uncertainty quantification.",
  "categories": [
    "cs.CE"
  ],
  "primary_category": "cs.CE",
  "doi": null,
  "journal_ref": "The 12 International Conference on Geographic Information Science,12 - 15th September, 2023. Leeds, UK The 12 International Conference on Geographic Information Science. The 12 International Conference on Geographic Information Science",
  "arxiv_id": "2307.13816",
  "pdf_url": null,
  "comment": "Accepted as short paper to the 12 International Conference on Geographic Information Science, Leeds, UK",
  "num_versions": null,
  "size_before_bytes": 5351955,
  "size_after_bytes": 105714
}