{
  "title": "Solid lubrication by wet-transferred solution-processed graphene flakes: dissipation mechanisms and superlubricity in mesoscale contacts",
  "authors": [
    "Renato Buzio",
    "Andrea Gerbi",
    "Cristina Bernini",
    "Luca Repetto",
    "Andrea Silva",
    "Andrea Vanossi"
  ],
  "submission_date": "2023-07-27T12:40:13+00:00",
  "revised_dates": [],
  "abstract": "Solution-processed few-layers graphene flakes, dispensed to rotating and sliding contacts via liquid dispersions, are gaining increasing attention as friction modifiers to achieve low friction and wear at technologically-relevant interfaces. Vanishing friction states, i.e. superlubricity, have been documented for nearly-ideal nanoscale contacts lubricated by individual graphene flakes; there is however no clear understanding if superlubricity might persist for larger and morphologically-disordered contacts, as those typically obtained by graphene wet transfer from a liquid dispersion. In this study we address the friction performance of solution-processed graphene flakes by means of colloidal probe Atomic Force Microscopy. We use an additive-free aqueous dispersion to coat micrometric silica beads, which are then sled under ambient conditions against prototypical material substrates, namely graphite and the transition metal dichalcogenides (TMDs) MoS2 and WS2. High resolution microscopy proves that the random assembly of the wet-transferred flakes over the silica probes results into an inhomogeneous coating, formed by graphene patches that control contact mechanics through tens-of-nanometers tall protrusions. Atomic-scale friction force spectroscopy reveals that dissipation proceeds via stick-slip instabilities. Load-controlled transitions from dissipative stick-slip to superlubric continuous sliding may occur for the graphene-graphite homojunctions, whereas single- and multiple-slips dissipative dynamics characterizes the graphene-TMD heterojunctions. Systematic numerical simulations demonstrate that the thermally-activated single-asperity Prandtl-Tomlinson model comprehensively describes friction experiments involving different graphene-coated colloidal probes, material substrates and sliding regimes.",
  "categories": [
    "cond-mat.mes-hall",
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.mes-hall",
  "doi": "10.1021/acsanm.3c01477",
  "journal_ref": "ACS Applied Nano Materials 6, 11443 (2023)",
  "arxiv_id": "2307.14813",
  "pdf_url": "https://arxiv.org/pdf/2307.14813v1",
  "comment": "25 pages, 6 figures",
  "num_versions": null,
  "size_before_bytes": 3504762,
  "size_after_bytes": 2060350
}