{
  "title": "Cascades of turbulent kinetic energy and multicomponent scalars in a momentum-scalar coupling turbulence driven by multiscale forces under homogeneous and isotropic hypotheses",
  "authors": [
    "Wei Zhao"
  ],
  "submission_date": "2023-07-28T10:47:15+00:00",
  "revised_dates": [
    "2023-12-07T06:20:17+00:00",
    "2024-06-05T10:42:45+00:00"
  ],
  "abstract": "Momentum-scalar coupling turbulence, a phenomenon observed in both natural and engineering contexts, involves the intricate interaction between multicomponent scalars and multiscale forces (i.e. multiple coupling mechanisms), resulting in a wide array of manifestations. Despite its importance, limited research has been conducted to comprehend the influence of these multicomponent and multiple coupling mechanisms on turbulence cascades. Hence, this study aims to provide a preliminary and theoretical exploration into how these multiple coupling mechanisms govern the cascades of turbulent kinetic energy and multicomponent scalars. The key findings of this study can be summarized as follows: (1) Validation of Quad-cascade processes. (2) Examination of various cases involving single scalar components but multiple coupling mechanisms. Of particular interest is the coexistence of buoyancy-driven turbulence and electrokinetic turbulence, which introduces a new VF subrange resulting from their nonlinear interaction. Another extension considers an exponential modulation function, equivalent to the coexistence of multiple coupling mechanisms acting on a single scalar. The study identifies two new VF subranges. (3) Binary scalar components and coupling mechanisms are investigated, indicating coupling mechanisms with significantly different strengths can also induce complex interactions and new VF subranges. This highlights the challenges inherent in addressing the simultaneous presence of multiple scalar components and coupling mechanisms. This research endeavor illuminates the theoretical understanding of the diverse scaling properties observed in momentum-scalar coupling turbulence across different scenarios.",
  "categories": [
    "physics.flu-dyn"
  ],
  "primary_category": "physics.flu-dyn",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15473",
  "pdf_url": "https://arxiv.org/pdf/2307.15473v3",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 3850656,
  "size_after_bytes": 2273148
}