{
  "title": "Mechanical response of van der Waals and charge coupled carbon nanotubes",
  "authors": [
    "Aningi Mokhalingam",
    "Indranil S Dalal",
    "Shakti S Gupta"
  ],
  "submission_date": "2023-07-31T06:32:02+00:00",
  "revised_dates": [],
  "abstract": "This work investigates the mechanical response of single-walled carbon nanotubes (SWCNTs) coupled through van der Waals and electrostatic forces using molecular dynamic (MD) simulations and a continuum model. In MD simulations, the covalent bond interactions between the carbon atoms are modeled using ReaxFF potential. The dynamic charges, dependent on the local environment, are calculated employing the charge equilibrium formalism within the ReaxFF. In the continuum model, the SWCNTs are modeled using the geometrically nonlinear Euler-Bernoulli beam theory. The Galerkin's approach is used to discretize the equations of motion. An approximate model to account for the end charge concentration in the SWCNTs, calibrated from the MD data, is incorporated into the beam model. The pair of SWCNTs are prescribed with two sets of boundary conditions: Fixed-fixed and fixed-free. The pull-in voltages at which the two SWCNTs snap onto each other with fixed-fixed boundary conditions obtained from the MD simulations agree within an error of $\\sim 0.5 \\%$ with that computed from the nonlinear beam theory. For fixed-free boundary conditions, the role of geometric nonlinearity is found to be insignificant. However, for this case, the concentrated charges play a significant role in determining the pull-in voltages. The post-pull-in response of the SWCNTs for both boundary conditions is investigated in detail through the MD simulations. The post-pull-in results presented here can be used as a benchmark for results obtained from continuum models in the future. Further, the proposed research helps design nano-resonators/tweezers/switches.",
  "categories": [
    "physics.comp-ph",
    "physics.app-ph"
  ],
  "primary_category": "physics.comp-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16429",
  "pdf_url": "https://arxiv.org/pdf/2307.16429v1",
  "comment": "23 pages, 16 figures",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}