{
  "title": "Study of longitudinal development of air showers in the knee energy range",
  "authors": [
    "Feng Zhang",
    "Hu Liu",
    "Fengrong Zhu",
    "Jacob Oloketuyi"
  ],
  "submission_date": "2023-07-23T07:15:58+00:00",
  "revised_dates": [
    "2023-08-02T13:41:05+00:00",
    "2024-09-30T00:40:37+00:00"
  ],
  "abstract": "Ground-based cosmic ray experiments detect cosmic ray mainly by measuring the longitudinal and lateral distribution of secondary particles produced in the extensive air shower (EAS). The EAS of cosmic ray in the knee energy region is simulated via CORSIKA software. Several simulation samples with different energy, composition and zenith angles were carried out to understand the longitudinal development of electron, muon and Cherenkov light in EAS. All the results presented were obtained assuming an observation plane at an altitude of 4400 m a.s.l. The differences of longitudinal development between electron and Cherenkov light were studied, and the reconstruction uncertainty of shower maximum for electron from Cherenkov light was estimated to be 10-15g/cm$^2$ for nuclei above 1 PeV. The performances of energy measurement and the composition discrimination ability based on longitudinal development were studied and compared with that from lateral distribution. It was found that number of electron per depth at its shower maximum has the smallest shower-to-shower fluctuations, but the shower-to-shower fluctuations of electron density measured at observation level was very close to it when the appropriate zenith angle was employed. The shower-to-shower fluctuations of shower maximum for electron is 50-55 g/cm$^2$ for proton, and 20-25 g/cm$^2$ for iron, but the composition discrimination ability between nuclei from muon density measured at observation level is much better than the shower maximum variable from longitudinal development. The hadronic model dependencies of the longitudinal development and lateral distribution were also discussed.",
  "categories": [
    "astro-ph.HE",
    "astro-ph.IM"
  ],
  "primary_category": "astro-ph.HE",
  "doi": "10.1016/j.astropartphys.2023.102877",
  "journal_ref": null,
  "arxiv_id": "2307.12246",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 23304842,
  "size_after_bytes": 268800
}