{
  "title": "On The Cost Function Associated With Legendrian Knots",
  "authors": [
    "Dheeraj Kulkarni",
    "Tanushree Shah",
    "Monika Yadav"
  ],
  "submission_date": "2023-07-26T05:29:41+00:00",
  "revised_dates": [
    "2025-01-03T02:10:38+00:00",
    "2025-10-07T00:52:47+00:00"
  ],
  "abstract": "In this article, we introduce a non-negative integer-valued function that measures the obstruction for converting topological isotopy between two Legendrian knots into a Legendrian isotopy. We refer to this function as the Cost function. We show that the Cost function induces a metric on the set of topologically isotopic Legendrian knots. Hence, the set of topologically isotopic Legendrian knots can be seen as a graph with path-metric given by the Cost function. Legendrian simple knot types are shown to be characterized using the Cost function. We also get a quantitative version of Fuchs-Tabachnikov's Theorem that says any two Legendrian knots in $(\\mathbb{S}^3,ξ_{std})$ in the same topological knot type become Legendrian isotopic after sufficiently many stabilizations. We compute the Cost function for Legendrian simple knots (for example torus knots) and we note the behavior of Cost function for twist knots and cables of torus knots (some of which are Legendrian non-simple). We also construct examples of Legendrian representatives of 2-bridge knots and compute the Cost between them. Further, we investigate the behavior of the Cost function under the connect sum operation. We conclude with some questions about the Cost function, its relation with the standard contact structure, and the topological knot type.",
  "categories": [
    "math.GT",
    "math.SG"
  ],
  "primary_category": "math.GT",
  "doi": "10.1556/012.2025.04328",
  "journal_ref": null,
  "arxiv_id": "2307.13963",
  "pdf_url": null,
  "comment": "22 pages, 30 figures, Published in Studia Scientiarum Mathematicarum Hungarica",
  "num_versions": null,
  "size_before_bytes": 1811279,
  "size_after_bytes": 1146754
}