{
  "title": "Microwave-based quantum control and coherence protection of tin-vacancy spin qubits in a strain-tuned diamond membrane heterostructure",
  "authors": [
    "Xinghan Guo",
    "Alexander M. Stramma",
    "Zixi Li",
    "William G. Roth",
    "Benchen Huang",
    "Yu Jin",
    "Ryan A. Parker",
    "Jesús Arjona Martínez",
    "Noah Shofer",
    "Cathryn P. Michaels",
    "Carola P. Purser",
    "Martin H. Appel",
    "Evgeny M. Alexeev",
    "Tianle Liu",
    "Andrea C. Ferrari",
    "David D. Awschalom",
    "Nazar Delegan",
    "Benjamin Pingault",
    "Giulia Galli",
    "F. Joseph Heremans",
    "Mete Atatüre",
    "Alexander A. High"
  ],
  "submission_date": "2023-07-21T21:40:21+00:00",
  "revised_dates": [
    "2023-10-09T00:18:36+00:00"
  ],
  "abstract": "Robust spin-photon interfaces in solids are essential components in quantum networking and sensing technologies. Ideally, these interfaces combine a long-lived spin memory, coherent optical transitions, fast and high-fidelity spin manipulation, and straightforward device integration and scaling. The tin-vacancy center (SnV) in diamond is a promising spin-photon interface with desirable optical and spin properties at 1.7 K. However, the SnV spin lacks efficient microwave control and its spin coherence degrades with higher temperature. In this work, we introduce a new platform that overcomes these challenges - SnV centers in uniformly strained thin diamond membranes. The controlled generation of crystal strain introduces orbital mixing that allows microwave control of the spin state with 99.36(9) % gate fidelity and spin coherence protection beyond a millisecond. Moreover, the presence of crystal strain suppresses temperature dependent dephasing processes, leading to a considerable improvement of the coherence time up to 223(10) $μ$s at 4 K, a widely accessible temperature in common cryogenic systems. Critically, the coherence of optical transitions is unaffected by the elevated temperature, exhibiting nearly lifetime-limited optical linewidths. Combined with the compatibility of diamond membranes with device integration, the demonstrated platform is an ideal spin-photon interface for future quantum technologies.",
  "categories": [
    "cond-mat.mes-hall",
    "cond-mat.mtrl-sci",
    "quant-ph"
  ],
  "primary_category": "cond-mat.mes-hall",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11916",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 8461238,
  "size_after_bytes": 304885
}