{
  "title": "Evaluating Large Language Models for Radiology Natural Language Processing",
  "authors": [
    "Zhengliang Liu",
    "Tianyang Zhong",
    "Yiwei Li",
    "Yutong Zhang",
    "Yi Pan",
    "Zihao Zhao",
    "Peixin Dong",
    "Chao Cao",
    "Yuxiao Liu",
    "Peng Shu",
    "Yaonai Wei",
    "Zihao Wu",
    "Chong Ma",
    "Jiaqi Wang",
    "Sheng Wang",
    "Mengyue Zhou",
    "Zuowei Jiang",
    "Chunlin Li",
    "Jason Holmes",
    "Shaochen Xu",
    "Lu Zhang",
    "Haixing Dai",
    "Kai Zhang",
    "Lin Zhao",
    "Yuanhao Chen",
    "Xu Liu",
    "Peilong Wang",
    "Pingkun Yan",
    "Jun Liu",
    "Bao Ge",
    "Lichao Sun",
    "Dajiang Zhu",
    "Xiang Li",
    "Wei Liu",
    "Xiaoyan Cai",
    "Xintao Hu",
    "Xi Jiang",
    "Shu Zhang",
    "Xin Zhang",
    "Tuo Zhang",
    "Shijie Zhao",
    "Quanzheng Li",
    "Hongtu Zhu",
    "Dinggang Shen",
    "Tianming Liu"
  ],
  "submission_date": "2023-07-25T17:57:18+00:00",
  "revised_dates": [
    "2023-07-28T00:22:07+00:00"
  ],
  "abstract": "The rise of large language models (LLMs) has marked a pivotal shift in the field of natural language processing (NLP). LLMs have revolutionized a multitude of domains, and they have made a significant impact in the medical field. Large language models are now more abundant than ever, and many of these models exhibit bilingual capabilities, proficient in both English and Chinese. However, a comprehensive evaluation of these models remains to be conducted. This lack of assessment is especially apparent within the context of radiology NLP. This study seeks to bridge this gap by critically evaluating thirty two LLMs in interpreting radiology reports, a crucial component of radiology NLP. Specifically, the ability to derive impressions from radiologic findings is assessed. The outcomes of this evaluation provide key insights into the performance, strengths, and weaknesses of these LLMs, informing their practical applications within the medical domain.",
  "categories": [
    "cs.CL"
  ],
  "primary_category": "cs.CL",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13693",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 5416639,
  "size_after_bytes": 310292
}