{
  "title": "Sign regular matrices and variation diminution: single-vector tests and characterizations, following Schoenberg, Gantmacher-Krein, and Motzkin",
  "authors": [
    "Projesh Nath Choudhury",
    "Shivangi Yadav"
  ],
  "submission_date": "2023-07-21T18:00:15+00:00",
  "revised_dates": [
    "2023-08-14T00:16:15+00:00",
    "2024-07-31T00:47:54+00:00"
  ],
  "abstract": "Variation diminution (VD) is a fundamental property in total positivity theory, first studied in 1912 by Fekete-Pólya for one-sided Pólya frequency sequences, followed by Schoenberg, and by Motzkin who characterized sign regular (SR) matrices using VD and some rank hypotheses. A classical theorem by Gantmacher-Krein characterized the strictly sign regular (SSR) $m \\times n$ matrices for $m>n$ using this property.\n  In this article we strengthen these results by characterizing all $m \\times n$ SSR matrices using VD. We further characterize strict sign regularity of a given sign pattern in terms of VD together with a natural condition motivated by total positivity. We then refine Motzkin's characterization of SR matrices by omitting the rank condition and specifying the sign pattern. This concludes a line of investigation on VD started by Fekete-Pólya [Rend. Circ. Mat. Palermo 1912] and continued by Schoenberg [Math. Z. 1930], Motzkin [PhD thesis, 1936], Gantmacher-Krein [1950 book], Brown-Johnstone-MacGibbon [J. Amer. Stat. Assoc. 1981], and Choudhury [Bull. London Math. Soc. 2022, Bull. Sci. Math. 2023].\n  In fact we show stronger characterizations, by employing single test vectors with alternating sign coordinates - i.e., lying in the alternating bi-orthant. We also show that test vectors chosen from any other orthant will not work.",
  "categories": [
    "math.RA",
    "math.FA"
  ],
  "primary_category": "math.RA",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11822",
  "pdf_url": null,
  "comment": "This paper has been split into two parts. The second part will be uploaded to arXiv soon. The first part is here and has been extensively revised. Final version, 14 pages, to appear in Proceedings of the American Mathematical Society",
  "num_versions": null,
  "size_before_bytes": 439047,
  "size_after_bytes": 439047
}