{
  "title": "Loop contributions to the scalar power spectrum due to quartic order action in ultra slow roll inflation",
  "authors": [
    "Suvashis Maity",
    "H. V. Ragavendra",
    "Shiv K. Sethi",
    "L. Sriramkumar"
  ],
  "submission_date": "2023-07-25T16:38:46+00:00",
  "revised_dates": [
    "2024-11-26T02:46:44+00:00"
  ],
  "abstract": "[Abridged] In contemporary literature, the calculation of modifications to the inflationary scalar power spectrum due to the loops from the higher order interaction terms in the Hamiltonian have led to a discussion regarding the validity of perturbation theory. Recently, there have been efforts to examine the contributions to the scalar power spectrum due to the loops arising from the cubic order terms in the action describing the perturbations, specifically in inflationary scenarios that permit an epoch of ultra slow roll (USR). A phase of USR inflation leads to significant observational consequences, such as the copious production of primordial black holes. In this work, we study the loop contributions to the scalar power spectrum in a scenario of USR inflation arising due to the quartic order terms in the action describing the scalar perturbations. We compute the loop contributions to the scalar power spectrum due to the dominant term in the action at the quartic order. We consider a scenario wherein a phase of USR is sandwiched between two stages of slow roll inflation and analyze the behavior of the loop contributions in terms of the parameters involved. We examine the late, intermediate and early epochs of USR during inflation. In the inflationary scenario involving a late phase of USR, for reasonable choices of the parameters, we show that the loop corrections are negligible for the entire range of wave numbers. In the intermediate case, the contributions from the loops prove to be scale invariant over large scales, and we find that these contributions can amount to 30% of the leading order power spectrum. In the case wherein USR sets in early, we find that the loop contributions could be negative and can dominate the power spectrum at the leading order, which indicates a breakdown of the perturbative expansion. We conclude with a brief summary and outlook.",
  "categories": [
    "astro-ph.CO",
    "gr-qc",
    "hep-th"
  ],
  "primary_category": "astro-ph.CO",
  "doi": "10.1088/1475-7516/2024/05/046",
  "journal_ref": "JCAP 05 (2024) 046",
  "arxiv_id": "2307.13636",
  "pdf_url": null,
  "comment": "v1: 34 pages, 8 figures; v2: 39 pages, 10 figures, added discussions, references and two appendices",
  "num_versions": null,
  "size_before_bytes": 4543866,
  "size_after_bytes": 723646
}