{
  "title": "Multi-gait Locomotion Planning and Tracking for Tendon-actuated Terrestrial Soft Robot (TerreSoRo)",
  "authors": [
    "Arun Niddish Mahendran",
    "Caitlin Freeman",
    "Alexander H. Chang",
    "Michael McDougall",
    "Patricio A. Vela",
    "Vishesh Vikas"
  ],
  "submission_date": "2023-07-31T03:26:48+00:00",
  "revised_dates": [],
  "abstract": "The adaptability of soft robots makes them ideal candidates to maneuver through unstructured environments. However, locomotion challenges arise due to complexities in modeling the body mechanics, actuation, and robot-environment dynamics. These factors contribute to the gap between their potential and actual autonomous field deployment. A closed-loop path planning framework for soft robot locomotion is critical to close the real-world realization gap. This paper presents a generic path planning framework applied to TerreSoRo (Tetra-Limb Terrestrial Soft Robot) with pose feedback. It employs a gait-based, lattice trajectory planner to facilitate navigation in the presence of obstacles. The locomotion gaits are synthesized using a data-driven optimization approach that allows for learning from the environment. The trajectory planner employs a greedy breadth-first search strategy to obtain a collision-free trajectory. The synthesized trajectory is a sequence of rotate-then-translate gait pairs. The control architecture integrates high-level and low-level controllers with real-time localization (using an overhead webcam). TerreSoRo successfully navigates environments with obstacles where path re-planning is performed. To best of our knowledge, this is the first instance of real-time, closed-loop path planning of a non-pneumatic soft robot.",
  "categories": [
    "cs.RO"
  ],
  "primary_category": "cs.RO",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16385",
  "pdf_url": "https://arxiv.org/pdf/2307.16385v1",
  "comment": "2023 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS 2023)",
  "num_versions": null,
  "size_before_bytes": 18090566,
  "size_after_bytes": 276566
}