{
  "title": "Orbital Period Changes for Fourteen Novae and the Critical Failures of the Predictions of Standard Theories, the Hibernation Model, and the Magnetic Braking Model",
  "authors": [
    "Bradley E. Schaefer"
  ],
  "submission_date": "2023-07-25T20:16:44+00:00",
  "revised_dates": [],
  "abstract": "The evolution of novae and Cataclysmic Variables (CVs) is driven by changes in the binary orbital periods. In a direct and critical test for various evolution models and their physical mechanisms, I measure the sudden changes in the period ($ΔP$) across 14 nova eruptions and I measure the steady period change during quiescence ($\\dot{P}$) for 20 inter-eruption intervals. The standard theory for $ΔP$ is dominated by the mechanism of mass loss, and this fails completely for the five novae with negative values, and it fails to permit the $ΔP$ for U Sco eruptions to change by one order-of-magnitude from eruption-to-eruption. The Hibernation Model of evolution is refuted because all the $ΔP$ measures are orders of magnitude too small to cause any significant drop in accretion luminosity, and indeed, near half of the nova have negative $ΔP$ as the opposite of the required mechanism for any hibernation state. As for the Magnetic Braking Model, this fails by many orders-of-magnitude in its predictions of the required $\\dot{P}$ for 9-out-of-13 novae. The observed $\\dot{P}$ values scatter, both positively and negatively, over a range of $\\pm$10$^{-9}$, while the predicted values are from $-$10$^{-13}$ to $-$10$^{-11}$. This huge scatter is not possible with standard theory, and there must be some currently-unknown mechanism to be added in, with this new mechanism 100--10000$\\times$ larger in effect than the current theory allows. In all, these failed predictions demonstrate that nova systems must have unknown physical mechanisms for both $ΔP$ and $\\dot{P}$ that dominate over all other effects.",
  "categories": [
    "astro-ph.SR",
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.SR",
  "doi": "10.1093/mnras/stad2223",
  "journal_ref": null,
  "arxiv_id": "2307.13804",
  "pdf_url": null,
  "comment": "MNRAS in press, see MNRAS webpage for published version and for the Supplementary Materials",
  "num_versions": null,
  "size_before_bytes": 848880,
  "size_after_bytes": 170124
}