{
  "title": "Theory of electron and ion holes as vortices in the phase-space of collision-less plasmas",
  "authors": [
    "Allen Lobo",
    "Vinod Kumar Sayal"
  ],
  "submission_date": "2023-07-28T09:55:17+00:00",
  "revised_dates": [
    "2023-10-30T17:37:55+00:00"
  ],
  "abstract": "This article studies the vortical nature and structure of phase-space holes -- nonlinear B.G.K. trapping modes found in the phase-space collision-free plasmas. A fluid-like outlook of the particles' phase-space is explored, which makes it convenient to analytically identify electron and ion holes as vortices -- similar to that of ordinary two-dimensional fluids. A fluid velocity is defined for the phase-space of the electrons and ions, continuity and momentum equations describing the flow of the phase-space fluid representing the particle system are then developed. Pressure formation and associated diffusion in phase-space of such systems is introduced and a vorticity field of the phase-space is then defined. Using these equations, electron holes and ion holes are analytically identified as vortices in the phase-space of the plasma. A relation between Schamel's trapping parameter ($β$), hole speed ($M$), hole phase-space depth ($-Γ$) and hole potential amplitude ($χ_0$) is derived. The approach introduces a new technique to study the phase-space holes of collision-less plasmas, allowing fluid-vortex-like treatment to these kinetic structures. Phase-space distribution functions for electron hole regions can then be analytically derived from this model, reproducing the schamel-df equations and thus acting as a precursor to the pseudo-potential approach, avoiding the need to assume a solution to the phase-space density.",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph",
  "doi": "10.1063/5.0216144",
  "journal_ref": null,
  "arxiv_id": "2307.15447",
  "pdf_url": "https://arxiv.org/pdf/2307.15447v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 2142276,
  "size_after_bytes": 187407
}