{
  "title": "Intruder in a two-dimensional granular system: statics and dynamics of force networks in an experimental system experiencing stick-slip dynamics",
  "authors": [
    "R. Basak",
    "R. Kozlowski",
    "L. A. Pugnaloni",
    "M. Kramar",
    "E. S. Socolar",
    "C. M. Carlevaro",
    "L. Kondic"
  ],
  "submission_date": "2023-07-24T15:35:02+00:00",
  "revised_dates": [],
  "abstract": "In quasi-two-dimensional experiments with photoelastic particles confined to an annular region, an intruder constrained to move in a circular path halfway between the annular walls experiences stick-slip dynamics. We discuss the response of the granular medium to the driven intruder, focusing on the evolution of the force network during sticking periods. Because the available experimental data does not include precise information about individual contact forces, we use an approach developed in our previous work (Basak et al, J. Eng. Mechanics (2021)) based on networks constructed from measurements of the integrated strain magnitude on each particle. These networks are analyzed using topological measures based on persistence diagrams, revealing that force networks evolve smoothly but in a nontrivial manner throughout each sticking period, even though the intruder and granular particles are stationary. Characteristic features of persistence diagrams show identifiable changes as a slip is approaching, indicating the existence of slip precursors. Key features of the dynamics are similar for granular materials composed of disks or pentagons, but some details are consistently different. In particular, we find significantly larger fluctuations of the measures computed based on persistence diagrams, and therefore of the underlying networks, for systems of pentagonal particles.",
  "categories": [
    "cond-mat.soft"
  ],
  "primary_category": "cond-mat.soft",
  "doi": "10.1103/PhysRevE.108.054903",
  "journal_ref": null,
  "arxiv_id": "2307.12890",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 5507799,
  "size_after_bytes": 87216
}