{
  "title": "The Yule-Frisch-Waugh-Lovell Theorem for Linear Instrumental Variables Estimation",
  "authors": [
    "Deepankar Basu"
  ],
  "submission_date": "2023-07-12T19:18:22+00:00",
  "revised_dates": [
    "2023-08-15T00:45:12+00:00"
  ],
  "abstract": "In this paper, I discuss three aspects of the Frisch-Waugh-Lovell theorem. First, I show that the theorem holds for linear instrumental variables estimation of a multiple regression model that is either exactly or overidentified. I show that with linear instrumental variables estimation: (a) coefficients on endogenous variables are identical in full and partial (or residualized) regressions; (b) residual vectors are identical for full and partial regressions; and (c) estimated covariance matrices of the coefficient vectors from full and partial regressions are equal (up to a degree of freedom correction) if the estimator of the error vector is a function only of the residual vectors and does not use any information about the covariate matrix other than its dimensions. While estimation of the full model uses the full set of instrumental variables, estimation of the partial model uses the residualized version of the same set of instrumental variables, with residualization carried out with respect to the set of exogenous variables. Second, I show that: (a) the theorem applies in large samples to the K-class of estimators, including the limited information maximum likelihood (LIML) estimator, and (b) the theorem does not apply in general to linear GMM estimators, but it does apply to the two step optimal linear GMM estimator. Third, I trace the historical and analytical development of the theorem and suggest that it be renamed as the Yule-Frisch-Waugh-Lovell (YFWL) theorem to recognize the pioneering contribution of the statistician G. Udny Yule in its development.",
  "categories": [
    "econ.EM"
  ],
  "primary_category": "econ.EM",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12731",
  "pdf_url": null,
  "comment": "arXiv admin note: substantial text overlap with arXiv:2307.00369",
  "num_versions": null,
  "size_before_bytes": 225305,
  "size_after_bytes": 227029
}