{
  "title": "Engineering Dion-Jacobson Perovskites in Polariton Waveguides",
  "authors": [
    "Annalisa Coriolano",
    "Anna Moliterni",
    "Francesco Todisco",
    "Laura Polimeno",
    "Rosanna Mastria",
    "Vincent Olieric",
    "Carlotta Giacobbe",
    "Milena De Giorgi",
    "Dario Ballarini",
    "Aurora Rizzo",
    "Giuseppe Gigli",
    "Cinzia Giannini",
    "Ilenia Viola",
    "Daniele Sanvitto",
    "Luisa De Marco"
  ],
  "submission_date": "2023-07-11T08:24:06+00:00",
  "revised_dates": [],
  "abstract": "Hybrid two-dimensional perovskites hold considerable promise as semiconductors for a wide range of optoelectronic applications. Many efforts are addressed to exploit the potential of these materials by tailoring their characteristics. In this work, the optical properties and electronic band structure in three new Dion-Jacobson (DJ) perovskites (PVKs) are engineered by modulating their structural distortion. Two different interlayer cations: 1-6, Hexamethylendiammonium, HE, and 3-(Dimethylamino)-1-propylammonium, DMPA, have been selected to investigate the role of the cation length and the ammonium binding group on the crystalline structure. This study provides new insights into the understanding of the structure-property relationship in DJ perovskites and demonstrates that exciton characteristics can be easily modulated with the judicious design of the organic cations. DJ PVKs developed in this work were also grown as size-controlled single crystal microwires through a microfluidic-assisted synthesis technique and integrated in a nanophotonic device. The DJ PVK microwire acts as a waveguide exhibiting strong light-matter coupling between the crystal optical modes and DJ PVK exciton. Through the investigation of these polariton waveguides, the nature of the double peak emission, which is often observed in these materials and whose nature is largely debated in the literature, is demonstrated originating from the hybrid polariton state.",
  "categories": [
    "cond-mat.mtrl-sci",
    "physics.optics"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": "10.1002/adom.202500299",
  "journal_ref": null,
  "arxiv_id": "2307.15070",
  "pdf_url": "https://arxiv.org/pdf/2307.15070v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 2492469,
  "size_after_bytes": 1520338
}