{
  "title": "White-light superflare and long-term activity of the nearby M7 type binary EI~Cnc observed with GWAC system",
  "authors": [
    "Hua-Li Li",
    "Jing Wang",
    "Li-Ping Xin",
    "Jian-Ying Bai",
    "Xu-Hui Han",
    "Hong-Bo Cai",
    "Lei Huang",
    "Xiao-Meng Lu",
    "Yu-Lei Qiu",
    "Chao Wu",
    "Guang-Wei Li",
    "Jing-Song Deng",
    "Da-Wei Xu",
    "Yuan-Gui Yang",
    "Xiang-Gao Wang",
    "En-Wei Liang",
    "Jian-Yan Wei"
  ],
  "submission_date": "2023-07-27T02:39:10+00:00",
  "revised_dates": [],
  "abstract": "Stellar white-light flares are believed to play an essential role on the physical and chemical properties of the atmosphere of the surrounding exoplanets. Here we report an optical monitoring campaign on the nearby flaring system EI~Cnc carried out by the Ground-based Wide Angle Cameras (GWAC) and its dedicated follow-up telescope. A superflare, coming from the brighter component EI~CncA, was detected and observed, in which four components are required to properly model the complex decay light curve. The lower limit of flare energy in the $R-$band is estimated to be $3.3\\times10^{32}$ ergs. 27 flares are additionally detected from the GWAC archive data with a total duration of 290 hours. The inferred cumulative flare frequency distribution follows a quite shallow power-law function with a slope of $β=-0.50\\pm 0.03$ over the energy range between $10^{30}$ and $10^{33}$ erg, which reinforces the trend that stars cooler than M4 show enhanced superflare activity. The flares identified in EI~Cnc enable us to extend the $τ-E$ relationship previously established in the white-light superflares of solar-type stars down to an energy as low as $\\sim10^{30}$erg (i.e., by three orders): $τ\\propto E^{0.42\\pm0.02}$, which suggests a common flare mechanism for stars with a type from M to solar-like, and implies an invariant of $B^{1/3}\\upsilon_{\\rm A}$ in the white-light flares.",
  "categories": [
    "astro-ph.SR",
    "astro-ph.EP"
  ],
  "primary_category": "astro-ph.SR",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14594",
  "pdf_url": "https://arxiv.org/pdf/2307.14594v1",
  "comment": "14 pages, 8 figures",
  "num_versions": null,
  "size_before_bytes": 9004339,
  "size_after_bytes": 288899
}