{
  "title": "Predicting pedestrian trajectories at different densities: A multi-criteria empirical analysis",
  "authors": [
    "Raphael Korbmacher",
    "Huu-Tu Dang",
    "Antoine Tordeux"
  ],
  "submission_date": "2023-07-28T09:48:19+00:00",
  "revised_dates": [],
  "abstract": "Predicting human trajectories is a challenging task due to the complexity of pedestrian behavior, which is influenced by external factors such as the scene's topology and interactions with other pedestrians. A special challenge arises from the dependence of the behaviour on the density of the scene. In the literature, deep learning algorithms show the best performance in predicting pedestrian trajectories, but so far just for situations with low densities. In this study, we aim to investigate the suitability of these algorithms for high-density scenarios by evaluating them on different error metrics and comparing their accuracy to that of knowledge-based models that have been used since long time in the literature. The findings indicate that deep learning algorithms provide improved trajectory prediction accuracy in the distance metrics for all tested densities. Nevertheless, we observe a significant number of collisions in the predictions, especially in high-density scenarios. This issue arises partly due to the absence of a collision avoidance mechanism within the algorithms and partly because the distance-based collision metric is inadequate for dense situations. To address these limitations, we propose the introduction of a novel continuous collision metric based on pedestrians' time-to-collision. Subsequently, we outline how this metric can be utilized to enhance the training of the algorithms.",
  "categories": [
    "physics.soc-ph"
  ],
  "primary_category": "physics.soc-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15442",
  "pdf_url": "https://arxiv.org/pdf/2307.15442v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 14445592,
  "size_after_bytes": 336221
}