{
  "title": "Pro-PRIME: A general Temperature-Guided Language model to engineer enhanced Stability and Activity in Proteins",
  "authors": [
    "Fan Jiang",
    "Mingchen Li",
    "Jiajun Dong",
    "Yuanxi Yu",
    "Xinyu Sun",
    "Banghao Wu",
    "Jin Huang",
    "Liqi Kang",
    "Yufeng Pei",
    "Liang Zhang",
    "Shaojie Wang",
    "Wenxue Xu",
    "Jingyao Xin",
    "Wanli Ouyang",
    "Guisheng Fan",
    "Lirong Zheng",
    "Yang Tan",
    "Zhiqiang Hu",
    "Yi Xiong",
    "Yan Feng",
    "Guangyu Yang",
    "Qian Liu",
    "Jie Song",
    "Jia Liu",
    "Liang Hong",
    "Pan Tan"
  ],
  "submission_date": "2023-07-24T10:41:48+00:00",
  "revised_dates": [],
  "abstract": "Designing protein mutants of both high stability and activity is a critical yet challenging task in protein engineering. Here, we introduce PRIME, a deep learning model, which can suggest protein mutants of improved stability and activity without any prior experimental mutagenesis data of the specified protein. Leveraging temperature-aware language modeling, PRIME demonstrated superior predictive power compared to current state-of-the-art models on the public mutagenesis dataset over 283 protein assays. Furthermore, we validated PRIME's predictions on five proteins, examining the top 30-45 single-site mutations' impact on various protein properties, including thermal stability, antigen-antibody binding affinity, and the ability to polymerize non-natural nucleic acid or resilience to extreme alkaline conditions. Remarkably, over 30% of the AI-recommended mutants exhibited superior performance compared to their pre-mutation counterparts across all proteins and desired properties. Moreover, we have developed an efficient, and successful method based on PRIME to rapidly obtain multi-site mutants with enhanced activity and stability. Hence, PRIME demonstrates the general applicability in protein engineering.",
  "categories": [
    "q-bio.BM"
  ],
  "primary_category": "q-bio.BM",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12682",
  "pdf_url": null,
  "comment": "arXiv admin note: text overlap with arXiv:2304.03780",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}