{
  "title": "High-sensitivity AC-charge detection with a MHz-frequency fluxonium qubit",
  "authors": [
    "B. -L. Najera-Santos",
    "R. Rousseau",
    "K. Gerashchenko",
    "H. Patange",
    "A. Riva",
    "M. Villiers",
    "T. Briant",
    "P. -F. Cohadon",
    "A. Heidmann",
    "J. Palomo",
    "M. Rosticher",
    "H. le Sueur",
    "A. Sarlette",
    "W. C. Smith",
    "Z. Leghtas",
    "E. Flurin",
    "T. Jacqmin",
    "S. Deléglise"
  ],
  "submission_date": "2023-07-26T17:48:09+00:00",
  "revised_dates": [],
  "abstract": "Owing to their strong dipole moment and long coherence times, superconducting qubits have demonstrated remarkable success in hybrid quantum circuits. However, most qubit architectures are limited to the GHz frequency range, severely constraining the class of systems they can interact with. The fluxonium qubit, on the other hand, can be biased to very low frequency while being manipulated and read out with standard microwave techniques. Here, we design and operate a heavy fluxonium with an unprecedentedly low transition frequency of $1.8~\\mathrm{MHz}$. We demonstrate resolved sideband cooling of the ``hot'' qubit transition with a final ground state population of $97.7~\\%$, corresponding to an effective temperature of $23~μ\\mathrm{K}$. We further demonstrate coherent manipulation with coherence times $T_1=34~μ\\mathrm{s}$, $T_2^*=39~μ\\mathrm{s}$, and single-shot readout of the qubit state. Importantly, by directly addressing the qubit transition with a capacitively coupled waveguide, we showcase its high sensitivity to a radio-frequency field. Through cyclic qubit preparation and interrogation, we transform this low-frequency fluxonium qubit into a frequency-resolved charge sensor. This method results in a charge sensitivity of $33~μ\\mathrm{e}/\\sqrt{\\mathrm{Hz}}$, or an energy sensitivity (in joules per hertz) of $2.8~\\hbar$. This method rivals state-of-the-art transport-based devices, while maintaining inherent insensitivity to DC charge noise. The high charge sensitivity combined with large capacitive shunt unlocks new avenues for exploring quantum phenomena in the $1-10~\\mathrm{MHz}$ range, such as the strong-coupling regime with a resonant macroscopic mechanical resonator.",
  "categories": [
    "quant-ph",
    "cond-mat.mes-hall"
  ],
  "primary_category": "quant-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14329",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 4887597,
  "size_after_bytes": 152350
}