{
  "title": "High-speed electrical connector assembly by structured compliance in a finray-effect gripper",
  "authors": [
    "Richard Hartisch",
    "Kevin Haninger"
  ],
  "submission_date": "2023-07-28T14:44:51+00:00",
  "revised_dates": [],
  "abstract": "Fine assembly tasks such as electrical connector insertion have tight tolerances and sensitive components, requiring compensation of alignment errors while applying sufficient force in the insertion direction, ideally at high speeds and while grasping a range of components. Vision, tactile, or force sensors can compensate alignment errors, but have limited bandwidth, limiting the safe assembly speed. Passive compliance such as silicone-based fingers can reduce collision forces and grasp a range of components, but often cannot provide the accuracy or assembly forces required. To support high-speed mechanical search and self-aligning insertion, this paper proposes monolithic additively manufactured fingers which realize a moderate, structured compliance directly proximal to the gripped object. The geometry of finray-effect fingers are adapted to add form-closure features and realize a directionally-dependent stiffness at the fingertip, with a high stiffness to apply insertion forces and lower transverse stiffness to support alignment. Design parameters and mechanical properties of the fingers are investigated with FEM and empirical studies, analyzing the stiffness, maximum load, and viscoelastic effects. The fingers realize a remote center of compliance, which is shown to depend on the rib angle, and a directional stiffness ratio of $14-36$. The fingers are applied to a plug insertion task, realizing a tolerance window of $7.5$ mm and approach speeds of $1.3$ m/s.",
  "categories": [
    "cs.RO"
  ],
  "primary_category": "cs.RO",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15589",
  "pdf_url": "https://arxiv.org/pdf/2307.15589v1",
  "comment": "Under review. arXiv admin note: substantial text overlap with arXiv:2301.08431",
  "num_versions": null,
  "size_before_bytes": 48593227,
  "size_after_bytes": 1864311
}