{
  "title": "Low-Cost Lung Cancer Detection Using Machine Learning on Breath Samples",
  "authors": [
    "Jayanth Mokkapati"
  ],
  "submission_date": "2023-07-22T21:31:25+00:00",
  "revised_dates": [],
  "abstract": "In recent years, electronic nose devices have become a popular approach for identifying respiratory disorders including lung cancer. Traditional e-nose systems have had very consistent principles and patterns of sensor responses. After coming to the realization that detecting cancer at early stages can save 99 percent of lives, it has become imperative to design a machine that can easily detect for lung cancer(the most common type of cancer) in a cost-effective and accurate way. Designing an Al Nose was a perfect way to counteract the problem. A tiny e-nose system with 14 gas sensors of four types was created and fifty breath samples were analyzed. Five feature extraction techniques and two classifiers were used to test the system's efficiency in recognizing and discriminating lung cancer from other respiratory disorders and healthy controls. Finally, the impact of different sensor types on the capacity of e-nose systems to identify objects was investigated. The sensitivity, specificity, and accuracy of distinguishing lung cancer patients from healthy controls are 91.58 percent, 91.72 percent, and 91.59 percent, respectively, when utilizing the DA fuzzy 5-NIN classification approach. The findings imply that type-specific sensors might improve the diagnostic accuracy of e-nose devices greatly. These findings indicated that the e-nose system described in this work might be used in lung cancer screening with good results. Furthermore, while creating e-nose systems, it is critical to consider type-different sensors. This machine covers all aspects to most effectively develop a machine that can detect lung cancer that is user-friendly and low cost.",
  "categories": [
    "q-bio.QM"
  ],
  "primary_category": "q-bio.QM",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12170",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}