{
  "title": "Pairwise kSZ signal extraction efficacy and optical depth estimation",
  "authors": [
    "Yulin Gong",
    "Rachel Bean",
    "Patricio A. Gallardo",
    "Eve M. Vavagiakis",
    "Nicholas Battaglia",
    "Michael Niemack"
  ],
  "submission_date": "2023-07-21T20:40:53+00:00",
  "revised_dates": [
    "2024-01-15T01:05:07+00:00"
  ],
  "abstract": "We determine the efficacy of the kinematic Sunyaev-Zel'dovich signal extraction pipeline, using pairwise kSZ measurements, in recovering unbiased estimates of the signal and inference of the associated optical depth. We consider the impact of cluster co-alignments along the line of sight, the modeling of baryonic clustering, and the presence of diffuse gas, as well as instrument beam convolution and noise. We demonstrate that two complementary approaches, aperture photometry, and a matched filter, can be used to recover an unbiased estimate of the cluster kSZ signal and the associated optical depth. Aperture photometry requires a correction factor accounting for the subtraction of signal in the annulus while the matched filter requires a tuning of the signal template profile. We show that both of these can be calibrated from simulated survey data. The optical depth estimates are also consistent with those inferred from stacked thermal SZ measurements. We apply the approaches to the publicly available Atacama Cosmology Telescope (ACT) data. The techniques developed here provide a promising method to leverage upcoming kSZ measurements, from ACT, Simons Observatory, CCAT, and CMB-S4 with spectroscopic galaxy surveys from DESI, Euclid, and Roman, to constrain cosmological properties of the dark energy, gravity, and neutrino masses.",
  "categories": [
    "astro-ph.CO"
  ],
  "primary_category": "astro-ph.CO",
  "doi": "10.1103/PhysRevD.109.023513",
  "journal_ref": "Phys. Rev. D 109, 023513 (2024)",
  "arxiv_id": "2307.11894",
  "pdf_url": null,
  "comment": "17 pages, 12 figures. Updated to match the published version in PRD",
  "num_versions": null,
  "size_before_bytes": 1989415,
  "size_after_bytes": 561563
}