{
  "title": "Scale jump-aware pose graph relaxation for monocular SLAM with re-initializations",
  "authors": [
    "Runze Yuan",
    "Ran Cheng",
    "Lige Liu",
    "Tao Sun",
    "Laurent Kneip"
  ],
  "submission_date": "2023-07-23T13:48:50+00:00",
  "revised_dates": [],
  "abstract": "Pose graph relaxation has become an indispensable addition to SLAM enabling efficient global registration of sensor reference frames under the objective of satisfying pair-wise relative transformation constraints. The latter may be given by incremental motion estimation or global place recognition. While the latter case enables loop closures and drift compensation, care has to be taken in the monocular case in which local estimates of structure and displacements can differ from reality not just in terms of noise, but also in terms of a scale factor. Owing to the accumulation of scale propagation errors, this scale factor is drifting over time, hence scale-drift aware pose graph relaxation has been introduced. We extend this idea to cases in which the relative scale between subsequent sensor frames is unknown, a situation that can easily occur if monocular SLAM enters re-initialization and no reliable overlap between successive local maps can be identified. The approach is realized by a hybrid pose graph formulation that combines the regular similarity consistency terms with novel, scale-blind constraints. We apply the technique to the practically relevant case of small indoor service robots capable of effectuating purely rotational displacements, a condition that can easily cause tracking failures. We demonstrate that globally consistent trajectories can be recovered even if multiple re-initializations occur along the loop, and present an in-depth study of success and failure cases.",
  "categories": [
    "cs.RO"
  ],
  "primary_category": "cs.RO",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12326",
  "pdf_url": null,
  "comment": "8 pages, 23 figures, International Conference on Intelligent Robots and Systems 2023",
  "num_versions": null,
  "size_before_bytes": 5309846,
  "size_after_bytes": 426684
}