{
  "title": "Patchy Screening of the CMB from Dark Photons",
  "authors": [
    "Dalila Pîrvu",
    "Junwu Huang",
    "Matthew C. Johnson"
  ],
  "submission_date": "2023-07-27T18:00:19+00:00",
  "revised_dates": [
    "2023-12-05T14:01:58+00:00",
    "2024-10-17T20:22:33+00:00"
  ],
  "abstract": "We study anisotropic (patchy) screening induced by the resonant conversion of cosmic microwave background (CMB) photons into dark-sector massive vector bosons (dark photons) as they cross non-linear large scale structure (LSS). Resonant conversion takes place through the kinetic mixing of the photon with the dark photon, one of the simplest low energy extensions to the Standard Model. In the early Universe, resonant conversion can occur when the photon plasma mass, obtained as the photon propagates through the ionized interstellar and intergalactic media, matches the dark photon mass. After the epoch of reionization, resonant conversion occurs mainly in the ionized gas that occupies virialized dark matter halos, for a range of dark photon masses between $10^{-13} {\\rm \\; eV} \\lesssim m_{\\rm A^{\\prime}} \\lesssim 10^{-11} {\\rm \\; eV}$. This leads to new CMB anisotropies that are correlated with LSS, which we refer to as patchy dark screening, in analogy with anisotropies from Thomson screening. Its unique frequency dependence allows it to be distinguished from the blackbody CMB. In this paper, we use a halo model approach to predict the imprint of dark screening on the CMB temperature and polarization anisotropies, as well as their correlation with LSS. We then examine the two- and three-point correlation functions of the dark-screened CMB, as well as correlation functions between CMB and LSS observables, to project the sensitivity of future measurements to the kinetic mixing parameter and dark photon mass. We demonstrate that an analysis with existing CMB data can improve upon current constraints on the kinetic mixing parameter by two orders of magnitude with the two-point correlation functions, while data from upcoming CMB experiments and LSS surveys can further improve the reach by another order of magnitude with two- and three-point correlation functions.",
  "categories": [
    "hep-ph",
    "astro-ph.CO"
  ],
  "primary_category": "hep-ph",
  "doi": "10.1088/1475-7516/2024/01/019",
  "journal_ref": null,
  "arxiv_id": "2307.15124",
  "pdf_url": "https://arxiv.org/pdf/2307.15124v3",
  "comment": "29 + 15 pages; 9 + 4 figures; comments welcome",
  "num_versions": null,
  "size_before_bytes": 15625067,
  "size_after_bytes": 3362069
}