{
  "title": "Machine Learning based Parameter Sensitivity of Regional Climate Models -- A Case Study of the WRF Model for Heat Extremes over Southeast Australia",
  "authors": [
    "P. Jyoteeshkumar Reddy",
    "Sandeep Chinta",
    "Richard Matear",
    "John Taylor",
    "Harish Baki",
    "Marcus Thatcher",
    "Jatin Kala",
    "Jason Sharples"
  ],
  "submission_date": "2023-07-27T07:02:06+00:00",
  "revised_dates": [],
  "abstract": "Heatwaves and bushfires cause substantial impacts on society and ecosystems across the globe. Accurate information of heat extremes is needed to support the development of actionable mitigation and adaptation strategies. Regional climate models are commonly used to better understand the dynamics of these events. These models have very large input parameter sets, and the parameters within the physics schemes substantially influence the model's performance. However, parameter sensitivity analysis (SA) of regional models for heat extremes is largely unexplored. Here, we focus on the southeast Australian region, one of the global hotspots of heat extremes. In southeast Australia Weather Research and Forecasting (WRF) model is the widely used regional model to simulate extreme weather events across the region. Hence in this study, we focus on the sensitivity of WRF model parameters to surface meteorological variables such as temperature, relative humidity, and wind speed during two extreme heat events over southeast Australia. Due to the presence of multiple parameters and their complex relationship with output variables, a machine learning (ML) surrogate-based global sensitivity analysis method is considered for the SA. The ML surrogate-based Sobol SA is used to identify the sensitivity of 24 adjustable parameters in seven different physics schemes of the WRF model. Results show that out of these 24, only three parameters, namely the scattering tuning parameter, multiplier of saturated soil water content, and profile shape exponent in the momentum diffusivity coefficient, are important for the considered meteorological variables. These SA results are consistent for the two different extreme heat events. Further, we investigated the physical significance of sensitive parameters. This study's results will help in further optimising WRF parameters to improve model simulation.",
  "categories": [
    "physics.ao-ph",
    "cs.LG"
  ],
  "primary_category": "physics.ao-ph",
  "doi": "10.1088/1748-9326/ad0eb0",
  "journal_ref": "Environ. Res. Lett. 19 (2024) 014010",
  "arxiv_id": "2307.14654",
  "pdf_url": "https://arxiv.org/pdf/2307.14654v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1720600,
  "size_after_bytes": 1021856
}