{
  "title": "Type II t-J model and shared antiferromagnetic spin coupling from Hund's rule in superconducting La$_3$Ni$_2$O$_7$",
  "authors": [
    "Hanbit Oh",
    "Ya-Hui Zhang"
  ],
  "submission_date": "2023-07-28T17:54:15+00:00",
  "revised_dates": [
    "2023-09-07T01:52:35+00:00",
    "2023-11-26T17:54:34+00:00"
  ],
  "abstract": "Recently, a 80 K superconductor was discovered in La$_3$Ni$_2$O$_7$ under high pressure. Density function theory (DFT) calculations identify $d_{x^2-y^2}$, $d_{z^2}$ as the active orbitals on the bilayer square lattice with a $d^{8-x}$ configuration of of Ni per site. One naive expectation is to describe this system in terms of a two-orbital t-J model. However, we emphasize the importance of Hund's coupling $J_H$ and the $x=0$ limit should be viewed as a spin-one Mott insulator. Especially, the significant Hund's coupling shares the inter-layer super-exchange $J_\\perp$ of the $d_{z^2}$ orbital to the $d_{x^2-y^2}$ orbital, an effect that cannot be captured by conventional perturbation or mean-field approaches. In this study, we first explore the limit where the $d_{z^2}$ orbital is Mott localized, dealing with a one-orbital bilayer t-J model focused on the $d_{x^2-y^2}$ orbital. Notably, we find that strong inter-layer pairing survives up to $x=0.5$ hole doping driven by the transmitted $J_\\perp$, which explains the existence of a high Tc superconductor in the experiment at this doping level. Next, we uncover the more realistic situation where the $d_{z^2}$ orbital is slightly hole-doped and cannot be simply integrated out. We take the $J_H\\rightarrow +\\infty$ limit and propose a type II t-J model with four \\textit{spin-half} singlon ($d^7$) states and three \\textit{spin-one} doublon ($d^8$) states. Employing a parton mean-field approach, we recover similar results as in the one-orbital t-J model, but now with the effect of the $J_\\perp$ automatically generated. We propose future experiments to electron dope the system to further enhance $T_c$.",
  "categories": [
    "cond-mat.str-el",
    "cond-mat.supr-con"
  ],
  "primary_category": "cond-mat.str-el",
  "doi": "10.1103/PhysRevB.108.17451",
  "journal_ref": "Phys. Rev. B 108, 174511 (2023)",
  "arxiv_id": "2307.15706",
  "pdf_url": "https://arxiv.org/pdf/2307.15706v3",
  "comment": "5+4 pages, 4+2 figures",
  "num_versions": null,
  "size_before_bytes": 7677554,
  "size_after_bytes": 195636
}