{
  "title": "Cognitive Engagement for STEM+C Education: Investigating Serious Game Impact on Graph Structure Learning with fNIRS",
  "authors": [
    "Shayla Sharmin",
    "Reza Koiler",
    "Rifat Sadik",
    "Arpan Bhattacharjee",
    "Priyanka Raju Patre",
    "Pinar Kullu",
    "Charles Hohensee",
    "Nancy Getchell",
    "Roghayeh Leila Barmaki"
  ],
  "submission_date": "2023-07-25T16:39:35+00:00",
  "revised_dates": [
    "2024-01-30T01:02:12+00:00",
    "2025-06-13T00:42:10+00:00"
  ],
  "abstract": "For serious games on education, understanding the effectiveness of different learning methods in influencing cognitive processes remains a significant challenge. This study investigates the impact of serious games on graph structure learning. For this, we compared our in-house game-based learning (GBL) and video-based learning (VBL) methodologies by evaluating their effectiveness on cognitive processes by oxygenated hemoglobin levels using functional near-infrared spectroscopy (fNIRS). We conducted a 2 x 1 between subjects preliminary study with twelve participants, involving two conditions: game and video. Both groups received equivalent content related to the basic structure of a graph, with comparable session lengths. The game group interacted with a quiz-based game, while the video group watched a pre-recorded video. The fNIRS was employed to capture cerebral signals from the prefrontal cortex, and participants completed pre- and post- questionnaires capturing user experience and knowledge gain. In our study, we noted that the mean levels of oxygenated hemoglobin were higher in the GBL group, suggesting the potential enhanced cognitive involvement. Our results show that the lateral prefrontal cortex (LPFC) has greater hemodynamic activity during the learning period. Moreover, knowledge gain analysis showed an increase in mean score in the GBL group compared to the VBL group. Although we did not observe statistically significant changes due to participant variability and sample size, this preliminary work contributes to understanding how GBL and VBL impact cognitive processes, providing insights for enhanced instructional design and educational game development. Additionally, it emphasizes the necessity for further investigation into the impact of GBL on cognitive engagement and learning outcomes.",
  "categories": [
    "cs.HC"
  ],
  "primary_category": "cs.HC",
  "doi": "10.1109/AIxVR59861.2024.00032",
  "journal_ref": "2024 IEEE International Conference on Artificial Intelligence and eXtended and Virtual Reality (AIxVR), Los Angeles, CA, USA, 2024, pp. 195-204",
  "arxiv_id": "2307.13637",
  "pdf_url": null,
  "comment": "19 pages, 9 figures",
  "num_versions": null,
  "size_before_bytes": 27670615,
  "size_after_bytes": 1245586
}