{
  "title": "A critical perspective for emerging ultra-thin solar cells with ultra-high power-per-weight outputs",
  "authors": [
    "Apostolos Panagiotopoulos",
    "Temur Maksudov",
    "George Kakavelakis",
    "George Perrakis",
    "Essa A. Alharbi",
    "Dimitar Kutsarov",
    "Furkan H. Isikgor",
    "Salman Alfihed",
    "Konstantinos Petridis",
    "Maria Kafesaki",
    "S. Ravi P. Silva",
    "Thomas D. Anthopoulos",
    "Michael Graetzel"
  ],
  "submission_date": "2023-07-25T12:16:24+00:00",
  "revised_dates": [],
  "abstract": "Ultrathin, solution-processed emerging solar cells with high power-per-weight (PPW) outputs demonstrate unique potential for applications where low weight, high power output, and flexibility are indispensable. The following perspective explores the literature of emerging PVs and highlights the maximum reported PPW values of Perovskite Solar Cells (PSCs) 29.4 W/g, Organic Solar Cells (OSCs) 32.07 W/g and Quantum Dot Solar Cells (QDSC) 15.02 W/g, respectively. The record PPW values of OSCs and PSCs are approximately one order of magnitude higher compared to their inorganic ultrathin solar cells counterparts (approx. 3.2 W/g for CIGS and a-Si). This consists emerging PVs, very attractive for a variety of applications where the PPW is the key parameter. In particular, both OSCs and PSCs can be implemented in different scenarios of applications (indoor and biocompatible applications for OSCs and outdoor and high-energy radiation conversion conditions for the PSCs) due to their unique optoelectronic and physiochemical properties. Finally, our theoretical optical and electrical simulation and optimization study for the most promising and well-suited PV technologies, showed an impressive maximum realistic theoretical PPW limit of 74.3 and 93.7 W/g for PSCs and OSCs, respectively. Our finding shows that the literature PSCs and OSCs towards high PPW outputs, is not quite close to the theoretical maximum and thus more work needs to be done to further increase the PPW output of these promising PV technologies.",
  "categories": [
    "cond-mat.mtrl-sci",
    "physics.app-ph"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13444",
  "pdf_url": null,
  "comment": "41 pages, 20 figues",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}