{
  "title": "General Purpose Artificial Intelligence Systems (GPAIS): Properties, Definition, Taxonomy, Societal Implications and Responsible Governance",
  "authors": [
    "Isaac Triguero",
    "Daniel Molina",
    "Javier Poyatos",
    "Javier Del Ser",
    "Francisco Herrera"
  ],
  "submission_date": "2023-07-26T16:35:48+00:00",
  "revised_dates": [
    "2024-02-06T01:53:47+00:00"
  ],
  "abstract": "Most applications of Artificial Intelligence (AI) are designed for a confined and specific task. However, there are many scenarios that call for a more general AI, capable of solving a wide array of tasks without being specifically designed for them. The term General-Purpose Artificial Intelligence Systems (GPAIS) has been defined to refer to these AI systems. To date, the possibility of an Artificial General Intelligence, powerful enough to perform any intellectual task as if it were human, or even improve it, has remained an aspiration, fiction, and considered a risk for our society. Whilst we might still be far from achieving that, GPAIS is a reality and sitting at the forefront of AI research. This work discusses existing definitions for GPAIS and proposes a new definition that allows for a gradual differentiation among types of GPAIS according to their properties and limitations. We distinguish between closed-world and open-world GPAIS, characterising their degree of autonomy and ability based on several factors such as adaptation to new tasks, competence in domains not intentionally trained for, ability to learn from few data, or proactive acknowledgment of their own limitations. We propose a taxonomy of approaches to realise GPAIS, describing research trends such as the use of AI techniques to improve another AI (AI-powered AI) or (single) foundation models. As a prime example, we delve into GenAI, aligning them with the concepts presented in the taxonomy. We explore multi-modality, which involves fusing various types of data sources to expand the capabilities of GPAIS. Through the proposed definition and taxonomy, our aim is to facilitate research collaboration across different areas that are tackling general purpose tasks, as they share many common aspects. Finally, we discuss the state of GPAIS, prospects, societal implications, and the need for regulation and governance.",
  "categories": [
    "cs.AI",
    "cs.LG"
  ],
  "primary_category": "cs.AI",
  "doi": "10.1016/j.inffus.2023.102135",
  "journal_ref": "Information Fusion, Volume 103, March 2024, 102135",
  "arxiv_id": "2307.14283",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 3270344,
  "size_after_bytes": 913116
}