{
  "title": "Population annealing with topological defect driven nonlocal updates for spin systems with quenched disorder",
  "authors": [
    "David Cirauqui",
    "Miguel Ángel García-March",
    "José Ramón Martínez Saavedra",
    "Maciej Lewenstein",
    "Przemysław R. Grzybowski"
  ],
  "submission_date": "2023-07-29T21:56:51+00:00",
  "revised_dates": [
    "2024-04-17T17:01:45+00:00"
  ],
  "abstract": "Population Annealing, one of the currently state-of-the-art algorithms for solving spin-glass systems, sometimes finds hard disorder instances for which its equilibration quality at each temperature step is severely damaged. In such cases one can therefore not be sure about having reached the true ground state without vastly increasing the computational resources. In this work we seek to overcome this problem by proposing a quantum-inspired modification of Population Annealing. Here we focus on three-dimensional random plaquette gauge model which ground state energy problem seems to be much harder to solve than standard spin-glass Edwards-Anderson model. In analogy to the Toric Code, by allowing single bond flips we let the system explore non-physical states, effectively expanding the configurational space by the introduction of topological defects that are then annealed through an additional field parameter. The dynamics of these defects allow for the effective realization of non-local cluster moves, potentially easing the equilibration process. We study the performance of this new method in three-dimensional random plaquette gauge model lattices of various sizes and compare it against Population Annealing. With that we conclude that the newly introduced non-local moves are able to improve the equilibration of the lattices, in some cases being superior to a normal Population Annealing algorithm with a sixteen times higher computational resource investment.",
  "categories": [
    "cond-mat.dis-nn"
  ],
  "primary_category": "cond-mat.dis-nn",
  "doi": "10.1103/PhysRevB.109.144202",
  "journal_ref": null,
  "arxiv_id": "2307.16087",
  "pdf_url": "https://arxiv.org/pdf/2307.16087v2",
  "comment": "Title slightly changed, improved discussion of section III.A and added a pseudocode of the algorithm to ease its understanding. Results and conclusions have not changed",
  "num_versions": null,
  "size_before_bytes": 42218068,
  "size_after_bytes": 316269
}