{
  "title": "Automatic Data Augmentation Learning using Bilevel Optimization for Histopathological Images",
  "authors": [
    "Saypraseuth Mounsaveng",
    "Issam Laradji",
    "David Vázquez",
    "Marco Perdersoli",
    "Ismail Ben Ayed"
  ],
  "submission_date": "2023-07-21T17:22:22+00:00",
  "revised_dates": [],
  "abstract": "Training a deep learning model to classify histopathological images is challenging, because of the color and shape variability of the cells and tissues, and the reduced amount of available data, which does not allow proper learning of those variations. Variations can come from the image acquisition process, for example, due to different cell staining protocols or tissue deformation. To tackle this challenge, Data Augmentation (DA) can be used during training to generate additional samples by applying transformations to existing ones, to help the model become invariant to those color and shape transformations. The problem with DA is that it is not only dataset-specific but it also requires domain knowledge, which is not always available. Without this knowledge, selecting the right transformations can only be done using heuristics or through a computationally demanding search. To address this, we propose an automatic DA learning method. In this method, the DA parameters, i.e. the transformation parameters needed to improve the model training, are considered learnable and are learned automatically using a bilevel optimization approach in a quick and efficient way using truncated backpropagation. We validated the method on six different datasets. Experimental results show that our model can learn color and affine transformations that are more helpful to train an image classifier than predefined DA transformations, which are also more expensive as they need to be selected before the training by grid search on a validation set. We also show that similarly to a model trained with RandAugment, our model has also only a few method-specific hyperparameters to tune but is performing better. This makes our model a good solution for learning the best DA parameters, especially in the context of histopathological images, where defining potentially useful transformation heuristically is not trivial.",
  "categories": [
    "cs.CV"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11808",
  "pdf_url": null,
  "comment": "arXiv admin note: text overlap with arXiv:2006.14699",
  "num_versions": null,
  "size_before_bytes": 10599439,
  "size_after_bytes": 249470
}