{
  "title": "Estimation and Inference for Multivariate Continuous-time Autoregressive Processes",
  "authors": [
    "Lorenzo Lucchese",
    "Mikko S. Pakkanen",
    "Almut E. D. Veraart"
  ],
  "submission_date": "2023-07-24T17:47:49+00:00",
  "revised_dates": [],
  "abstract": "The aim of this paper is to develop estimation and inference methods for the drift parameters of multivariate Lévy-driven continuous-time autoregressive processes of order $p\\in\\mathbb{N}$. Starting from a continuous-time observation of the process, we develop consistent and asymptotically normal maximum likelihood estimators. We then relax the unrealistic assumption of continuous-time observation by considering natural discretizations based on a combination of Riemann-sum, finite difference, and thresholding approximations. The resulting estimators are also proven to be consistent and asymptotically normal under a general set of conditions, allowing for both finite and infinite jump activity in the driving Lévy process. When discretizing the estimators, allowing for irregularly spaced observations is of great practical importance. In this respect, CAR($p$) models are not just relevant for \"true\" continuous-time processes: a CAR($p$) specification provides a natural continuous-time interpolation for modeling irregularly spaced data - even if the observed process is inherently discrete. As a practically relevant application, we consider the setting where the multivariate observation is known to possess a graphical structure. We refer to such a process as GrCAR and discuss the corresponding drift estimators and their properties. The finite sample behavior of all theoretical asymptotic results is empirically assessed by extensive simulation experiments.",
  "categories": [
    "stat.ME",
    "math.ST"
  ],
  "primary_category": "stat.ME",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13020",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 4968723,
  "size_after_bytes": 415693
}