{
  "title": "Fine structures of Intrinsically Disordered Proteins",
  "authors": [
    "Swarnadeep Seth",
    "Brandon Stine",
    "Aniket Bhattacharya"
  ],
  "submission_date": "2023-07-31T03:25:21+00:00",
  "revised_dates": [
    "2023-12-05T19:20:56+00:00"
  ],
  "abstract": "We report simulation studies of 33 single intrinsically disordered proteins (IDPs) using coarse-grained (CG) bead-spring models where interactions among different amino acids are introduced through a hydropathy matrix and additional screened Coulomb interaction for the charged amino acid beads. Our simulation studies of two different hydropathy scales (HPS1, HPS2) [Dignon et al., PLOS Comp. Biology, 14, 2018, Tesei et al. PNAS, 118, 2021] and the comparison with the existing experimental data indicates an optimal interaction parameter $ε= 0.1$ kcal/mol and $0.2$ kcal/mol for the HPS1 and HPS2 hydropathy scales. We use these best-fit parameters to investigate both the universal aspects as well as the fine structures of the individual IDPs by introducing additional characteristics.(i) First, we investigate the polymer specific scaling relations of the IDPs in comparison to the universal scaling relations [Bair et al., J. Chem. Phys. 158, 204902 (2023)] for the homopolymers and we demonstrate that IDPs are broadly characterized with a Flory exponent of 0.56 with the conclusion that conformations of the IDPs interpolate between Gaussian and 3DSAW chains. (ii) Then we introduce Wilson charge index W that captures the essential features of charge interactions and distribution in the sequence space, and (iii) a skewness parameter S that captures the finer shape variation of the gyration radii distribution related to the charge asymmetry. Finally, our study of the variation of <$R_g$> as a function of salt concentration provides another important metric to bring out finer characteristics of the IDPs which may carry relevant information for the origin of life.",
  "categories": [
    "cond-mat.soft",
    "physics.bio-ph"
  ],
  "primary_category": "cond-mat.soft",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16383",
  "pdf_url": "https://arxiv.org/pdf/2307.16383v2",
  "comment": "12.3 pages, 10 Figures",
  "num_versions": null,
  "size_before_bytes": 12135815,
  "size_after_bytes": 126010
}