{
  "title": "Categorification and Dynamics in Generalised Braid Groups",
  "authors": [
    "Edmund Heng"
  ],
  "submission_date": "2023-07-25T09:57:15+00:00",
  "revised_dates": [],
  "abstract": "Recent developments in the theory of stability conditions and its relation to Teichmuller theory have revealed a deep connection between triangulated categories and surfaces. Motivated by this, we prove a categorical analogue of the Nielsen-Thurston classification theorem for the rank two generalised braid groups by viewing them as (sub)groups of autoequivalences of certain triangulated categories. This can be seen as a categorical generalisation of the classification known for the type $A$ braid groups when viewed as mapping class groups of the punctured discs.\n  Firstly, we realise the generalised braid groups as groups of autoequivalences through categorical actions that categorify the corresponding Burau representations. These categorifications are achieved by constructing certain algebra objects in the tensor categories associated to the quantum group $U_q(\\mathfrak{sl}_2)$, generalising the construction of zigzag algebras used in the categorical actions of simply-laced-type braid groups to include the non-simply-laced-types.\n  By viewing the elements of the generalised braid groups as autoequivalences of triangulated categories, we study their dynamics through mass growth (categorical entropy), as introduced by Dimitrov--Haiden--Katzarkov--Kontsevich. Our classification is then achieved in a similar fashion to Bestvina-Handel's approach to the Nielsen-Thurston classification for mapping class groups. Namely, our classification can be effectively decided through a given algorithm that also computes the mass growth of the group elements. Moreover, it shows that the mass growth of the pseudo-Anosov elements are computable from certain rank two matrices.\n  This is the author's PhD thesis.",
  "categories": [
    "math.RT",
    "math.CT",
    "math.DS",
    "math.QA"
  ],
  "primary_category": "math.RT",
  "doi": "10.25911/FD1C-FA86",
  "journal_ref": null,
  "arxiv_id": "2307.13379",
  "pdf_url": null,
  "comment": "This is a revised version of the author's thesis in 10.25911/FD1C-FA86. The major fix (other than typos) is the proof of Proposition 3.3.4. The content of this thesis will be split into (at least) two papers in the future. Comments welcomed!",
  "num_versions": null,
  "size_before_bytes": 1726428,
  "size_after_bytes": 558544
}