{
  "title": "Tackling Sampling Noise in Physical Systems for Machine Learning Applications: Fundamental Limits and Eigentasks",
  "authors": [
    "Fangjun Hu",
    "Gerasimos Angelatos",
    "Saeed A. Khan",
    "Marti Vives",
    "Esin Türeci",
    "Leon Bello",
    "Graham E. Rowlands",
    "Guilhem J. Ribeill",
    "Hakan E. Türeci"
  ],
  "submission_date": "2023-07-29T21:39:29+00:00",
  "revised_dates": [
    "2023-10-30T15:55:43+00:00"
  ],
  "abstract": "The expressive capacity of physical systems employed for learning is limited by the unavoidable presence of noise in their extracted outputs. Though present in physical systems across both the classical and quantum regimes, the precise impact of noise on learning remains poorly understood. Focusing on supervised learning, we present a mathematical framework for evaluating the resolvable expressive capacity (REC) of general physical systems under finite sampling noise, and provide a methodology for extracting its extrema, the eigentasks. Eigentasks are a native set of functions that a given physical system can approximate with minimal error. We show that the REC of a quantum system is limited by the fundamental theory of quantum measurement, and obtain a tight upper bound for the REC of any finitely-sampled physical system. We then provide empirical evidence that extracting low-noise eigentasks can lead to improved performance for machine learning tasks such as classification, displaying robustness to overfitting. We present analyses suggesting that correlations in the measured quantum system enhance learning capacity by reducing noise in eigentasks. The applicability of these results in practice is demonstrated with experiments on superconducting quantum processors. Our findings have broad implications for quantum machine learning and sensing applications.",
  "categories": [
    "quant-ph"
  ],
  "primary_category": "quant-ph",
  "doi": "10.1103/PhysRevX.13.041020",
  "journal_ref": "Phys. Rev. X 13, 041020 (2023)",
  "arxiv_id": "2307.16083",
  "pdf_url": "https://arxiv.org/pdf/2307.16083v2",
  "comment": "37 pages, 10 figures, 1 table. Significantly expanded version of arXiv:2301.00042 [quant-ph], covering physical systems operating in the classical and quantum regimes",
  "num_versions": null,
  "size_before_bytes": 15920473,
  "size_after_bytes": 937100
}