{
  "title": "Somatic mutations in human ageing: New insights from DNA sequencing and inherited mutations",
  "authors": [
    "Kasit Chatsirisupachai",
    "João Pedro de Magalhães"
  ],
  "submission_date": "2023-07-28T10:43:36+00:00",
  "revised_dates": [],
  "abstract": "The accumulation of somatic mutations is a driver of cancer and has long been associated with ageing. Due to limitations in quantifying mutation burden with age in non-cancerous tissues, the impact of somatic mutations in other ageing phenotypes is unclear. Recent advances in DNA sequencing technologies have allowed the large-scale quantification of somatic mutations in ageing. These studies have revealed a gradual accumulation of mutations in most normal tissues with age as well as a substantial clonal expansion driven mostly by cancer-related mutations. Nevertheless, because of the relatively modest burden of age-related somatic mutations identified so far and their stochastic nature, it is difficult to envision how somatic mutation accumulation alone can explain most ageing phenotypes that develop gradually. Studies across species have also found that longer-lived species have lower somatic mutation rates, though these could be explained by selective pressures to reduce or postpone cancer as longevity increases. Overall, with a few exceptions like cancer, results from recent DNA sequencing studies do not add weight to the idea that somatic mutations with age drive ageing phenotypes and the phenotypic role, if any, of somatic mutations in ageing remains unclear. Recent studies in patients with somatic mutation burden and no signs of accelerated ageing further question the role of somatic mutations in ageing.",
  "categories": [
    "q-bio.GN"
  ],
  "primary_category": "q-bio.GN",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15471",
  "pdf_url": "https://arxiv.org/pdf/2307.15471v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 178582,
  "size_after_bytes": 107448
}