{
  "title": "Verifiable measurement-based quantum random sampling with trapped ions",
  "authors": [
    "Martin Ringbauer",
    "Marcel Hinsche",
    "Thomas Feldker",
    "Paul K. Faehrmann",
    "Juani Bermejo-Vega",
    "Claire Edmunds",
    "Lukas Postler",
    "Roman Stricker",
    "Christian D. Marciniak",
    "Michael Meth",
    "Ivan Pogorelov",
    "Rainer Blatt",
    "Philipp Schindler",
    "Jens Eisert",
    "Thomas Monz",
    "Dominik Hangleiter"
  ],
  "submission_date": "2023-07-26T18:00:03+00:00",
  "revised_dates": [
    "2025-01-09T01:43:13+00:00"
  ],
  "abstract": "Quantum computers are now on the brink of outperforming their classical counterparts. One way to demonstrate the advantage of quantum computation is through quantum random sampling performed on quantum computing devices. However, existing tools for verifying that a quantum device indeed performed the classically intractable sampling task are either impractical or not scalable to the quantum advantage regime. The verification problem thus remains an outstanding challenge. Here, we experimentally demonstrate efficiently verifiable quantum random sampling in the measurement-based model of quantum computation on a trapped-ion quantum processor. We create and sample from random cluster states, which are at the heart of measurement-based computing, up to a size of 4 x 4 qubits. By exploiting the structure of these states, we are able to recycle qubits during the computation to sample from entangled cluster states that are larger than the qubit register. We then efficiently estimate the fidelity to verify the prepared states -- in single instances and on average -- and compare our results to cross-entropy benchmarking. Finally, we study the effect of experimental noise on the certificates. Our results and techniques provide a feasible path toward a verified demonstration of a quantum advantage.",
  "categories": [
    "quant-ph",
    "cs.CC"
  ],
  "primary_category": "quant-ph",
  "doi": "10.1038/s41467-024-55342-3",
  "journal_ref": "Nature Comm. 16, 106 (2025)",
  "arxiv_id": "2307.14424",
  "pdf_url": null,
  "comment": "11+16 pages. Comments welcome. v2: improved presentation",
  "num_versions": null,
  "size_before_bytes": 15311059,
  "size_after_bytes": 439008
}