{
  "title": "Non-resonant ultra-fast multipactor regime in dielectric-assist accelerating structures",
  "authors": [
    "Daniel González-Iglesias",
    "Benito Gimeno",
    "Daniel Esperante",
    "Pablo Martinez-Reviriego",
    "Pablo Martín-Luna",
    "Nuria Fuster-Martínez",
    "César Blanch",
    "Eduardo Martínez",
    "Abraham Menendez",
    "Juan Fuster",
    "Alexej Grudiev"
  ],
  "submission_date": "2023-07-26T08:16:52+00:00",
  "revised_dates": [],
  "abstract": "The objective of this work is the evaluation of the risk of suffering a multipactor discharge in an S-band dielectric-assist accelerating (DAA) structure for a compact low-energy linear particle accelerator dedicated to hadrontherapy treatments. A DAA structure consists of ultra-low loss dielectric ciylinders and disks with irises which are periodically arranged in a metallic enclosure, with the advantage of having an extremely high quality factor and very high shunt impedance at room temperature, and it is therefore proposed as a potential alternative to conventional disk-loaded copper structures. However, it has been observed that these structures suffer from multipactor discharges. In fact, multipactor is one of the main problems of these devices, as it limits the maximum accelerating gradient. Because of this, the analysis of multipactor risk in the early design steps of DAA cavities is crucial to ensure the correct performance of the device after fabrication. In this paper, we present a comprehensive and detailed study of multipactor in our DAA design through numerical simulations performed with an in-house developed code based on the Monte-Carlo method. The phenomenology of the multipactor (resonant electron trajectories, electron flight time between impacts, etc.) is described in detail for different values of the accelerating gradient. It has been found that in these structures an ultra-fast non-resonant multipactor appears, which is different from the types of multipactor theoretically studied in the scientific literature. In addition, the effect of several low electron emission coatings on the multipactor threshold is investigated. Furthermore, a novel design based on the modification of the DAA cell geometry for multipactor mitigation is introduced, which shows a significant increase in the accelerating gradient handling capabilities of our prototype.",
  "categories": [
    "physics.acc-ph",
    "physics.plasm-ph"
  ],
  "primary_category": "physics.acc-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14026",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 2390292,
  "size_after_bytes": 95718
}