{
  "title": "Nonlinear optical diode effect in a magnetic Weyl semimetal",
  "authors": [
    "Christian Tzschaschel",
    "Jian-Xiang Qiu",
    "Xue-Jian Gao",
    "Hou-Chen Li",
    "Chunyu Guo",
    "Hung-Yu Yang",
    "Cheng-Ping Zhang",
    "Ying-Ming Xie",
    "Yu-Fei Liu",
    "Anyuan Gao",
    "Damien Bérubé",
    "Thao Dinh",
    "Sheng-Chin Ho",
    "Yuqiang Fang",
    "Fuqiang Huang",
    "Johanna Nordlander",
    "Qiong Ma",
    "Fazel Tafti",
    "Philip J. W. Moll",
    "Kam Tuen Law",
    "Su-Yang Xu"
  ],
  "submission_date": "2023-07-28T15:04:08+00:00",
  "revised_dates": [
    "2024-04-08T17:52:31+00:00"
  ],
  "abstract": "Diode effects are of great interest for both fundamental physics and modern technologies. Electrical diode effects (nonreciprocal transport) have been observed in Weyl systems. Optical diode effects arising from the Weyl fermions have been theoretically considered but not probed experimentally. Here, we report the observation of a nonlinear optical diode effect (NODE) in the magnetic Weyl semimetal CeAlSi, where the magnetization introduces a pronounced directionality in the nonlinear optical second-harmonic generation (SHG). We show demonstrate a six-fold change of the measured SHG intensity between opposite propagation directions over a bandwidth exceeding 250 meV. Supported by density-functional theory, we establish the linearly dispersive bands emerging from Weyl nodes as the origin of this broadband effect. We further demonstrate current-induced magnetization switching and thus electrical control of the NODE. Our results advance ongoing research to identify novel nonlinear optical/transport phenomena in magnetic topological materials and further opens new pathways for the unidirectional manipulation of light.",
  "categories": [
    "cond-mat.mes-hall",
    "cond-mat.mtrl-sci",
    "physics.optics"
  ],
  "primary_category": "cond-mat.mes-hall",
  "doi": "10.1038/s41467-024-47291-8",
  "journal_ref": "Nat. Commun 15, 3017 (2024)",
  "arxiv_id": "2307.15603",
  "pdf_url": "https://arxiv.org/pdf/2307.15603v2",
  "comment": "20 pages, 4 figures, SI included",
  "num_versions": null,
  "size_before_bytes": 47845527,
  "size_after_bytes": 1541176
}