{
  "title": "Evaluation and Measurement of Software Process Improvement -- A Systematic Literature Review",
  "authors": [
    "Michael Unterkalmsteiner",
    "Tony Gorschek",
    "A. K. M. Moinul Islam",
    "Chow Kian Cheng",
    "Rahadian Bayu Permadi",
    "Robert Feldt"
  ],
  "submission_date": "2023-07-24T21:51:15+00:00",
  "revised_dates": [],
  "abstract": "BACKGROUND: Software Process Improvement (SPI) is a systematic approach to increase the efficiency and effectiveness of a software development organization and to enhance software products. OBJECTIVE: This paper aims to identify and characterize evaluation strategies and measurements used to assess the impact of different SPI initiatives. METHOD: The systematic literature review includes 148 papers published between 1991 and 2008. The selected papers were classified according to SPI initiative, applied evaluation strategies, and measurement perspectives. Potential confounding factors interfering with the evaluation of the improvement effort were assessed. RESULTS: Seven distinct evaluation strategies were identified, wherein the most common one, \"Pre-Post Comparison\" was applied in 49 percent of the inspected papers. Quality was the most measured attribute (62 percent), followed by Cost (41 percent), and Schedule (18 percent). Looking at measurement perspectives, \"Project\" represents the majority with 66 percent. CONCLUSION: The evaluation validity of SPI initiatives is challenged by the scarce consideration of potential confounding factors, particularly given that \"Pre-Post Comparison\" was identified as the most common evaluation strategy, and the inaccurate descriptions of the evaluation context. Measurements to assess the short and mid-term impact of SPI initiatives prevail, whereas long-term measurements in terms of customer satisfaction and return on investment tend to be less used.",
  "categories": [
    "cs.SE"
  ],
  "primary_category": "cs.SE",
  "doi": "10.1109/TSE.2011.26",
  "journal_ref": "IEEE Trans. Software Eng. 38(2): 398-424 (2012)",
  "arxiv_id": "2307.13143",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 2534427,
  "size_after_bytes": 216078
}