{
  "title": "Learning a Common Dictionary for CSI Feedback in FDD Massive MU-MIMO-OFDM Systems",
  "authors": [
    "Pavan Kumar Gadamsetty",
    "K. V. S. Hari",
    "Lajos Hanzo"
  ],
  "submission_date": "2023-07-29T09:33:27+00:00",
  "revised_dates": [],
  "abstract": "In a transmit preprocessing aided frequency division duplex (FDD) massive multi-user (MU) multiple-input multiple-output (MIMO) scheme assisted orthogonal frequency-division multiplexing (OFDM) system, it is required to feed back the frequency domain channel transfer function (FDCHTF) of each subcarrier at the user equipment (UE) to the base station (BS). The amount of channel state information (CSI) to be fed back to the BS increases linearly with the number of antennas and subcarriers, which may become excessive. Hence we propose a novel CSI feedback compression algorithm based on compressive sensing (CS) by designing a common dictionary (CD) to reduce the CSI feedback of existing algorithms. Most of the prior work on CSI feedback compression considered single-UE systems. Explicitly, we propose a common dictionary learning (CDL) framework for practical frequency-selective channels and design a CD suitable for both single-UE and multi-UE systems. A set of two methods is proposed. Specifically, the first one is the CDL-K singular value decomposition (KSVD) method, which uses the K-SVD algorithm. The second one is the CDL-orthogonal Procrustes (OP) method, which relies on solving the orthogonal Procrustes problem. The CD conceived for exploiting the spatial correlation of channels across all the subcarriers and UEs compresses the CSI at each UE, and {upon reception} reconstructs it at the BS. Our simulation results show that the proposed dictionary's estimated channel vectors have lower normalized mean-squared error (NMSE) than the traditional fixed Discrete Fourier Transform (DFT) based dictionary. The CSI feedback is reduced by 50%, and the memory reduction at both the UE and BS starts from 50% and increases with the number of subcarriers.",
  "categories": [
    "eess.SP"
  ],
  "primary_category": "eess.SP",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15943",
  "pdf_url": "https://arxiv.org/pdf/2307.15943v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 2202318,
  "size_after_bytes": 1219864
}