{
  "title": "Graph Condensation for Inductive Node Representation Learning",
  "authors": [
    "Xinyi Gao",
    "Tong Chen",
    "Yilong Zang",
    "Wentao Zhang",
    "Quoc Viet Hung Nguyen",
    "Kai Zheng",
    "Hongzhi Yin"
  ],
  "submission_date": "2023-07-29T12:11:14+00:00",
  "revised_dates": [
    "2023-12-09T05:46:16+00:00"
  ],
  "abstract": "Graph neural networks (GNNs) encounter significant computational challenges when handling large-scale graphs, which severely restricts their efficacy across diverse applications. To address this limitation, graph condensation has emerged as a promising technique, which constructs a small synthetic graph for efficiently training GNNs while retaining performance. However, due to the topology structure among nodes, graph condensation is limited to condensing only the observed training nodes and their corresponding structure, thus lacking the ability to effectively handle the unseen data. Consequently, the original large graph is still required in the inference stage to perform message passing to inductive nodes, resulting in substantial computational demands. To overcome this issue, we propose mapping-aware graph condensation (MCond), explicitly learning the one-to-many node mapping from original nodes to synthetic nodes to seamlessly integrate new nodes into the synthetic graph for inductive representation learning. This enables direct information propagation on the synthetic graph, which is much more efficient than on the original large graph. Specifically, MCond employs an alternating optimization scheme with innovative loss terms from transductive and inductive perspectives, facilitating the mutual promotion between graph condensation and node mapping learning. Extensive experiments demonstrate the efficacy of our approach in inductive inference. On the Reddit dataset, MCond achieves up to 121.5x inference speedup and 55.9x reduction in storage requirements compared with counterparts based on the original graph.",
  "categories": [
    "cs.LG",
    "cs.AI"
  ],
  "primary_category": "cs.LG",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15967",
  "pdf_url": "https://arxiv.org/pdf/2307.15967v2",
  "comment": "2024 IEEE 40th International Conference on Data Engineering (ICDE)",
  "num_versions": null,
  "size_before_bytes": 2206487,
  "size_after_bytes": 976123
}