{
  "title": "Characteristics, Implementation and Applications of Special Perfect Entangler Circuits",
  "authors": [
    "M. Karthick Selvan",
    "S. Balakrishnan"
  ],
  "submission_date": "2023-07-24T08:19:39+00:00",
  "revised_dates": [
    "2023-10-03T00:15:53+00:00",
    "2024-01-29T01:07:42+00:00",
    "2024-11-19T02:18:15+00:00"
  ],
  "abstract": "We discuss the characteristics of special perfect entanglers and construct single parameter two-qubit circuits which are locally equivalent to special perfect entanglers. We present the results obtained from the implementation of one of the circuits using cross-resonance interaction and discuss their applications. First, we show that the ability of two-qubit gates to create entangled states can be described using the chords present in the argand diagram of squared eigenvalues of nonlocal part of two-qubit gates. We show that the entangling power of a two-qubit gate is proportional to the mean squared length of the chords. We deduce the entangling characteristics of special perfect entanglers from the argand diagram associated with them. We implement a special perfect entangler circuit using echoed cross-resonance gate and pulse-level programming for nine different circuit parameters. For a particular input state, we perform quantum state tomography and calculate state fidelity and concurrence of the obtained output density matrices. We also measure the average gate fidelity for B gate circuit. We construct two universal two-qubit quantum circuits using the special perfect entangler circuits. These universal circuits can be used to generate all two-qubit gates. We show that (n-1) B gate circuits can be used to generate n-qubit GHZ and perfect W states. We generate three-qubit perfect W state. Perfect W state generated using pulse-level programming shows better fidelity than the state generated using echoed cross-resonance gate.",
  "categories": [
    "quant-ph"
  ],
  "primary_category": "quant-ph",
  "doi": "10.1140/epjd/s10053-024-00925-4",
  "journal_ref": null,
  "arxiv_id": "2307.12599",
  "pdf_url": null,
  "comment": "11 pages, comments are welcome",
  "num_versions": null,
  "size_before_bytes": 5789523,
  "size_after_bytes": 793452
}