{
  "title": "Self-Supervised Learning for Improved Synthetic Aperture Sonar Target Recognition",
  "authors": [
    "BW Sheffield"
  ],
  "submission_date": "2023-07-27T14:17:24+00:00",
  "revised_dates": [],
  "abstract": "This study explores the application of self-supervised learning (SSL) for improved target recognition in synthetic aperture sonar (SAS) imagery. The unique challenges of underwater environments make traditional computer vision techniques, which rely heavily on optical camera imagery, less effective. SAS, with its ability to generate high-resolution imagery, emerges as a preferred choice for underwater imaging. However, the voluminous high-resolution SAS data presents a significant challenge for labeling; a crucial step for training deep neural networks (DNNs).\n  SSL, which enables models to learn features in data without the need for labels, is proposed as a potential solution to the data labeling challenge in SAS. The study evaluates the performance of two prominent SSL algorithms, MoCov2 and BYOL, against the well-regarded supervised learning model, ResNet18, for binary image classification tasks. The findings suggest that while both SSL models can outperform a fully supervised model with access to a small number of labels in a few-shot scenario, they do not exceed it when all the labels are used.\n  The results underscore the potential of SSL as a viable alternative to traditional supervised learning, capable of maintaining task performance while reducing the time and costs associated with data labeling. The study also contributes to the growing body of evidence supporting the use of SSL in remote sensing and could stimulate further research in this area.",
  "categories": [
    "cs.CV",
    "cs.LG",
    "eess.IV"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15098",
  "pdf_url": "https://arxiv.org/pdf/2307.15098v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1007884,
  "size_after_bytes": 58226
}