{
  "title": "Rotational and radio emission properties of PSR J0738-4042 over half a century",
  "authors": [
    "M. E. Lower",
    "S. Johnston",
    "A. Karastergiou",
    "P. R. Brook",
    "M. Bailes",
    "S. Buchner",
    "A. T. Deller",
    "L. Dunn",
    "C. Flynn",
    "M. Kerr",
    "R. N. Manchester",
    "A. Mandlik",
    "L. S. Oswald",
    "A. Parthasarathy",
    "R. M. Shannon",
    "C. Sobey",
    "P. Weltevrede"
  ],
  "submission_date": "2023-07-22T01:04:01+00:00",
  "revised_dates": [
    "2023-08-02T13:39:24+00:00"
  ],
  "abstract": "We present a comprehensive study of the rotational and emission properties of PSR J0738$-$4042 using a combination of observations taken by the Deep Space Network, Hartebeesthoek, Parkes (Murriyang) and Molonglo observatories between 1972 and 2023. Our timing of the pulsar is motivated by previously reported profile/spin-down events that occurred in September 2005 and December 2015, which result in an anomalously large braking index of $n = 23300 \\pm 1800$. Using a Gaussian process regression framework, we develop continuous models for the evolution of the pulsar spin-down rate ($\\dotν$) and profile shape. We find that the pulse profile variations are similar regardless of radio observing frequency and polarisation. Small-scale differences can be ascribed to changes in the interstellar medium along the line of sight and frequency-dependent changes in magnetospheric radio emission height. No new correlated spin-down or profile events were identified in our extended dataset. However, we found that the disappearance of a bright emission component in the leading edge of archival profiles between 1981-1988 was not associated with a substantial change in $\\dotν$. This marks a notable departure from the previous profile/spin-down events in this pulsar. We discuss the challenges these observations pose for physical models and conclude that interactions between the pulsar and in-falling asteroids or a form of magnetospheric state-switching with a long periodicity are plausible explanations.",
  "categories": [
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.HE",
  "doi": "10.1093/mnras/stad2243",
  "journal_ref": null,
  "arxiv_id": "2307.11953",
  "pdf_url": null,
  "comment": "14 pages, 8 figures. Fixed typo on page 5. Accepted for publication in MNRAS",
  "num_versions": null,
  "size_before_bytes": 4142355,
  "size_after_bytes": 461419
}