{
  "title": "Synthetic white balancing for intra-operative hyperspectral imaging",
  "authors": [
    "Anisha Bahl",
    "Conor C. Horgan",
    "Mirek Janatka",
    "Oscar J. MacCormac",
    "Philip Noonan",
    "Yijing Xie",
    "Jianrong Qiu",
    "Nicola Cavalcanti",
    "Philipp Fürnstahl",
    "Michael Ebner",
    "Mads S. Bergholt",
    "Jonathan Shapey",
    "Tom Vercauteren"
  ],
  "submission_date": "2023-07-24T13:42:10+00:00",
  "revised_dates": [],
  "abstract": "Hyperspectral imaging shows promise for surgical applications to non-invasively provide spatially-resolved, spectral information. For calibration purposes, a white reference image of a highly-reflective Lambertian surface should be obtained under the same imaging conditions. Standard white references are not sterilizable, and so are unsuitable for surgical environments. We demonstrate the necessity for in situ white references and address this by proposing a novel, sterile, synthetic reference construction algorithm. The use of references obtained at different distances and lighting conditions to the subject were examined. Spectral and color reconstructions were compared with standard measurements qualitatively and quantitatively, using $ΔE$ and normalised RMSE respectively. The algorithm forms a composite image from a video of a standard sterile ruler, whose imperfect reflectivity is compensated for. The reference is modelled as the product of independent spatial and spectral components, and a scalar factor accounting for gain, exposure, and light intensity. Evaluation of synthetic references against ideal but non-sterile references is performed using the same metrics alongside pixel-by-pixel errors. Finally, intraoperative integration is assessed though cadaveric experiments. Improper white balancing leads to increases in all quantitative and qualitative errors. Synthetic references achieve median pixel-by-pixel errors lower than 6.5% and produce similar reconstructions and errors to an ideal reference. The algorithm integrated well into surgical workflow, achieving median pixel-by-pixel errors of 4.77%, while maintaining good spectral and color reconstruction.",
  "categories": [
    "eess.IV"
  ],
  "primary_category": "eess.IV",
  "doi": "10.1117/1.JMI.10.4.046001",
  "journal_ref": null,
  "arxiv_id": "2307.12791",
  "pdf_url": null,
  "comment": "22 pages, 10 figures",
  "num_versions": null,
  "size_before_bytes": 9678764,
  "size_after_bytes": 151538
}