{
  "title": "Interfacial cooling and heating, temperature discontinuity and inversion in evaporation and condensation",
  "authors": [
    "Gang Chen"
  ],
  "submission_date": "2023-07-29T18:15:20+00:00",
  "revised_dates": [],
  "abstract": "Although ubiquitous in nature and industrial processes, transport processes at the interface during evaporation and condensation are still poorly understood. Experiments have shown temperature discontinuities at the interface during evaporation and condensation but the experimentally reported interface temperature jump varies by two orders of magnitude. Even the direction of such temperature jump is still being debated. Using kinetic-theory based expressions for the interfacial mass flux and heat flux, we solve coupled problem between the liquid and the vapor phase during evaporation and condensation. Our model shows that when evaporation or condensation happens, an intrinsic temperature difference develops across the interface, due to the mismatch of the enthalpy carried by vapor at the interface and the bulk region. The vapor temperature near the interface cools below the saturation temperature on the liquid surface during evaporation and heats up above the latter during condensation. However, many existing experiments have shown an opposite trend to this prediction. We explain this difference as arising from the reverse heat conduction in the vapor phase. Our model results compare favorably with experiments on both evaporation and condensation. We show that when the liquid layer is very thin, most of the applied temperature difference between the solid wall and the vapor phase happens at the liquid-vapor interface, leading to saturation of the evaporation and the condensation rates and the corresponding heat transfer rate. This result contradicts current belief that the evaporation and condensation rates are inversely proportional to the liquid film thickness.",
  "categories": [
    "cond-mat.soft",
    "physics.flu-dyn"
  ],
  "primary_category": "cond-mat.soft",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16043",
  "pdf_url": "https://arxiv.org/pdf/2307.16043v1",
  "comment": "26 pages, 8 figures",
  "num_versions": null,
  "size_before_bytes": 762025,
  "size_after_bytes": 461156
}