{
  "title": "A detailed first-order post-Newtonian analysis of massive Brans-Dicke theories: numerical constraints and the $β$ parameter meaning",
  "authors": [
    "Matheus F. S. Alves",
    "Júnior D. Toniato",
    "Davi C. Rodrigues"
  ],
  "submission_date": "2023-07-21T19:55:04+00:00",
  "revised_dates": [
    "2024-02-26T01:16:38+00:00"
  ],
  "abstract": "Massive Brans-Dicke (BD) theory is among the simplest general relativity extensions. It is commonly found as the weak-field limit of other gravitational theories. Here we do a detailed post-Newtonian analysis of massive BD theories. We start by expanding the massive BD field equations following the Will-Nodtvedt Parameterized-Post-Newtonian (PPN) formalism, without point-particle approximations. A single potential that is not present in the standard PPN formalism is found. This new potential hinders immediate PPN conclusions. To proceed, we do a complete first-order post-Newtonian analysis and explicitly derive all the conserved quantities. After demanding that there exists a Newtonian limit by requiring the BD mass to be sufficiently large, we find, as expected, that $γ= 1$; but there is no effective $β$ parameter that can have the same physical role of the standard $β$ in PPN formalism. All the others standard PPN parameters can be extended to the massive BD case without issues and are shown to have the same values of general relativity. At last, we consider numerical relations on the periastron advance and the BD mass in two different physical contexts, the orbit of Mercury about the Sun and the orbit of the star S2 about the expected supermassive black hole in the Milky Way.",
  "categories": [
    "gr-qc"
  ],
  "primary_category": "gr-qc",
  "doi": "10.1103/PhysRevD.109.044045",
  "journal_ref": "Phys. Rev. D 109, 044045 (2024)",
  "arxiv_id": "2307.11883",
  "pdf_url": null,
  "comment": "v2: 12 pages, 5 figures. Accepted in PRD",
  "num_versions": null,
  "size_before_bytes": 534866,
  "size_after_bytes": 188922
}