{
  "title": "The minimum measurable eccentricity from gravitational waves of LISA massive black hole binaries",
  "authors": [
    "Mudit Garg",
    "Shubhanshu Tiwari",
    "Andrea Derdzinski",
    "John G. Baker",
    "Sylvain Marsat",
    "Lucio Mayer"
  ],
  "submission_date": "2023-07-25T09:39:41+00:00",
  "revised_dates": [
    "2023-11-10T01:26:31+00:00",
    "2025-01-16T01:24:38+00:00"
  ],
  "abstract": "We explore the eccentricity measurement threshold of LISA for gravitational waves radiated by massive black hole binaries (MBHBs) with redshifted BH masses $M_z$ in the range $10^{4.5}$-$10^{7.5}~{\\rm M}_\\odot$ at redshift $z=1$. The eccentricity can be an important tracer of the environment where MBHBs evolve to reach the merger phase. To consider LISA's motion and apply the time delay interferometry, we employ the lisabeta software and produce year-long eccentric waveforms using the inspiral-only post-Newtonian model TaylorF2Ecc. We study the minimum measurable eccentricity ($e_{\\rm min}$, defined one year before the merger) analytically by computing matches and Fisher matrices, and numerically via Bayesian inference by varying both intrinsic and extrinsic parameters. We find that $e_{\\rm min}$ strongly depends on $M_z$ and weakly on mass ratio and extrinsic parameters. Match-based signal-to-noise ratio criterion suggest that LISA will be able to detect $e_{\\rm min}\\sim10^{-2.5}$ for lighter systems ($M_z\\lesssim10^{5.5}~{\\rm M}_\\odot$) and $\\sim10^{-1.5}$ for heavier MBHBs with a $90$ per cent confidence. Bayesian inference with Fisher initialization and a zero noise realization pushes this limit to $e_{\\rm min}\\sim10^{-2.75}$ for lower-mass binaries, assuming a $<50$ per cent relative error. Bayesian inference can recover injected eccentricities of $0.1$ and $10^{-2.75}$ for a $10^5~{\\rm M}_\\odot$ system with a $\\sim10^{-2}$ per cent and a $\\sim10$ per cent relative errors, respectively. Stringent Bayesian odds criterion ($\\ln{B}>8$) provides nearly the same inference. Both analytical and numerical methodologies provide almost consistent results for our systems of interest. LISA will launch in a decade, making this study valuable and timely for unlocking the mysteries of the MBHB evolution.",
  "categories": [
    "astro-ph.GA",
    "astro-ph.CO",
    "astro-ph.HE",
    "gr-qc"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.1093/mnras/stad3477",
  "journal_ref": null,
  "arxiv_id": "2307.13367",
  "pdf_url": null,
  "comment": "12 pages, 15 figures. Published by MNRAS",
  "num_versions": null,
  "size_before_bytes": 20819696,
  "size_after_bytes": 828487
}