{
  "title": "Radiatively-driven clumpy X-ray absorbers in the NLS1 galaxy IRAS 13224-3809",
  "authors": [
    "Takuya Midooka",
    "Misaki Mizumoto",
    "Ken Ebisawa"
  ],
  "submission_date": "2023-07-22T09:01:02+00:00",
  "revised_dates": [],
  "abstract": "Recent radiation-magnetohydrodynamic simulations of active galactic nuclei predict the presence of the disk winds, which may get unstable and turn into fragmented clumps far from the central black hole. These inner winds and the outer clumps may be observed as the ultrafast outflows (UFOs) and the partial absorbers, respectively. However, it is challenging to observationally constrain their origins because of the complicated spectral features and variations. To resolve such degeneracies of the clumpy absorbers and other components, we developed a novel ``spectral-ratio model fitting'' technique that estimates the variable absorbing parameters from the ratios of the partially absorbed spectra to the non-absorbed one, canceling the complex non-variable spectral features. We applied this method to the narrow-line Seyfert 1 galaxy \\iras observed by \\xmm in 2016 for $\\sim$1.5 Ms. As a result, we found that the soft spectral variation is mostly caused by changes in the partial covering fraction of the mildly-ionized clumpy absorbers, whose outflow velocities are similar to those of the UFO ($\\sim$0.2--0.3 $c$). Furthermore, the velocities of the clumpy absorbers and UFOs increase similarly with the X-ray fluxes, consistent with the change in the UV-dominant continuum flux. We also discovered a striking correlation between the clump covering fraction and the equivalent width of the UFO absorption lines, which indicates that increasing the outflow in the line-of-sight lead to more prominent UFOs and more partial absorption. These findings strongly suggest that the clumpy absorbers and the UFO share the same origin, driven by the same UV-dominant continuum radiation.",
  "categories": [
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.HE",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12023",
  "pdf_url": null,
  "comment": "18 pages, 13 figures, accepted for publication in ApJ",
  "num_versions": null,
  "size_before_bytes": 17989251,
  "size_after_bytes": 1240970
}