{
  "title": "Mask mandates and COVID-19: A Re-analysis of the Boston school mask study",
  "authors": [
    "Tracy Beth Hoeg",
    "Ambarish Chandra",
    "Ram Duriseti",
    "Shamez Ladhani",
    "Vinay Prasad"
  ],
  "submission_date": "2023-07-22T03:53:14+00:00",
  "revised_dates": [],
  "abstract": "Background: A recent epidemiological analysis of staggered policy implementation reported a 29.4% reduction in COVID-19 cases by maintaining school mask mandates in the greater Boston area during the first half of 2022. The robustness of their results and the appropriateness of methodology are explored. Methods: Using data from the Massachusetts Department of Elementary and Secondary Education and the Centers for Disease Control and Prevention, we re-analyze differences in COVID-19 incidence in school districts that did and did not lift mask mandates using the same districts as the original study and expanded the analysis to the entire state of Massachusetts. We present changes in case rates and differences in prior immunity in areas with different mask lifting policies. Results: The Boston and Chelsea districts, which maintained mask mandates, were outliers in terms of size, demographics, and testing. We failed to find a notable change in student cases in mask mandate districts compared with the 70 districts in the original study (-0.08/1000; p=0.98) and found a slight increase compared with a statewide control group +3.63/1000 (p=0.291). Results were similar for students and staff combined. Districts that dropped mask mandates first experienced the largest decreases in cases (22% drop vs 12% in the masked districts). There was a moderate to strong relationship (R2 = 0.35-0.66; p-values <0.001) between prior community infection burden and district case rates in Spring 2022, with prior immunity alone explaining as much as two-thirds of the variation in case rates in Spring of 2022. Conclusions: We fail to find any consistent notable negative relationship between school mask mandates and infection rates in the Greater Boston Area or state of Massachusetts during the 2021-2022 academic year.",
  "categories": [
    "physics.soc-ph",
    "q-bio.PE"
  ],
  "primary_category": "physics.soc-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11974",
  "pdf_url": null,
  "comment": "37 pages including supplement. 3 figures and 2 tables in main text. 4 figures in the supplementary material",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}