{
  "title": "LLDiffusion: Learning Degradation Representations in Diffusion Models for Low-Light Image Enhancement",
  "authors": [
    "Tao Wang",
    "Kaihao Zhang",
    "Ziqian Shao",
    "Wenhan Luo",
    "Bjorn Stenger",
    "Tae-Kyun Kim",
    "Wei Liu",
    "Hongdong Li"
  ],
  "submission_date": "2023-07-27T07:22:51+00:00",
  "revised_dates": [],
  "abstract": "Current deep learning methods for low-light image enhancement (LLIE) typically rely on pixel-wise mapping learned from paired data. However, these methods often overlook the importance of considering degradation representations, which can lead to sub-optimal outcomes. In this paper, we address this limitation by proposing a degradation-aware learning scheme for LLIE using diffusion models, which effectively integrates degradation and image priors into the diffusion process, resulting in improved image enhancement. Our proposed degradation-aware learning scheme is based on the understanding that degradation representations play a crucial role in accurately modeling and capturing the specific degradation patterns present in low-light images. To this end, First, a joint learning framework for both image generation and image enhancement is presented to learn the degradation representations. Second, to leverage the learned degradation representations, we develop a Low-Light Diffusion model (LLDiffusion) with a well-designed dynamic diffusion module. This module takes into account both the color map and the latent degradation representations to guide the diffusion process. By incorporating these conditioning factors, the proposed LLDiffusion can effectively enhance low-light images, considering both the inherent degradation patterns and the desired color fidelity. Finally, we evaluate our proposed method on several well-known benchmark datasets, including synthetic and real-world unpaired datasets. Extensive experiments on public benchmarks demonstrate that our LLDiffusion outperforms state-of-the-art LLIE methods both quantitatively and qualitatively. The source code and pre-trained models are available at https://github.com/TaoWangzj/LLDiffusion.",
  "categories": [
    "cs.CV",
    "eess.IV"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14659",
  "pdf_url": "https://arxiv.org/pdf/2307.14659v1",
  "comment": "16 pages, 9 figures",
  "num_versions": null,
  "size_before_bytes": 7899973,
  "size_after_bytes": 256896
}