{
  "title": "Counterfactual Explanation via Search in Gaussian Mixture Distributed Latent Space",
  "authors": [
    "Xuan Zhao",
    "Klaus Broelemann",
    "Gjergji Kasneci"
  ],
  "submission_date": "2023-07-25T10:21:26+00:00",
  "revised_dates": [
    "2023-11-16T01:17:54+00:00",
    "2023-11-23T01:03:12+00:00"
  ],
  "abstract": "Counterfactual Explanations (CEs) are an important tool in Algorithmic Recourse for addressing two questions: 1. What are the crucial factors that led to an automated prediction/decision? 2. How can these factors be changed to achieve a more favorable outcome from a user's perspective? Thus, guiding the user's interaction with AI systems by proposing easy-to-understand explanations and easy-to-attain feasible changes is essential for the trustworthy adoption and long-term acceptance of AI systems. In the literature, various methods have been proposed to generate CEs, and different quality measures have been suggested to evaluate these methods. However, the generation of CEs is usually computationally expensive, and the resulting suggestions are unrealistic and thus non-actionable. In this paper, we introduce a new method to generate CEs for a pre-trained binary classifier by first shaping the latent space of an autoencoder to be a mixture of Gaussian distributions. CEs are then generated in latent space by linear interpolation between the query sample and the centroid of the target class. We show that our method maintains the characteristics of the input sample during the counterfactual search. In various experiments, we show that the proposed method is competitive based on different quality measures on image and tabular datasets -- efficiently returns results that are closer to the original data manifold compared to three state-of-the-art methods, which are essential for realistic high-dimensional machine learning applications.",
  "categories": [
    "cs.LG"
  ],
  "primary_category": "cs.LG",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13390",
  "pdf_url": null,
  "comment": "XAI workshop of IJCAI 2023",
  "num_versions": null,
  "size_before_bytes": 15578999,
  "size_after_bytes": 740643
}