{
  "title": "Spirals and clumps in V960 Mon: signs of planet formation via gravitational instability around an FU Ori star?",
  "authors": [
    "P. Weber",
    "S. Pérez",
    "A. Zurlo",
    "J. Miley",
    "A. Hales",
    "L. Cieza",
    "D. Principe",
    "M. Cárcamo",
    "A. Garufi",
    "Á. Kóspál",
    "M. Takami",
    "J. Kastner",
    "Z. Zhu",
    "J. Williams"
  ],
  "submission_date": "2023-07-25T11:54:49+00:00",
  "revised_dates": [],
  "abstract": "The formation of giant planets has traditionally been divided into two pathways: core accretion and gravitational instability. However, in recent years, gravitational instability has become less favored, primarily due to the scarcity of observations of fragmented protoplanetary disks around young stars and low occurrence rate of massive planets on very wide orbits. In this study, we present a SPHERE/IRDIS polarized light observation of the young outbursting object V960 Mon. The image reveals a vast structure of intricately shaped scattered light with several spiral arms. This finding motivated a re-analysis of archival ALMA 1.3 mm data acquired just two years after the onset of the outburst of V960 Mon. In these data, we discover several clumps of continuum emission aligned along a spiral arm that coincides with the scattered light structure. We interpret the localized emission as fragments formed from a spiral arm under gravitational collapse. Estimating the mass of solids within these clumps to be of several Earth masses, we suggest this observation to be the first evidence of gravitational instability occurring on planetary scales. This study discusses the significance of this finding for planet formation and its potential connection with the outbursting state of V960 Mon.",
  "categories": [
    "astro-ph.EP",
    "astro-ph.SR"
  ],
  "primary_category": "astro-ph.EP",
  "doi": "10.3847/2041-8213/ace186",
  "journal_ref": null,
  "arxiv_id": "2307.13433",
  "pdf_url": null,
  "comment": "Published in ApJL. 11 pages, 4 figures. Images available as fits files at https://github.com/yemsnucleus/V960_Mon_ApJL",
  "num_versions": null,
  "size_before_bytes": 3072254,
  "size_after_bytes": 333683
}