{
  "title": "Discovery of Delta Scuti variables in eclipsing binary systems II.Southern TESS field search",
  "authors": [
    "F. Kahraman Alicavus",
    "G. C. Coban",
    "E. Celik",
    "D. S. Dogan",
    "O. Ekinci",
    "F. Alicavus"
  ],
  "submission_date": "2023-07-24T12:14:19+00:00",
  "revised_dates": [],
  "abstract": "The presence of pulsating stars in eclipsing binary systems (EBs) makes these objects significant since they allow us to investigate the stellar interior structure and evolution. Different types of pulsating stars could be found in EBs such as Delta Scuti variables. Delta Scuti stars in EBs have been known for decades and the increasing number of such systems is important for understanding pulsational structure. Hence, in this study, a research was carried out on the southern TESS field to discover new Delta Scuti stars in EBs. We produced an algorithm to search for detached and semi-detached EBs considering three steps; the orbital period (P$_{orb}$)'s harmonics in the Fourier spectrum, skewness of the light curves, and classification of \\textsc{UPSILON} program. If two of these steps classify a system as an EB, the algorithm also identifies it as an EB. The TESS pixel files of targets were also analyzed to see whether the fluxes are contaminated by other systems. No contamination was found. We researched the existence of pulsation through EBs with a visual inspection. To confirm Delta Scuti-type oscillations, the binary variation was removed from the light curve, and residuals were analyzed. Consequently, we identified 42 Delta Scuti candidates in EBs. The P$_{orb}$, $L$, and M$_{V}$ of systems were calculated. Their positions on the H-R diagram and the known orbital-pulsation period relationship were analyzed. We also examined our targets to find if any of them show frequency modulation with the orbital period and discovered one candidate of tidally tilted pulsators.",
  "categories": [
    "astro-ph.SR"
  ],
  "primary_category": "astro-ph.SR",
  "doi": "10.1093/mnras/stad1898",
  "journal_ref": null,
  "arxiv_id": "2307.12726",
  "pdf_url": null,
  "comment": "Published in MNRAS",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}