{
  "title": "Challenges and Practices in Aligning Requirements with Verification and Validation: A Case Study of Six Companies",
  "authors": [
    "Elizabeth Bjarnason",
    "Per Runeson",
    "Markus Borg",
    "Michael Unterkalmsteiner",
    "Emelie Engström",
    "Björn Regnell",
    "Giedre Sabaliauskaite",
    "Annabella Loconsole",
    "Tony Gorschek",
    "Robert Feldt"
  ],
  "submission_date": "2023-07-24T02:39:53+00:00",
  "revised_dates": [],
  "abstract": "Weak alignment of requirements engineering (RE) with verification and validation (VV) may lead to problems in delivering the required products in time with the right quality. For example, weak communication of requirements changes to testers may result in lack of verification of new requirements and incorrect verification of old invalid requirements, leading to software quality problems, wasted effort and delays. However, despite the serious implications of weak alignment research and practice both tend to focus on one or the other of RE or VV rather than on the alignment of the two. We have performed a multi-unit case study to gain insight into issues around aligning RE and VV by interviewing 30 practitioners from 6 software developing companies, involving 10 researchers in a flexible research process for case studies. The results describe current industry challenges and practices in aligning RE with VV, ranging from quality of the individual RE and VV activities, through tracing and tools, to change control and sharing a common understanding at strategy, goal and design level. The study identified that human aspects are central, i.e. cooperation and communication, and that requirements engineering practices are a critical basis for alignment. Further, the size of an organisation and its motivation for applying alignment practices, e.g. external enforcement of traceability, are variation factors that play a key role in achieving alignment. Our results provide a strategic roadmap for practitioners improvement work to address alignment challenges. Furthermore, the study provides a foundation for continued research to improve the alignment of RE with VV.",
  "categories": [
    "cs.SE"
  ],
  "primary_category": "cs.SE",
  "doi": "10.1007/s10664-013-9263-y",
  "journal_ref": "Empir. Softw. Eng. 19(6): 1809-1855 (2014)",
  "arxiv_id": "2307.12489",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}