{
  "title": "Large negative magnetoresistance and pseudogap phase in superconducting A15-type La$_4$H$_{23}$",
  "authors": [
    "Jianning Guo",
    "Dmitrii Semenok",
    "Grigoriy Shutov",
    "Di Zhou",
    "Su Chen",
    "Yulong Wang",
    "Toni Helm",
    "Sven Luther",
    "Xiaoli Huang",
    "Tian Cui"
  ],
  "submission_date": "2023-07-24T18:38:45+00:00",
  "revised_dates": [],
  "abstract": "High pressure plays a crucial role in the field of superconductivity. Compressed hydride superconductors are leaders in the race for a material that can conduct electricity without resistance at high or even room temperature. In the present work, we have discovered new lanthanum superhydride, cubic A15-type La$_4$H$_{23}$, with lower stabilization pressure compared to the reported $\\textit{fcc}$ LaH$_{10}$. Superconducting La$_4$H$_{23}$ was obtained by laser heating of LaH$_3$ with ammonia borane at about 120 GPa. Transport measurements reveal the maximum critical temperature $\\textit{T}$$_{C}$(onset) = 105 K and the critical field $\\textit{H}$$_{C2}$(0) = 32 T at 118 GPa, as evidenced by the sharp drop of electrical resistance and the displacement of superconducting transitions in applied magnetic fields. Moreover, we provide evidence for unconventional transport associated with a pseudogap phase in La$_4$H$_{23}$ using pulsed magnetic fields up to 68 T. A large negative magnetoresistance in the non-superconducting state below 40 K, quasi $\\textit{T}$-linear electrical resistance, and a sign-change of its temperature dependence mark the emergence of pseudogap in this hydride. Discovered lanthanum hydride is a new member of the A15 family of superconductors with $\\textit{T}$$_C$ exceeding the boiling point of liquid nitrogen.",
  "categories": [
    "cond-mat.supr-con",
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.supr-con",
  "doi": "10.1093/nsr/nwae149",
  "journal_ref": "National Science Review, nwae149, 2024",
  "arxiv_id": "2307.13067",
  "pdf_url": null,
  "comment": "A mistake in Figure 3(a) was fixed",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}