{
  "title": "VacancySBERT: the approach for representation of titles and skills for semantic similarity search in the recruitment domain",
  "authors": [
    "Maiia Bocharova",
    "Eugene Malakhov",
    "Vitaliy Mezhuyev"
  ],
  "submission_date": "2023-07-31T13:21:15+00:00",
  "revised_dates": [],
  "abstract": "The paper focuses on deep learning semantic search algorithms applied in the HR domain. The aim of the article is developing a novel approach to training a Siamese network to link the skills mentioned in the job ad with the title. It has been shown that the title normalization process can be based either on classification or similarity comparison approaches. While classification algorithms strive to classify a sample into predefined set of categories, similarity search algorithms take a more flexible approach, since they are designed to find samples that are similar to a given query sample, without requiring pre-defined classes and labels. In this article semantic similarity search to find candidates for title normalization has been used. A pre-trained language model has been adapted while teaching it to match titles and skills based on co-occurrence information. For the purpose of this research fifty billion title-descriptions pairs had been collected for training the model and thirty three thousand title-description-normalized title triplets, where normalized job title was picked up manually by job ad creator for testing purposes. As baselines FastText, BERT, SentenceBert and JobBert have been used. As a metric of the accuracy of the designed algorithm is Recall in top one, five and ten model's suggestions. It has been shown that the novel training objective lets it achieve significant improvement in comparison to other generic and specific text encoders. Two settings with treating titles as standalone strings, and with included skills as additional features during inference have been used and the results have been compared in this article. Improvements by 10% and 21.5% have been achieved using VacancySBERT and VacancySBERT (with skills) respectively. The benchmark has been developed as open-source to foster further research in the area.",
  "categories": [
    "cs.CL"
  ],
  "primary_category": "cs.CL",
  "doi": "10.15276/aait.06.2023.4",
  "journal_ref": "Applied Aspects of Information Technology, 1(6), 52-59 (2023)",
  "arxiv_id": "2307.16638",
  "pdf_url": "https://arxiv.org/pdf/2307.16638v1",
  "comment": "8 pages, 3 figures",
  "num_versions": null,
  "size_before_bytes": 421698,
  "size_after_bytes": 259108
}