{
  "title": "Off-equatorial deflections and gravitational lensing. I. In Kerr spacetime and effect of spin",
  "authors": [
    "Tingyuan Jiang",
    "Xiaoge Xu",
    "Junji Jia"
  ],
  "submission_date": "2023-07-27T20:06:47+00:00",
  "revised_dates": [
    "2024-05-14T14:45:24+00:00",
    "2024-10-26T11:38:27+00:00",
    "2024-12-23T09:59:45+00:00"
  ],
  "abstract": "This paper investigates off-equatorial plane deflections and gravitational lensing of both null signals and massive particles in Kerr spacetime in the weak deflection limit, with the finite distance effect of the source and detector taken into account. This is the effect caused by the fact that both the source and detector are located at finite distances from the lens, while many researchers often use the deflection angle for infinite distances from sources and detectors. The deflection in both the $φ$ and $θ$ directions is computed as power series of $M/r_0$ and $r_0/r_{\\mathrm{s,d}}$, where $M,\\,r_{\\mathrm{s,d}}$ are the spacetime mass and source and detector radii respectively, and $r_0$ is the minimal radial coordinate of the trajectory. The coefficients of these series are simple trigonometric functions of $θ_\\te$, the extreme value of the $θ$ coordinate of the trajectory. A set of exact gravitational lensing equations is used to solve for $r_0$ and $θ_\\te$ for given deviation angles $δθ$ and $δφ$ of the source, and two lensed images are always obtained. The apparent angles and their magnifications of these images, and the time delays between them are solved and their dependence on various parameters, especially spacetime spin $\\hat{a}$ are analyzed in great detail. It is found that there generally exist two critical spacetime spin values that separate the case of test particles reaching the detector from different sides of the $z$ axis from the cases in which the images appear from the same side in the celestial plane. Three potential applications of these results are discussed.",
  "categories": [
    "gr-qc"
  ],
  "primary_category": "gr-qc",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15174",
  "pdf_url": "https://arxiv.org/pdf/2307.15174v4",
  "comment": "revised version, references added; language improved; 21 pages; 10 figures, 1 table; to match the published version",
  "num_versions": null,
  "size_before_bytes": 7004032,
  "size_after_bytes": 585960
}