{
  "title": "Launching Drifter Observations in the Presence of Uncertainty",
  "authors": [
    "Nan Chen",
    "Evelyn Lunasin",
    "Stephen Wiggins"
  ],
  "submission_date": "2023-07-24T13:27:19+00:00",
  "revised_dates": [],
  "abstract": "Determining the optimal locations for placing extra observational measurements has practical significance. However, the exact underlying flow field is never known in practice. Significant uncertainty appears when the flow field is inferred from a limited number of existing observations via data assimilation or statistical forecast. In this paper, a new computationally efficient strategy for deploying Lagrangian drifters that highlights the central role of uncertainty is developed. A nonlinear trajectory diagnostic approach that underlines the importance of uncertainty is built to construct a phase portrait map. It consists of both the geometric structure of the underlying flow field and the uncertainty in the estimated state from Lagrangian data assimilation. The drifters are deployed at the maxima of this map and are required to be separated enough. Such a strategy allows the drifters to travel the longest distances to collect both the local and global information of the flow field. It also facilitates the reduction of a significant amount of uncertainty. To characterize the uncertainty, the estimated state is given by a probability density function (PDF). An information metric is then introduced to assess the information gain in such a PDF, which is fundamentally different from the traditional path-wise measurements. The information metric also avoids using the unknown truth to quantify the uncertainty reduction, making the method practical. Mathematical analysis exploiting simple illustrative examples is used to validate the strategy. Numerical simulations based on multiscale turbulent flows are then adopted to demonstrate the advantages of this strategy over some other methods.",
  "categories": [
    "physics.flu-dyn",
    "math.DS",
    "nlin.CD"
  ],
  "primary_category": "physics.flu-dyn",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12779",
  "pdf_url": null,
  "comment": "45 pages, 11 figures",
  "num_versions": null,
  "size_before_bytes": 9238609,
  "size_after_bytes": 154094
}