{
  "title": "Anomaly Detection in Industrial Machinery using IoT Devices and Machine Learning: a Systematic Mapping",
  "authors": [
    "Sérgio F. Chevtchenko",
    "Elisson da Silva Rocha",
    "Monalisa Cristina Moura Dos Santos",
    "Ricardo Lins Mota",
    "Diego Moura Vieira",
    "Ermeson Carneiro de Andrade",
    "Danilo Ricardo Barbosa de Araújo"
  ],
  "submission_date": "2023-07-28T20:58:00+00:00",
  "revised_dates": [
    "2023-11-14T11:37:11+00:00"
  ],
  "abstract": "Anomaly detection is critical in the smart industry for preventing equipment failure, reducing downtime, and improving safety. Internet of Things (IoT) has enabled the collection of large volumes of data from industrial machinery, providing a rich source of information for Anomaly Detection. However, the volume and complexity of data generated by the Internet of Things ecosystems make it difficult for humans to detect anomalies manually. Machine learning (ML) algorithms can automate anomaly detection in industrial machinery by analyzing generated data. Besides, each technique has specific strengths and weaknesses based on the data nature and its corresponding systems. However, the current systematic mapping studies on Anomaly Detection primarily focus on addressing network and cybersecurity-related problems, with limited attention given to the industrial sector. Additionally, these studies do not cover the challenges involved in using ML for Anomaly Detection in industrial machinery within the context of the IoT ecosystems. This paper presents a systematic mapping study on Anomaly Detection for industrial machinery using IoT devices and ML algorithms to address this gap. The study comprehensively evaluates 84 relevant studies spanning from 2016 to 2023, providing an extensive review of Anomaly Detection research. Our findings identify the most commonly used algorithms, preprocessing techniques, and sensor types. Additionally, this review identifies application areas and points to future challenges and research opportunities.",
  "categories": [
    "cs.LG"
  ],
  "primary_category": "cs.LG",
  "doi": "10.1109/ACCESS.2023.3333242",
  "journal_ref": null,
  "arxiv_id": "2307.15807",
  "pdf_url": "https://arxiv.org/pdf/2307.15807v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 9560309,
  "size_after_bytes": 1445977
}