{
  "title": "An individual-based model to explore the impact of psychological stress on immune infiltration into tumour spheroids",
  "authors": [
    "Emma Leschiera",
    "Gheed Al-Hity",
    "Melanie S. Flint",
    "Chandrasekhar Venkataraman",
    "Tommaso Lorenzi",
    "Luis Almeida",
    "Chloe Audebert"
  ],
  "submission_date": "2023-07-24T08:58:33+00:00",
  "revised_dates": [
    "2024-03-11T00:35:33+00:00"
  ],
  "abstract": "In recent in vitro experiments on co-culture between breast tumour spheroids and activated immune cells, it was observed that the introduction of the stress hormone cortisol resulted in a decreased immune cell infiltration into the spheroids. Moreover, the presence of cortisol deregulated the normal levels of the pro- and anti-inflammatory cytokines IFN-γ and IL-10. We present an individual-based model to explore the interaction dynamics between tumour and immune cells under psychological stress conditions. With our model, we explore the processes underlying the emergence of different levels of immune infiltration, with particular focus on the biological mechanisms regulated by IFN-γ and IL-10. The set-up of numerical simulations is defined to mimic the scenarios considered in the experimental study. Similarly to the experimental quantitative analysis, we compute a score that quantifies the level of immune cell infiltration into the tumour. The results of numerical simulations indicate that the motility of immune cells, their capability to infiltrate through tumour cells, their growth rate and the interplay between these cell parameters can affect the level of immune cell infiltration in different ways. Ultimately, numerical simulations of this model support a deeper understanding of the impact of biological stress-induced mechanisms on immune infiltration.",
  "categories": [
    "q-bio.CB"
  ],
  "primary_category": "q-bio.CB",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12627",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 7439923,
  "size_after_bytes": 1197900
}