{
  "title": "Different versions of soft-photon theorems exemplified at leading and next-to-leading terms for pion-pion and pion-proton scattering",
  "authors": [
    "Piotr Lebiedowicz",
    "Otto Nachtmann",
    "Antoni Szczurek"
  ],
  "submission_date": "2023-07-25T07:14:45+00:00",
  "revised_dates": [
    "2024-02-01T01:26:18+00:00",
    "2024-05-30T00:59:40+00:00"
  ],
  "abstract": "We investigate the photon emission in pion-pion and pion-proton scattering in the soft-photon limit where the photon energy $ω\\to 0$. The expansions of the $π^{-} π^{0} \\to π^{-} π^{0} γ$ and the $π^{\\pm} p \\to π^{\\pm} p γ$ amplitudes, satisfying the energy-momentum relations, to the orders $ω^{-1}$ and $ω^{0}$ are derived. We show that these terms can be expressed completely in terms of the on-shell amplitudes for $π^{-} π^{0} \\to π^{-} π^{0}$ and $π^{\\pm} p \\to π^{\\pm} p$, respectively, and their partial derivatives with respect to $s$ and $t$. The~structure term which is non singular for $ω\\to 0$ is determined to the order $ω^{0}$ from the gauge-invariance constraint using the generalized Ward identities for pions and the proton. For the reaction $π^{-} π^{0} \\to π^{-} π^{0} γ$ we discuss in detail the soft-photon theorems in the versions of both F.E. Low and S. Weinberg. We show that these two versions are different and must not be confounded. Weinberg's version gives the pole term of a Laurent expansion in $ω$ of the amplitude for $π^{-} π^{0} \\to π^{-} π^{0} γ$ around the phase-space point of zero radiation. Low's version gives an approximate expression for the above amplitude at a fixed phase-space point, corresponding to non-zero radiation. Clearly, the leading and next-to-leading terms in theses two approaches must be, and are indeed, different. We show their relation. We also discuss the expansions of differential cross sections for $π^{-} π^{0} \\to π^{-} π^{0} γ$ with respect to $ω$ for $ω\\to 0$.",
  "categories": [
    "hep-ph",
    "hep-ex",
    "hep-th"
  ],
  "primary_category": "hep-ph",
  "doi": "10.1103/PhysRevD.109.094042",
  "journal_ref": "Phys. Rev. D 109 (2024) 094042",
  "arxiv_id": "2307.13291",
  "pdf_url": null,
  "comment": "16 pages, 9 figure, v2 contains extended discussion on different versions of soft-photon theorems and added references, v3 is equivalent to the PRD version",
  "num_versions": null,
  "size_before_bytes": 6746048,
  "size_after_bytes": 280115
}