{
  "title": "After collapse: On how a physical vacuum can change the black hole paradigm",
  "authors": [
    "Julio Arrechea",
    "Carlos Barceló",
    "Valentin Boyanov"
  ],
  "submission_date": "2023-07-25T11:25:02+00:00",
  "revised_dates": [],
  "abstract": "Standard General Relativity assumes that, in the absence of classical matter sources, spacetime is empty. This chapter considers and analyses the new behaviours of the gravitational field that appear when one substitutes this emptiness by a reactive vacuum, stemming in particular from the idea of vacuum provided by quantum field theory. We restrict our study to spherically symmetric configurations, and take a simple free quantum scalar field as a proxy to more complicated formulations. Our analysis is split into a study of static and of dynamical configurations. Under the assumption of staticity, we find and describe the different asymptotically flat self-consistent solutions that appear when using a vacuum Renormalised Stress-Energy Tensor (RSET) as an additional source in the Einstein equations. Of particular interest is the discovery that, as opposed to standard general relativity, the new theory naturally contains static ultracompact stellar configurations which could observationally be mistaken for black holes (BHs). Then, in our study of dynamical configurations, we investigate the possibility of these same vacuum effects changing the internal gravitational processes after an initial gravitational collapse in a way which shows a path towards forming the aforementioned ultracompact configurations. This has lead us to analyse several dynamical situations seldom contemplated in the literature. Of special relevance, we find that the inner horizon that all realistic BHs should contain could inflate outwards quickly enough to meet the outer one before any appreciable Hawking evaporation has taken place.",
  "categories": [
    "gr-qc",
    "hep-th"
  ],
  "primary_category": "gr-qc",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13416",
  "pdf_url": null,
  "comment": "64 pages, 9 figures. Invited chapter to appear in the volume \"New Frontiers in Gravitational Collapse and Spacetime Singularities\" (Eds. P. S. Joshi and D. Malafarina, Springer Series in Astrophysics and Cosmology)",
  "num_versions": null,
  "size_before_bytes": 1359601,
  "size_after_bytes": 166470
}