{
  "title": "Delayed Appearance and Evolution of Coronal Lines in the TDE AT2019qiz",
  "authors": [
    "P. Short",
    "A. Lawrence",
    "M. Nicholl",
    "M. Ward",
    "T. M. Reynolds",
    "S. Mattila",
    "C. Yin",
    "I. Arcavi",
    "A. Carnall",
    "P. Charalampopoulos",
    "M. Gromadzki",
    "P. G. Jonker",
    "S. Kim",
    "G. Leloudas",
    "I. Mandel",
    "F. Onori",
    "M. Pursiainen",
    "S. Schulze",
    "C. Villforth",
    "T. Wevers"
  ],
  "submission_date": "2023-07-25T17:34:13+00:00",
  "revised_dates": [],
  "abstract": "Tidal disruption events (TDEs) occur when a star gets torn apart by a supermassive black hole as it crosses its tidal radius. We present late-time optical and X-ray observations of the nuclear transient AT2019qiz, which showed the typical signs of an optical-UV transient class commonly believed to be TDEs. Optical spectra were obtained 428, 481 and 828 rest-frame days after optical lightcurve peak, and a UV/X-ray observation coincided with the later spectrum. The optical spectra show strong coronal emission lines, including [Fe VII], [Fe X], [Fe XI] and [Fe XIV]. The Fe lines rise and then fall, except [Fe XIV] which appears late and rises. We observe increasing flux of narrow H-alpha and H-beta and a decrease in broad H-alpha flux. The coronal lines have FWHMs ranging from ~150 - 300km/s, suggesting they originate from a region between the broad and narrow line emitting gas. Between the optical flare and late-time observation, the X-ray spectrum softens dramatically. The 0.3-1 keV X-ray flux increases by a factor of ~50 while the hard X-ray flux decreases by a factor of ~6. WISE fluxes also rose over the same period, indicating the presence of an infrared echo. With AT2017gge, AT2019qiz is one of two examples of a spectroscopically-confirmed optical-UV TDE showing delayed coronal line emission, supporting speculations that Extreme Coronal Line Emitters in quiescent galaxies can be echos of unobserved past TDEs. We argue that the coronal lines, narrow lines, and infrared emission arise from the illumination of pre-existing material likely related to either a previous TDE or AGN activity.",
  "categories": [
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.HE",
  "doi": "10.1093/mnras/stad2270",
  "journal_ref": null,
  "arxiv_id": "2307.13674",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1509328,
  "size_after_bytes": 415754
}