{
  "title": "Cross-dimensional transfer learning in medical image segmentation with deep learning",
  "authors": [
    "Hicham Messaoudi",
    "Ahror Belaid",
    "Douraied Ben Salem",
    "Pierre-Henri Conze"
  ],
  "submission_date": "2023-07-29T02:50:38+00:00",
  "revised_dates": [],
  "abstract": "Over the last decade, convolutional neural networks have emerged and advanced the state-of-the-art in various image analysis and computer vision applications. The performance of 2D image classification networks is constantly improving and being trained on databases made of millions of natural images. However, progress in medical image analysis has been hindered by limited annotated data and acquisition constraints. These limitations are even more pronounced given the volumetry of medical imaging data. In this paper, we introduce an efficient way to transfer the efficiency of a 2D classification network trained on natural images to 2D, 3D uni- and multi-modal medical image segmentation applications. In this direction, we designed novel architectures based on two key principles: weight transfer by embedding a 2D pre-trained encoder into a higher dimensional U-Net, and dimensional transfer by expanding a 2D segmentation network into a higher dimension one. The proposed networks were tested on benchmarks comprising different modalities: MR, CT, and ultrasound images. Our 2D network ranked first on the CAMUS challenge dedicated to echo-cardiographic data segmentation and surpassed the state-of-the-art. Regarding 2D/3D MR and CT abdominal images from the CHAOS challenge, our approach largely outperformed the other 2D-based methods described in the challenge paper on Dice, RAVD, ASSD, and MSSD scores and ranked third on the online evaluation platform. Our 3D network applied to the BraTS 2022 competition also achieved promising results, reaching an average Dice score of 91.69% (91.22%) for the whole tumor, 83.23% (84.77%) for the tumor core, and 81.75% (83.88%) for enhanced tumor using the approach based on weight (dimensional) transfer. Experimental and qualitative results illustrate the effectiveness of our methods for multi-dimensional medical image segmentation.",
  "categories": [
    "eess.IV",
    "cs.CV",
    "cs.LG"
  ],
  "primary_category": "eess.IV",
  "doi": "10.1016/j.media.2023.102868",
  "journal_ref": "In Medical Image Analysis (Vol. 88, p. 102868). Elsevier BV (2023)",
  "arxiv_id": "2307.15872",
  "pdf_url": "https://arxiv.org/pdf/2307.15872v1",
  "comment": "30 pages, 12 figures, 6 tables, Accepted for publication in the Journal of Medical Image Analysis",
  "num_versions": null,
  "size_before_bytes": 6384168,
  "size_after_bytes": 227480
}