{
  "title": "Central radio galaxies in galaxy clusters: Joint surveys by eROSITA and ASKAP",
  "authors": [
    "K. Böckmann",
    "M. Brüggen",
    "B. Koribalski",
    "A. Veronica",
    "T. H. Reiprich",
    "E. Bulbul",
    "Y. E. Bahar",
    "F. Balzer",
    "J. Comparat",
    "C. Garrel",
    "V. Ghirardini",
    "G. Gürkan",
    "M. Kluge",
    "D. Leahy",
    "A. Merloni",
    "A. Liu",
    "M. E. Ramos-Ceja",
    "M. Salvato",
    "J. Sanders",
    "S. Shabala",
    "X. Zhang"
  ],
  "submission_date": "2023-07-25T17:33:26+00:00",
  "revised_dates": [
    "2023-08-10T00:16:19+00:00",
    "2023-09-27T13:30:00+00:00"
  ],
  "abstract": "The extended ROentgen Survey with an Imaging Telescope Array (eROSITA) telescope onboard the Spectrum-Roentgen-Gamma (SRG) mission has finished the first eROSITA All-Sky Survey (eRASS:1), and detected 10$^4$ galaxy clusters in the western Galactic hemisphere. In the radio band, the Australian Square Kilometre Array Pathfinder (ASKAP) telescope finished its pilot 1 phase of the project 'Evolutionary Map of the Universe' (EMU) with 220.000 sources in a 270 deg$^2$ field overlapping with eRASS:1. These two surveys are used to study radio-mode Active Galactic Nuclei (AGN) in clusters. In order to understand the efficiency of radio-mode feedback at the centers of galaxy clusters, we relate the radio properties of brightest cluster galaxies (BCG) to the X-ray properties of the host clusters. We identify the central radio sources in eRASS:1 clusters or calculate corresponding upper limits on the radio luminosity. Then, we derive relations between the X-ray properties of the clusters and the radio properties of the corresponding central radio source. We also apply a mid-infrared color criterion using WISE colors to identify AGN. In total we investigate a sample of 75 clusters. We find a statistically significant correlation between the X-ray luminosity of the cluster and the 944 MHz radio luminosity of the corresponding central radio galaxy. There is also a positive trend between the radio power and the largest linear size (LLS) of the radio source. The density and the LLS do not show any correlation. We find that in high luminosity clusters with L_X > $10^{43}$ erg s$^{-1}$ the kinetic luminosity of the radio jets is not longer correlated with the X-ray luminosity and discuss various reasons. We find an anti-correlation between the central cooling time t_cool and the radio luminosity L_R indicating a need for more powerful AGN in clusters with short central cooling times.",
  "categories": [
    "astro-ph.CO",
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.CO",
  "doi": "10.1051/0004-6361/202346912",
  "journal_ref": "A&A 677, A188 (2023)",
  "arxiv_id": "2307.13672",
  "pdf_url": null,
  "comment": "16 pages, 12 figures, accepted for publication in A&A",
  "num_versions": null,
  "size_before_bytes": 27882749,
  "size_after_bytes": 1364870
}