{
  "title": "Data-Driven Modeling with Experimental Augmentation for the Modulation Strategy of the Dual-Active-Bridge Converter",
  "authors": [
    "Xinze Li",
    "Josep Pou",
    "Jiaxin Dong",
    "Fanfan Lin",
    "Changyun Wen",
    "Suvajit Mukherjee",
    "Xin Zhang"
  ],
  "submission_date": "2023-07-30T08:52:05+00:00",
  "revised_dates": [
    "2023-08-03T01:29:35+00:00"
  ],
  "abstract": "For the performance modeling of power converters, the mainstream approaches are essentially knowledge-based, suffering from heavy manpower burden and low modeling accuracy. Recent emerging data-driven techniques greatly relieve human reliance by automatic modeling from simulation data. However, model discrepancy may occur due to unmodeled parasitics, deficient thermal and magnetic models, unpredictable ambient conditions, etc. These inaccurate data-driven models based on pure simulation cannot represent the practical performance in physical world, hindering their applications in power converter modeling. To alleviate model discrepancy and improve accuracy in practice, this paper proposes a novel data-driven modeling with experimental augmentation (D2EA), leveraging both simulation data and experimental data. In D2EA, simulation data aims to establish basic functional landscape, and experimental data focuses on matching actual performance in real world. The D2EA approach is instantiated for the efficiency optimization of a hybrid modulation for neutral-point-clamped dual-active-bridge (NPC-DAB) converter. The proposed D2EA approach realizes 99.92% efficiency modeling accuracy, and its feasibility is comprehensively validated in 2-kW hardware experiments, where the peak efficiency of 98.45% is attained. Overall, D2EA is data-light and can achieve highly accurate and highly practical data-driven models in one shot, and it is scalable to other applications, effortlessly.",
  "categories": [
    "eess.SY",
    "cs.AI"
  ],
  "primary_category": "eess.SY",
  "doi": "10.1109/TIE.2023.3265027",
  "journal_ref": "IEEE.Trans.Ind.Electron. Early Access (2023) 1-11",
  "arxiv_id": "2307.16173",
  "pdf_url": "https://arxiv.org/pdf/2307.16173v2",
  "comment": "11 pages",
  "num_versions": null,
  "size_before_bytes": 3759680,
  "size_after_bytes": 2264166
}