{
  "title": "ALMA 0.5 kpc Resolution Spatially Resolved Investigations of Nuclear Dense Molecular Gas Properties in Nearby Ultraluminous Infrared Galaxies Based on HCN and HCO$^{+}$ Three Transition Line Data",
  "authors": [
    "Masatoshi Imanishi",
    "Shunsuke Baba",
    "Kouichiro Nakanishi",
    "Takuma Izumi"
  ],
  "submission_date": "2023-07-27T20:17:45+00:00",
  "revised_dates": [],
  "abstract": "We present the results of our ALMA $\\lesssim$0.5 kpc-resolution dense molecular line (HCN and HCO$^{+}$ J=2-1, J=3-2, and J=4-3) observations of 12 nearby (ultra)luminous infrared galaxies ([U]LIRGs). After matching beam sizes of all molecular line data to the same values in all (U)LIRGs, we derive molecular line flux ratios, by extracting spectra in the central 0.5, 1, 2 kpc circular regions, and 0.5-1 and 1-2 kpc annular regions. Based on non-LTE model calculations, we quantitatively confirm that the innermost ($\\lesssim$0.5 kpc) molecular gas is very dense ($\\gtrsim$10$^{5}$ cm$^{-3}$) and warm ($\\gtrsim$300 K) in ULIRGs, and that in one LIRG is also modestly dense (10$^{4-5}$ cm$^{-3}$) and warm ($\\sim$100 K). We then investigate the spatial variation of the HCN-to-HCO$^{+}$ flux ratios and high-J to low-J flux ratios of HCN and HCO$^{+}$. A subtle sign of decreasing trend of these ratios from the innermost ($\\lesssim$0.5 kpc) to outer nuclear (0.5-2 kpc) region is discernible in a significant fraction of the observed ULIRGs. For two AGN-hosting ULIRGs which display the trend most clearly, we find based on a Bayesian approach that the HCN-to-HCO$^{+}$ abundance ratio and gas kinetic temperature systematically increase from the outer nuclear to the innermost region. We suggest that this trend comes from potential AGN effects, because no such spatial variation is found in a starburst-dominated LIRG.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15179",
  "pdf_url": "https://arxiv.org/pdf/2307.15179v1",
  "comment": "62 pages, 29 figures. ApJ accepted. Higher resolution version is available at http://www2.nao.ac.jp/~masaimanishi/Aph/ImanishiULIRG500pcH.pdf",
  "num_versions": null,
  "size_before_bytes": 25776617,
  "size_after_bytes": 421169
}