{
  "title": "GeneMask: Fast Pretraining of Gene Sequences to Enable Few-Shot Learning",
  "authors": [
    "Soumyadeep Roy",
    "Jonas Wallat",
    "Sowmya S Sundaram",
    "Wolfgang Nejdl",
    "Niloy Ganguly"
  ],
  "submission_date": "2023-07-29T09:17:16+00:00",
  "revised_dates": [],
  "abstract": "Large-scale language models such as DNABert and LOGO aim to learn optimal gene representations and are trained on the entire Human Reference Genome. However, standard tokenization schemes involve a simple sliding window of tokens like k-mers that do not leverage any gene-based semantics and thus may lead to (trivial) masking of easily predictable sequences and subsequently inefficient Masked Language Modeling (MLM) training. Therefore, we propose a novel masking algorithm, GeneMask, for MLM training of gene sequences, where we randomly identify positions in a gene sequence as mask centers and locally select the span around the mask center with the highest Normalized Pointwise Mutual Information (NPMI) to mask. We observe that in the absence of human-understandable semantics in the genomics domain (in contrast, semantic units like words and phrases are inherently available in NLP), GeneMask-based models substantially outperform the SOTA models (DNABert and LOGO) over four benchmark gene sequence classification datasets in five few-shot settings (10 to 1000-shot). More significantly, the GeneMask-based DNABert model is trained for less than one-tenth of the number of epochs of the original SOTA model. We also observe a strong correlation between top-ranked PMI tokens and conserved DNA sequence motifs, which may indicate the incorporation of latent genomic information. The codes (including trained models) and datasets are made publicly available at https://github.com/roysoumya/GeneMask.",
  "categories": [
    "cs.CL"
  ],
  "primary_category": "cs.CL",
  "doi": "10.3233/FAIA230492",
  "journal_ref": "Frontiers in Artificial Intelligence and Applications, Volume 372: ECAI 2023",
  "arxiv_id": "2307.15933",
  "pdf_url": "https://arxiv.org/pdf/2307.15933v1",
  "comment": "12 pages including appendix. Accepted for publication at 26th European Conference on Artificial Intelligence ECAI 2023",
  "num_versions": null,
  "size_before_bytes": 582905,
  "size_after_bytes": 248057
}