{
  "title": "Phase diagram of one-dimensional driven-dissipative exciton-polariton condensates",
  "authors": [
    "Francesco Vercesi",
    "Quentin Fontaine",
    "Sylvain Ravets",
    "Jacqueline Bloch",
    "Maxime Richard",
    "Léonie Canet",
    "Anna Minguzzi"
  ],
  "submission_date": "2023-07-28T16:51:26+00:00",
  "revised_dates": [],
  "abstract": "We consider a one-dimensional driven-dissipative exciton-polariton condensate under incoherent pump, described by the stochastic generalized Gross-Pitaevskii equation. It was shown that the condensate phase dynamics maps under some assumptions to the Kardar-Parisi-Zhang (KPZ) equation, and the temporal coherence of the condensate follows a stretched exponential decay characterized by KPZ universal exponents. In this work, we determine the main mechanisms which lead to the departure from the KPZ phase, and identify three possible other regimes: (i) a soliton-patterned regime at large interactions and weak noise, populated by localized structures analogue to dark solitons; (ii) a vortex-disordered regime at high noise and weak interactions, dominated by point-like phase defects in space-time; (iii) a defect-free reservoir-textured regime where the adiabatic approximation breaks down. We characterize each regime by the space-time maps, the first-order correlations, the momentum distribution and the density of topological defects. We thus obtain the phase diagram at varying noise, pump intensity and interaction strength. Our predictions are amenable to observation in state-of-art experiments with exciton-polaritons.",
  "categories": [
    "cond-mat.stat-mech",
    "cond-mat.quant-gas"
  ],
  "primary_category": "cond-mat.stat-mech",
  "doi": "10.1103/PhysRevResearch.5.043062",
  "journal_ref": "Physical Review Research 5, 043062 (2023)",
  "arxiv_id": "2307.15664",
  "pdf_url": "https://arxiv.org/pdf/2307.15664v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 2090083,
  "size_after_bytes": 95277
}