{
  "title": "Cosmological Tensions and the Transitional Planck Mass Model",
  "authors": [
    "Joshua A Kable",
    "Giampaolo Benevento",
    "Graeme E Addison",
    "Charles L Bennett"
  ],
  "submission_date": "2023-07-22T21:45:56+00:00",
  "revised_dates": [],
  "abstract": "In this followup analysis, we update previous constraints on the Transitional Planck Mass (TPM) modified gravity model using the latest version of EFTCAMB and provide new constraints using SPT and Planck anisotropy data along with Planck CMB lensing, BAO, SNe Ia, and an $H_0$ prior from local measurements. We find that large shifts in the Planck mass lead to large suppression of power on small scales that is disfavored by both SPT and Planck. Using only SPT TE-EE data, this suppression of power can be compensated for by an upward shift of the scalar index to $n_s = 1.003 \\pm 0.016$ resulting in $H_0 = 71.94^{+0.86}_{-0.85}$ kms$^{-1}$Mpc$^{-1}$ and a $\\sim7\\%$ shift in the Planck mass. Including Planck TT $\\ell \\leq 650$ and Planck TE-EE data restricts the shift to be $<5\\%$ at $2σ$ with $H_0 = 70.65 \\pm 0.66$ kms$^{-1}$Mpc$^{-1}$. Excluding the $H_0$ prior, SPT and Planck data constrain the shift in the Planck mass to be $<3\\%$ at $2σ$ with a best-fit value of $0.04\\%$, consistent with the $Λ$CDM limit. In this case $H_0 = 69.09^{+0.69}_{-0.68}$ kms$^{-1}$Mpc$^{-1}$, which is partially elevated by the dynamics of the scalar-field in the late universe. This differs from EDE models that prefer higher values of $H_0$ when high $\\ell$ Planck TT data are excluded. We additionally constrain TPM using RSD data from BOSS DR 12 and cosmic shear, galaxy-galaxy lensing, and galaxy clustering data from DES Y1 finding both disfavor transitions close to recombination, but earlier Planck mass transitions are allowed.",
  "categories": [
    "astro-ph.CO"
  ],
  "primary_category": "astro-ph.CO",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12174",
  "pdf_url": null,
  "comment": "25 pages, 8 figures, 8 tables",
  "num_versions": null,
  "size_before_bytes": 10838021,
  "size_after_bytes": 372475
}