{
  "title": "Aspects of Everpresent $Λ$ (II): Cosmological Tests of Current Models",
  "authors": [
    "Santanu Das",
    "Arad Nasiri",
    "Yasaman K. Yazdi"
  ],
  "submission_date": "2023-07-25T18:02:46+00:00",
  "revised_dates": [
    "2024-10-07T00:52:53+00:00"
  ],
  "abstract": "This paper investigates Everpresent $Λ$, a stochastic dark energy model motivated by causal set theory and unimodular gravity, and confronts it with two key observational data sets, Supernova Ia (SN Ia) and Cosmic Microwave Background (CMB) data. A key feature of this model is that $Λ$ fluctuates over time and on average the magnitude of its fluctuations is of the order of the dominant energy density (be it radiation or matter) for the given epoch. In particular, we focus on a phenomenological implementation of Everpresent $Λ$ known as Model 1. The random fluctuations in Everpresent $Λ$ realizations are generated using seed numbers, and we find that for a small fraction of seeds Model 1 is capable of producing realizations that fit SN Ia data better than $Λ$CDM. We further investigate what features distinguish these realizations from the more general behaviour, and find that the \"good'' realizations have relatively small fluctuations at low redshifts ($z<1.5$), which do not closely track the matter density. We find that Model 1 struggles to improve on $Λ$CDM at describing the CMB data. However, by suppressing the values of $Λ$ near the last scattering surface, as suggested in arXiv:1703.06265, we find a large improvement in the best fit of the model, though still with a $χ^2$ value much larger than that of $Λ$CDM. We also study the allowed variation of the dark energy density by the CMB constraints in a more model-independent manner, and find that some variation (especially prior to recombination) is possible and in fact can lead to improvement over $Λ$CDM and reduce the Hubble tension, in line with some early dark energy proposals. However, for the kinds of variations considered, the favoured fluctuations are smaller in magnitude than is typical in current Everpresent $Λ$ models.",
  "categories": [
    "astro-ph.CO",
    "gr-qc",
    "hep-th"
  ],
  "primary_category": "astro-ph.CO",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13743",
  "pdf_url": null,
  "comment": "37 pages, 14 figures, 2 tables",
  "num_versions": null,
  "size_before_bytes": 40297264,
  "size_after_bytes": 654203
}