{
  "title": "Entangling interactions between artificial atoms mediated by a multimode left-handed superconducting ring resonator",
  "authors": [
    "T. McBroom-Carroll",
    "A. Schlabes",
    "X. Xu",
    "J. Ku",
    "B. Cole",
    "S. Indrajeet",
    "M. D. LaHaye",
    "M. H. Ansari",
    "B. L. T. Plourde"
  ],
  "submission_date": "2023-07-28T17:42:23+00:00",
  "revised_dates": [
    "2024-05-12T21:20:01+00:00"
  ],
  "abstract": "Superconducting metamaterial transmission lines implemented with lumped circuit elements can exhibit left-handed dispersion, where the group and phase velocity have opposite sign, in a frequency range relevant for superconducting artificial atoms. Forming such a metamaterial transmission line into a ring and coupling it to qubits at different points around the ring results in a multimode bus resonator with a compact footprint. Using flux-tunable qubits, we characterize and theoretically model the variation in the coupling strength between the two qubits and each of the ring resonator modes. Although the qubits have negligible direct coupling between them, their interactions with the multimode ring resonator result in both a transverse exchange coupling and a higher order $ZZ$ interaction between the qubits. As we vary the detuning between the qubits and their frequency relative to the ring resonator modes, we observe significant variations in both of these inter-qubit interactions, including zero crossings and changes of sign. The ability to modulate interaction terms such as the $ZZ$ scale between zero and large values for small changes in qubit frequency provides a promising pathway for implementing entangling gates in a system capable of hosting many qubits.",
  "categories": [
    "quant-ph",
    "cond-mat.supr-con"
  ],
  "primary_category": "quant-ph",
  "doi": "10.1103/PRXQuantum.5.020325",
  "journal_ref": "PRX Quantum 5, 020325 (2024)",
  "arxiv_id": "2307.15695",
  "pdf_url": "https://arxiv.org/pdf/2307.15695v2",
  "comment": "8 + 11 pages, 5 + 5 figures, 0 + 3 tables",
  "num_versions": null,
  "size_before_bytes": 17592072,
  "size_after_bytes": 226037
}