{
  "title": "Implications of the pulsar timing array detections for massive black hole mergers in the LISA band",
  "authors": [
    "Enrico Barausse",
    "Kallol Dey",
    "Marco Crisostomi",
    "Akshay Panayada",
    "Sylvain Marsat",
    "Soumen Basak"
  ],
  "submission_date": "2023-07-23T06:59:40+00:00",
  "revised_dates": [
    "2023-11-27T01:16:11+00:00"
  ],
  "abstract": "The recent evidence of a stochastic background of gravitational waves in the nHz band by pulsar-timing array (PTA) experiments has shed new light on the formation and evolution of massive black hole binaries with masses $\\sim 10^8$--$10^9 M_\\odot$. The PTA data are consistent with a population of such binaries merging efficiently after the coalescence of their galactic hosts, and presenting masses slightly larger than previously expected. This momentous discovery calls for investigating the prospects of detecting the smaller ($\\sim 10^5$--$10^7 M_\\odot$) massive black hole binaries targeted by the Laser Interferometer Space Antenna (LISA). By using semi-analytic models for the formation and evolution of massive black hole binaries calibrated against the PTA results, we find that LISA will observe at least a dozen and up to thousands of black hole binaries during its mission duration. The minimum number of detections rises to $\\sim 70$ if one excludes models that only marginally reproduce the quasar luminosity function at $z=6$. We also assess LISA's parameter estimation capabilities with state-of-the-art waveforms including higher modes and realistic instrumental response, and find that the masses, sky position, and distance will typically be estimated to within respectively 1%, 10 square degrees, and 10% for the detected systems (assuming a 4-year mission).",
  "categories": [
    "astro-ph.GA",
    "astro-ph.CO",
    "astro-ph.HE",
    "gr-qc"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.1103/PhysRevD.108.103034",
  "journal_ref": "Phys. Rev. D 108 (2023) 10, 103034",
  "arxiv_id": "2307.12245",
  "pdf_url": null,
  "comment": "17 pages, 7 figures. PRD in press",
  "num_versions": null,
  "size_before_bytes": 12946416,
  "size_after_bytes": 236044
}