{
  "title": "Flow states and heat transport in liquid metal convection",
  "authors": [
    "Lei Ren",
    "Xin Tao",
    "Lu Zhang",
    "Ming-Jiu Ni",
    "Ke-Qing Xia",
    "Yi-Chao Xie"
  ],
  "submission_date": "2023-07-29T04:08:49+00:00",
  "revised_dates": [],
  "abstract": "We present an experimental study of Rayleigh-Bénard convection using liquid metal alloy gallium-indium-tin as the working fluid with a Prandtl number of $Pr=0.029$. The flow state and the heat transport were measured in a Rayleigh number range of $1.2\\times10^{4} \\le Ra \\le 1.3\\times10^{7}$. The temperature fluctuation at the cell centre is used as a proxy for the flow state. It is found that, as $Ra$ increases from the lower end of the parameter range, the flow evolves from a convection state to an oscillation state, a chaotic state, and finally a turbulent state for $Ra>10^5$. The study suggests that the large-scale circulation in the turbulent state is a residual of the cell structures near the onset of convection, which is in contrast with the case of $Pr\\sim1$, where the cell structure is replaced by high-order flow modes transiently before the emergence of the large-scale circulation in the turbulent state. The evolution of the flow state is also reflected by the heat transport characterised by the Nusselt number $Nu$ and the probability density function (PDF) of the temperature fluctuation at the cell centre. It is found that the effective local heat transport scaling exponent $γ$, i.e., $Nu\\sim Ra^γ$, changes continuously from $γ=0.49$ at $Ra\\sim 10^4$ to $γ=0.25$ for $Ra>10^6$. Meanwhile, the PDF at the cell centre gradually evolves from a Gaussian-like shape before the transition to turbulence to an exponential-like shape in the turbulent state. For $Ra>10^6$, the flow shows self-similar behaviour, which is revealed by the universal shape of the PDF of the temperature fluctuation at the cell centre and a $Nu=0.19Ra^{0.25}$ scaling for the heat transport.",
  "categories": [
    "physics.flu-dyn"
  ],
  "primary_category": "physics.flu-dyn",
  "doi": "10.1017/jfm.2022.866",
  "journal_ref": "J. Fluid Mech., 951, R1, 2022",
  "arxiv_id": "2307.15885",
  "pdf_url": "https://arxiv.org/pdf/2307.15885v1",
  "comment": "12 pages, 5 figures; Accepted for publication in the Journal of Fluid Mechanics",
  "num_versions": null,
  "size_before_bytes": 1251955,
  "size_after_bytes": 148558
}