{
  "title": "Numerical investigation of the boundary layer stability on a section of a rotating wind turbine blade",
  "authors": [
    "Thales Coelho Leite Fava",
    "Dan Henningson",
    "Ardeshir Hanifi"
  ],
  "submission_date": "2023-07-31T08:41:56+00:00",
  "revised_dates": [],
  "abstract": "Laminar-turbulent transition on a rotating wind turbine blade at a chord Reynolds number of $1 \\times 10^5$ and varying angles of attack ($AoA$) is studied with direct numerical simulations and linear stability theory. The rotation effects depend on the streamwise pressure gradient and direct/reverse flow state. In the $AoA=12.8^\\circ$ case, rotation retards the flow in the laminar separation bubble (LSB) and renders the mixed Tollmien-Schlichting/Kelvin-Helmholtz (TS/KH) instability more unstable. Rotation fosters an oblique secondary instability mechanism, rapidly breaking the KH rolls into small-scale turbulence. A sub-harmonic mechanism is dominant in the non-rotating case, retarding transition. However, rotation accelerates the boundary layer upstream of separation, subject to a strong adverse pressure gradient (APG), stabilizing TS waves and delaying transition in $3\\%$ and reattachment in $4\\%$. In the $AoA=4.2^\\circ$ and $AoA=1.2^\\circ$ cases, rotation decelerates the flow upstream of separation, subject to a favorable pressure gradient (FPG), which makes TS waves more unstable. Nonetheless, rotation accelerates the separated flow, partially stabilizing the KH mechanism. Rotation further promotes the appearance of inflectional crossflow velocity profiles that triggers stationary and traveling crossflow modes. These modes are less unstable than the TS/KH mechanism of the separated shear layer but lead to the formation of coherent spanwise-velocity structures. For $AoA=4.2^\\circ$, rotation strengthens the sub-harmonic secondary instability mechanism in the rotating case over the oblique one under no rotation. For $AoA=1.2^\\circ$, the sub-harmonic mechanism is dominant regardless of rotation. Notice that the transition location is not changed by rotation in the $AoA=4.2^\\circ$ and $AoA=1.2^\\circ$ cases. Finally, rotation stabilizes the absolute instability found in these cases.",
  "categories": [
    "physics.flu-dyn"
  ],
  "primary_category": "physics.flu-dyn",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16494",
  "pdf_url": "https://arxiv.org/pdf/2307.16494v1",
  "comment": "36 pages, 17 figures",
  "num_versions": null,
  "size_before_bytes": 10008407,
  "size_after_bytes": 243632
}