{
  "title": "Contrastive Example-Based Control",
  "authors": [
    "Kyle Hatch",
    "Benjamin Eysenbach",
    "Rafael Rafailov",
    "Tianhe Yu",
    "Ruslan Salakhutdinov",
    "Sergey Levine",
    "Chelsea Finn"
  ],
  "submission_date": "2023-07-24T19:43:22+00:00",
  "revised_dates": [],
  "abstract": "While many real-world problems that might benefit from reinforcement learning, these problems rarely fit into the MDP mold: interacting with the environment is often expensive and specifying reward functions is challenging. Motivated by these challenges, prior work has developed data-driven approaches that learn entirely from samples from the transition dynamics and examples of high-return states. These methods typically learn a reward function from high-return states, use that reward function to label the transitions, and then apply an offline RL algorithm to these transitions. While these methods can achieve good results on many tasks, they can be complex, often requiring regularization and temporal difference updates. In this paper, we propose a method for offline, example-based control that learns an implicit model of multi-step transitions, rather than a reward function. We show that this implicit model can represent the Q-values for the example-based control problem. Across a range of state-based and image-based offline control tasks, our method outperforms baselines that use learned reward functions; additional experiments demonstrate improved robustness and scaling with dataset size.",
  "categories": [
    "cs.LG",
    "cs.AI",
    "cs.RO"
  ],
  "primary_category": "cs.LG",
  "doi": null,
  "journal_ref": "Proceedings of The 5th Annual Learning for Dynamics and Control Conference, PMLR 211:155-169, 2023",
  "arxiv_id": "2307.13101",
  "pdf_url": null,
  "comment": "This is an updated version of a manuscript that originally appeared at L4DC 2023. The project website is here https://sites.google.com/view/laeo-rl",
  "num_versions": null,
  "size_before_bytes": 3246570,
  "size_after_bytes": 124130
}