{
  "title": "Big Data$\\unicode{x2013}$Supply Chain Management Framework for Forecasting: Data Preprocessing and Machine Learning Techniques",
  "authors": [
    "Md Abrar Jahin",
    "Md Sakib Hossain Shovon",
    "Jungpil Shin",
    "Istiyaque Ahmed Ridoy",
    "M. F. Mridha"
  ],
  "submission_date": "2023-07-24T17:49:05+00:00",
  "revised_dates": [
    "2023-12-14T02:43:22+00:00",
    "2023-12-15T01:32:54+00:00",
    "2024-02-06T05:07:39+00:00",
    "2024-02-09T01:03:17+00:00",
    "2025-09-04T00:09:30+00:00"
  ],
  "abstract": "This article intends to systematically identify and comparatively analyze state-of-the-art supply chain (SC) forecasting strategies and technologies. A novel framework has been proposed incorporating Big Data Analytics in SC Management (problem identification, data sources, exploratory data analysis, machine-learning model training, hyperparameter tuning, performance evaluation, and optimization), forecasting effects on human-workforce, inventory, and overall SC. Initially, the need to collect data according to SC strategy and how to collect them has been discussed. The article discusses the need for different types of forecasting according to the period or SC objective. The SC KPIs and the error-measurement systems have been recommended to optimize the top-performing model. The adverse effects of phantom inventory on forecasting and the dependence of managerial decisions on the SC KPIs for determining model performance parameters and improving operations management, transparency, and planning efficiency have been illustrated. The cyclic connection within the framework introduces preprocessing optimization based on the post-process KPIs, optimizing the overall control process (inventory management, workforce determination, cost, production and capacity planning). The contribution of this research lies in the standard SC process framework proposal, recommended forecasting data analysis, forecasting effects on SC performance, machine learning algorithms optimization followed, and in shedding light on future research.",
  "categories": [
    "cs.LG",
    "stat.ML"
  ],
  "primary_category": "cs.LG",
  "doi": "10.1007/s11831-024-10092-9",
  "journal_ref": "Archives of Computational Methods in Engineering, Volume 31, pp. 3619-3645 (2024)",
  "arxiv_id": "2307.12971",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 10644246,
  "size_after_bytes": 4828306
}