{
  "title": "A Knowledge-enhanced Two-stage Generative Framework for Medical Dialogue Information Extraction",
  "authors": [
    "Zefa Hu",
    "Ziyi Ni",
    "Jing Shi",
    "Shuang Xu",
    "Bo Xu"
  ],
  "submission_date": "2023-07-30T10:51:32+00:00",
  "revised_dates": [
    "2023-10-25T12:41:34+00:00",
    "2023-10-26T04:55:52+00:00",
    "2024-02-20T03:24:16+00:00"
  ],
  "abstract": "This paper focuses on term-status pair extraction from medical dialogues (MD-TSPE), which is essential in diagnosis dialogue systems and the automatic scribe of electronic medical records (EMRs). In the past few years, works on MD-TSPE have attracted increasing research attention, especially after the remarkable progress made by generative methods. However, these generative methods output a whole sequence consisting of term-status pairs in one stage and ignore integrating prior knowledge, which demands a deeper understanding to model the relationship between terms and infer the status of each term. This paper presents a knowledge-enhanced two-stage generative framework (KTGF) to address the above challenges. Using task-specific prompts, we employ a single model to complete the MD-TSPE through two phases in a unified generative form: we generate all terms the first and then generate the status of each generated term. In this way, the relationship between terms can be learned more effectively from the sequence containing only terms in the first phase, and our designed knowledge-enhanced prompt in the second phase can leverage the category and status candidates of the generated term for status generation. Furthermore, our proposed special status \"not mentioned\" makes more terms available and enriches the training data in the second phase, which is critical in the low-resource setting. The experiments on the Chunyu and CMDD datasets show that the proposed method achieves superior results compared to the state-of-the-art models in the full training and low-resource settings.",
  "categories": [
    "cs.CL"
  ],
  "primary_category": "cs.CL",
  "doi": "10.1007/s11633-023-1461-5",
  "journal_ref": null,
  "arxiv_id": "2307.16200",
  "pdf_url": "https://arxiv.org/pdf/2307.16200v4",
  "comment": "Published in Machine Intelligence Research, https://link.springer.com/article/10.1007/s11633-023-1461-5",
  "num_versions": null,
  "size_before_bytes": 5344232,
  "size_after_bytes": 2487901
}