{
  "title": "Large Language Models Understand and Can be Enhanced by Emotional Stimuli",
  "authors": [
    "Cheng Li",
    "Jindong Wang",
    "Yixuan Zhang",
    "Kaijie Zhu",
    "Wenxin Hou",
    "Jianxun Lian",
    "Fang Luo",
    "Qiang Yang",
    "Xing Xie"
  ],
  "submission_date": "2023-07-14T00:57:12+00:00",
  "revised_dates": [
    "2023-07-26T00:12:29+00:00",
    "2023-08-02T00:10:11+00:00",
    "2023-09-21T00:29:45+00:00",
    "2023-10-23T00:20:30+00:00",
    "2023-11-07T01:38:21+00:00",
    "2023-11-14T01:24:11+00:00"
  ],
  "abstract": "Emotional intelligence significantly impacts our daily behaviors and interactions. Although Large Language Models (LLMs) are increasingly viewed as a stride toward artificial general intelligence, exhibiting impressive performance in numerous tasks, it is still uncertain if LLMs can genuinely grasp psychological emotional stimuli. Understanding and responding to emotional cues gives humans a distinct advantage in problem-solving. In this paper, we take the first step towards exploring the ability of LLMs to understand emotional stimuli. To this end, we first conduct automatic experiments on 45 tasks using various LLMs, including Flan-T5-Large, Vicuna, Llama 2, BLOOM, ChatGPT, and GPT-4. Our tasks span deterministic and generative applications that represent comprehensive evaluation scenarios. Our automatic experiments show that LLMs have a grasp of emotional intelligence, and their performance can be improved with emotional prompts (which we call \"EmotionPrompt\" that combines the original prompt with emotional stimuli), e.g., 8.00% relative performance improvement in Instruction Induction and 115% in BIG-Bench. In addition to those deterministic tasks that can be automatically evaluated using existing metrics, we conducted a human study with 106 participants to assess the quality of generative tasks using both vanilla and emotional prompts. Our human study results demonstrate that EmotionPrompt significantly boosts the performance of generative tasks (10.9% average improvement in terms of performance, truthfulness, and responsibility metrics). We provide an in-depth discussion regarding why EmotionPrompt works for LLMs and the factors that may influence its performance. We posit that EmotionPrompt heralds a novel avenue for exploring interdisciplinary knowledge for human-LLMs interaction.",
  "categories": [
    "cs.CL",
    "cs.AI",
    "cs.HC"
  ],
  "primary_category": "cs.CL",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11760",
  "pdf_url": null,
  "comment": "Technical report; updated the std error for human study; short version (v1) was accepted by LLM@IJCAI'23; 32 pages; more work: https://llm-enhance.github.io/",
  "num_versions": null,
  "size_before_bytes": 18866521,
  "size_after_bytes": 3377067
}