{
  "title": "Nonlinear $q$-voter model involving nonconformity on networks",
  "authors": [
    "Rinto Anugraha NQZ",
    "Roni Muslim",
    "Henokh Lugo Hariyanto",
    "Fahrudin Nugroho",
    "Idham Syah Alam",
    "Muhammad Ardhi Khalif"
  ],
  "submission_date": "2023-07-27T00:10:48+00:00",
  "revised_dates": [
    "2023-08-02T00:49:20+00:00",
    "2023-08-06T12:54:27+00:00",
    "2025-01-08T02:58:40+00:00"
  ],
  "abstract": "The order-disorder phase transition is a fascinating phenomenon in opinion dynamics models within sociophysics. This transition emerges due to noise parameters, interpreted as social behaviors such as anticonformity and independence (nonconformity) in a social context. In this study, we examine the impact of nonconformist behaviors on the macroscopic states of the system. Both anticonformity and independence are parameterized by a probability \\( p \\), with the model implemented on a complete graph and a scale-free network. Furthermore, we introduce a skepticism parameter \\( s \\), which quantifies a voter's propensity for nonconformity. Our analytical and simulation results reveal that the model exhibits continuous and discontinuous phase transitions for nonzero values of \\( s \\) at specific values of \\( q \\). We estimate the critical exponents using finite-size scaling analysis to classify the model's universality. The findings suggest that the model on the complete graph and the scale-free network share the same universality class as the mean-field Ising model. Additionally, we explore the scaling behavior associated with variations in \\( s \\) and assess the influence of \\( p \\) and \\( s \\) on the system's opinion dynamics.",
  "categories": [
    "physics.soc-ph"
  ],
  "primary_category": "physics.soc-ph",
  "doi": "10.1016/j.physd.2024.134508",
  "journal_ref": "Volume 472, February 2025, 134508",
  "arxiv_id": "2307.14548",
  "pdf_url": "https://arxiv.org/pdf/2307.14548v4",
  "comment": "14 pages and 15 figures",
  "num_versions": null,
  "size_before_bytes": 4663608,
  "size_after_bytes": 594028
}