{
  "title": "VolTS: A Volatility-based Trading System to forecast Stock Markets Trend using Statistics and Machine Learning",
  "authors": [
    "Ivan Letteri"
  ],
  "submission_date": "2023-07-25T11:41:00+00:00",
  "revised_dates": [
    "2023-08-21T00:11:57+00:00"
  ],
  "abstract": "Volatility-based trading strategies have attracted a lot of attention in financial markets due to their ability to capture opportunities for profit from market dynamics. In this article, we propose a new volatility-based trading strategy that combines statistical analysis with machine learning techniques to forecast stock markets trend.\n  The method consists of several steps including, data exploration, correlation and autocorrelation analysis, technical indicator use, application of hypothesis tests and statistical models, and use of variable selection algorithms. In particular, we use the k-means++ clustering algorithm to group the mean volatility of the nine largest stocks in the NYSE and NasdaqGS markets. The resulting clusters are the basis for identifying relationships between stocks based on their volatility behaviour. Next, we use the Granger Causality Test on the clustered dataset with mid-volatility to determine the predictive power of a stock over another stock. By identifying stocks with strong predictive relationships, we establish a trading strategy in which the stock acting as a reliable predictor becomes a trend indicator to determine the buy, sell, and hold of target stock trades.\n  Through extensive backtesting and performance evaluation, we find the reliability and robustness of our volatility-based trading strategy. The results suggest that our approach effectively captures profitable trading opportunities by leveraging the predictive power of volatility clusters, and Granger causality relationships between stocks.\n  The proposed strategy offers valuable insights and practical implications to investors and market participants who seek to improve their trading decisions and capitalize on market trends. It provides valuable insights and practical implications for market participants looking to.",
  "categories": [
    "q-fin.TR",
    "q-fin.PM"
  ],
  "primary_category": "q-fin.TR",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13422",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 6407929,
  "size_after_bytes": 284939
}