{
  "title": "Super-tetragonal Sr4Al2O7: a versatile sacrificial layer for high-integrity freestanding oxide membranes",
  "authors": [
    "Jinfeng Zhang",
    "Ting Lin",
    "Ao Wang",
    "Xiaochao Wang",
    "Qingyu He",
    "Huan Ye",
    "Jingdi Lu",
    "Qing Wang",
    "Zhengguo Liang",
    "Feng Jin",
    "Shengru Chen",
    "Minghui Fan",
    "Er-Jia Guo",
    "Qinghua Zhang",
    "Lin Gu",
    "Zhenlin Luo",
    "Liang Si",
    "Wenbin Wu",
    "Lingfei Wang"
  ],
  "submission_date": "2023-07-27T15:57:26+00:00",
  "revised_dates": [
    "2023-10-06T10:48:25+00:00"
  ],
  "abstract": "Releasing the epitaxial oxide heterostructures from substrate constraints leads to the emergence of various correlated electronic phases and paves the way for integrations with advanced semiconductor technologies. Identifying a suitable water-soluble sacrificial layer, compatible with the high-quality epitaxial growth of oxide heterostructures, is currently the key to the development of large-scale freestanding oxide membranes. In this study, we unveil the super-tetragonal Sr4Al2O7 (SAOT) as a promising water-soluble sacrificial layer. The distinct low-symmetric crystal structure of SAOT enables a superior capability to sustain epitaxial strain, thus allowing for broad tunability in lattice constants. The resultant structural coherency and defect-free interface in perovskite ABO3/SAOT heterostructures effectively restrain crack formations during the water-assisted release of freestanding oxide membranes. For a variety of non-ferroelectric oxide membranes, the crack-free areas can span up to a few millimeters in length scale. These compelling features, combined with the inherent high-water solubility, make SAOT a versatile and feasible sacrificial layer for producing high-quality freestanding oxide membranes, thereby boosting their potential for innovative oxide electronics and flexible device designs.",
  "categories": [
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14966",
  "pdf_url": "https://arxiv.org/pdf/2307.14966v2",
  "comment": "5 figures and SI, it is the second version of this manuscript",
  "num_versions": null,
  "size_before_bytes": 37223684,
  "size_after_bytes": 21451773
}