{
  "title": "Adjoint-based optimal control of contractile elastic bodies. Application to limbless locomotion on frictional substrates",
  "authors": [
    "Ashutosh Bijalwan",
    "Jose J Munoz"
  ],
  "submission_date": "2023-07-27T08:12:14+00:00",
  "revised_dates": [],
  "abstract": "In nature, limbless locomotion is adopted by a wide range of organisms at various length scales. Interestingly, undulatory, crawling and inching/looping gait constitutes a fundamental class of limbless locomotion and is often observed in many species such as caterpillars, earthworms, leeches, larvae, and \\emph{C. elegans}, to name a few. In this work, we developed a computationally efficient 3D Finite Element (FE) based unified framework for the locomotion of limbless organisms on soft substrates. Muscle activity is simulated with a multiplicative decomposition of deformation gradient, which allows mimicking a broad range of locomotion patterns in 3D solids on frictional substrates. In particular, a two-field FE formulation based on positions and velocities is proposed. Governing partial differential equations are transformed into equivalent time-continuous differential-algebraic equations (DAEs). Next, the optimal locomotion strategies are studied in the framework of optimal control theory. We resort to adjoint-based methods and deduce the first-order optimality conditions, that yield a system of DAEs with two-point end conditions. Hidden symplectic structure and Symplectic Euler time integration of optimality conditions have been discussed. The resulting discrete first-order optimality conditions form a non-linear programming problem that is solved efficiently with the Forward Backwards Sweep Method. Finally, some numerical examples are provided to demonstrate the comprehensiveness of the proposed computational framework and investigate the energy-efficient optimal limbless locomotion strategy out of distinct locomotion patterns adopted by limbless organisms.",
  "categories": [
    "math.OC",
    "physics.bio-ph"
  ],
  "primary_category": "math.OC",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14681",
  "pdf_url": "https://arxiv.org/pdf/2307.14681v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 4802575,
  "size_after_bytes": 133605
}