{
  "title": "Mitigating Communications Threats in Decentralized Federated Learning through Moving Target Defense",
  "authors": [
    "Enrique Tomás Martínez Beltrán",
    "Pedro Miguel Sánchez Sánchez",
    "Sergio López Bernal",
    "Gérôme Bovet",
    "Manuel Gil Pérez",
    "Gregorio Martínez Pérez",
    "Alberto Huertas Celdrán"
  ],
  "submission_date": "2023-07-21T17:43:50+00:00",
  "revised_dates": [
    "2023-12-12T01:19:35+00:00"
  ],
  "abstract": "The rise of Decentralized Federated Learning (DFL) has enabled the training of machine learning models across federated participants, fostering decentralized model aggregation and reducing dependence on a server. However, this approach introduces unique communication security challenges that have yet to be thoroughly addressed in the literature. These challenges primarily originate from the decentralized nature of the aggregation process, the varied roles and responsibilities of the participants, and the absence of a central authority to oversee and mitigate threats. Addressing these challenges, this paper first delineates a comprehensive threat model focused on DFL communications. In response to these identified risks, this work introduces a security module to counter communication-based attacks for DFL platforms. The module combines security techniques such as symmetric and asymmetric encryption with Moving Target Defense (MTD) techniques, including random neighbor selection and IP/port switching. The security module is implemented in a DFL platform, Fedstellar, allowing the deployment and monitoring of the federation. A DFL scenario with physical and virtual deployments have been executed, encompassing three security configurations: (i) a baseline without security, (ii) an encrypted configuration, and (iii) a configuration integrating both encryption and MTD techniques. The effectiveness of the security module is validated through experiments with the MNIST dataset and eclipse attacks. The results showed an average F1 score of 95%, with the most secure configuration resulting in CPU usage peaking at 68% (+-9%) in virtual deployments and network traffic reaching 480.8 MB (+-18 MB), effectively mitigating risks associated with eavesdropping or eclipse attacks.",
  "categories": [
    "cs.CR",
    "cs.AI",
    "cs.DC",
    "cs.LG",
    "cs.NI"
  ],
  "primary_category": "cs.CR",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11730",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 2208907,
  "size_after_bytes": 1152864
}