{
  "title": "Tensions with the flat $\\boldsymbolΛ$CDM model from high-redshift cosmography",
  "authors": [
    "G. Bargiacchi",
    "M. G. Dainotti",
    "S. Capozziello"
  ],
  "submission_date": "2023-07-28T07:13:04+00:00",
  "revised_dates": [],
  "abstract": "The longstanding search for the cosmological model that best describes the Universe has been made more intriguing since the recent discovery of the Hubble constant, $H_{0}$, tension observed between the value of $H_{0}$ from the Cosmic Microwave Background and from type Ia supernovae (SNe Ia). Hence, the commonly trusted flat $Λ$CDM model is under investigation. In this scenario, cosmography is a very powerful technique to investigate the evolution of the Universe without any cosmological assumption, thus revealing tensions between observational data and predictions from cosmological models in a completely model-independent way. We here employ a robust cosmographic technique based on an orthogonal logarithmic polynomial expansion of the luminosity distance to fit quasars (QSOs) alone and QSOs combined with Gamma-Ray Bursts (GRBs), SNe Ia, and Baryon Acoustic Oscillations. To apply QSOs and GRBs as probes we use, respectively, the Risaliti-Lusso relation between ultraviolet and X-ray luminosities and the ``Dainotti GRB 3D relation\" among the rest-frame end time of the X-ray plateau emission, its corresponding luminosity, and the peak prompt luminosity. We also correct QSOs and GRBs for selection biases and redshift evolution and we employ both the traditional Gaussian likelihood and the newly discovered best-fit likelihoods for each probe investigated. This comprehensive analysis reveals a strong tension ($> 4 \\, σ$) between our data sets and the flat $Λ$CDM model proving the power of both the cosmographic approach and high-redshift sources, such as QSOs and GRBs, which can probe the Universe at early epochs.",
  "categories": [
    "astro-ph.CO",
    "hep-th"
  ],
  "primary_category": "astro-ph.CO",
  "doi": "10.1093/mnras/stad2326",
  "journal_ref": null,
  "arxiv_id": "2307.15359",
  "pdf_url": "https://arxiv.org/pdf/2307.15359v1",
  "comment": "13 pages, 4 figures, 4 tables. Comments are welcome. Accepted for publication in MNRAS",
  "num_versions": null,
  "size_before_bytes": 7162431,
  "size_after_bytes": 612073
}