{
  "title": "ProtoASNet: Dynamic Prototypes for Inherently Interpretable and Uncertainty-Aware Aortic Stenosis Classification in Echocardiography",
  "authors": [
    "Hooman Vaseli",
    "Ang Nan Gu",
    "S. Neda Ahmadi Amiri",
    "Michael Y. Tsang",
    "Andrea Fung",
    "Nima Kondori",
    "Armin Saadat",
    "Purang Abolmaesumi",
    "Teresa S. M. Tsang"
  ],
  "submission_date": "2023-07-26T18:06:25+00:00",
  "revised_dates": [],
  "abstract": "Aortic stenosis (AS) is a common heart valve disease that requires accurate and timely diagnosis for appropriate treatment. Most current automatic AS severity detection methods rely on black-box models with a low level of trustworthiness, which hinders clinical adoption. To address this issue, we propose ProtoASNet, a prototypical network that directly detects AS from B-mode echocardiography videos, while making interpretable predictions based on the similarity between the input and learned spatio-temporal prototypes. This approach provides supporting evidence that is clinically relevant, as the prototypes typically highlight markers such as calcification and restricted movement of aortic valve leaflets. Moreover, ProtoASNet utilizes abstention loss to estimate aleatoric uncertainty by defining a set of prototypes that capture ambiguity and insufficient information in the observed data. This provides a reliable system that can detect and explain when it may fail. We evaluate ProtoASNet on a private dataset and the publicly available TMED-2 dataset, where it outperforms existing state-of-the-art methods with an accuracy of 80.0% and 79.7%, respectively. Furthermore, ProtoASNet provides interpretability and an uncertainty measure for each prediction, which can improve transparency and facilitate the interactive usage of deep networks to aid clinical decision-making. Our source code is available at: https://github.com/hooman007/ProtoASNet.",
  "categories": [
    "cs.CV"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14433",
  "pdf_url": null,
  "comment": "To be published in MICCAI 2023",
  "num_versions": null,
  "size_before_bytes": 8692642,
  "size_after_bytes": 114489
}