{
  "title": "Errors Dynamics in Affine Group Systems",
  "authors": [
    "Xinghan Li",
    "Jianqi Chen",
    "Han Zhang",
    "Jieqiang Wei",
    "Junfeng Wu"
  ],
  "submission_date": "2023-07-31T11:58:16+00:00",
  "revised_dates": [
    "2023-12-19T02:51:11+00:00"
  ],
  "abstract": "Errors dynamics captures the evolution of the state errors between two distinct trajectories, that are governed by the same system rule but initiated or perturbed differently. In particular, state observer error dynamics analysis in matrix Lie group is fundamental in practice. In this paper, we focus on the error dynamics analysis for an affine group system under external disturbances or random noises. To this end, we first discuss the connections between the notions of affine group systems and linear group systems. We provide two equivalent characterizations of a linear group system. Such characterizations are based on the homeomorphism of its transition flow and linearity of its Lie algebra counterpart, respectively. Next, we investigate the evolution of a linear group system and we assume it is diffused by a Brownian motion in tangent spaces. We further show that the dynamics projected in the Lie algebra is governed by a stochastic differential equation with a linear drift term. We apply these findings in analyzing the error dynamics. Under differentiable disturbance, we derive an ordinary differential equation characterizing the evolution of the projected errors in the Lie algebra. In addition, the counterpart with stochastic disturbances is derived for the projected errors in terms of a stochastic differential equation. Explicit and accurate derivation of error dynamics is provided for matrix group $SE_N(3)$, which plays a vital role especially in robotic applications.",
  "categories": [
    "eess.SY"
  ],
  "primary_category": "eess.SY",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16597",
  "pdf_url": "https://arxiv.org/pdf/2307.16597v2",
  "comment": "8pages,1 figure",
  "num_versions": null,
  "size_before_bytes": 3412009,
  "size_after_bytes": 1579280
}