{
  "title": "Assortment Optimization with Visibility Constraints",
  "authors": [
    "Theo Barre",
    "Omar El Housni",
    "Marouane Ibn Brahim",
    "Andrea Lodi",
    "Danny Segev"
  ],
  "submission_date": "2023-07-25T17:05:17+00:00",
  "revised_dates": [
    "2024-04-03T00:13:36+00:00",
    "2025-02-18T02:02:00+00:00"
  ],
  "abstract": "Motivated by applications in e-retail and online advertising, we study the problem of assortment optimization under visibility constraints, that we refer to as APV. Here, we are given a universe of substitutable products and a stream of customers. The objective is to determine the optimal assortment of products to offer to each customer in order to maximize the total expected revenue, subject to exogenously-given visibility constraints, stating that each product should be shown to a minimum number of customers. We assume that customer choices follow a Multinomial Logit model (MNL). We provide a structural characterization of optimal assortments and present a linear time algorithm for solving APV. To this end, we introduce a novel function called the ``expanded revenue\" of an assortment and establish its supermodularity; our algorithm takes advantage of this structural property. Additionally, we prove that APV can be formulated as a compact linear program. Next, we consider APV with cardinality constraints, which limit the maximum number of products that can be included in an assortment. We prove this problem to be strongly NP-hard and not admitting a Fully Polynomial Time Approximation Scheme (FPTAS), even when all products have identical prices. Subsequently, we devise a Polynomial Time Approximation Scheme (PTAS) for APV under cardinality constraints with identical prices. We also examine the revenue loss resulting from the enforcement of visibility constraints, comparing it to the unconstrained problem. To offset this loss, we propose a novel strategy to distribute the loss incurred among the products subject to visibility constraints, charging each vendor an amount proportional to their product's contribution to the revenue loss.",
  "categories": [
    "math.OC"
  ],
  "primary_category": "math.OC",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13656",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 755245,
  "size_after_bytes": 622243
}