{
  "title": "Toward General-Relativistic Magnetohydrodynamics Simulations in Stationary Non-Vacuum Spacetimes",
  "authors": [
    "Prashant Kocherlakota",
    "Ramesh Narayan",
    "Koushik Chatterjee",
    "Alejandro Cruz-Osorio",
    "Yosuke Mizuno"
  ],
  "submission_date": "2023-07-27T18:32:48+00:00",
  "revised_dates": [
    "2023-10-18T00:34:34+00:00",
    "2024-03-06T01:12:25+00:00"
  ],
  "abstract": "Accretion of magnetized gas on compact astrophysical objects such as black holes has been successfully modeled using general relativistic magnetohydrodynamic (GRMHD) simulations. These simulations have largely been performed in the Kerr metric, which describes the spacetime of a vacuum and stationary spinning black hole (BH) in general relativity (GR). The simulations have revealed important clues on the physics of accretion and jets near the BH event horizon, and have been used to interpret recent Event Horizon Telescope images of the supermassive BHs, M87$^*$ and Sgr A$^*$. GRMHD simulations require the spacetime metric in horizon-penetrating coordinates such that all metric coefficients are regular at the event horizon. The Kerr metric and its electrically charged spinning analog, the Kerr-Newman metric, are currently the only metrics available in such coordinates. We report here horizon-penetrating forms of a large class of stationary, axisymmetric, spinning metrics. These can be used to carry out GRMHD simulations of accretion on spinning, nonvacuum BHs and non-BHs within GR, as well as accretion on spinning objects described by non-GR metric theories of gravity.",
  "categories": [
    "astro-ph.HE",
    "astro-ph.GA",
    "gr-qc"
  ],
  "primary_category": "astro-ph.HE",
  "doi": "10.3847/2041-8213/acfd1f",
  "journal_ref": "ApJL 956, L11 (2023)",
  "arxiv_id": "2307.15140",
  "pdf_url": "https://arxiv.org/pdf/2307.15140v3",
  "comment": "Corrected typo in eqs. 23, C20",
  "num_versions": null,
  "size_before_bytes": 2500813,
  "size_after_bytes": 2502404
}