{
  "title": "Challenges in aligning requirements engineering and verification in a large-scale industrial context",
  "authors": [
    "Giedre Sabaliauskaite",
    "Annabella Loconsole",
    "Emelie Engström",
    "Michael Unterkalmsteiner",
    "Björn Regnell",
    "Per Runeson",
    "Tony Gorschek",
    "Robert Feldt"
  ],
  "submission_date": "2023-07-23T20:08:49+00:00",
  "revised_dates": [],
  "abstract": "[Context and motivation] When developing software, coordination between different organizational units is essential in order to develop a good quality product, on time and within budget. Particularly, the synchronization between requirements and verification processes is crucial in order to assure that the developed software product satisfies customer requirements. [Question/problem] Our research question is: what are the current challenges in aligning the requirements and verification processes? [Principal ideas/results] We conducted an interview study at a large software development company. This paper presents preliminary findings of these interviews that identify key challenges in aligning requirements and verification processes. [Contribution] The result of this study includes a range of challenges faced by the studied organization grouped into the categories: organization and processes, people, tools, requirements process, testing process, change management, traceability, and measurement. The findings of this study can be used by practitioners as a basis for investigating alignment in their organizations, and by scientists in developing approaches for more efficient and effective management of the alignment between requirements and verification.",
  "categories": [
    "cs.SE"
  ],
  "primary_category": "cs.SE",
  "doi": "10.1007/978-3-642-14192-8_14",
  "journal_ref": null,
  "arxiv_id": "2307.12419",
  "pdf_url": null,
  "comment": "Requirements Engineering: Foundation for Software Quality: 16th International Working Conference, REFSQ 2010, Essen, Germany, June 30-July 2, 2010. Proceedings 16 (pp. 128-142). Springer Berlin Heidelberg",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}