{
  "title": "Charge and Entanglement Criticality in a U(1)-Symmetric Hybrid Circuit of Qubits",
  "authors": [
    "Ahana Chakraborty",
    "Kun Chen",
    "Aidan Zabalo",
    "Justin H. Wilson",
    "J. H. Pixley"
  ],
  "submission_date": "2023-07-24T18:00:04+00:00",
  "revised_dates": [
    "2024-11-15T01:09:51+00:00"
  ],
  "abstract": "We study critical properties of the entanglement and charge-sharpening measurement-induced phase transitions in a non-unitary quantum circuit evolving with a U(1) conserved charge. Our numerical estimation of the critical properties of the entanglement transition at finite system sizes appears distinct from the generic non-conserving case and percolation. We provide two possible interpretations of this observation: (a) these two transitions occur at different measurement rates in the thermodynamic limit, but at finite system sizes their critical fans overlap and the critical exponents we probed here show a combination of both the criticality. Nonetheless, the multifractal properties of the entanglement transition remain distinct from the generic case without any symmetry, indicating a unique universality class due to the U(1) symmetry. (b) these two transitions occur at the same measurement rate at any length scale. Within this interpretation, our estimation of all the critical exponents are sharply different than the non-conserving case, again confirming the presence of a new universality class due U(1) symmetry. We compute entanglement critical exponents and correlation functions via various ancilla measures, use a transfer matrix for multifractality, and compute correlators associated with charge sharpening to explain these findings. Through these correlators, we also find evidence consistent with the charge-sharpening transition being of the Berezinskii-Kosterlitz-Thouless type (including the predicted ``jump'' in stiffness), which simultaneously argues for a broad critical fan for this transition. As a result, attempts to measure critical properties in this finite-size system will see anomalously large exponents predicted by our numerical analysis.",
  "categories": [
    "cond-mat.dis-nn",
    "cond-mat.stat-mech",
    "quant-ph"
  ],
  "primary_category": "cond-mat.dis-nn",
  "doi": "10.1103/PhysRevB.110.045135",
  "journal_ref": "Phys. Rev. B 110, 045135 (2024)",
  "arxiv_id": "2307.13038",
  "pdf_url": null,
  "comment": "12+5 pages, 8+6 figures",
  "num_versions": null,
  "size_before_bytes": 15495633,
  "size_after_bytes": 1444519
}