{
  "title": "Engineering 3D Floquet codes by rewinding",
  "authors": [
    "Arpit Dua",
    "Nathanan Tantivasadakarn",
    "Joseph Sullivan",
    "Tyler D. Ellison"
  ],
  "submission_date": "2023-07-25T17:27:40+00:00",
  "revised_dates": [
    "2023-08-15T00:16:41+00:00",
    "2023-08-29T01:00:01+00:00",
    "2024-04-09T01:47:22+00:00"
  ],
  "abstract": "Floquet codes are a novel class of quantum error-correcting codes with dynamically generated logical qubits arising from a periodic schedule of non-commuting measurements. We utilize the interpretation of measurements in terms of condensation of topological excitations and the rewinding of measurement sequences to engineer new examples of Floquet codes. In particular, rewinding is advantageous for obtaining a desired set of instantaneous stabilizer groups on both toric and planar layouts. Our first example is a Floquet code with instantaneous stabilizer codes that have the same topological order as 3D toric code(s). This Floquet code also exhibits a splitting of the topological order of the 3D toric code under the associated sequence of measurements, i.e., an instantaneous stabilizer group of a single copy of 3D toric code in one round transforms into an instantaneous stabilizer group of two copies of 3D toric codes up to nonlocal stabilizers in the following round. We further construct boundaries for this 3D code and argue that stacking it with two copies of 3D subsystem toric code allows for a transversal implementation of the logical non-Clifford $CCZ$ gate. We also show that the coupled-layer construction of the X-cube Floquet code can be modified by a rewinding schedule such that each of the instantaneous stabilizer codes is finite-depth-equivalent to the X-cube model up to toric codes; the X-cube Floquet code exhibits a splitting of the X-cube model into a copy of the X-cube model and toric codes under the measurement sequence. Our final 3D example is a generalization of the 2D Floquet toric code on the honeycomb lattice to 3D, which has instantaneous stabilizer codes with the same topological order as the 3D fermionic toric code.",
  "categories": [
    "quant-ph",
    "cond-mat.str-el"
  ],
  "primary_category": "quant-ph",
  "doi": "10.1103/PRXQuantum.5.020305",
  "journal_ref": "PRX Quantum 5, 020305 (2024)",
  "arxiv_id": "2307.13668",
  "pdf_url": null,
  "comment": "22+7 pages, 28 figures, Mathematica files are available at https://github.com/dua-arpit/floquetcodes , v2 changes: added more details on the rewinding X-cube Floquet code and made minor updates in color code figures in the appendix, v3 changes: minor typos corrected, v4 changes: PRX Quantum version",
  "num_versions": null,
  "size_before_bytes": 23143398,
  "size_after_bytes": 788807
}