{
  "title": "Large-Scale Multi-Fleet Platoon Coordination: A Dynamic Programming Approach",
  "authors": [
    "Ting Bai",
    "Alexander Johansson",
    "Karl Henrik Johansson",
    "Jonas Mårtensson"
  ],
  "submission_date": "2023-07-21T19:15:39+00:00",
  "revised_dates": [],
  "abstract": "Truck platooning is a promising technology that enables trucks to travel in formations with small inter-vehicle distances for improved aerodynamics and fuel economy. The real-world transportation system includes a vast number of trucks owned by different fleet owners, for example, carriers. To fully exploit the benefits of platooning, efficient dispatching strategies that facilitate the platoon formations across fleets are required. This paper presents a distributed framework for addressing multi-fleet platoon coordination in large transportation networks, where each truck has a fixed route and aims to maximize its own fleet's platooning profit by scheduling its waiting times at hubs. The waiting time scheduling problem of individual trucks is formulated as a distributed optimal control problem with continuous decision space and a reward function that takes non-zero values only at discrete points. By suitably discretizing the decision and state spaces, we show that the problem can be solved exactly by dynamic programming, without loss of optimality. Finally, a realistic simulation study is conducted over the Swedish road network with $5,000$ trucks to evaluate the profit and efficiency of the approach. The simulation study shows that, compared to single-fleet platooning, multi-fleet platooning provided by our method achieves around $15$ times higher monetary profit and increases the CO$_2$ emission reductions from $0.4\\%$ to $5.5\\%$. In addition, it shows that the developed approach can be carried out in real-time and thus is suitable for platoon coordination in large transportation systems.",
  "categories": [
    "eess.SY"
  ],
  "primary_category": "eess.SY",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11867",
  "pdf_url": null,
  "comment": "IEEE Transactions on Intelligent Transportation Systems, accepted",
  "num_versions": null,
  "size_before_bytes": 7915063,
  "size_after_bytes": 361292
}