{
  "title": "PredictChain: Empowering Collaboration and Data Accessibility for AI in a Decentralized Blockchain-based Marketplace",
  "authors": [
    "Matthew T. Pisano",
    "Connor J. Patterson",
    "Oshani Seneviratne"
  ],
  "submission_date": "2023-07-27T19:56:18+00:00",
  "revised_dates": [],
  "abstract": "Limited access to computing resources and training data poses significant challenges for individuals and groups aiming to train and utilize predictive machine learning models. Although numerous publicly available machine learning models exist, they are often unhosted, necessitating end-users to establish their computational infrastructure. Alternatively, these models may only be accessible through paid cloud-based mechanisms, which can prove costly for general public utilization. Moreover, model and data providers require a more streamlined approach to track resource usage and capitalize on subsequent usage by others, both financially and otherwise. An effective mechanism is also lacking to contribute high-quality data for improving model performance. We propose a blockchain-based marketplace called \"PredictChain\" for predictive machine-learning models to address these issues. This marketplace enables users to upload datasets for training predictive machine learning models, request model training on previously uploaded datasets, or submit queries to trained models. Nodes within the blockchain network, equipped with available computing resources, will operate these models, offering a range of archetype machine learning models with varying characteristics, such as cost, speed, simplicity, power, and cost-effectiveness. This decentralized approach empowers users to develop improved models accessible to the public, promotes data sharing, and reduces reliance on centralized cloud providers.",
  "categories": [
    "cs.LG",
    "cs.DC"
  ],
  "primary_category": "cs.LG",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15168",
  "pdf_url": "https://arxiv.org/pdf/2307.15168v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 2243118,
  "size_after_bytes": 133719
}