{
  "title": "Do humans and Convolutional Neural Networks attend to similar areas during scene classification: Effects of task and image type",
  "authors": [
    "Romy Müller",
    "Marcel Dürschmidt",
    "Julian Ullrich",
    "Carsten Knoll",
    "Sascha Weber",
    "Steffen Seitz"
  ],
  "submission_date": "2023-07-25T09:02:29+00:00",
  "revised_dates": [],
  "abstract": "Deep Learning models like Convolutional Neural Networks (CNN) are powerful image classifiers, but what factors determine whether they attend to similar image areas as humans do? While previous studies have focused on technological factors, little is known about the role of factors that affect human attention. In the present study, we investigated how the tasks used to elicit human attention maps interact with image characteristics in modulating the similarity between humans and CNN. We varied the intentionality of human tasks, ranging from spontaneous gaze during categorization over intentional gaze-pointing up to manual area selection. Moreover, we varied the type of image to be categorized, using either singular, salient objects, indoor scenes consisting of object arrangements, or landscapes without distinct objects defining the category. The human attention maps generated in this way were compared to the CNN attention maps revealed by explainable artificial intelligence (Grad-CAM). The influence of human tasks strongly depended on image type: For objects, human manual selection produced maps that were most similar to CNN, while the specific eye movement task has little impact. For indoor scenes, spontaneous gaze produced the least similarity, while for landscapes, similarity was equally low across all human tasks. To better understand these results, we also compared the different human attention maps to each other. Our results highlight the importance of taking human factors into account when comparing the attention of humans and CNN.",
  "categories": [
    "cs.CV",
    "cs.AI",
    "cs.HC"
  ],
  "primary_category": "cs.CV",
  "doi": "10.3390/app14062648",
  "journal_ref": "Applied Sciences 14(6) (2024) 2648",
  "arxiv_id": "2307.13345",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}