{
  "title": "VIRD: Immersive Match Video Analysis for High-Performance Badminton Coaching",
  "authors": [
    "Tica Lin",
    "Alexandre Aouididi",
    "Zhutian Chen",
    "Johanna Beyer",
    "Hanspeter Pfister",
    "Jui-Hsien Wang"
  ],
  "submission_date": "2023-07-24T06:03:02+00:00",
  "revised_dates": [
    "2023-08-09T00:12:25+00:00"
  ],
  "abstract": "Badminton is a fast-paced sport that requires a strategic combination of spatial, temporal, and technical tactics. To gain a competitive edge at high-level competitions, badminton professionals frequently analyze match videos to gain insights and develop game strategies. However, the current process for analyzing matches is time-consuming and relies heavily on manual note-taking, due to the lack of automatic data collection and appropriate visualization tools. As a result, there is a gap in effectively analyzing matches and communicating insights among badminton coaches and players. This work proposes an end-to-end immersive match analysis pipeline designed in close collaboration with badminton professionals, including Olympic and national coaches and players. We present VIRD, a VR Bird (i.e., shuttle) immersive analysis tool, that supports interactive badminton game analysis in an immersive environment based on 3D reconstructed game views of the match video. We propose a top-down analytic workflow that allows users to seamlessly move from a high-level match overview to a detailed game view of individual rallies and shots, using situated 3D visualizations and video. We collect 3D spatial and dynamic shot data and player poses with computer vision models and visualize them in VR. Through immersive visualizations, coaches can interactively analyze situated spatial data (player positions, poses, and shot trajectories) with flexible viewpoints while navigating between shots and rallies effectively with embodied interaction. We evaluated the usefulness of VIRD with Olympic and national-level coaches and players in real matches. Results show that immersive analytics supports effective badminton match analysis with reduced context-switching costs and enhances spatial understanding with a high sense of presence.",
  "categories": [
    "cs.HC",
    "cs.GR"
  ],
  "primary_category": "cs.HC",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12539",
  "pdf_url": null,
  "comment": "To Appear in IEEE Transactions on Visualization and Computer Graphics (IEEE VIS), 2023",
  "num_versions": null,
  "size_before_bytes": 49695218,
  "size_after_bytes": 857349
}