{
  "title": "On the Vulnerability of Fairness Constrained Learning to Malicious Noise",
  "authors": [
    "Avrim Blum",
    "Princewill Okoroafor",
    "Aadirupa Saha",
    "Kevin Stangl"
  ],
  "submission_date": "2023-07-21T20:26:54+00:00",
  "revised_dates": [
    "2023-07-28T00:06:38+00:00",
    "2024-08-26T00:01:34+00:00"
  ],
  "abstract": "We consider the vulnerability of fairness-constrained learning to small amounts of malicious noise in the training data. Konstantinov and Lampert (2021) initiated the study of this question and presented negative results showing there exist data distributions where for several fairness constraints, any proper learner will exhibit high vulnerability when group sizes are imbalanced. Here, we present a more optimistic view, showing that if we allow randomized classifiers, then the landscape is much more nuanced. For example, for Demographic Parity we show we can incur only a $Θ(α)$ loss in accuracy, where $α$ is the malicious noise rate, matching the best possible even without fairness constraints. For Equal Opportunity, we show we can incur an $O(\\sqrtα)$ loss, and give a matching $Ω(\\sqrtα)$lower bound. In contrast, Konstantinov and Lampert (2021) showed for proper learners the loss in accuracy for both notions is $Ω(1)$. The key technical novelty of our work is how randomization can bypass simple \"tricks\" an adversary can use to amplify his power. We also consider additional fairness notions including Equalized Odds and Calibration. For these fairness notions, the excess accuracy clusters into three natural regimes $O(α)$,$O(\\sqrtα)$ and $O(1)$. These results provide a more fine-grained view of the sensitivity of fairness-constrained learning to adversarial noise in training data.",
  "categories": [
    "cs.LG",
    "cs.AI",
    "cs.CR",
    "cs.CY"
  ],
  "primary_category": "cs.LG",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11892",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 11583869,
  "size_after_bytes": 625567
}