{
  "title": "Unconventional superconductivity protected from disorder on the kagome lattice",
  "authors": [
    "Sofie Castro Holbæk",
    "Morten H. Christensen",
    "Andreas Kreisel",
    "Brian M. Andersen"
  ],
  "submission_date": "2023-07-24T14:59:27+00:00",
  "revised_dates": [
    "2023-10-27T00:35:14+00:00"
  ],
  "abstract": "Motivated by the recent discovery of superconductivity in the kagome $A$V$_3$Sb$_5$ ($A$: K, Rb, Cs) metals, we perform a theoretical study of the symmetry-allowed superconducting orders on the two-dimensional kagome lattice with focus on their response to disorder. We uncover a qualitative difference between the robustness of intraband spin-singlet (even-parity) and spin-triplet (odd-parity) unconventional superconductivity to atomic-scale nonmagnetic disorder. Due to the particular sublattice character of the electronic states on the kagome lattice, disorder in spin-singlet superconducting phases is only weakly pair-breaking despite the fact that the gap structure features sign changes. By contrast, spin-triplet condensates remain fragile to disorder on the kagome lattice. We demonstrate these effects in terms of the absence of impurity bound states and an associated weak disorder-induced $T_c$-suppression for spin-singlet order. We also discuss the consequences for quasi-particle interference and their inherent tendency for momentum-space anisotropy due to sublattice effects on the kagome lattice. For unconventional kagome superconductors, our results imply that any allowed spin-singlet order, including for example $d+id$-wave superconductivity, exhibits a disorder-response qualitatively similar to standard conventional $s$-wave superconductors.",
  "categories": [
    "cond-mat.supr-con",
    "cond-mat.str-el"
  ],
  "primary_category": "cond-mat.supr-con",
  "doi": "10.1103/PhysRevB.108.144508",
  "journal_ref": "Phys. Rev. B 108, 144508 (2023)",
  "arxiv_id": "2307.12861",
  "pdf_url": null,
  "comment": "16 pages, 12 figures",
  "num_versions": null,
  "size_before_bytes": 5037293,
  "size_after_bytes": 407110
}