{
  "title": "An Empirical Study on Bugs Inside PyTorch: A Replication Study",
  "authors": [
    "Sharon Chee Yin Ho",
    "Vahid Majdinasab",
    "Mohayeminul Islam",
    "Diego Elias Costa",
    "Emad Shihab",
    "Foutse Khomh",
    "Sarah Nadi",
    "Muhammad Raza"
  ],
  "submission_date": "2023-07-25T19:23:55+00:00",
  "revised_dates": [
    "2023-08-02T00:32:38+00:00"
  ],
  "abstract": "Software systems are increasingly relying on deep learning components, due to their remarkable capability of identifying complex data patterns and powering intelligent behaviour. A core enabler of this change in software development is the availability of easy-to-use deep learning libraries. Libraries like PyTorch and TensorFlow empower a large variety of intelligent systems, offering a multitude of algorithms and configuration options, applicable to numerous domains of systems. However, bugs in those popular deep learning libraries also may have dire consequences for the quality of systems they enable; thus, it is important to understand how bugs are identified and fixed in those libraries.\n  Inspired by a study of Jia et al., which investigates the bug identification and fixing process at TensorFlow, we characterize bugs in the PyTorch library, a very popular deep learning framework. We investigate the causes and symptoms of bugs identified during PyTorch's development, and assess their locality within the project, and extract patterns of bug fixes. Our results highlight that PyTorch bugs are more like traditional software projects bugs, than related to deep learning characteristics. Finally, we also compare our results with the study on TensorFlow, highlighting similarities and differences across the bug identification and fixing process.",
  "categories": [
    "cs.SE",
    "cs.AI"
  ],
  "primary_category": "cs.SE",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13777",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1876950,
  "size_after_bytes": 780480
}