{
  "title": "Ferroelectricity in tetragonal ZrO$_2$ thin films",
  "authors": [
    "Ali El Boutaybi",
    "Thomas Maroutian",
    "Ludovic Largeau",
    "Nathaniel Findling",
    "Jean-Blaise Brubach",
    "Rebecca Cervasio",
    "Alban Degezelle",
    "Sylvia Matzen",
    "Laurent Vivien",
    "Pascale Roy",
    "Panagiotis Karamanis",
    "Michel Rérat",
    "Philippe Lecoeur"
  ],
  "submission_date": "2023-07-31T08:38:10+00:00",
  "revised_dates": [],
  "abstract": "We report on the crystal structure and ferroelectric properties of epitaxial ZrO$_2$ films ranging from 7 to 42 nm thickness grown on La$_{0.67}$Sr$_{0.33}$MnO$_3$-buffered (110)-oriented SrTiO$_3$ substrate. By employing X-ray diffraction, we confirm a tetragonal phase at all investigated thicknesses, with slight in-plane strain due to the substrate in the thinnest films. Further confirmation of the tetragonal phase was obtained through Infrared absorption spectroscopy with synchrotron light, performed on ZrO$_2$ membrane transferred onto a high resistive Silicon substrate. Up to a thickness of 31 nm, the ZrO$_2$ epitaxial films exhibit ferroelectric behavior, at variance with the antiferroelectric behavior reported previously for the tetragonal phase in polycrystalline films. However, the ferroelectricity is found here to diminish with increasing film thickness, with a polarization of about 13 $μ$C.cm$^{-2}$ and down to 1 $μ$C.cm$^{-2}$ for 7 nm and 31 nm-thick ZrO$_2$ films, respectively. This highlights the role of thickness reduction, substrate strain, and surface effects in promoting polarization in the tetragonal ZrO$_2$ thin films. These findings provide new insights into the ferroelectric properties and structure of ZrO$_2$ thin films, and open up new directions to investigate the origin of ferroelectricity in ZrO$_2$ and to optimize this material for future applications.",
  "categories": [
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16492",
  "pdf_url": "https://arxiv.org/pdf/2307.16492v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 2349364,
  "size_after_bytes": 101888
}