{
  "title": "Probing the Consistency of Cosmological Contours for Supernova Cosmology",
  "authors": [
    "P. Armstrong",
    "H. Qu",
    "D. Brout",
    "T. M. Davis",
    "R. Kessler",
    "A. G. Kim",
    "C. Lidman",
    "M. Sako",
    "B. E. Tucker"
  ],
  "submission_date": "2023-07-25T23:29:41+00:00",
  "revised_dates": [],
  "abstract": "As the scale of cosmological surveys increases, so does the complexity in the analyses. This complexity can often make it difficult to derive the underlying principles, necessitating statistically rigorous testing to ensure the results of an analysis are consistent and reasonable. This is particularly important in multi-probe cosmological analyses like those used in the Dark Energy Survey and the upcoming Legacy Survey of Space and Time, where accurate uncertainties are vital. In this paper, we present a statistically rigorous method to test the consistency of contours produced in these analyses, and apply this method to the Pippin cosmological pipeline used for Type Ia supernova cosmology with the Dark Energy Survey. We make use of the Neyman construction, a frequentist methodology that leverages extensive simulations to calculate confidence intervals, to perform this consistency check. A true Neyman construction is too computationally expensive for supernova cosmology, so we develop a method for approximating a Neyman construction with far fewer simulations. We find that for a simulated data-set, the 68% contour reported by the Pippin pipeline and the 68% confidence region produced by our approximate Neyman construction differ by less than a percent near the input cosmology, however show more significant differences far from the input cosmology, with a maximal difference of 0.05 in $Ω_{M}$, and 0.07 in $w$. This divergence is most impactful for analyses of cosmological tensions, but its impact is mitigated when combining supernovae with other cross-cutting cosmological probes, such as the Cosmic Microwave Background.",
  "categories": [
    "astro-ph.CO"
  ],
  "primary_category": "astro-ph.CO",
  "doi": "10.1017/pasa.2023.40",
  "journal_ref": "Publications of the Astronomical Society of Australia (2023) 1-9",
  "arxiv_id": "2307.13862",
  "pdf_url": null,
  "comment": "9 pages, 11 figures, 4 tables. For source code see https://github.com/dessn/BiasValidation",
  "num_versions": null,
  "size_before_bytes": 5636323,
  "size_after_bytes": 508247
}