{
  "title": "Fast and Fourier: Extreme Mass Ratio Inspiral Waveforms in the Frequency Domain",
  "authors": [
    "Lorenzo Speri",
    "Michael L. Katz",
    "Alvin J. K. Chua",
    "Scott A. Hughes",
    "Niels Warburton",
    "Jonathan E. Thompson",
    "Christian E. A. Chapman-Bird",
    "Jonathan R. Gair"
  ],
  "submission_date": "2023-07-24T07:56:07+00:00",
  "revised_dates": [
    "2024-01-17T02:15:43+00:00"
  ],
  "abstract": "Extreme Mass Ratio Inspirals (EMRIs) are one of the key sources for future space-based gravitational wave interferometers. Measurements of EMRI gravitational waves are expected to determine the characteristics of their sources with sub-percent precision. However, their waveform generation is challenging due to the long duration of the signal and the high harmonic content. Here, we present the first ready-to-use Schwarzschild eccentric EMRI waveform implementation in the frequency domain for use with either graphics processing units (GPUs) or central processing units (CPUs). We present the overall waveform implementation and test the accuracy and performance of the frequency domain waveforms against the time domain implementation. On GPUs, the frequency domain waveform takes in median $0.044$ seconds to generate and is twice as fast to compute as its time domain counterpart when considering massive black hole masses $\\geq 2 \\times 10^6 \\,{\\rm M_\\odot}$ and initial eccentricities $e_0 > 0.2$. On CPUs, the median waveform evaluation time is $5$ seconds, and it is five times faster in the frequency domain than in the time domain. Using a sparser frequency array can further speed up the waveform generation, reaching up to $ 0.3$ seconds. This enables us to perform, for the first time, EMRI parameter inference with fully relativistic waveforms on CPUs. Future EMRI models which encompass wider source characteristics (particularly black hole spin and generic orbit geometries) will require significantly more harmonics. Frequency-domain models will be essential analysis tools for these astrophysically realistic and important signals.",
  "categories": [
    "gr-qc",
    "astro-ph.HE",
    "astro-ph.IM"
  ],
  "primary_category": "gr-qc",
  "doi": "10.3389/fams.2023.1266739",
  "journal_ref": "Front. Appl. Math. Stat. 9 (2023)",
  "arxiv_id": "2307.12585",
  "pdf_url": null,
  "comment": "23 pages, 6 figures",
  "num_versions": null,
  "size_before_bytes": 19205235,
  "size_after_bytes": 707006
}