{
  "title": "General relativistic bubble growth in cosmological phase transitions",
  "authors": [
    "Lorenzo Giombi",
    "Mark Hindmarsh"
  ],
  "submission_date": "2023-07-22T13:50:06+00:00",
  "revised_dates": [
    "2023-08-30T00:24:54+00:00"
  ],
  "abstract": "We use a full general relativistic framework to study the self-similar expansion of bubbles of the stable phase into a flat Friedmann-Lemaître-Robertson-Walker Universe in a first order phase transition in the early Universe. With a simple linear barotropic equation of state in both phases, and in the limit of a phase boundary of negligible width, we find that self-similar solutions exist, which are qualitatively similar to the analogous solutions in Minkowski space, but with distinguishing features. Rarefaction waves extend to the centre of the bubble, while spatial sections near the centre of the bubble have negative curvature. Gravitational effects redistribute the kinetic energy of the fluid around the bubble, and can change the kinetic energy fraction significantly. The kinetic energy fraction of the gravitating solution can be enhanced over the analogous Minkowski solution by as much as $\\mathcal{O}(1)$, and suppressed by a factor as larger as $\\mathcal{O}(10)$ in case of fast detonations. The amount of negative spatial curvature at the centre of the bubble is of the same order of magnitude of the naive expectation based on considerations of the energy density perturbation in Minkowski solutions, with gravitating deflagrations less negatively curved, and detonations more. We infer that general relativistic effects might have a significant impact on accurate calculations of the gravitational wave power spectrum when the bubble size becomes comparable to the cosmological Hubble radius, affecting the primary generation from the fluid shear stress, and inducing secondary generation by scalar perturbations.",
  "categories": [
    "astro-ph.CO",
    "gr-qc"
  ],
  "primary_category": "astro-ph.CO",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12080",
  "pdf_url": null,
  "comment": "42 pages, 11 figures",
  "num_versions": null,
  "size_before_bytes": 4810585,
  "size_after_bytes": 415589
}