{
  "title": "Chasing rainbows and ocean glints: Inner working angle constraints for the Habitable Worlds Observatory",
  "authors": [
    "Sophia R. Vaughan",
    "Timothy D. Gebhard",
    "Kimberly Bott",
    "Sarah L. Casewell",
    "Nicolas B. Cowan",
    "David S. Doelman",
    "Matthew Kenworthy",
    "Johan Mazoyer",
    "Maxwell A. Millar-Blanchaer",
    "Victor J. H. Trees",
    "Daphne M. Stam",
    "Olivier Absil",
    "Lisa Altinier",
    "Pierre Baudoz",
    "Ruslan Belikov",
    "Alexis Bidot",
    "Jayne L. Birkby",
    "Markus J. Bonse",
    "Bernhard Brandl",
    "Alexis Carlotti",
    "Elodie Choquet",
    "Dirk van Dam",
    "Niyati Desai",
    "Kevin Fogarty",
    "J. Fowler",
    "Kyle van Gorkom",
    "Yann Gutierrez",
    "Olivier Guyon",
    "Sebastiaan Y. Haffert",
    "Olivier Herscovici-Schiller",
    "Adrien Hours",
    "Roser Juanola-Parramon",
    "Evangelia Kleisioti",
    "Lorenzo König",
    "Maaike van Kooten",
    "Mariya Krasteva",
    "Iva Laginja",
    "Rico Landman",
    "Lucie Leboulleux",
    "David Mouillet",
    "Mamadou N'Diaye",
    "Emiel H. Por",
    "Laurent Pueyo",
    "Frans Snik"
  ],
  "submission_date": "2023-07-27T18:17:31+00:00",
  "revised_dates": [],
  "abstract": "NASA is engaged in planning for a Habitable Worlds Observatory (HabWorlds), a coronagraphic space mission to detect rocky planets in habitable zones and establish their habitability. Surface liquid water is central to the definition of planetary habitability. Photometric and polarimetric phase curves of starlight reflected by an exoplanet can reveal ocean glint, rainbows and other phenomena caused by scattering by clouds or atmospheric gas. Direct imaging missions are optimised for planets near quadrature, but HabWorlds' coronagraph may obscure the phase angles where such optical features are strongest. The range of accessible phase angles for a given exoplanet will depend on the planet's orbital inclination and/or the coronagraph's inner working angle (IWA). We use a recently-created catalog relevant to HabWorlds of 164 stars to estimate the number of exo-Earths that could be searched for ocean glint, rainbows, and polarization effects due to Rayleigh scattering. We find that the polarimetric Rayleigh scattering peak is accessible in most of the exo-Earth planetary systems. The rainbow due to water clouds at phase angles of ${\\sim}20-60^\\circ$ would be accessible with HabWorlds for a planet with an Earth equivalent instellation in ${\\sim}{46}$ systems, while the ocean glint signature at phase angles of ${\\sim}130-170^\\circ$ would be accessible in ${\\sim}{16}$ systems, assuming an IWA${=}62$ mas ($3λ/D$). Improving the IWA${=}41$ mas ($2λ/D$) increases accessibility to rainbows and glints by factors of approximately 2 and 3, respectively. By observing these scattering features, HabWorlds could detect a surface ocean and water cycle, key indicators of habitability.",
  "categories": [
    "astro-ph.EP"
  ],
  "primary_category": "astro-ph.EP",
  "doi": "10.1093/mnras/stad2127",
  "journal_ref": null,
  "arxiv_id": "2307.15137",
  "pdf_url": "https://arxiv.org/pdf/2307.15137v1",
  "comment": "MNRAS accepted, 9 pages, 8 figures, 3 tables",
  "num_versions": null,
  "size_before_bytes": 2948084,
  "size_after_bytes": 1335109
}