{
  "title": "WC-SBERT: Zero-Shot Text Classification via SBERT with Self-Training for Wikipedia Categories",
  "authors": [
    "Te-Yu Chi",
    "Yu-Meng Tang",
    "Chia-Wen Lu",
    "Qiu-Xia Zhang",
    "Jyh-Shing Roger Jang"
  ],
  "submission_date": "2023-07-28T04:17:41+00:00",
  "revised_dates": [],
  "abstract": "Our research focuses on solving the zero-shot text classification problem in NLP, with a particular emphasis on innovative self-training strategies. To achieve this objective, we propose a novel self-training strategy that uses labels rather than text for training, significantly reducing the model's training time. Specifically, we use categories from Wikipedia as our training set and leverage the SBERT pre-trained model to establish positive correlations between pairs of categories within the same text, facilitating associative training. For new test datasets, we have improved the original self-training approach, eliminating the need for prior training and testing data from each target dataset. Instead, we adopt Wikipedia as a unified training dataset to better approximate the zero-shot scenario. This modification allows for rapid fine-tuning and inference across different datasets, greatly reducing the time required for self-training. Our experimental results demonstrate that this method can adapt the model to the target dataset within minutes. Compared to other BERT-based transformer models, our approach significantly reduces the amount of training data by training only on labels, not the actual text, and greatly improves training efficiency by utilizing a unified training set. Additionally, our method achieves state-of-the-art results on both the Yahoo Topic and AG News datasets.",
  "categories": [
    "cs.CL",
    "cs.AI"
  ],
  "primary_category": "cs.CL",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15293",
  "pdf_url": "https://arxiv.org/pdf/2307.15293v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 3352818,
  "size_after_bytes": 163750
}