{
  "title": "A Phase-Coded Time-Domain Interleaved OTFS Waveform with Improved Ambiguity Function",
  "authors": [
    "Jiajun Zhu",
    "Yanqun Tang",
    "Chao Yang",
    "Chi Zhang",
    "Haoran Yin",
    "Jiaojiao Xiong",
    "Yuhua Chen"
  ],
  "submission_date": "2023-07-26T09:57:24+00:00",
  "revised_dates": [
    "2023-09-26T00:21:36+00:00"
  ],
  "abstract": "Integrated sensing and communication (ISAC) is a significant application scenario in future wireless communication networks, and sensing capability of a waveform is always evaluated by the ambiguity function. To enhance the sensing performance of the orthogonal time frequency space (OTFS) waveform, we propose a novel time-domain interleaved cyclic-shifted P4-coded OTFS (TICP4-OTFS) with improved ambiguity function. TICP4-OTFS can achieve superior autocorrelation features in both the time and frequency domains by exploiting the multicarrier-like form of OTFS after interleaved and the favorable autocorrelation attributes of the P4 code. Furthermore, we present the vectorized formulation of TICP4-OTFS modulation as well as its signal structure in each domain. Numerical simulations show that our proposed TICP4-OTFS waveform outperforms OTFS with a narrower mainlobe as well as lower and more distant sidelobes in terms of delay and Doppler-dimensional ambiguity functions, and an instance of range estimation using pulse compression is illustrated to exhibit the proposed waveform\\u2019s greater resolution. Besides, TICP4-OTFS achieves better performance of bit error rate for communication in low signal-to-noise ratio (SNR) scenarios.",
  "categories": [
    "eess.SP"
  ],
  "primary_category": "eess.SP",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14076",
  "pdf_url": null,
  "comment": "This paper has been accepted by 2023 IEEE Globecom Workshops (GC Wkshps): Workshop on Integrated Sensing and Communications for Internet of Things",
  "num_versions": null,
  "size_before_bytes": 2209894,
  "size_after_bytes": 641932
}