{
  "title": "Modeling the Chromosphere and Transition Region of Planet-hosting Star GJ 436",
  "authors": [
    "Dominik Hintz",
    "Sarah Peacock",
    "Travis Barman",
    "Birgit Fuhrmeister",
    "Evangelos Nagel",
    "Andreas Schweitzer",
    "Sandra V. Jeffers",
    "Ignasi Ribas",
    "Ansgar Reiners",
    "Andreas Quirrenbach",
    "Pedro J. Amado",
    "Victor J. S. Bejar",
    "Jose A. Caballero",
    "Artie P. Hatzes",
    "David Montes"
  ],
  "submission_date": "2023-07-25T23:12:25+00:00",
  "revised_dates": [],
  "abstract": "Ahead of upcoming space missions intending to conduct observations of low-mass stars in the ultraviolet (UV) spectral region it becomes imperative to simultaneously conduct atmospheric modeling from the UV to the visible (VIS) and near-infrared (NIR). Investigations on extended spectral regions will help to improve the overall understanding of the diversity of spectral lines arising from very different atmospheric temperature regions. Here we investigate atmosphere models with a chromosphere and transition region for the M2.5V star GJ 436, which hosts a close-in Hot Neptune. The atmosphere models are guided by observed spectral features from the UV to the VIS/NIR originating in the chromosphere and transition region of GJ 436. High-resolution observations from the Hubble Space Telescope and Calar Alto high-Resolution search for M dwarfs with Exo-earths with Near-infrared and optical Echelle Spectrographs (CARMENES) are used to obtain an appropriate model spectrum for the investigated M dwarf. We use a large set of atomic species considered in nonlocal thermodynamic equilibrium conditions within our PHOENIX model computations to approximate the physics within the low-density atmospheric regions. In order to obtain an overall match for the nonsimultaneous observations, it is necessary to apply a linear combination of two model spectra, where one of them better reproduces the UV lines while the other better represents the lines from the VIS/NIR range. This is needed to adequately handle different activity states across the observations.",
  "categories": [
    "astro-ph.SR",
    "astro-ph.EP"
  ],
  "primary_category": "astro-ph.SR",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13857",
  "pdf_url": null,
  "comment": "13 pages, 7 figures, accepted for publication in ApJ",
  "num_versions": null,
  "size_before_bytes": 563250,
  "size_after_bytes": 345826
}