{
  "title": "An SU(2)-symmetric Semidefinite Programming Hierarchy for Quantum Max Cut",
  "authors": [
    "Jun Takahashi",
    "Chaithanya Rayudu",
    "Cunlu Zhou",
    "Robbie King",
    "Kevin Thompson",
    "Ojas Parekh"
  ],
  "submission_date": "2023-07-28T17:26:31+00:00",
  "revised_dates": [
    "2023-08-14T15:16:09+00:00"
  ],
  "abstract": "Understanding and approximating extremal energy states of local Hamiltonians is a central problem in quantum physics and complexity theory. Recent work has focused on developing approximation algorithms for local Hamiltonians, and in particular the ``Quantum Max Cut'' (QMax-Cut) problem, which is closely related to the antiferromagnetic Heisenberg model. In this work, we introduce a family of semidefinite programming (SDP) relaxations based on the Navascues-Pironio-Acin (NPA) hierarchy which is tailored for QMaxCut by taking into account its SU(2) symmetry. We show that the hierarchy converges to the optimal QMaxCut value at a finite level, which is based on a new characterization of the algebra of SWAP operators. We give several analytic proofs and computational results showing exactness/inexactness of our hierarchy at the lowest level on several important families of graphs.\n  We also discuss relationships between SDP approaches for QMaxCut and frustration-freeness in condensed matter physics and numerically demonstrate that the SDP-solvability practically becomes an efficiently-computable generalization of frustration-freeness. Furthermore, by numerical demonstration we show the potential of SDP algorithms to perform as an approximate method to compute physical quantities and capture physical features of some Heisenberg-type statistical mechanics models even away from the frustration-free regions.",
  "categories": [
    "quant-ph"
  ],
  "primary_category": "quant-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15688",
  "pdf_url": "https://arxiv.org/pdf/2307.15688v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 12544539,
  "size_after_bytes": 792574
}