{
  "title": "Rechargeable Li/Cl$_2$ battery down to -80 °C",
  "authors": [
    "Peng Liang",
    "Guanzhou Zhu",
    "Cheng-Liang Huang",
    "Yuan-Yao Li",
    "Hao Sun",
    "Bin Yuan",
    "Shu-Chi Wu",
    "Jiachen Li",
    "Feifei Wang",
    "Bing-Joe Hwang",
    "Hongjie Dai"
  ],
  "submission_date": "2023-07-24T17:20:15+00:00",
  "revised_dates": [],
  "abstract": "Low temperature rechargeable batteries are important to life in cold climates, polar/deep-sea expeditions and space explorations. Here, we report ~ 3.5 - 4 V rechargeable lithium/chlorine (Li/Cl2) batteries operating down to -80 °C, employing Li metal negative electrode, a novel CO2 activated porous carbon (KJCO2) as the positive electrode, and a high ionic conductivity (~ 5 to 20 mS cm-1 from -80 °C to 25 °C) electrolyte comprised of 1 M aluminum chloride (AlCl3), 0.95 M lithium chloride (LiCl), and 0.05 M lithium bis(fluorosulfonyl)imide (LiFSI) in low melting point (-104.5 °C) thionyl chloride (SOCl2). Between room-temperature and -80 °C, the Li/Cl2 battery delivered up to ~ 30,000 - 4,500 mAh g-1 first discharge capacity and a 1,200 - 5,000 mAh g-1 reversible capacity (discharge voltages in ~ 3.5 to 3.1 V) over up to 130 charge-discharge cycles. Mass spectrometry and X-ray photoelectron spectroscopy (XPS) probed Cl2 trapped in the porous carbon upon LiCl electro-oxidation during charging. At lower temperature down to -80 °C, SCl2/S2Cl2 and Cl2 generated by electro-oxidation in the charging step were trapped in porous KJCO2 carbon, allowing for reversible reduction to afford a high discharge voltage plateau near ~ 4 V with up to ~ 1000 mAh g-1 capacity for SCl2/S2Cl2 reduction and up to ~ 4000 mAh g-1 capacity at ~ 3.1 V plateau for Cl2 reduction. Towards practical use, we made CR2032 Li/Cl2 battery cells to drive digital watches at -40 °C and light emitting diode at -80 °C, opening Li/Cl2 secondary batteries for ultra-cold conditions.",
  "categories": [
    "physics.app-ph"
  ],
  "primary_category": "physics.app-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12947",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}