{
  "title": "HeteFedRec: Federated Recommender Systems with Model Heterogeneity",
  "authors": [
    "Wei Yuan",
    "Liang Qu",
    "Lizhen Cui",
    "Yongxin Tong",
    "Xiaofang Zhou",
    "Hongzhi Yin"
  ],
  "submission_date": "2023-07-24T14:00:07+00:00",
  "revised_dates": [
    "2023-11-15T01:11:56+00:00",
    "2023-12-06T01:22:23+00:00"
  ],
  "abstract": "Owing to the nature of privacy protection, federated recommender systems (FedRecs) have garnered increasing interest in the realm of on-device recommender systems. However, most existing FedRecs only allow participating clients to collaboratively train a recommendation model of the same public parameter size. Training a model of the same size for all clients can lead to suboptimal performance since clients possess varying resources. For example, clients with limited training data may prefer to train a smaller recommendation model to avoid excessive data consumption, while clients with sufficient data would benefit from a larger model to achieve higher recommendation accuracy. To address the above challenge, this paper introduces HeteFedRec, a novel FedRec framework that enables the assignment of personalized model sizes to participants. In HeteFedRec, we present a heterogeneous recommendation model aggregation strategy, including a unified dual-task learning mechanism and a dimensional decorrelation regularization, to allow knowledge aggregation among recommender models of different sizes. Additionally, a relation-based ensemble knowledge distillation method is proposed to effectively distil knowledge from heterogeneous item embeddings. Extensive experiments conducted on three real-world recommendation datasets demonstrate the effectiveness and efficiency of HeteFedRec in training federated recommender systems under heterogeneous settings.",
  "categories": [
    "cs.IR"
  ],
  "primary_category": "cs.IR",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12810",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 12068491,
  "size_after_bytes": 4997710
}