{
  "title": "A grid-overlay finite difference method for the fractional Laplacian on arbitrary bounded domains",
  "authors": [
    "Weizhang Huang",
    "Jinye Shen"
  ],
  "submission_date": "2023-07-26T18:14:52+00:00",
  "revised_dates": [
    "2024-04-08T00:09:19+00:00"
  ],
  "abstract": "A grid-overlay finite difference method is proposed for the numerical approximation of the fractional Laplacian on arbitrary bounded domains. The method uses an unstructured simplicial mesh and an overlay uniform grid for the underlying domain and constructs the approximation based on a uniform-grid finite difference approximation and a data transfer from the unstructured mesh to the uniform grid. The method takes full advantages of both uniform-grid finite difference approximation in efficient matrix-vector multiplication via the fast Fourier transform and unstructured meshes for complex geometries and mesh adaptation. It is shown that its stiffness matrix is similar to a symmetric and positive definite matrix and thus invertible if the data transfer has full column rank and positive column sums. Piecewise linear interpolation is studied as a special example for the data transfer. It is proved that the full column rank and positive column sums of linear interpolation is guaranteed if the spacing of the uniform grid is smaller than or equal to a positive bound proportional to the minimum element height of the unstructured mesh. Moreover, a sparse preconditioner is proposed for the iterative solution of the resulting linear system for the homogeneous Dirichlet problem of the fractional Laplacian. Numerical examples demonstrate that the new method has similar convergence behavior as existing finite difference and finite element methods and that the sparse preconditioning is effective. Furthermore, the new method can readily be incorporated with existing mesh adaptation strategies. Numerical results obtained by combining with the so-called MMPDE moving mesh method are also presented.",
  "categories": [
    "math.NA"
  ],
  "primary_category": "math.NA",
  "doi": "10.1137/23M1558562",
  "journal_ref": "SIAM Journal on Scientific Computing, 46 (2024), A744-A769",
  "arxiv_id": "2307.14437",
  "pdf_url": null,
  "comment": "27 pages",
  "num_versions": null,
  "size_before_bytes": 5008744,
  "size_after_bytes": 167189
}