{
  "title": "Ab-initio predictions of spin relaxation, dephasing and diffusion in solids",
  "authors": [
    "Junqing Xu",
    "Yuan Ping"
  ],
  "submission_date": "2023-07-30T20:15:24+00:00",
  "revised_dates": [],
  "abstract": "Spin relaxation, dephasing and diffusion are at the heart of spin-based information technology. Accurate theoretical approaches to simulate spin lifetimes ($τ_s$), determining how fast the spin polarization and phase information will be lost, are important to the understandings of underlying mechanism of these spin processes, and invaluable to search for promising candidates of spintronic materials. Recently, we develop a first-principles real-time density-matrix (FPDM) approach to simulate spin dynamics for general solid-state systems. Through the complete first-principles' descriptions of light-matter interaction and scattering processes including electron-phonon, electronimpurity and electron-electron scatterings with self-consistent spin-orbit coupling, as well as ab initio Land'e g-factor, our method can predict $τ_s$ at various conditions as a function of carrier density and temperature, under electric and magnetic fields. By employing this method, we successfully reproduce experimental results of disparate materials and identify the key factors affecting spin relaxation, dephasing, and diffusion in different materials. Specifically, we predict that germanene has long $τ_s$ (~100 ns at 50 K), a giant spin lifetime anisotropy and spin-valley locking effect under electric fields, making it advantageous for spin-valleytronic applications. Based on our theoretical derivations and ab initio simulations, we propose a new useful electronic quantity, named spin-flip angle $θ^{\\uparrow\\downarrow}$, for the understanding of spin relaxation through intervalley spin-flip scattering processes. Our method can be further applied to other emerging materials and extended to simulate exciton spin dynamics and steady-state photocurrents due to photogalvanic effect.",
  "categories": [
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16311",
  "pdf_url": "https://arxiv.org/pdf/2307.16311v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 2289095,
  "size_after_bytes": 253351
}