{
  "title": "Question Answering with Deep Neural Networks for Semi-Structured Heterogeneous Genealogical Knowledge Graphs",
  "authors": [
    "Omri Suissa",
    "Maayan Zhitomirsky-Geffet",
    "Avshalom Elmalech"
  ],
  "submission_date": "2023-07-30T12:49:54+00:00",
  "revised_dates": [],
  "abstract": "With the rising popularity of user-generated genealogical family trees, new genealogical information systems have been developed. State-of-the-art natural question answering algorithms use deep neural network (DNN) architecture based on self-attention networks. However, some of these models use sequence-based inputs and are not suitable to work with graph-based structure, while graph-based DNN models rely on high levels of comprehensiveness of knowledge graphs that is nonexistent in the genealogical domain. Moreover, these supervised DNN models require training datasets that are absent in the genealogical domain. This study proposes an end-to-end approach for question answering using genealogical family trees by: 1) representing genealogical data as knowledge graphs, 2) converting them to texts, 3) combining them with unstructured texts, and 4) training a trans-former-based question answering model. To evaluate the need for a dedicated approach, a comparison between the fine-tuned model (Uncle-BERT) trained on the auto-generated genealogical dataset and state-of-the-art question-answering models was per-formed. The findings indicate that there are significant differences between answering genealogical questions and open-domain questions. Moreover, the proposed methodology reduces complexity while increasing accuracy and may have practical implications for genealogical research and real-world projects, making genealogical data accessible to experts as well as the general public.",
  "categories": [
    "cs.CL",
    "cs.AI",
    "cs.IR",
    "cs.LG"
  ],
  "primary_category": "cs.CL",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16214",
  "pdf_url": "https://arxiv.org/pdf/2307.16214v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1464066,
  "size_after_bytes": 874416
}