{
  "title": "Machine Learning of Nonequilibrium Phase Transition in an Ising Model on Square Lattice",
  "authors": [
    "Dagne Wordofa",
    "Mulugeta Bekele"
  ],
  "submission_date": "2023-07-21T20:58:39+00:00",
  "revised_dates": [],
  "abstract": "This paper presents the investigation of convolutional neural network (CNN) prediction successfully recognizing the temperature of the non-equilibrium phases and phase transitions in two-dimensional (2D) Ising spins on square-lattice. The model uses image snapshots of ferromagnetic 2D spin configurations as an input shape to provide the average out put predictions. By considering supervised machine learning techniques, we perform the (modified) Metropolis Monte Carlo (MC) simulations to generate the equilibrium (and non-equilibrium) configurations. In equilibrium Ising model, the Metropolis algorithm respects detailed balance condition (DBC), while its modified non-equilibrium version violates the DBC. Violating the DBC of the algorithm is characterized by a parameter $-8 < \\varepsilon < 8$. We find the exact result of the transition temperature in terms of $\\varepsilon$. This solution is used to encode the two (high-and low-temperature) phases through an order parameter of the model. If we set $\\varepsilon = 0$, the usual single spin flip algorithm can be restored and the equilibrium configurations (training dataset) generated with such set up are used to train our model. For $\\varepsilon \\neq 0$, the system attains the non-equilibrium steady states (NESS), and the modified algorithm generates NESS configurations (test dataset), not defined by Boltzmann distribution. Finally, the trained model has been validated and successfully tested on the test dataset. Our result shows that CNN can correctly determine the nonequilibrium phase transition temperature $T_c$ for various $\\varepsilon$ values, consistent with the exact result (our study) and also in agreement with MC result (literature).",
  "categories": [
    "cond-mat.stat-mech"
  ],
  "primary_category": "cond-mat.stat-mech",
  "doi": "10.3390/condmat8030083",
  "journal_ref": null,
  "arxiv_id": "2307.11901",
  "pdf_url": null,
  "comment": "14 pages",
  "num_versions": null,
  "size_before_bytes": 31648147,
  "size_after_bytes": 65162
}