{
  "title": "Semiclassical analysis of the bifundamental QCD on $\\mathbb{R}^2\\times T^2$ with 't Hooft flux",
  "authors": [
    "Yui Hayashi",
    "Yuya Tanizaki",
    "Hiromasa Watanabe"
  ],
  "submission_date": "2023-07-26T04:12:06+00:00",
  "revised_dates": [
    "2023-11-01T00:19:41+00:00",
    "2024-04-26T00:43:12+00:00"
  ],
  "abstract": "We study the phase structure of bifundamental quantum chromodynamics (QCD(BF)), which is the $4$-dimensional $SU(N) \\times SU(N)$ gauge theory coupled with the bifundamental fermion. Firstly, we refine constraints on its phase diagram from 't Hooft anomalies and global inconsistencies, and we find more severe constraints than those in previous literature about QCD(BF). Secondly, we employ the recently-proposed semiclassical approach for confining vacua to investigate this model concretely, and this is made possible via anomaly-preserving $T^2$ compactification. For sufficiently small $T^2$ with the 't Hooft flux, the dilute gas approximation of center vortices gives reliable semiclassical computations, and we determine the phase diagram as a function of the fermion mass $m$, two strong scales $Λ_{1},Λ_2$, and two vacuum angles, $θ_1, θ_2$. In particular, we find that the QCD(BF) vacuum respects the $\\mathbb{Z}_2$ exchange symmetry of two gauge groups. Under the assumption of the adiabatic continuity, our result successfully explains one of the conjectured phase diagrams in the previous literature and also gives positive support for the nonperturbative validity of the large-$N$ orbifold equivalence between QCD(BF) and $\\mathcal{N}=1$ $SU(2N)$ supersymmetric Yang-Mills theory. We also comment on problems of domain walls.",
  "categories": [
    "hep-th"
  ],
  "primary_category": "hep-th",
  "doi": "10.1007/JHEP10(2023)146",
  "journal_ref": "JHEP 10 (2023 ) 146",
  "arxiv_id": "2307.13954",
  "pdf_url": null,
  "comment": "33 pages, 5 figures, v2: small discussion added, v3: typos corrected",
  "num_versions": null,
  "size_before_bytes": 4795290,
  "size_after_bytes": 1946260
}