{
  "title": "Modeling the complexity of Elliptic Black Hole Solution In 4D Using Hamiltonian Monte Carlo with Stacked Neural Networks",
  "authors": [
    "Armin Hatefi",
    "Ehsan Hatefi",
    "Roberto J. López-Sastre"
  ],
  "submission_date": "2023-07-26T21:29:42+00:00",
  "revised_dates": [
    "2023-10-06T00:18:35+00:00"
  ],
  "abstract": "In this paper, we study the black hole solution of self-similar gravitational collapse in the Einstein-axion-dilaton system for the elliptic class in four dimensions. The solution is invariant under space-time dilation, which is combined with internal SL(2,R) transformations. Due to the complex and highly nonlinear pattern of the equations of motion in the physics of black holes, researchers typically have to use various numerical techniques to make the equations tractable to estimate the parameters and the critical solutions. To this end, they have to ignore the numerical measurement errors in estimating the parameters. To our knowledge, for the first time in the literature on axion-dilation systems, we propose to estimate the critical collapse functions in a Bayesian framework. We develop a novel methodology to translate the modelling of the complexity of the elliptic black hole to a sampling problem using Hamiltonian Monte Carlo with stacked neural networks. Unlike methods in the literature, this probabilistic approach enables us not only to recover the available deterministic solution but also to explore possibly all physically distinguishable self-similar solutions that may occur due to numerical measurement errors.",
  "categories": [
    "gr-qc",
    "hep-th",
    "physics.comp-ph",
    "physics.data-an"
  ],
  "primary_category": "gr-qc",
  "doi": "10.1007/JHEP10(2023)034",
  "journal_ref": "JHEP10(2023)034",
  "arxiv_id": "2307.14515",
  "pdf_url": null,
  "comment": "V2: The first version accepted to be published in Journal of High Energy Physics (JHEP 2023)",
  "num_versions": null,
  "size_before_bytes": 3023788,
  "size_after_bytes": 131294
}