{
  "title": "Detection of a High-velocity Jet from MWC 349A Traced by Hydrogen Recombination Line Emission",
  "authors": [
    "Sirina Prasad",
    "Qizhou Zhang",
    "James Moran",
    "Yue Cao",
    "Izaskun Jimenéz-Serra",
    "Jesus Martín-Pintado",
    "Antonio Martinez Henares",
    "Alejandro Báez Rubio"
  ],
  "submission_date": "2023-07-27T17:56:35+00:00",
  "revised_dates": [],
  "abstract": "MWC 349A is one of the rare stars known to have hydrogen radio recombination line (RRL) masers. The bright maser emission makes it possible to study the dynamics of the system at milli-arcsecond (mas) precision. We present Atacama Large Millimeter/submillimeter Array (ALMA) observations of the 1.4 mm and 0.8 mm continuum emission of MWC 349A, as well as the H30$α$ and H26$α$ RRLs. Using the most extended array configuration of C43-10 with a maximum baseline of 16.2km, we spatially resolved the H30$α$ line and 1.4mm continuum emission for the first time. In addition to the known H30$α$ and H26$α$ maser emission from a Keplerian disk at LSR velocities from -12 to 28 km s$^{-1}$ and from an ionized wind for velocities between -12 to -40 km s$^{-1}$ and 28 to 60 km s$^{-1}$, we found evidence of a jet along the polar axis at $V_{\\mathrm{LSR}}$ from -85 to -40 km s$^{-1}$ and +60 to +100 km s$^{-1}$. These masers are found in a linear structure nearly aligned with the polar axis of the disk. If these masers lie close to the polar axis, their velocities could be as high as 575 km s$^{-1}$, which cannot be explained solely by a single expanding wind as proposed in Báez Rubio et al (2013). We suggest that they originate from a high-velocity jet, likely launched by a magnetohydrodynamic wind. The jet appears to rotate in the same direction as the rotation of the disk. A detailed radiative transfer modeling of these emissions will further elucidate the origin of these masers in the wind.",
  "categories": [
    "astro-ph.SR",
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.SR",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15050",
  "pdf_url": "https://arxiv.org/pdf/2307.15050v1",
  "comment": "Accepted for publication in Astrophysical Journal Letters",
  "num_versions": null,
  "size_before_bytes": 6348893,
  "size_after_bytes": 4193938
}