{
  "title": "Work statistics and Entanglement across the fermionic superfluid-insulator transition",
  "authors": [
    "Krissia Zawadzki",
    "Guilherme A. Canella",
    "Vivian V. França",
    "Irene D'Amico"
  ],
  "submission_date": "2023-07-24T18:18:43+00:00",
  "revised_dates": [],
  "abstract": "Entanglement in many-body systems may display interesting signatures of quantum phase transitions and similar properties are starting to be encountered in the analysis of work fluctuations. Here, we consider the fermionic superfluid-to-insulator transition (SIT) and relate its entanglement properties with its work distribution statistics. The SIT is modeled by the attractive fermionic Hubbard model in the presence of randomly distributed impurities. The work distribution is calculated across two quench protocols, both triggering the SIT. In the first, the concentration of impurities is increased; in the second, the impurities' disorder strength is varied. Our results indicate that, the critical state that induces minimization of the entanglement also maximizes the average work. We demonstrate that, for this state, density fluctuations vanish at all orders, hence all central moments of the work probability distribution are exactly zero at criticality. For systems undergoing a precursor to the transition (short chains with finite impurity potential) numerical results confirm these predictions, with higher moments further from the ideal result. For both protocols, at criticality, the system absorbs the most energy with almost no penalty in terms of fluctuations: ultimately this feature could be used to implement a quantum critical battery. The effects of temperature on these signatures of critical behaviour are also investigated and shown to favor work extraction for high enough temperatures.",
  "categories": [
    "quant-ph",
    "cond-mat.str-el"
  ],
  "primary_category": "quant-ph",
  "doi": "10.1002/qute.202300237",
  "journal_ref": null,
  "arxiv_id": "2307.13059",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1938373,
  "size_after_bytes": 47971
}