{
  "title": "Operator Splitting/Finite Element Methods for the Minkowski Problem",
  "authors": [
    "Hao Liu",
    "Shingyu Leung",
    "Jianliang Qian"
  ],
  "submission_date": "2023-07-31T08:48:36+00:00",
  "revised_dates": [
    "2023-08-01T02:22:07+00:00"
  ],
  "abstract": "The classical Minkowski problem for convex bodies has deeply influenced the development of differential geometry. During the past several decades, abundant mathematical theories have been developed for studying the solutions of the Minkowski problem, however, the numerical solution of this problem has been largely left behind, with only few methods available to achieve that goal. In this article, focusing on the two-dimensional Minkowski problem with Dirichlet boundary conditions, we introduce two solution methods, both based on operator-splitting. One of these two methods deals directly with the Dirichlet condition, while the other method uses an approximation of this Dirichlet condition. This relaxation of the Dirichlet condition makes this second method better suited than the first one to treat those situations where the Minkowski and the Dirichlet condition are not compatible. Both methods are generalizations of the solution method for the canonical Monge-Ampère equation discussed by Glowinski et al. (Journal of Scientific Computing, 79(1), 1-47, 2019); as such they take advantage of a divergence formulation of the Minkowski problem, well-suited to a mixed finite element approximation, and to the the time-discretization via an operator-splitting scheme, of an associated initial value problem. Our methodology can be easily implemented on convex domains of rather general shape (with curved boundaries, possibly). The numerical experiments we performed validate both methods and show that if one uses continuous piecewise affine finite element approximations of the smooth solution of the Minkowski problem and of its three second order derivatives, these two methods provide nearly second order accuracy for the $L^2$ and $L^{\\infty}$ error. One can extend easily the methods discussed in this article, to address the solution of three-dimensional Minkowski problem.",
  "categories": [
    "math.NA"
  ],
  "primary_category": "math.NA",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16497",
  "pdf_url": "https://arxiv.org/pdf/2307.16497v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 56540914,
  "size_after_bytes": 3604892
}