{
  "title": "Revisiting Distillation for Continual Learning on Visual Question Localized-Answering in Robotic Surgery",
  "authors": [
    "Long Bai",
    "Mobarakol Islam",
    "Hongliang Ren"
  ],
  "submission_date": "2023-07-22T10:35:25+00:00",
  "revised_dates": [],
  "abstract": "The visual-question localized-answering (VQLA) system can serve as a knowledgeable assistant in surgical education. Except for providing text-based answers, the VQLA system can highlight the interested region for better surgical scene understanding. However, deep neural networks (DNNs) suffer from catastrophic forgetting when learning new knowledge. Specifically, when DNNs learn on incremental classes or tasks, their performance on old tasks drops dramatically. Furthermore, due to medical data privacy and licensing issues, it is often difficult to access old data when updating continual learning (CL) models. Therefore, we develop a non-exemplar continual surgical VQLA framework, to explore and balance the rigidity-plasticity trade-off of DNNs in a sequential learning paradigm. We revisit the distillation loss in CL tasks, and propose rigidity-plasticity-aware distillation (RP-Dist) and self-calibrated heterogeneous distillation (SH-Dist) to preserve the old knowledge. The weight aligning (WA) technique is also integrated to adjust the weight bias between old and new tasks. We further establish a CL framework on three public surgical datasets in the context of surgical settings that consist of overlapping classes between old and new surgical VQLA tasks. With extensive experiments, we demonstrate that our proposed method excellently reconciles learning and forgetting on the continual surgical VQLA over conventional CL methods. Our code is publicly accessible.",
  "categories": [
    "cs.CV",
    "cs.CL",
    "cs.RO"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12045",
  "pdf_url": null,
  "comment": "To appear in MICCAI 2023. Code availability: https://github.com/longbai1006/CS-VQLA",
  "num_versions": null,
  "size_before_bytes": 871690,
  "size_after_bytes": 142415
}