{
  "title": "High-statistics pedestrian dynamics on stairways and their probabilistic fundamental diagrams",
  "authors": [
    "Caspar A. S. Pouw",
    "Alessandro Corbetta",
    "Alessandro Gabbana",
    "Chiel van der Laan",
    "Federico Toschi"
  ],
  "submission_date": "2023-07-28T15:12:41+00:00",
  "revised_dates": [
    "2024-01-12T10:00:31+00:00"
  ],
  "abstract": "Staircases play an essential role in crowd dynamics, allowing pedestrians to flow across large multi-level public facilities such as transportation hubs, and office buildings. Achieving a robust understanding of pedestrian behavior in these facilities is a key societal necessity. What makes this an outstanding scientific challenge is the extreme randomness intrinsic to pedestrian behavior. Any quantitative understanding necessarily needs to be probabilistic, including average dynamics and fluctuations. In this work, we analyze data from an unprecedentedly high statistics year-long pedestrian tracking campaign, in which we anonymously collected millions of trajectories across a staircase within Eindhoven train station (NL). Made possible thanks to a state-of-the-art, faster than real-time, computer vision approach hinged on 3D depth imaging, and YOLOv7-based depth localization. We consider both free-stream conditions, i.e. pedestrians walking in undisturbed, and trafficked conditions, uni/bidirectional flows. We report the position vs density, considering the crowd as a 'compressible' physical medium. We show how pedestrians willingly opt to occupy fewer space than available, accepting a certain degree of compressibility. This is a non-trivial physical feature of pedestrian dynamics and we introduce a novel way to quantify this effect. As density increases, pedestrians strive to keep a minimum distance d = 0.6 m from the person in front of them. Finally, we establish first-of-kind fully resolved probabilistic fundamental diagrams, where we model the pedestrian walking velocity as a mixture of a slow and fast-paced component. Notably, averages and modes of velocity distribution turn out to be substantially different. Our results, including probabilistic parametrizations based on few variables, are key towards improved facility design and realistic simulation of pedestrians on staircases.",
  "categories": [
    "physics.soc-ph"
  ],
  "primary_category": "physics.soc-ph",
  "doi": "10.1016/j.trc.2023.104468",
  "journal_ref": "Transp.Res.Part.C.Emerg.Technol. 159 (2024)",
  "arxiv_id": "2307.15609",
  "pdf_url": "https://arxiv.org/pdf/2307.15609v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 41300639,
  "size_after_bytes": 507422
}