{
  "title": "The First Direct Detection of Kirkwood Transitions in Concentrated Aqueous Electrolytes using Small Angle X-ray Scattering",
  "authors": [
    "Mohammadhasan Dinpajooh",
    "Elisa Biasin",
    "Christopher J. Mundy",
    "Gregory K. Schenter",
    "Emily T. Nienhuis",
    "Sebastian T. Mergelsberg",
    "Chris J. Benmore",
    "John L. Fulton",
    "Shawn M. Kathmann"
  ],
  "submission_date": "2023-07-28T02:17:59+00:00",
  "revised_dates": [
    "2023-08-15T01:51:18+00:00"
  ],
  "abstract": "Ion-ion correlations, screening, and equilibrium bulk structure in various concentrated electrolytes are investigated using synchrotron small angle X-ray scattering (SAXS), theory, and molecular simulation. Utilizing SAXS measurements we provide estimates of the Kirkwood Transition (KT) for a variety of aqueous electrolytes (NaCl, CaCl$_2$, SrCl$_2$, and ErCl$_3$). The KT may be defined as the concentration above which the ion-ion correlations cease to decay exponentially with a single length scale given by the Debye length $λ_{\\rm D}$ and develop an additional length scale, $d=2π/Q_0$ that reflects the formation of local domains of charge. Theoretical models of the KT have been known for decades for highly idealized models of electrolytes, but experimental verification of KT in real electrolytes has yet to be confirmed. Herein, we provide consistent theoretical and experimental estimates of both the inverse screening lengths $a_0$ and inverse domain size, $Q_0$ for the aforementioned electrolyte systems. Taken together, $a_0$ and $Q_0$ are known descriptors of the KT and provide a view into the complexity of ion-ion interaction beyond the well-accepted Debye-Hückel limit. Our findings suggest a picture of interaction for real electrolytes that is more general than that found in idealized models that is manifest in the precise form of the non-local response function that we estimate through the interpretation of the experimental SAXS signal. Importantly, the additional complexity of describing ion-ion interaction of real electrolytes will implicate the short-range ion-ion interactions that can only be computed via molecular simulation and provide a quantitative approach to describe electrolyte phenomena beyond Debye-Hückel theory.",
  "categories": [
    "cond-mat.soft",
    "cond-mat.stat-mech"
  ],
  "primary_category": "cond-mat.soft",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15265",
  "pdf_url": "https://arxiv.org/pdf/2307.15265v2",
  "comment": "35",
  "num_versions": null,
  "size_before_bytes": 7484694,
  "size_after_bytes": 653598
}