{
  "title": "Dark energy in light of the early JWST observations: case for a negative cosmological constant?",
  "authors": [
    "Shahnawaz A. Adil",
    "Upala Mukhopadhyay",
    "Anjan A. Sen",
    "Sunny Vagnozzi"
  ],
  "submission_date": "2023-07-24T13:06:47+00:00",
  "revised_dates": [
    "2023-07-27T00:17:17+00:00",
    "2024-01-25T01:10:36+00:00"
  ],
  "abstract": "Early data from the James Webb Space Telescope (JWST) has uncovered the existence of a surprisingly abundant population of very massive galaxies at extremely high redshift, which are hard to accommodate within the standard $Λ$CDM cosmology. We explore whether the JWST observations may be pointing towards more complex dynamics in the dark energy (DE) sector. Motivated by the ubiquity of anti-de Sitter vacua in string theory, we consider a string-inspired scenario where the DE sector consists of a negative cosmological constant (nCC) and a evolving component with positive energy density on top, whose equation of state is allowed to cross the phantom divide. We show that such a scenario can drastically alter the growth of structure compared to $Λ$CDM, and accommodate the otherwise puzzling JWST observations if the dynamical component evolves from the quintessence-like regime in the past to the phantom regime today: in particular, we demonstrate that the presence of a nCC (which requires a higher density for the evolving component) plays a crucial role in enhancing the predicted cumulative comoving stellar mass density. Our work reinforces the enormous potential held by observations of the abundance of high-$z$ galaxies in probing cosmological models and new fundamental physics, including string-inspired ingredients.",
  "categories": [
    "astro-ph.CO",
    "gr-qc",
    "hep-ph",
    "hep-th"
  ],
  "primary_category": "astro-ph.CO",
  "doi": "10.1088/1475-7516/2023/10/072",
  "journal_ref": "JCAP 2310 (2023) 072",
  "arxiv_id": "2307.12763",
  "pdf_url": null,
  "comment": "30 pages, 10 sub-figures arranged into 5 figures. v2: additional references added, acknowledgements updated. v3: added two sub-figures (one additional figure) and additional references. Version accepted for publication in JCAP",
  "num_versions": null,
  "size_before_bytes": 3368942,
  "size_after_bytes": 500281
}