{
  "title": "Probing reflection from aerosols with the near-infrared dayside spectrum of WASP-80b",
  "authors": [
    "Bob Jacobs",
    "Jean-Michel Désert",
    "Peter Gao",
    "Caroline V. Morley",
    "Jacob Arcangeli",
    "Saugata Barat",
    "Mark S. Marley",
    "Julianne I. Moses",
    "Jonathan J. Fortney",
    "Jacob L. Bean",
    "Kevin B. Stevenson",
    "Vatsal Panwar"
  ],
  "submission_date": "2023-07-26T16:04:42+00:00",
  "revised_dates": [
    "2023-10-27T00:22:13+00:00"
  ],
  "abstract": "The presence of aerosols is intimately linked to the global energy budget and the composition of a planet's atmospheres. Their ability to reflect incoming light prevents energy from being deposited into the atmosphere, and they shape spectra of exoplanets. We observed five near-infrared secondary eclipses of WASP-80b with the Wide Field Camera 3 (WFC3) aboard the \\textit{Hubble Space Telescope} to provide constraints on the presence and properties of atmospheric aerosols. We detect a broadband eclipse depth of $34\\pm10$\\,ppm for WASP-80b. We detect a higher planetary flux than expected from thermal emission alone at $1.6σ$, which hints toward the presence of reflecting aerosols on this planet's dayside, indicating a geometric albedo of $A_g<0.33$ at 3$σ$. We paired the WFC3 data with Spitzer data and explored multiple atmospheric models with and without aerosols to interpret this spectrum. Albeit consistent with a clear dayside atmosphere, we found a slight preference for near-solar metallicities and for dayside clouds over hazes. We exclude soot haze formation rates higher than $10^{-10.7}$ g cm$^{-2}$s$^{-1}$ and tholin formation rates higher than $10^{-12.0}$ g cm$^{-2}$s$^{-1}$ at $3σ$. We applied the same atmospheric models to a previously published WFC3/Spitzer transmission spectrum for this planet and found weak haze formation. A single soot haze formation rate best fits both the dayside and the transmission spectra simultaneously. However, we emphasize that no models provide satisfactory fits in terms of the chi-square of both spectra simultaneously, indicating longitudinal dissimilarity in the atmosphere's aerosol composition.",
  "categories": [
    "astro-ph.EP"
  ],
  "primary_category": "astro-ph.EP",
  "doi": "10.3847/2041-8213/acfee9",
  "journal_ref": "ApJL 2023 Volume 956, Number 2, page L43",
  "arxiv_id": "2307.14399",
  "pdf_url": null,
  "comment": "Published in ApJ Letters (20 Oct 2023)",
  "num_versions": null,
  "size_before_bytes": 5796612,
  "size_after_bytes": 906757
}