{
  "title": "Stellar angular momentum of disk galaxies at z = 0.7 in the MAGIC survey I. Impact of the environment",
  "authors": [
    "W. Mercier",
    "B. Epinat",
    "T. Contini",
    "D. Krajnović",
    "L. Ciesla",
    "B. C. Lemaux",
    "V. Abril-Melgarejo",
    "L. Boogaard",
    "D. Pelliccia"
  ],
  "submission_date": "2023-07-25T09:19:26+00:00",
  "revised_dates": [],
  "abstract": "Aims: At intermediate redshift, galaxy groups/clusters are thought to impact galaxies (e.g. their angular momentum). We investigate whether the environment has an impact on the galaxies' angular momentum and identify underlying driving physical mechanisms.\n  Methods: We derive robust estimates of the stellar angular momentum using Hubble Space Telescope (HST) images combined with spatially resolved ionised gas kinematics from the Multi-Unit Spectroscopic Explorer (MUSE) for a sample of ~200 galaxies in groups and in the field at z~0.7 drawn from the MAGIC survey. Using various environmental tracers, we study the position of the galaxies in the the angular momentum-stellar mass (Fall) relation as a function of environment.\n  Results: We measure a 0.12 dex (2sigma significant) depletion of angular momentum for low-mass galaxies (M* < 10^10 Msun) in groups with respect to the field. Massive galaxies located in dense environments have less angular momentum than expected from the low-mass Fall relation but, without a comparable field sample, we cannot infer whether this effect is mass- or environmentally-driven. Furthermore, massive galaxies are found in the centre of the structures and have low systemic velocities. The observed depletion of angular momentum at low mass does not appear linked with the strength of the over-density around the galaxies but it is strongly correlated with the galaxies' systemic velocity normalised by the dispersion of their host group and with their ionised gas velocity dispersion.\n  Conclusions: Group galaxies seem depleted in angular momentum, especially at low mass. Our results suggest that this depletion might be induced by physical mechanisms that scale with the systemic velocity of the galaxies (e.g. stripping or merging) and that such mechanism might be responsible for enhancing the velocity dispersion of the gas as galaxies lose angular momentum.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.1051/0004-6361/202346700",
  "journal_ref": "A&A 677, A143 (2023)",
  "arxiv_id": "2307.13355",
  "pdf_url": null,
  "comment": "23 pages, including 5 appendices, 14 figures, accepted version before language correction",
  "num_versions": null,
  "size_before_bytes": 4278044,
  "size_after_bytes": 256937
}