{
  "title": "Where are the photons in a transmission-line pulse?",
  "authors": [
    "Evangelos Varvelis",
    "Debjyoti Biswas",
    "David P. DiVincenzo"
  ],
  "submission_date": "2023-07-27T10:31:12+00:00",
  "revised_dates": [],
  "abstract": "We develop a photonic description of short, one-dimensional electromagnetic pulses, specifically in the language of electrical transmission lines. Current practice in quantum technology, using arbitrary waveform generators, can readily produce very short, few-cycle pulses in microwave TEM guided structures (coaxial cables or coplanar waveguides) in a very low noise, low temperature setting. We argue that these systems attain the limit of producing pure coherent quantum states, in which the vacuum has been displaced for a short time, and therefore short spatial extent. When the pulse is bipolar, that is, the integrated voltage of the pulse is zero, then the state can be described by the finite displacement of a single mode. Therefore there is a definite mean number of photons, but which have neither a well defined frequency nor position. Due to the Paley-Wiener theorem, the two-component photon 'wavefunction' of this mode is not strictly bounded in space even if the vacuum displacement that defines it is bounded. This wavefunction's components are, for the case of pulses moving in a specific direction, complex valued, with the real and imaginary parts related by a Hilbert transform. They are thus akin to the 'analytic signals' of communication theory. When the pulse is unipolar no photonic description is possible -- the photon number can be considered to be divergent. We consider properties that photon counters and quantum non-demolition detectors must have to optimally convert and detect the photons in several example pulses, and we discuss some consequence of this optimization for the application of very short pulses in quantum cryptography.",
  "categories": [
    "quant-ph",
    "cond-mat.mes-hall"
  ],
  "primary_category": "quant-ph",
  "doi": "10.1073/pnas.2314846121",
  "journal_ref": "Proceedings of the National Academy of Sciences 121, e2314846121 (2024)",
  "arxiv_id": "2307.14756",
  "pdf_url": "https://arxiv.org/pdf/2307.14756v1",
  "comment": "9 pages, 4 figures",
  "num_versions": null,
  "size_before_bytes": 281869,
  "size_after_bytes": 102013
}