{
  "title": "A Comparison of the Composition of Planets in Single- and Multi-Planet Systems Orbiting M dwarfs",
  "authors": [
    "Romy Rodríguez Martínez",
    "David V. Martin",
    "B. Scott Gaudi",
    "Joseph G. Schulze",
    "Anusha Pai Asnodkar",
    "Kiersten M. Boley",
    "Sarah Ballard"
  ],
  "submission_date": "2023-07-24T18:00:04+00:00",
  "revised_dates": [],
  "abstract": "We investigate and compare the composition of M-dwarf planets in systems with only one known planet (``singles\") to those residing in multi-planet systems (``multis\") and the fundamental properties of their host stars. We restrict our analysis to planets with directly measured masses and radii, which comprise a total of 70 planets: 30 singles and 40 multis in 19 systems. We compare the bulk densities for the full sample, which includes planets ranging in size from $0.52 R_{\\oplus}$ to $12.8R_\\oplus$, and find that single planets have significantly lower densities on average than multis, which we cannot attribute to selection biases. We compare the bulk densities normalized by an Earth model for planets with $R_{p} < 6R_{\\oplus}$, and find that multis are also denser with 99\\% confidence. We calculate and compare the core/water mass fractions (CMF/WMF) of low-mass planets ($M_p <10 M_{\\oplus}$), and find that the likely rocky multis (with $R_p <1.6 R_{\\oplus}$) have lower CMFs than singles. We also compare the [Fe/H] metallicity and rotation period of all single versus multi-planet host stars with such measurements in the literature and find that multi-planet hosts are significantly more metal-poor than those hosting a single planet. Moreover, we find that host star metallicity decreases with increasing planet multiplicity. In contrast, we find only a modest difference in the rotation period. The significant differences in planetary composition and metallicity of the host stars point to different physical processes governing the formation of single- and multi-planet systems in M dwarfs.",
  "categories": [
    "astro-ph.EP",
    "astro-ph.SR"
  ],
  "primary_category": "astro-ph.EP",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13034",
  "pdf_url": null,
  "comment": "20 pages, 11 figures, 2 tables. Submitted to ApJ and under review. Comments welcome!",
  "num_versions": null,
  "size_before_bytes": 5739406,
  "size_after_bytes": 568884
}