{
  "title": "Mechanical modeling of the maturation process for tissue-engineered implants: application to biohybrid heart valves",
  "authors": [
    "Mahmoud Sesa",
    "Hagen Holthusen",
    "Lukas Lamm",
    "Christian Böhm",
    "Tim Brepols",
    "Stefan Jockenhövel",
    "Stefanie Reese"
  ],
  "submission_date": "2023-07-23T21:55:46+00:00",
  "revised_dates": [],
  "abstract": "The development of tissue-engineered cardiovascular implants can improve the lives of large segments of our society who suffer from cardiovascular diseases. Regenerative tissues are fabricated using a process called tissue maturation. Furthermore, it is highly challenging to produce cardiovascular regenerative implants with sufficient mechanical strength to withstand the loading conditions within the human body. Therefore, biohybrid implants for which the regenerative tissue is reinforced by standard reinforcement material (e.g. textile or 3d printed scaffold) can be an interesting solution. In silico models can significantly contribute to characterizing, designing, and optimizing biohybrid implants. The first step towards this goal is to develop a computational model for the maturation process of tissue-engineered implants. This paper focuses on the mechanical modeling of textile-reinforced tissue-engineered cardiovascular implants. First, we propose an energy-based approach to compute the collagen evolution during the maturation process. Then, we apply the concept of structural tensors to model the anisotropic behavior of the extracellular matrix and the textile scaffold. Next, the newly developed material model is embedded into a special solid-shell finite element formulation with reduced integration. Finally, we use our framework to compute two structural problems: a pressurized shell construct and a tubular-shaped heart valve. The results show the ability of the model to predict collagen growth in response to the boundary conditions applied during the maturation process. Consequently, we can predict the implant's mechanical response, such as the deformation and stresses of the implant.",
  "categories": [
    "cs.CE"
  ],
  "primary_category": "cs.CE",
  "doi": "10.1016/j.compbiomed.2023.107623",
  "journal_ref": null,
  "arxiv_id": "2307.12439",
  "pdf_url": null,
  "comment": "Preprint submitted to Elsevier",
  "num_versions": null,
  "size_before_bytes": 9529402,
  "size_after_bytes": 2484877
}