{
  "title": "Characteristic Length Scale and Dynamics of $χ^{3/2}$-MOND Cosmology",
  "authors": [
    "Donniel Cruz",
    "Emmanuel Rodulfo"
  ],
  "submission_date": "2023-07-27T20:32:24+00:00",
  "revised_dates": [],
  "abstract": "This work studies the cosmology of $χ^{3/2}$-MOND gravity by Bernal et. al. (2011). This theory is a modification to Einstein's General Relativity (GR) that uses a dimensionless curvature scalar $χ$ by rescaling the Ricci scalar $R$ by some characteristic length scale $L_M$, as well as a set of modified field equations that follows from a $3/2$-power Lagrangian. The characteristic length scale is assumed to be built from the universal constants of the theory and the parameters of the system in question. In the weak field limit, this theory recovers Milgrom's (1983) Modified Newtonian Dynamics (MOND). MOND is a proposal that corrects Newtonian gravitational laws below an acceleration threshold $a_0\\approx1.2\\times{10}^{-10}m/s^2$ to explain the anomalous flattening of galactic rotation curves without imposing any dark matter components. In the cosmological case, this work asserts that the characteristic length scale is of the order $c^2/a_0$. This specific value is motivated in two ways: (1) it is shown that this scale defines a convergence of GR and MOND at some critical mass (with this as the corresponding length); (2) this length scale is shown to be an extremal value of $L_M$ independent of the mass parameter. The established length scale is then used in the case of cosmology; the FLRW metric is plugged in into the modified field equations and the two modified Friedmann equations are derived incorporating the MOND effects by a manifest appearance of the constant $a_0$.",
  "categories": [
    "gr-qc",
    "astro-ph.CO"
  ],
  "primary_category": "gr-qc",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15187",
  "pdf_url": "https://arxiv.org/pdf/2307.15187v1",
  "comment": "6 pages, presented at De La Salle University - Manila Research Congress 2023 Parallel Sessions on July 7, 2023 (proceedings: https://www.dlsu.edu.ph/dlsu-conference-series/)",
  "num_versions": null,
  "size_before_bytes": 199405,
  "size_after_bytes": 123833
}