{
  "title": "Structural phase transition, $s_{\\pm}$-wave pairing and magnetic stripe order in the bilayered nickelate superconductor La$_3$Ni$_2$O$_7$ under pressure",
  "authors": [
    "Yang Zhang",
    "Ling-Fang Lin",
    "Adriana Moreo",
    "Thomas A. Maier",
    "Elbio Dagotto"
  ],
  "submission_date": "2023-07-28T03:03:24+00:00",
  "revised_dates": [
    "2023-07-31T16:36:53+00:00",
    "2023-08-01T20:31:38+00:00",
    "2024-03-26T00:32:33+00:00"
  ],
  "abstract": "Motivated by the recently discovered high-$T_c$ superconductor La$_3$Ni$_2$O$_7$, we comprehensively study this system using density functional theory and random phase approximation calculations. At low pressures, the Amam phase is stable, containing the Y$^{2-}$ mode distortion from the Fmmm phase, while the Fmmm phase is unstable. Because of small differences in enthalpy and a considerable Y$^{2-}$ mode amplitude, the two phases may coexist in the range between 10.6 and 14 GPa, beyond which the Fmmm phase dominates. In addition, the magnetic stripe-type spin order with wavevector ($π$, 0) was stable at the intermediate region. Pairing is induced in the $s_{\\pm}$-wave channel due to partial nesting between the {\\bf M}=$(π, π)$ centered pockets and portions of the Fermi surface centered at the {\\bf X}=$(π, 0)$ and {\\bf Y}=$(0, π)$ points. This resembles results for iron-based superconductors but has a fundamental difference with iron pnictides and selenides. Moreover, our present efforts also suggest that La$_3$Ni$_2$O$_7$ is qualitatively different from infinite-layer nickelates and cuprate superconductors.",
  "categories": [
    "cond-mat.supr-con"
  ],
  "primary_category": "cond-mat.supr-con",
  "doi": "10.1038/s41467-024-46622-z",
  "journal_ref": "Nat. Commun. 15, 2470 (2024)",
  "arxiv_id": "2307.15276",
  "pdf_url": "https://arxiv.org/pdf/2307.15276v4",
  "comment": "Main text (13 pages, 7 figures)+ SM(7 pages, 12 figures)",
  "num_versions": null,
  "size_before_bytes": 18747962,
  "size_after_bytes": 249081
}