{
  "title": "AutoAlign: Fully Automatic and Effective Knowledge Graph Alignment enabled by Large Language Models",
  "authors": [
    "Rui Zhang",
    "Yixin Su",
    "Bayu Distiawan Trisedya",
    "Xiaoyan Zhao",
    "Min Yang",
    "Hong Cheng",
    "Jianzhong Qi"
  ],
  "submission_date": "2023-07-18T04:43:24+00:00",
  "revised_dates": [
    "2023-09-06T00:17:27+00:00",
    "2023-11-14T01:41:59+00:00"
  ],
  "abstract": "The task of entity alignment between knowledge graphs (KGs) aims to identify every pair of entities from two different KGs that represent the same entity. Many machine learning-based methods have been proposed for this task. However, to our best knowledge, existing methods all require manually crafted seed alignments, which are expensive to obtain. In this paper, we propose the first fully automatic alignment method named AutoAlign, which does not require any manually crafted seed alignments. Specifically, for predicate embeddings, AutoAlign constructs a predicate-proximity-graph with the help of large language models to automatically capture the similarity between predicates across two KGs. For entity embeddings, AutoAlign first computes the entity embeddings of each KG independently using TransE, and then shifts the two KGs' entity embeddings into the same vector space by computing the similarity between entities based on their attributes. Thus, both predicate alignment and entity alignment can be done without manually crafted seed alignments. AutoAlign is not only fully automatic, but also highly effective. Experiments using real-world KGs show that AutoAlign improves the performance of entity alignment significantly compared to state-of-the-art methods.",
  "categories": [
    "cs.IR",
    "cs.CL",
    "cs.LG"
  ],
  "primary_category": "cs.IR",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11772",
  "pdf_url": null,
  "comment": "14 pages, 5 figures, 4 tables, IEEE Transactions on Knowledge and Data Engineering",
  "num_versions": null,
  "size_before_bytes": 7988741,
  "size_after_bytes": 1292785
}