{
  "title": "Capse.jl: efficient and auto-differentiable CMB power spectra emulation",
  "authors": [
    "Marco Bonici",
    "Federico Bianchini",
    "Jaime Ruiz-Zapatero"
  ],
  "submission_date": "2023-07-26T17:58:09+00:00",
  "revised_dates": [
    "2024-01-29T01:19:20+00:00",
    "2024-02-02T01:12:13+00:00"
  ],
  "abstract": "We present Capse.jl, a novel neural network-based emulator designed for rapid and accurate prediction of Cosmic Microwave Background (CMB) temperature, polarization, and lensing angular power spectra. The emulator computes predictions in just a few microseconds with emulation errors below $0.1σ$ for all the scales relevant for the upcoming CMB-S4 survey. Capse.jl can also be trained in an hour's time on a 8-cores CPU. We test Capse.jl on Planck 2018, ACT DR4, and 2018 SPT-3G data and demonstrate its capability to derive cosmological constraints comparable to those obtained by traditional methods, but with a computational efficiency that is three to six orders of magnitude higher. We take advantage of the differentiability of our emulators to use gradient-based methods, such as Pathfinder and Hamiltonian Monte Carlo (HMC), which speed up the convergence and increase sampling efficiency. Together, these features make Capse.jl a powerful tool for studying the CMB and its implications for cosmology. When using the fastest combination of our likelihoods, emulators, and analysis algorithm, we are able to perform a Plancky TT + TE + EE analysis in less than a second. To ensure full reproducibility, we provide open access to the codes and data required to reproduce all the results of this work.",
  "categories": [
    "astro-ph.CO"
  ],
  "primary_category": "astro-ph.CO",
  "doi": "10.21105/astro.2307.14339",
  "journal_ref": "Volume 7 (2024)",
  "arxiv_id": "2307.14339",
  "pdf_url": null,
  "comment": "16 pages, 6 figures. Accepted for publication in The Open Journal of Astrophysics. Capse.jl is available $\\href{https://github.com/CosmologicalEmulators/Capse.jl}{\\text{here}}$",
  "num_versions": null,
  "size_before_bytes": 30644426,
  "size_after_bytes": 575131
}