{
  "title": "Optomechanics of optically-levitated particles: A tutorial and perspective",
  "authors": [
    "George Winstone",
    "Alexey Grinin",
    "Mishkat Bhattacharya",
    "Andrew A. Geraci",
    "Tongcang Li",
    "Peter J. Pauzauskie",
    "Nick Vamivakas"
  ],
  "submission_date": "2023-07-21T18:58:25+00:00",
  "revised_dates": [
    "2024-08-07T00:51:35+00:00"
  ],
  "abstract": "Optomechanics, the study of the mechanical interaction of light with matter, has proven to be a fruitful area of research that has yielded many notable achievements, including the direct detection of gravitational waves in kilometer-scale optical interferometers. Light has been used to cool and demonstrate quantum control over the mechanical degrees of freedom of individual ions and atoms, and more recently has facilitated the observation of quantum ``mechanics'' in objects of larger mass, even at the kg-scale. Optical levitation, where an object can be suspended by radiation pressure and largely decoupled from its environment, has recently established itself as a rich field of study, with many notable results relevant for precision measurement, quantum information science, and foundational tests of quantum mechanics and fundamental physics. This article provides a survey of several current activities in field along with a tutorial describing associated key concepts and methods, both from an experimental and theoretical approach. It is intended as a resource for junior researchers who are new to this growing field as well as beginning graduate students. The tutorial is concluded with a perspective on both promising emerging experimental platforms and anticipated future theoretical developments.",
  "categories": [
    "quant-ph",
    "physics.optics"
  ],
  "primary_category": "quant-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11858",
  "pdf_url": null,
  "comment": "59 pages, 22 figures, submitted to Advances in Optics and Photonics, 4 figures added, 1 figure deleted, additional introductory text added in Sec. 2",
  "num_versions": null,
  "size_before_bytes": 30351545,
  "size_after_bytes": 1661954
}