{
  "title": "DDG-Net: Discriminability-Driven Graph Network for Weakly-supervised Temporal Action Localization",
  "authors": [
    "Xiaojun Tang",
    "Junsong Fan",
    "Chuanchen Luo",
    "Zhaoxiang Zhang",
    "Man Zhang",
    "Zongyuan Yang"
  ],
  "submission_date": "2023-07-31T05:48:39+00:00",
  "revised_dates": [
    "2023-08-07T04:29:12+00:00"
  ],
  "abstract": "Weakly-supervised temporal action localization (WTAL) is a practical yet challenging task. Due to large-scale datasets, most existing methods use a network pretrained in other datasets to extract features, which are not suitable enough for WTAL. To address this problem, researchers design several modules for feature enhancement, which improve the performance of the localization module, especially modeling the temporal relationship between snippets. However, all of them neglect the adverse effects of ambiguous information, which would reduce the discriminability of others. Considering this phenomenon, we propose Discriminability-Driven Graph Network (DDG-Net), which explicitly models ambiguous snippets and discriminative snippets with well-designed connections, preventing the transmission of ambiguous information and enhancing the discriminability of snippet-level representations. Additionally, we propose feature consistency loss to prevent the assimilation of features and drive the graph convolution network to generate more discriminative representations. Extensive experiments on THUMOS14 and ActivityNet1.2 benchmarks demonstrate the effectiveness of DDG-Net, establishing new state-of-the-art results on both datasets. Source code is available at \\url{https://github.com/XiaojunTang22/ICCV2023-DDGNet}.",
  "categories": [
    "cs.CV"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16415",
  "pdf_url": "https://arxiv.org/pdf/2307.16415v2",
  "comment": "Accepted by ICCV2023",
  "num_versions": null,
  "size_before_bytes": 2701917,
  "size_after_bytes": 306877
}