{
  "title": "Random walks in correlated diffusivity landscapes",
  "authors": [
    "Adrian Pacheco-Pozo",
    "Igor M. Sokolov"
  ],
  "submission_date": "2023-07-31T09:02:01+00:00",
  "revised_dates": [],
  "abstract": "In recent years, several experiments highlighted a new type of diffusion anomaly, which was called Brownian yet non-Gaussian diffusion. In systems displaying this behavior, the mean squared displacement of the diffusing particles grows linearly in time, like in a normal diffusion, but the distribution of displacements is non-Gaussian. In situations when the convergence to Gaussian still takes place at longer times, the probability density of the displacements may show a persisting peak around the distribution's mode, and the pathway of convergence to the Gaussian is unusual. One of the theoretical models showing such a behavior corresponds to a disordered system with local diffusion coefficients slowly varying in space. While the standard pathway to Gaussian, as proposed by the Central Limit Theorem, would assume that the peak, under the corresponding rescaling, smoothens and lowers in course of the time; in the model discussed, the peak, under rescaling, narrows and stays sharp. In the present work, we discuss the nature of this peak. On a coarse-grained level, the motion of the particles in the diffusivity landscape is described by continuous time random walks with correlations between waiting times and positions. The peak is due to strong spatiotemporal correlations along the trajectories of diffusing particles. Destroying these correlations while keeping the temporal structure of the process intact leads to the decay of the peak. We also note that the correlated CTRW model reproducing serial correlations between the waiting times along the trajectory fails to quantitatively reproduce the shape of the peak even for the decorrelated motion, while being quite accurate in the wings of the PDF. This shows the importance of high-order temporal correlations for the peak's formation.",
  "categories": [
    "cond-mat.stat-mech",
    "cond-mat.dis-nn"
  ],
  "primary_category": "cond-mat.stat-mech",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16504",
  "pdf_url": "https://arxiv.org/pdf/2307.16504v1",
  "comment": "23 pages, 7 figures",
  "num_versions": null,
  "size_before_bytes": 1467560,
  "size_after_bytes": 195751
}