{
  "title": "Panchromatic Photometry of Low-redshift, Massive Galaxies Selected from SDSS Stripe 82",
  "authors": [
    "Yang A. Li",
    "Luis C. Ho",
    "Jinyi Shangguan",
    "Ming-Yang Zhuang",
    "Ruancun Li"
  ],
  "submission_date": "2023-07-25T12:41:23+00:00",
  "revised_dates": [],
  "abstract": "The broadband spectral energy distribution of a galaxy encodes valuable information on its stellar mass, star formation rate (SFR), dust content, and possible fractional energy contribution from nonstellar sources. We present a comprehensive catalog of panchromatic photometry, covering 17 bands from the far-ultraviolet to 500 $μ$m, for 2685 low-redshift (z=0.01-0.11), massive ($M_* > 10^{10}\\,M_\\odot$) galaxies selected from the Stripe 82 region of the Sloan Digital Sky Survey, one of the largest areas with relatively deep, uniform observations over a wide range of wavelengths. Taking advantage of the deep optical coadded images, we develop a hybrid approach for matched-aperture photometry of the multi-band data. We derive robust uncertainties and upper limits for undetected galaxies, deblend interacting/merging galaxies and sources in crowded regions, and treat contamination by foreground stars. We perform spectral energy distribution fitting to derive the stellar mass, SFR, and dust mass, critically assessing the influence of flux upper limits for undetected photometric bands and applying corrections for systematic uncertainties based on extensive mock tests. Comparison of our measurements with those of commonly used published catalogs reveals good agreement for the stellar masses. While the SFRs of galaxies on the star-forming main sequence show reasonable consistency, galaxies in and below the green valley show considerable disagreement between different sets of measurements. Our analysis suggests that one should incorporate the most accurate and inclusive photometry into the spectral energy distribution analysis, and that care should be exercised in interpreting the SFRs of galaxies with moderate to weak star formation activity.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.3847/1538-4365/acd4b5",
  "journal_ref": "2023ApJS..267...17L",
  "arxiv_id": "2307.13461",
  "pdf_url": null,
  "comment": "36 pages, 24 figures",
  "num_versions": null,
  "size_before_bytes": 5729662,
  "size_after_bytes": 434488
}