{
  "title": "Study of Magnetic Field and Turbulence in the TeV halo around Monogem Pulsar",
  "authors": [
    "Sunil Malik",
    "Ka Ho Yuen",
    "Huirong Yan"
  ],
  "submission_date": "2023-07-25T08:55:53+00:00",
  "revised_dates": [
    "2024-03-21T00:44:47+00:00"
  ],
  "abstract": "Magnetic fields are ubiquitous in the interstellar medium, including extended objects such as supernova remnants and diffuse halos around Pulsars. Its turbulent characteristics govern the diffusion of cosmic rays and the multi-wavelength emission from PWNe. However, the geometry and turbulence nature of the magnetic fields in the ambient region of PWN is still unknown. Recent gamma-ray observations from HAWC and synchrotron observations suggest a highly suppressed diffusion coefficient compared to the mean interstellar value. In this study, we present the first direct observational evidence of the orientation of the mean magnetic field and turbulent characteristics by employing a recently developed statistical parameter `Y$_{turb}$' in the extended halo around the Monogem pulsar. Our study points two possible scenarios: nearly aligned toward the line of sight (LoS) with compressible modes dominance or high inclination angle toward LoS and characterized by Alfvénic turbulence. The first scenario appears consistent with other observational signatures. Furthermore, we report that the magnetic field has an observed correlation length of approximately $3 \\pm 0.6 {\\rm pc}$ in the Monogem halo. Our study highlights the pivotal role of magnetic field and turbulence in unraveling the physical processes in TeV halos and cosmic ray transport.",
  "categories": [
    "astro-ph.HE",
    "astro-ph.GA",
    "astro-ph.SR"
  ],
  "primary_category": "astro-ph.HE",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13342",
  "pdf_url": null,
  "comment": "6 pages, 3 figures, 2 tables, Accepted for publication in ApJ",
  "num_versions": null,
  "size_before_bytes": 3184722,
  "size_after_bytes": 664839
}