{
  "title": "Dust enrichment and grain growth in a smooth disk around the DG Tau protostar revealed by ALMA triple bands frequency observations",
  "authors": [
    "Satoshi Ohashi",
    "Munetake Momose",
    "Akimasa Kataoka",
    "Aya E Higuchi",
    "Takashi Tsukagoshi",
    "Takahiro Ueda",
    "Claudio Codella",
    "Linda Podio",
    "Tomoyuki Hanawa",
    "Nami Sakai",
    "Hiroshi Kobayashi",
    "Satoshi Okuzumi",
    "Hidekazu Tanaka"
  ],
  "submission_date": "2023-07-26T22:08:29+00:00",
  "revised_dates": [],
  "abstract": "Characterizing the physical properties of dust grains in a protoplanetary disk is critical to comprehending the planet formation process. Our study presents ALMA high-resolution observations of the young protoplanetary disk around DG Tau at a 1.3 mm dust continuum. The observations, with a spatial resolution of $\\approx 0.04''$, or $\\approx5$ au, revealed a geometrically thin and smooth disk without substantial substructures, suggesting that the disk retains the initial conditions of the planet formation. To further analyze the distributions of dust surface density, temperature, and grain size, we conducted a multi-band analysis with several dust models, incorporating ALMA archival data of the 0.87 mm and 3.1 mm dust polarization. The results showed that the Toomre $Q$ parameter is $\\lesssim2$ at a 20 au radius, assuming a dust-to-gas mass ratio of 0.01. This implies that a higher dust-to-gas mass ratio is necessary to stabilize the disk. The grain sizes depend on the dust models, and for the DSHARP compact dust, they were found to be smaller than $\\sim400$ $μ$m in the inner region ($r\\lesssim20$ au), while exceeding larger than 3 mm in the outer part. Radiative transfer calculations show that the dust scale height is lower than at least one-third of the gas scale height. These distributions of dust enrichment, grain sizes, and weak turbulence strength may have significant implications for the formation of planetesimals through mechanisms such as streaming instability. We also discuss the CO snowline effect and collisional fragmentation in dust coagulation for the origin of the dust size distribution.",
  "categories": [
    "astro-ph.EP",
    "astro-ph.SR"
  ],
  "primary_category": "astro-ph.EP",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14526",
  "pdf_url": "https://arxiv.org/pdf/2307.14526v1",
  "comment": "29 pages, 21 figures, 5 tables. Accepted for publication in ApJ",
  "num_versions": null,
  "size_before_bytes": 6878921,
  "size_after_bytes": 539335
}