{
  "title": "Coincidence detection probability of $(γ, 2e)$ photoemission measurement",
  "authors": [
    "Yuehua Su",
    "Kun Cao",
    "Chao Zhang"
  ],
  "submission_date": "2023-07-24T14:57:09+00:00",
  "revised_dates": [
    "2023-07-26T00:09:05+00:00",
    "2024-10-07T00:23:05+00:00"
  ],
  "abstract": "In the study of strongly correlated electrons, one of the challenging core tasks is to develop the potential techniques for direct detection of the many-body correlations of strongly correlated electrons. The $(γ, 2e)$ photoemission technique has been developed to investigate the two-body correlations of the target correlated electrons. In this article, we will focus on this technique for the correlated electrons near the Fermi energy in condensed matter. The coincidence detection probability of the two emitted electrons in the $(γ, 2e)$ photoemission measurement is shown to be relevant to a two-body Bethe-Salpeter wave function, which describes the dynamical two-body correlations of the target correlated electrons near the Fermi energy. As the coincidence detection probability involves an electron-electron interaction matrix element, the arbitrary momentum and/or energy transfer due to this electron-electron interaction makes the $(γ, 2e)$ photoemission technique fail to reveal the inner-pair structures of the two-body Bethe-Salpeter wave function. However, the center-of-mass momentum and energy of the two-body Bethe-Salpeter wave function can be distinctly resolved. Thus, the $(γ, 2e)$ photoemission technique can provide the center-of-mass physics of the two-body correlations of the target correlated electrons. It will be one potential technique to study the center-of-mass physics of the Cooper pairs in superconductor.",
  "categories": [
    "cond-mat.supr-con",
    "cond-mat.str-el"
  ],
  "primary_category": "cond-mat.supr-con",
  "doi": "10.1088/1361-648X/ad7e74",
  "journal_ref": "J. Phys.: Condens. Matter 36 (2024) 505602",
  "arxiv_id": "2307.12857",
  "pdf_url": null,
  "comment": "11 pages, 3 figures, published version",
  "num_versions": null,
  "size_before_bytes": 864054,
  "size_after_bytes": 404779
}