{
  "title": "PUF Probe: A PUF-based Hardware Authentication Equipment for IEDs",
  "authors": [
    "Vishal D. Jadhav",
    "Narahari N. Moudhgalya",
    "Tapabrata Sen",
    "T. V. Prabhakar"
  ],
  "submission_date": "2023-07-28T06:32:20+00:00",
  "revised_dates": [],
  "abstract": "Intelligent Electronic Devices (IEDs) are vital components in modern electrical substations, collectively responsible for monitoring electrical parameters and performing protective functions. As a result, ensuring the integrity of IEDs is an essential criteria. While standards like IEC 61850 and IEC 60870-5-104 establish cyber-security protocols for secure information exchange in IED-based power systems, the physical integrity of IEDs is often overlooked, leading to a rise in counterfeit and tainted electronic products. This paper proposes a physical unclonable function (PUF)-based device (IEDPUF probe) capable of extracting unique hardware signatures from commercial IEDs. These signatures can serve as identifiers, facilitating the authentication and protection of IEDs against counterfeiting. The paper presents the complete hardware architecture of the IEDPUF probe, along with algorithms for signature extraction and authentication. The process involves the central computer system (CCS) initiating IED authentication requests by sending random challenges to the IEDPUF probe. Based on the challenges, the IEDPUF probe generates responses, which are then verified by the CCS to authenticate the IED. Additionally, a two-way authentication technique is employed to ensure that only verified requests are granted access for signature extraction. Experimental results confirm the efficacy of the proposed IEDPUF probe. The results demonstrate its ability to provide real-time responses possessing randomness while uniquely identifying the IED under investigation. The proposed IEDPUF probe offers a simple, cost-effective, accurate solution with minimal storage requirements, enhancing the authenticity and integrity of IEDs within electrical substations",
  "categories": [
    "cs.CR",
    "eess.SP",
    "eess.SY"
  ],
  "primary_category": "cs.CR",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15338",
  "pdf_url": "https://arxiv.org/pdf/2307.15338v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 30374243,
  "size_after_bytes": 356714
}