{
  "title": "Multi-Agent Graph Reinforcement Learning based On-Demand Wireless Energy Transfer in Multi-UAV-aided IoT Network",
  "authors": [
    "Ze Yu Zhao",
    "Yueling Che",
    "Sheng Luo",
    "Kaishun Wu",
    "Victor C. M. Leung"
  ],
  "submission_date": "2023-07-27T05:02:13+00:00",
  "revised_dates": [],
  "abstract": "This paper proposes a new on-demand wireless energy transfer (WET) scheme of multiple unmanned aerial vehicles (UAVs). Unlike the existing studies that simply pursuing the total or the minimum harvested energy maximization at the Internet of Things (IoT) devices, where the IoT devices' own energy requirements are barely considered, we propose a new metric called the hungry-level of energy (HoE), which reflects the time-varying energy demand of each IoT device based on the energy gap between its required energy and the harvested energy from the UAVs. With the purpose to minimize the overall HoE of the IoT devices whose energy requirements are not satisfied, we optimally determine all the UAVs' trajectories and WET decisions over time, under the practical mobility and energy constraints of the UAVs. Although the proposed problem is of high complexity to solve, by excavating the UAVs' self-attentions for their collaborative WET, we propose the multiagent graph reinforcement learning (MAGRL) based approach. Through the offline training of the MAGRL model, where the global training at the central controller guides the local training at each UAV agent, each UAV then distributively determines its trajectory and WET based on the well-trained local neural networks. Simulation results show that the proposed MAGRL-based approach outperforms various benchmarks for meeting the IoT devices' energy requirements.",
  "categories": [
    "cs.IT"
  ],
  "primary_category": "cs.IT",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14626",
  "pdf_url": "https://arxiv.org/pdf/2307.14626v1",
  "comment": "This paper is accepted by the 21th International Symposium on Modeling and Optimization in Mobile, Ad hoc, and Wireless Networks (WiOpt 2023). 8 pages, 8 figures, conference",
  "num_versions": null,
  "size_before_bytes": 6172013,
  "size_after_bytes": 352221
}