{
  "title": "Optimized nuclear energy density functionals including long-range pion contributions",
  "authors": [
    "L. Zurek",
    "S. K. Bogner",
    "R. J. Furnstahl",
    "R. Navarro Pérez",
    "N. Schunck",
    "A. Schwenk"
  ],
  "submission_date": "2023-07-25T15:22:05+00:00",
  "revised_dates": [
    "2024-01-22T01:04:56+00:00"
  ],
  "abstract": "Nuclear energy density functionals successfully reproduce properties of nuclei across almost the entire nuclear chart. However, nearly all available functionals are phenomenological in nature and lack a rigorous connection to systematically improvable nuclear forces. This issue might be solved with an energy density functional obtained from first principles. As an intermediate step towards this goal we construct the GUDE family of functionals that is obtained from a hybrid scheme consisting of long-range pion-exchange contributions derived from chiral effective field theory at the Hartree-Fock level and a phenomenological Skyrme part. When including pion contributions beyond next-to-leading order in the chiral expansion, we find significant improvements over a reference Skyrme functional constructed following the same protocol. We analyze the importance of different pion contributions and identify which terms drive the observed improvements. Since pions are incorporated without adding further optimization parameters to the functionals, the improvements can be attributed to the functional form of these terms. Our work therefore suggests that the considered chiral contributions constitute useful ingredients for true ab initio energy density functionals.",
  "categories": [
    "nucl-th",
    "nucl-ex"
  ],
  "primary_category": "nucl-th",
  "doi": "10.1103/PhysRevC.109.014319",
  "journal_ref": "Phys. Rev. C 109, 014319 (2024)",
  "arxiv_id": "2307.13568",
  "pdf_url": null,
  "comment": "21 pages, 12 figures, corresponds to published version",
  "num_versions": null,
  "size_before_bytes": 1122938,
  "size_after_bytes": 500482
}