{
  "title": "Viscous lubrication force between spherical bubbles with time-dependent radii",
  "authors": [
    "Jean-Lou Pierson"
  ],
  "submission_date": "2023-07-24T07:35:31+00:00",
  "revised_dates": [
    "2024-02-28T01:46:18+00:00"
  ],
  "abstract": "Motivated by the dynamics of microbubbles in dissolved gas flotation processes, we consider theoretically the approach between two shear-free spherical bubbles with time-dependent radii. We make use of the lubrication assumption to obtain the thin film flow between the bubbles. Our analysis underscores that for the shear-free condition and spherical shape assumption to hold, both the viscosity ratio and the capillary number must be significantly smaller than the thickness of the film. We demonstrate that the lubrication force exhibits weak singular behavior, scaling logarithmically with the ratio of bubble radius to film thickness. To assess the accuracy of our findings, we compare the obtained solution to results from Stokes flow theory. The comparison demonstrates that our current results are reliable, provided that we combine the lubrication forces with subdominant corrections, which require proper matching and computation to the solution far from the film. In practice, we compute these subdominant corrections in the case of two equal bubbles or a bubble close to a plane-free surface either by a curve fit of numerical results from bi-spherical coordinate solutions or by using results from the literature. We illustrate the relevance of the solution to determine the drainage time of a small bubble rising to a free surface and the drainage rate of expanding bubbles under force-free conditions. Finally, in the discussion, we relax the assumption of negligible shear and show that even a small but non-negligible shear induced by fluid motion within the bubble introduces a singular term in the lubrication force.",
  "categories": [
    "physics.flu-dyn"
  ],
  "primary_category": "physics.flu-dyn",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12570",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 2438523,
  "size_after_bytes": 547241
}