{
  "title": "Gas flow-directed growth of aligned carbon nanotubes from nonmetallic seeds",
  "authors": [
    "Yuanjia Liu",
    "Taiki Inoue",
    "Mengyue Wang",
    "Michiharu Arifuku",
    "Noriko Kiyoyanagi",
    "Yoshihiro Kobayashi"
  ],
  "submission_date": "2023-07-24T12:15:25+00:00",
  "revised_dates": [],
  "abstract": "Kite growth is a process that utilizes laminar gas flow in chemical vapor deposition to grow long, well-aligned carbon nanotubes (CNTs) for electronic application. This process uses metal nanoparticles (NPs) as catalytic seeds for CNT growth. However, these NPs remain as impurities in the grown CNT. In this study, nanodiamonds (NDs) with negligible catalytic activity were utilized as nonmetallic seeds instead of metal catalysts because they are stable at high temperatures and facilitate the growth of low-defect CNTs without residual metal impurities. Results demonstrate the successful growth of over 100-$μ$m-long CNTs by carefully controlling the growth conditions. Importantly, we developed an analysis method that utilizes secondary electron (SE) yield to distinguish whether or not CNTs grown from metal impurities. The absence of metallic NPs at the CNT tips was revealed by the SE yield mapping, whereas the presence of some kind of NPs at the same locations was confirmed by atomic force microscopy (AFM). These results suggest that most of the aligned CNTs were grown from nonmetallic seeds, most likely ND-derived NPs, via the tip-growth mode. Structural characterizations revealed the high crystallinity of CNTs, with relatively small diameters. This study presents the first successful use of nonmetallic seeds for kite growth and provides a convincing alternative for starting materials to prepare long, aligned CNTs without metal impurities. The findings of this study pave the way for more convenient fabrication of aligned CNT-based devices, potentially simplifying the production process by avoiding the need for the removal of metal impurities.",
  "categories": [
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": "10.1016/j.carbon.2023.118309",
  "journal_ref": "Carbon 214, 118309 (2023)",
  "arxiv_id": "2307.12727",
  "pdf_url": null,
  "comment": "Accepted version. Main manuscript: 26 pages, 6 figures. Supporting information: 8 pages, 9 figures",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}