{
  "title": "Skyrme-Hartree-Fock-Bogoliubov mass models on a 3D mesh: III. From atomic nuclei to neutron stars",
  "authors": [
    "Guilherme Grams",
    "Wouter Ryssens",
    "Guillaume Scamps",
    "Stephane Goriely",
    "Nicolas Chamel"
  ],
  "submission_date": "2023-07-26T16:14:10+00:00",
  "revised_dates": [
    "2023-10-09T00:18:50+00:00"
  ],
  "abstract": "We present BSkG3, the latest entry in the Brussels-Skyrme-on-a-grid series of large-scale models of nuclear structure based on an energy density functional. Compared to its predecessors, the new model offers a more realistic description of nucleonic matter at the extreme densities relevant to neutron stars. This achievement is made possible by incorporating a constraint on the infinite nuclear matter properties at high densities in the parameter adjustment, ensuring in this way that the predictions of BSkG3 for the nuclear Equation of State are compatible with the observational evidence for heavy pulsars with $M > 2 M_{\\odot}$. Instead of the usual phenomenological pairing terms, we also employ a more microscopically founded treatment of nucleon pairing, resulting in extrapolations to high densities that are in line with the predictions of advanced many-body methods and are hence more suited to the study of superfluidity in neutron stars. By adopting an extended form of the Skyrme functional, we are able to reconcile the description of matter at high densities and at saturation density: the new model further refines the description of atomic nuclei offered by its predecessors. A qualitative improvement is our inclusion of ground state reflection asymmetry, in addition to the spontaneous breaking of rotational, axial, and time-reversal symmetry. Quantitatively, the model offers lowered root-mean-square deviations on 2457 masses (0.631 MeV), 810 charge radii (0.0237 fm) and an unmatched accuracy with respect to 45 primary fission barriers of actinide nuclei (0.33 MeV). Reconciling the complexity of neutron stars with those of atomic nuclei establishes BSkG3 as a tool of choice for applications to nuclear structure, the nuclear equation of state and nuclear astrophysics in general.",
  "categories": [
    "nucl-th",
    "nucl-ex"
  ],
  "primary_category": "nucl-th",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14276",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 5596992,
  "size_after_bytes": 621779
}