{
  "title": "A Survey on the Integration of NAND Flash Storage in the Design of File Systems and the Host Storage Software Stack",
  "authors": [
    "Nick Tehrany",
    "Krijn Doekemeijer",
    "Animesh Trivedi"
  ],
  "submission_date": "2023-07-21T19:14:40+00:00",
  "revised_dates": [],
  "abstract": "With the ever-increasing amount of data generate in the world, estimated to reach over 200 Zettabytes by 2025, pressure on efficient data storage systems is intensifying. The shift from HDD to flash-based SSD provides one of the most fundamental shifts in storage technology, increasing performance capabilities significantly. However, flash storage comes with different characteristics than prior HDD storage technology. Therefore, storage software was unsuitable for leveraging the capabilities of flash storage. As a result, a plethora of storage applications have been design to better integrate with flash storage and align with flash characteristics.\n  In this literature study we evaluate the effect the introduction of flash storage has had on the design of file systems, which providing one of the most essential mechanisms for managing persistent storage. We analyze the mechanisms for effectively managing flash storage, managing overheads of introduced design requirements, and leverage the capabilities of flash storage. Numerous methods have been adopted in file systems, however prominently revolve around similar design decisions, adhering to the flash hardware constrains, and limiting software intervention. Future design of storage software remains prominent with the constant growth in flash-based storage devices and interfaces, providing an increasing possibility to enhance flash integration in the host storage software stack.",
  "categories": [
    "cs.OS"
  ],
  "primary_category": "cs.OS",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11866",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 4686505,
  "size_after_bytes": 904585
}