{
  "title": "Neutrino mixing sum rules and the Littlest Seesaw",
  "authors": [
    "Francesco Costa",
    "Stephen F. King"
  ],
  "submission_date": "2023-07-26T01:40:39+00:00",
  "revised_dates": [
    "2023-08-08T00:35:54+00:00",
    "2023-11-02T00:22:44+00:00",
    "2024-04-16T02:19:00+00:00"
  ],
  "abstract": "In this work, we study the neutrino mixing sum rules arising from discrete symmetries, and the class of Littlest Seesaw (LS) neutrino models. These symmetry based approaches all offer predictions for the cosine of the leptonic CP phase $\\cos δ$ in terms of the mixing angles, $θ_{13}$, $θ_{12}$, $θ_{23}$, while the LS models also predict the sine of the leptonic CP phase $\\sin δ$ as well as making other predictions. In particular we study the \\textit{solar} neutrino mixing sum rules, arising from charged lepton corrections to Tri-bimaximal (TB), Bi-maximal (BM), Golden Ratios (GRs) and Hexagonal (HEX) neutrino mixing, and \\textit{atmospheric} neutrino mixing sum rules, arising from preserving one of the columns of these types of mixing, for example the first or second column of the TB mixing matrix (TM1 or TM2), and confront them with an up-to-date global fit of the neutrino oscillation data. We show that some mixing sum rules, for example an \\textit{atmospheric} neutrino mixing sum rule arising from a version of neutrino Golden Ratio mixing (GRa1), are already excluded at 3$σ$, and determine the remaining models allowed by the data. We also consider the more predictive LS models (which obey the TM1 sum rules and offer further predictions) based on constrained sequential dominance CSD($n$) with $n\\approx 3$. We compare for the first time the three cases $n=2.5$, $n=3$ and $n=1+\\sqrt{6}\\approx 3.45$ which are favoured by theoretical models, using a new type of analysis to accurately predict the observables $θ_{12}$, $θ_{23}$ and $δ$. We study all the above approaches, \\textit{solar} and \\textit{atmospheric} mixing sum rules and LS models, together so that they may be compared, and to give an up to date analysis of the predictions of all of these possibilities, when confronted with the most recent global fits.",
  "categories": [
    "hep-ph"
  ],
  "primary_category": "hep-ph",
  "doi": "10.3390/universe9110472",
  "journal_ref": "Universe 2023, 9, 472",
  "arxiv_id": "2307.13895",
  "pdf_url": null,
  "comment": "Fig 6 has been updated",
  "num_versions": null,
  "size_before_bytes": 22799727,
  "size_after_bytes": 5574627
}