{
  "title": "HINOTORI I: The Nature of Rejuvenation Galaxies",
  "authors": [
    "Takumi S. Tanaka",
    "Kazuhiro Shimasaku",
    "Sandro Tacchella",
    "Makoto Ando",
    "Kei Ito",
    "Hassen M. Yesuf",
    "Suin Matsui"
  ],
  "submission_date": "2023-07-26T15:04:03+00:00",
  "revised_dates": [],
  "abstract": "We present the HINOTORI (star formation History INvestigatiOn TO find RejuvenatIon) project to reveal the nature of rejuvenation galaxies (RGs), which are galaxies that restarted their star formation after being quiescent. As the first step of HINOTORI, we construct the largest RG sample with 1071 sources. We select these RGs from 8857 MaNGA (Mapping Nearby Galaxies at APO) survey galaxies by reconstructing their star formation histories with Prospector spectral energy distribution fitting code. Both optical spectral data and UV to IR photometric data are used for the fitting. Using mock data, we confirm that our method can detect weak rejuvenation events that form only about 0.1% of the total stellar mass with high completeness. The RGs account for ~10% of the whole sample, and rejuvenation events contribute on average only about 0.1% of the total stellar mass in those galaxies but 17% of the cosmic-star formation rate density today. Our RGs have a similar mass distribution to quiescent galaxies (QGs). However, the morphology of the RGs is more disk-like than QGs, suggesting that rejuvenation may occur selectively in disk-like QGs. Our results also suggest the possibility of multiple-time rejuvenation events in a single galaxy. Further spatially resolved analyses of integral field unit data and radio observations and comparisons to simulations are needed to identify the mechanism and the role of rejuvenation in galaxy evolution.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14235",
  "pdf_url": null,
  "comment": "33 pages, 22 figures. Submitted to PASJ",
  "num_versions": null,
  "size_before_bytes": 9362028,
  "size_after_bytes": 299749
}