{
  "title": "Effective-Hamiltonian theory: An approximation to the equilibrium state of open quantum systems",
  "authors": [
    "Nicholas Anto-Sztrikacs",
    "Brett Min",
    "Marlon Brenes",
    "Dvira Segal"
  ],
  "submission_date": "2023-07-26T17:50:08+00:00",
  "revised_dates": [],
  "abstract": "We extend and benchmark the recently-developed Effective-Hamiltonian (EFFH) method [PRX Quantum $\\bf{4}$, 020307 (2023)] as an approximation to the equilibrium state (\"mean-force Gibbs state\") of a quantum system at strong coupling to a thermal bath. The EFFH method is an approximate framework. Through a combination of the reaction-coordinate mapping, a polaron transformation and a controlled truncation, it imprints the system-bath coupling parameters into the system's Hamiltonian. First, we develop a $\\textit{variational}$ EFFH technique. In this method, system's parameters are renormalized by both the system-bath coupling parameters (as in the original EFFH approach) and the bath's temperature. Second, adopting the generalized spin-boson model, we benchmark the equilibrium state from the EFFH treatment against numerically-exact simulations and demonstrate a good agreement for both polarization and coherences using the Brownian spectral function. Third, we contrast the (normal and variational) EFFH approach with the familiar (normal and variational) polaron treatment. We show that the two methods predict a similar structure for the equilibrium state, albeit the EFFH approach offers the advantage of simpler calculations and closed-form analytical results. Altogether, we argue that for temperatures comparable to the system's frequencies, the EFFH methodology provides a good approximation for the mean-force Gibbs state in the full range of system-bath coupling, from ultraweak to ultrastrong.",
  "categories": [
    "cond-mat.stat-mech",
    "quant-ph"
  ],
  "primary_category": "cond-mat.stat-mech",
  "doi": "10.1103/PhysRevB.108.115437",
  "journal_ref": "Phys. Rev. B 108, 115437 (2023)",
  "arxiv_id": "2307.14330",
  "pdf_url": null,
  "comment": "21 pages, 5 figures",
  "num_versions": null,
  "size_before_bytes": 1498107,
  "size_after_bytes": 126618
}