{
  "title": "Efficient Gaussian Process Classification-based Physical-Layer Authentication with Configurable Fingerprints for 6G-Enabled IoT",
  "authors": [
    "Rui Meng",
    "Fangzhou Zhu",
    "Xiqi Cheng",
    "Xiaodong Xu",
    "Bizhu Wang",
    "Chen Dong",
    "Bingxuan Xu",
    "Xiaofeng Tao",
    "Ping Zhang"
  ],
  "submission_date": "2023-07-23T08:28:35+00:00",
  "revised_dates": [
    "2024-09-10T01:01:15+00:00",
    "2025-04-08T00:48:23+00:00"
  ],
  "abstract": "The future 6G-enabled IoT will facilitate seamless global connectivity among ubiquitous wireless devices, but this advancement also introduces heightened security risks such as spoofing attacks. Physical-Layer Authentication (PLA) has emerged as a promising, inherently secure, and energy-efficient technique for authenticating IoT terminals. Nonetheless, the direct application of state-of-the-art PLA schemes to 6G-enabled IoT encounters two major hurdles: inaccurate channel fingerprints and the inefficient utilization of prior fingerprint information. To tackle these challenges, we leverage Reconfigurable Intelligent Surfaces (RISs) to enhance fingerprint accuracy. Additionally, we integrate active learning and Gaussian Processes (GPs) to propose an Efficient Gaussian Process Classification (EGPC)-based PLA scheme, aiming for reliable and lightweight authentication. Following Bayes' theorem, we model configurable fingerprints using GPs and employ the expectation propagation method to identify unknown fingerprints. Given the difficulty of obtaining sufficient labeled fingerprint samples to train PLA models, we propose three fingerprint selection algorithms. These algorithms select unlabeled fingerprints and query their identities using upper-layer authentication mechanisms. Among these methods, the optimal algorithm reduces the number of training fingerprints needed through importance sampling and eliminates the requirement for PLA model retraining through joint distribution calculation. Simulations results reveal that, in comparison with non-RIS-based approaches, the RIS-aided PLA framework decreases the authentication error rate by 98.69%. In addition, our designed fingerprint selection algorithms achieve a reduction in the authentication error rate of up to 86.93% compared to baseline active learning schemes.",
  "categories": [
    "eess.SP"
  ],
  "primary_category": "eess.SP",
  "doi": "10.1109/TCE.2025.3557239",
  "journal_ref": null,
  "arxiv_id": "2307.12263",
  "pdf_url": null,
  "comment": "14 pages, 9 figures",
  "num_versions": null,
  "size_before_bytes": 12866993,
  "size_after_bytes": 390172
}