{
  "title": "First-principles Calculations of MoSeTe/WSeTe Bilayers: Stability, Phonons, Electronic Band Offsets, and Rashba Splitting",
  "authors": [
    "Hamid Mehdipour",
    "Peter Kratzer"
  ],
  "submission_date": "2023-07-21T18:18:26+00:00",
  "revised_dates": [
    "2024-06-04T00:38:11+00:00"
  ],
  "abstract": "Janus materials have attracted much interest due to their intrinsic electric dipole moment and Rashba band splitting. We show that, by building bilayers of MoSeTe and WSeTe with different chalcogen atom sequences and different stacking patterns, one can modulate the net dipole moment strength and the Rashba effect, as well as the band alignment of the MoSeTe/WSeTe bilayer. Type-II band alignment is found which can be exploited to create long-lived interlayer excitons. Moreover, it is shown that the atomic sequence and stacking play pivotal roles in the interlayer distance of MoSeTe/WSeTe and thus its electronic structure and vibrational, especially low-frequency, characteristics. The long-range dispersion forces between atoms are treated with a conventional additive pairwise, as well as a many-body-dispersion method. It is shown that under the many-body dispersion method, more clear and rational thermodynamic trends of bilayer stacking are realized and interface distances are estimated more accurately. Vibrational spectra of the bilayers are calculated using first-principles phonon calculations and the fingerprints of monolayer attraction and repulsion are identified. An anti-correlation between distance and the shearing mode frequency of the rigid monolayers is demonstrated which agrees well with experimental findings. The results suggest that the judicious selection of the atomic sequence and stacking helps to widen the scope of the low-dimensional materials by adding or enhancing properties for specific applications, e.g. for spintronics or valleytronics devices.",
  "categories": [
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": "10.1103/PhysRevB.109.085425",
  "journal_ref": "Phys. Rev. B 109, 085425 (2024)",
  "arxiv_id": "2307.11839",
  "pdf_url": null,
  "comment": "19 pages, 12 figures",
  "num_versions": null,
  "size_before_bytes": 9011390,
  "size_after_bytes": 273697
}