{
  "title": "Supersonic friction of a black hole traversing a self-interacting scalar dark matter cloud",
  "authors": [
    "Alexis Boudon",
    "Philippe Brax",
    "Patrick Valageas"
  ],
  "submission_date": "2023-07-28T08:37:55+00:00",
  "revised_dates": [
    "2023-08-16T13:43:29+00:00"
  ],
  "abstract": "Black Holes (BH) traversing a dark matter cloud made out of a self-interacting scalar soliton are slowed down by two complementary effects. At low subsonic speeds, the BH accretes dark matter and this is the only source of dragging along its motion, if we neglect the backreaction of the cloud self-gravity. The situation changes at larger supersonic speeds where a shock appears. This leads to the emergence of an additional friction term, associated with the gravitational and scalar pressure interactions and with the wake behind the moving BH. This is a long distance effect that can be captured by the hydrodynamical regime of the scalar flow far away from the BH. This dynamical friction term has the same form as the celebrated Chandrasekhar collisionless result, albeit with a well-defined Coulomb logarithm and a prefactor that is smaller by a factor 2/3. The infra-red cut-off is naturally provided by the size of the scalar cloud, which is set by the scalar mass and coupling, whilst the ultra-violet behaviour corresponds to the distance from the BH where the velocity field is significantly perturbed by the BH, which is determined by pressure effects. As a result, supersonic BH are slowed down by both the accretion drag and the dynamical friction. This effect will be potentially detectable by future gravitational wave experiments as it influences the phase of the gravitational wave signal from inspiralling binaries.",
  "categories": [
    "astro-ph.CO",
    "astro-ph.GA",
    "gr-qc",
    "hep-th"
  ],
  "primary_category": "astro-ph.CO",
  "doi": "10.1103/PhysRevD.108.103517",
  "journal_ref": "Phys. Rev. D 108, 103517 (2023)",
  "arxiv_id": "2307.15391",
  "pdf_url": "https://arxiv.org/pdf/2307.15391v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 981181,
  "size_after_bytes": 615024
}