{
  "title": "LIGO-Virgo-KAGRA's Oldest Black Holes: Probing star formation at cosmic noon with GWTC-3",
  "authors": [
    "Maya Fishbach",
    "Lieke van Son"
  ],
  "submission_date": "2023-07-28T21:49:39+00:00",
  "revised_dates": [
    "2023-10-18T21:33:05+00:00"
  ],
  "abstract": "In their third observing run, the LIGO-Virgo-KAGRA gravitational-wave (GW) observatory was sensitive to binary black hole (BBH) mergers out to redshifts $z_\\mathrm{merge}\\approx1$. Because GWs are inefficient at shrinking the binary orbit, some of these BBH systems likely experienced long delay times $τ$ between the formation of their progenitor stars at $z_\\mathrm{form}$ and their GW merger at $z_\\mathrm{merge}$. In fact, the distribution of delay times predicted by isolated binary evolution resembles a power law $p(τ)\\proptoτ^{α_τ}$ with slope $-1\\lesssimα_τ\\lesssim-0.35$ and a minimum delay time of $τ_\\mathrm{min}=10$ Myr. We use these predicted delay time distributions to infer the formation redshifts of the $\\sim70$ BBH events reported in the third GW transient catalog GWTC-3 and the formation rate of BBH progenitors. For our default $α_τ=-1$ delay time distribution, we find that GWTC-3 contains at least one system (with 90\\% credibility) that formed earlier than $z_\\mathrm{form}>4.4$. Comparing our inferred BBH progenitor formation rate to the star formation rate (SFR), we find that at $z_\\mathrm{form}=4$, the number of BBH progenitor systems formed per stellar mass was $6.4^{+9.4}_{-5.5}\\times10^{-6}\\,M_\\odot^{-1}$ and this yield dropped to $0.134^{+1.6}_{-0.127}\\times10^{-6}\\,M_\\odot^{-1}$ by $z_\\mathrm{form}=0$. We discuss implications of this measurement for the cosmic metallicity evolution, finding that for typical assumptions about the metallicity-dependence of the BBH yield, the average metallicity at $z_\\mathrm{form}=4$ was $\\langle\\log_{10}(Z/Z_\\odot)\\rangle=-0.3^{+0.3}_{-0.4}$, although the inferred metallicity can vary by a factor of $\\approx3$ for different assumptions about the BBH yield. Our results highlight the promise of current GW observatories to probe high-redshift star formation.",
  "categories": [
    "astro-ph.GA",
    "astro-ph.HE",
    "gr-qc"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.3847/2041-8213/ad0560",
  "journal_ref": "ApJL 957 L31 (2023)",
  "arxiv_id": "2307.15824",
  "pdf_url": "https://arxiv.org/pdf/2307.15824v2",
  "comment": "Updates to some calculations following helpful referee comments. Accepted by ApJL. 17 pages, 8 figures",
  "num_versions": null,
  "size_before_bytes": 5678214,
  "size_after_bytes": 1393648
}