{
  "title": "Robust Graph Contrastive Learning with Information Restoration",
  "authors": [
    "Yulin Zhu",
    "Xing Ai",
    "Yevgeniy Vorobeychik",
    "Kai Zhou"
  ],
  "submission_date": "2023-07-24T06:41:59+00:00",
  "revised_dates": [
    "2025-06-10T00:34:37+00:00",
    "2025-08-25T00:19:54+00:00"
  ],
  "abstract": "The graph contrastive learning (GCL) framework has gained remarkable achievements in graph representation learning. However, similar to graph neural networks (GNNs), GCL models are susceptible to graph structural attacks. As an unsupervised method, GCL faces greater challenges in defending against adversarial attacks. Furthermore, there has been limited research on enhancing the robustness of GCL. To thoroughly explore the failure of GCL on the poisoned graphs, we investigate the detrimental effects of graph structural attacks against the GCL framework. We discover that, in addition to the conventional observation that graph structural attacks tend to connect dissimilar node pairs, these attacks also diminish the mutual information between the graph and its representations from an information-theoretical perspective, which is the cornerstone of the high-quality node embeddings for GCL. Motivated by this theoretical insight, we propose a robust graph contrastive learning framework with a learnable sanitation view that endeavors to sanitize the augmented graphs by restoring the diminished mutual information caused by the structural attacks. Additionally, we design a fully unsupervised tuning strategy to tune the hyperparameters without accessing the label information, which strictly coincides with the defender's knowledge. Extensive experiments demonstrate the effectiveness and efficiency of our proposed method compared to competitive baselines.",
  "categories": [
    "cs.LG",
    "cs.SI"
  ],
  "primary_category": "cs.LG",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12555",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 5218918,
  "size_after_bytes": 2237437
}