{
  "title": "Interleaved Training for Massive MIMO Downlink via Exploring Spatial Correlation",
  "authors": [
    "Cheng Zhang",
    "Chang Liu",
    "Yindi Jing",
    "Minjie Ding",
    "Yongming Huang"
  ],
  "submission_date": "2023-07-31T00:51:20+00:00",
  "revised_dates": [
    "2024-01-16T12:04:07+00:00"
  ],
  "abstract": "Interleaved training has been studied for single-user and multi-user massive MIMO downlink with either fully-digital or hybrid beamforming. However, the impact of channel correlation on its average training overhead is rarely addressed. In this paper, we explore the channel correlation to improve the interleaved training for single-user massive MIMO downlink. For the beam-domain interleaved training, we propose a modified scheme by optimizing the beam training codebook. The basic antenna-domain interleaved training is also improved by dynamically adjusting the training order of the base station (BS) antennas during the training process based on the values of the already trained channels. Exact and simplified approximate expressions of the average training length are derived in closed-form for the basic and modified beam-domain schemes and the basic antenna-domain scheme in correlated channels. For the modified antenna-domain scheme, a deep neural network (DNN)-based approximation is provided for fast performance evaluation. Analytical results and simulations verify the accuracy of our derived training length expressions and explicitly reveal the impact of system parameters on the average training length. In addition, the modified beam/antenna-domain schemes are shown to have a shorter average training length compared to the basic schemes.",
  "categories": [
    "cs.IT",
    "eess.SP"
  ],
  "primary_category": "cs.IT",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16356",
  "pdf_url": "https://arxiv.org/pdf/2307.16356v2",
  "comment": "14 pages (double column), 8 figures. The paper has been accepted by IEEE Transactions on Wireless Communications",
  "num_versions": null,
  "size_before_bytes": 5942261,
  "size_after_bytes": 2022534
}