{
  "title": "ICF-SRSR: Invertible scale-Conditional Function for Self-Supervised Real-world Single Image Super-Resolution",
  "authors": [
    "Reyhaneh Neshatavar",
    "Mohsen Yavartanoo",
    "Sanghyun Son",
    "Kyoung Mu Lee"
  ],
  "submission_date": "2023-07-24T12:42:45+00:00",
  "revised_dates": [
    "2023-09-01T00:21:21+00:00"
  ],
  "abstract": "Single image super-resolution (SISR) is a challenging ill-posed problem that aims to up-sample a given low-resolution (LR) image to a high-resolution (HR) counterpart. Due to the difficulty in obtaining real LR-HR training pairs, recent approaches are trained on simulated LR images degraded by simplified down-sampling operators, e.g., bicubic. Such an approach can be problematic in practice because of the large gap between the synthesized and real-world LR images. To alleviate the issue, we propose a novel Invertible scale-Conditional Function (ICF), which can scale an input image and then restore the original input with different scale conditions. By leveraging the proposed ICF, we construct a novel self-supervised SISR framework (ICF-SRSR) to handle the real-world SR task without using any paired/unpaired training data. Furthermore, our ICF-SRSR can generate realistic and feasible LR-HR pairs, which can make existing supervised SISR networks more robust. Extensive experiments demonstrate the effectiveness of the proposed method in handling SISR in a fully self-supervised manner. Our ICF-SRSR demonstrates superior performance compared to the existing methods trained on synthetic paired images in real-world scenarios and exhibits comparable performance compared to state-of-the-art supervised/unsupervised methods on public benchmark datasets.",
  "categories": [
    "eess.IV",
    "cs.CV"
  ],
  "primary_category": "eess.IV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12751",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 66150014,
  "size_after_bytes": 325088
}