{
  "title": "From PeV to TeV: Astrophysical Neutrinos with Contained Vertices in 10 years of IceCube Data",
  "authors": [
    "Vedant Basu",
    "Aswathi Balagopal"
  ],
  "submission_date": "2023-07-27T20:27:27+00:00",
  "revised_dates": [],
  "abstract": "The IceCube Neutrino Observatory is a cubic-kilometer Cherenkov detector at the South Pole, designed to study neutrinos of astrophysical origin. We present an analysis of the Medium Energy Starting Events (MESE) sample, a veto-based event selection that selects neutrinos and efficiently rejects a background of cosmic ray-induced muons This is an extension of the High Energy Starting Event (HESE) analysis, which established the existence of high-energy neutrinos of astrophysical origin. The HESE sample is consistent with a single power law spectrum with best-fit index $2.87^{+0.20}_{-0.19}$, which is softer than complementary IceCube measurements of the astrophysical neutrino spectrum. While HESE is sensitive to neutrinos above 60 TeV, MESE improves the sensitivity to lower energies, down to 1 TeV. In this analysis we use an improved understanding of atmospheric backgrounds in the astrophysical neutrino sample via more accurate modeling of the detector self-veto. A previous measurement with a 2-year MESE dataset had indicated the presence of a possible 30 TeV excess. With 10 years of data, we have a larger sample size to investigate this excess. We will use this event selection to measure the cosmic neutrino energy spectrum over a wide energy range. The flavor ratio of astrophysical neutrinos will also be discussed.",
  "categories": [
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.HE",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15183",
  "pdf_url": "https://arxiv.org/pdf/2307.15183v1",
  "comment": "Presented at the 38th International Cosmic Ray Conference (ICRC2023). See arXiv:2307.13047 for all IceCube contributions",
  "num_versions": null,
  "size_before_bytes": 1764967,
  "size_after_bytes": 229510
}