{
  "title": "Exploring Strange Entanglement: Experimental and Theoretical Perspectives on Neutral Kaon Systems",
  "authors": [
    "Nahid Binandeh Dehaghani",
    "A. Pedro Aguiar",
    "Rafal Wisniewski"
  ],
  "submission_date": "2023-07-19T11:02:55+00:00",
  "revised_dates": [],
  "abstract": "This chapter provides an in-depth analysis of the properties and phenomena associated with neutral K-mesons. Kaons are quantum systems illustrating strange behaviours. We begin by examining the significance of strangeness and charge parity violation in understanding these particles. The concept of strangeness oscillations is then introduced, explaining oscillations between $K^0$ and $\\bar{K}^0$ states. The regeneration of $K_S$ is investigated, uncovering the underlying mechanisms involved. The discussion moves on to quasi-spin space, exploring its bases and their implications. The entangled states of kaon pairs $(K^0,\\bar K^0)$ are considered, with a focus on maximally entangled neutral kaons and non-maximally entangled states. Decoherence effects on entangled kaons are examined, utilizing the density matrix description to capture the dynamics. A dedicated decoherence parameter is introduced to quantify the impact of decoherence. Furthermore, the chapter investigates the loss of entanglement through measures such as Von Neumann entanglement entropy, entanglement of formation, and concurrence. These measures provide insights into quantifying and characterizing entanglement in the context of neutral kaons. Through this comprehensive exploration of properties, phenomena, and entanglement dynamics, this chapter aims to pointing out recent works on neutral kaons, contributing to advancements in particle physics.",
  "categories": [
    "quant-ph",
    "hep-th"
  ],
  "primary_category": "quant-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15595",
  "pdf_url": "https://arxiv.org/pdf/2307.15595v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 478853,
  "size_after_bytes": 279308
}