{
  "title": "An Exact Algorithm for Optimization Problems with Inverse S-shaped Function",
  "authors": [
    "Arka Das",
    "Ankur Sinha",
    "Sachin Jayaswal"
  ],
  "submission_date": "2023-07-25T19:37:44+00:00",
  "revised_dates": [],
  "abstract": "In this paper, we propose an exact general algorithm for solving non-convex optimization problems, where the non-convexity arises due to the presence of an inverse S-shaped function. The proposed method involves iteratively approximating the inverse S-shaped function through piece-wise linear inner and outer approximations. In particular, the concave part of the inverse S-shaped function is inner-approximated through an auxiliary linear program, resulting in a bilevel program, which is reduced to a single level using KKT conditions before solving it using the cutting plane technique. To test the computational efficiency of the algorithm, we solve a facility location problem involving economies and dis-economies of scale for each of the facilities. The computational experiments indicate that our proposed algorithm significantly outperforms the previously reported methods. We solve non-convex facility location problems with sizes up to 30 potential facilities and 150 customers. Our proposed algorithm converges to the global optimum within a maximum computational time of 3 hours for 95 percent of the datasets. For almost 60 percent of the test cases, the proposed algorithm outperforms the benchmark methods by an order of magnitude. The paper ends with managerial insights on facility network design involving economies and dis-economies of scale. One of the important insights points out that it may be optimal to increase the number of production facilities operating under dis-economies of scale with an overall decrease in transportation costs.",
  "categories": [
    "math.OC"
  ],
  "primary_category": "math.OC",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13781",
  "pdf_url": null,
  "comment": "5 Figures, 8 Tables",
  "num_versions": null,
  "size_before_bytes": 3703096,
  "size_after_bytes": 2946255
}