{
  "title": "Neural Schrödinger Bridge with Sinkhorn Losses: Application to Data-driven Minimum Effort Control of Colloidal Self-assembly",
  "authors": [
    "Iman Nodozi",
    "Charlie Yan",
    "Mira Khare",
    "Abhishek Halder",
    "Ali Mesbah"
  ],
  "submission_date": "2023-07-26T18:17:05+00:00",
  "revised_dates": [
    "2023-10-17T00:04:39+00:00"
  ],
  "abstract": "We show that the minimum effort control of colloidal self-assembly can be naturally formulated in the order-parameter space as a generalized Schrödinger bridge problem -- a class of fixed-horizon stochastic optimal control problems that originated in the works of Erwin Schrödinger in the early 1930s. In recent years, this class of problems has seen a resurgence of research activities in the control and machine learning communities. Different from the existing literature on the theory and computation for such problems, the controlled drift and diffusion coefficients for colloidal self-assembly are typically nonaffine in control, and are difficult to obtain from physics-based modeling. We deduce the conditions of optimality for such generalized problems, and show that the resulting system of equations is structurally very different from the existing results in a way that standard computational approaches no longer apply. Thus motivated, we propose a data-driven learning and control framework, named `neural Schrödinger bridge', to solve such generalized Schrödinger bridge problems by innovating on recent advances in neural networks. We illustrate the effectiveness of the proposed framework using a numerical case study of colloidal self-assembly. We learn the controlled drift and diffusion coefficients as two neural networks using molecular dynamics simulation data, and then use these two to train a third network with Sinkhorn losses designed for distributional endpoint constraints, specific for this class of control problems.",
  "categories": [
    "math.OC",
    "cs.LG",
    "eess.SY"
  ],
  "primary_category": "math.OC",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14442",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 12746048,
  "size_after_bytes": 762958
}