{
  "title": "Velocity Dispersion $σ_{\\rm aper}$ Aperture Corrections as a Function of Galaxy Properties from Integral-field Stellar Kinematics of 10,000 MaNGA Galaxies",
  "authors": [
    "Kai Zhu",
    "Ran Li",
    "Xiaoyue Cao",
    "Shengdong Lu",
    "Michele Cappellari",
    "Shude Mao"
  ],
  "submission_date": "2023-07-23T07:45:52+00:00",
  "revised_dates": [],
  "abstract": "The second moment of the stellar velocity within the effective radius, denoted by $σ_{\\rm e}^2$, is a crucial quantity in galaxy studies as it provides insight into galaxy properties and their mass distributions. However, large spectroscopic surveys typically do not measure $σ_{\\rm e}$ directly, instead providing $σ_{\\rm aper}$, the second moment of the stellar velocity within a fixed fiber aperture. In this paper, we derive an empirical aperture correction formula, given by $σ_{\\rm aper}/σ_{\\rm e}=(R_{\\rm aper}/R_{\\rm e})^α$, using spatially resolved stellar kinematics extracted from approximately 10,000 Sloan Digital Sky Survey-Mapping Nearby Galaxies at Apache Point Observatory (SDSS-MaNGA) integral field unit observations. Our analysis reveals a strong dependence of $α$ on the $r$-band absolute magnitude $M_{\\rm r}$, $g-i$ color, and Sersic index $n_{\\rm Ser}$, where $α$ values are lower for brighter, redder galaxies with higher Sersic indices. Our results demonstrate that the aperture correction derived from previous literature on early-type galaxies cannot be applied to predict the aperture corrections for galaxies with intermediate Sersic indices. We provide a lookup table of $α$ values for different galaxy types, with parameters in the ranges of $-18>M_{\\rm r}>-24$, $0.4<g-i<1.6$, and $0<n_{\\rm Ser}<8$. A Python script is provided to obtain the correction factors from the lookup table.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.1088/1674-4527/acd58a",
  "journal_ref": "Research in Astronomy and Astrophysics, Volume 23, Issue 8, id.085001, 12 pp. (2023)",
  "arxiv_id": "2307.12251",
  "pdf_url": null,
  "comment": "12 pages, 10 figures, 1 table, published in Research in Astronomy and Astrophysics",
  "num_versions": null,
  "size_before_bytes": 5210882,
  "size_after_bytes": 185178
}