{
  "title": "Higher-order Topological Insulators and Semimetals in Three Dimensions without Crystalline Counterparts",
  "authors": [
    "Yu-Feng Mao",
    "Yu-Liang Tao",
    "Jiong-Hao Wang",
    "Qi-Bo Zeng",
    "Yong Xu"
  ],
  "submission_date": "2023-07-27T16:12:41+00:00",
  "revised_dates": [
    "2023-10-19T03:29:08+00:00"
  ],
  "abstract": "Quasicrystals allow for symmetries that are impossible in crystalline materials, such as eight-fold rotational symmetry, enabling the existence of novel higher-order topological insulators in two dimensions without crystalline counterparts. However, it remains an open question whether three-dimensional higher-order topological insulators and Weyl-like semimetals without crystalline counterparts can exist. Here, we demonstrate the existence of a second-order topological insulator by constructing and exploring a three-dimensional model Hamiltonian in a stack of Ammann-Beenker tiling quasicrystalline lattices. The topological phase has eight chiral hinge modes that lead to quantized longitudinal conductances of $4 e^2/h$. We show that the topological phase is characterized by the winding number of the quadrupole moment. We further establish the existence of a second-order topological insulator with time-reversal symmetry, characterized by a $\\mathbb{Z}_2$ topological invariant. Finally, we propose a model that exhibits a higher-order Weyl-like semimetal phase, demonstrating both hinge and surface Fermi arcs. Our findings highlight that quasicrystals in three dimensions can give rise to higher-order topological insulators and semimetal phases that are unattainable in crystals.",
  "categories": [
    "cond-mat.mes-hall",
    "cond-mat.dis-nn",
    "cond-mat.quant-gas"
  ],
  "primary_category": "cond-mat.mes-hall",
  "doi": "10.1103/PhysRevB.109.134205",
  "journal_ref": "Phys. Rev. B 109, 134205 (2024)",
  "arxiv_id": "2307.14974",
  "pdf_url": "https://arxiv.org/pdf/2307.14974v2",
  "comment": "7 pages, 6 figures",
  "num_versions": null,
  "size_before_bytes": 3748354,
  "size_after_bytes": 78300
}