{
  "title": "The electronic structure of intertwined kagome, honeycomb, and triangular sublattices of the intermetallics MCo$_2$Al$_9$",
  "authors": [
    "Chiara Bigi",
    "Sahar Pakdel",
    "Michał J. Winiarski",
    "Pasquale Orgiani",
    "Ivana Vobornik",
    "Jun Fujii",
    "Giorgio Rossi",
    "Vincent Polewczyk",
    "Phil D. C. King",
    "Giancarlo Panaccione",
    "Tomasz Klimczuk",
    "Kristian Sommer Thygesen",
    "Federico Mazzola"
  ],
  "submission_date": "2023-07-23T09:02:12+00:00",
  "revised_dates": [],
  "abstract": "Intermetallics are an important playground to stabilize a large variety of physical phenomena, arising from their complex crystal structure. The ease of their chemical tuneabilty makes them suitable platforms to realize targeted electronic properties starting from the symmetries hidden in their unit cell. Here, we investigate the family of the recently discovered intermetallics MCo$_2$Al$_9$ (M: Sr, Ba) and we unveil their electronic structure for the first time. By using angle-resolved photoelectron spectroscopy and density functional theory calculations, we discover the existence of Dirac-like dispersions as ubiquitous features in this family, coming from the hidden kagome and honeycomb symmetries embedded in the unit cell. Finally, from calculations, we expect that the spin-orbit coupling is responsible for opening energy gaps in the electronic structure spectrum, which also affects the majority of the observed Dirac-like states. Our study constitutes the first experimental observation of the electronic structure of MCo$_2$Al$_9$ and proposes these systems as hosts of Dirac-like physics with intrinsic spin-orbit coupling. The latter effect suggests MCo$_2$Al$_9$ as a future platform for investigating the emergence of non-trivial topology.",
  "categories": [
    "cond-mat.str-el"
  ],
  "primary_category": "cond-mat.str-el",
  "doi": "10.1103/PhysRevB.108.075148",
  "journal_ref": "Phys. Rev. B 108, 075148 (2023)",
  "arxiv_id": "2307.12269",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 22762512,
  "size_after_bytes": 728894
}