{
  "title": "Revealing the Gas Recycling in the Circumgalactic Medium (CGM) Utilizing a Luminous Ly$α$ Nebula Around a Type-II Quasar at z=2.6 with the Keck Cosmic Web Imager (KCWI)",
  "authors": [
    "Shiwu Zhang",
    "Zheng Cai",
    "Dandan Xu",
    "Andrea Afruni",
    "Yunjing Wu",
    "Wuji Wang",
    "Fabrizio Arrigoni Battaia",
    "Mingyu Li",
    "Sen Wang",
    "Xianzhi Bi"
  ],
  "submission_date": "2023-07-26T14:41:09+00:00",
  "revised_dates": [],
  "abstract": "How galaxies acquire material from the circumgalactic medium (CGM) is a key question in galaxy evolution. Recent observations and simulations show that gas recycling could be an important avenue for star formation. This paper presents Keck Cosmic Web Imager (KCWI) integral field unit spectroscopic observations on a type-II quasar, Q1517+0055 at z = 2.65, a pilot study of our Ly$α$ nebulae sample at $z\\approx 2$. We revealed diffuse emission of the Ly$α$ 1216, HeII 1640, and CIV 1549 on the projected physical scale of 122 kpc, 45 kpc, and 79 kpc, respectively. The total Ly$α$ luminosity is L$_{\\rm Lyα}$ = $3.04\\pm 0.02 \\times 10^{44}$ erg s$^{-1}$. The line ratio diagnostics shows that HeII/Ly$α$ $\\approx$0.08 and CIV/Ly$α$ $\\approx$0.28, consistent with the photoionization including recombination and photon pumping. We also identify the associated HI and CIV absorption from the spectra. By fitting the spectra, we derive both the column density and the velocity. We find that the velocity profile from both the absorption and the HeII emission exhibit increasing trends. Moreover, both the line ratio diagnostic from the emission and the column density ratio from the absorption confirm that the cool gas metallicity is $\\geq Z_{\\odot}$. From detailed modeling and estimation, gas recycling might be a more plausible interpretation compared with the scenario of a powerful outflow.",
  "categories": [
    "astro-ph.GA",
    "astro-ph.CO"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.3847/1538-4357/acd760",
  "journal_ref": null,
  "arxiv_id": "2307.14224",
  "pdf_url": null,
  "comment": "Published in ApJ, 21 July 2023 (accepted version), 18 pages, 10 figures, and seven tables in the main text",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}