{
  "title": "A comprehensive survey on quantum computer usage: How many qubits are employed for what purposes?",
  "authors": [
    "Tsubasa Ichikawa",
    "Hideaki Hakoshima",
    "Koji Inui",
    "Kosuke Ito",
    "Ryo Matsuda",
    "Kosuke Mitarai",
    "Koichi Miyamoto",
    "Wataru Mizukami",
    "Kaoru Mizuta",
    "Toshio Mori",
    "Yuichiro Nakano",
    "Akimoto Nakayama",
    "Ken N. Okada",
    "Takanori Sugimoto",
    "Souichi Takahira",
    "Nayuta Takemori",
    "Satoyuki Tsukano",
    "Hiroshi Ueda",
    "Ryo Watanabe",
    "Yuichiro Yoshida",
    "Keisuke Fujii"
  ],
  "submission_date": "2023-07-30T04:52:29+00:00",
  "revised_dates": [
    "2023-10-10T07:33:38+00:00"
  ],
  "abstract": "Quantum computers (QCs), which work based on the law of quantum mechanics, are expected to be faster than classical computers in several computational tasks such as prime factoring and simulation of quantum many-body systems. In the last decade, research and development of QCs have rapidly advanced. Now hundreds of physical qubits are at our disposal, and one can find several remarkable experiments actually outperforming the classical computer in a specific computational task. On the other hand, it is unclear what the typical usages of the QCs are. Here we conduct an extensive survey on the papers that are posted in the quant-ph section in arXiv and claim to have used QCs in their abstracts. To understand the current situation of the research and development of the QCs, we evaluated the descriptive statistics about the papers, including the number of qubits employed, QPU vendors, application domains and so on. Our survey shows that the annual number of publications is increasing, and the typical number of qubits employed is about six to ten, growing along with the increase in the quantum volume (QV). Most of the preprints are devoted to applications such as quantum machine learning, condensed matter physics, and quantum chemistry, while quantum error correction and quantum noise mitigation use more qubits than the other topics. These imply that the increase in QV is fundamentally relevant, and more experiments for quantum error correction, and noise mitigation using shallow circuits with more qubits will take place.",
  "categories": [
    "quant-ph"
  ],
  "primary_category": "quant-ph",
  "doi": "10.1038/s42254-024-00725-0",
  "journal_ref": "Nat. Rev. Phys. 6, 345 (2024)",
  "arxiv_id": "2307.16130",
  "pdf_url": "https://arxiv.org/pdf/2307.16130v2",
  "comment": "14 pages, 5 figures, figures regenerated",
  "num_versions": null,
  "size_before_bytes": 2204384,
  "size_after_bytes": 1025850
}