{
  "title": "The Discreet Charm of the Discrete Series in DS$_2$",
  "authors": [
    "Dionysios Anninos",
    "Tarek Anous",
    "Ben Pethybridge",
    "Gizem Şengör"
  ],
  "submission_date": "2023-07-28T22:39:34+00:00",
  "revised_dates": [
    "2023-08-21T14:27:30+00:00"
  ],
  "abstract": "We study quantum field theories placed on a two-dimensional de Sitter spacetime (dS$_2$) with an eye on the group-theoretic organisation of single and multi-particle states. We explore the distinguished role of the discrete series unitary irreducible representation (UIR) in the Hilbert space. By employing previous attempts to realise these states in free tachyonic scalar field theories, we propose how the discrete series may contribute to the Källén-Lehmann decomposition of an interacting scalar two-point function. We also study BF gauge theories with $SL(N,\\mathbb{R})$ gauge group in dS$_2$ and establish a relation between the discrete series UIRs and the operator content of these theories. Although present at the level of the operators, states carrying discrete series quantum numbers are projected out of the gauge-invariant Hilbert space. This projection is reminiscent of what happens for quantum field theories coupled to semiclassical de Sitter gravity, where we must project onto the subspace of de Sitter invariant states. We discuss how to impose the diffeomorphism constraints on local field-theory operators coupled to two-dimensional gravity in de Sitter, with particular emphasis on the role of contact terms. Finally, we discuss an SYK-type model with a random two-body interaction that encodes an infinite tower of discrete series operators. We speculate on its potential microscopic connection to the $SL(N,\\mathbb{R})$ BF theory in the large-$N$ limit.",
  "categories": [
    "hep-th"
  ],
  "primary_category": "hep-th",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15832",
  "pdf_url": "https://arxiv.org/pdf/2307.15832v2",
  "comment": "56 pages",
  "num_versions": null,
  "size_before_bytes": 706748,
  "size_after_bytes": 710422
}