{
  "title": "Light-Quark $SU(3)$ Flavour Splitting of Heavy-Light Constituent Diquark Masses and Doubly-Strange Diquarks from QCD Sum-Rules",
  "authors": [
    "T. de Oliveira",
    "D. Harnett",
    "R. Kleiv",
    "A. Palameta",
    "T. G. Steele"
  ],
  "submission_date": "2023-07-28T21:14:17+00:00",
  "revised_dates": [
    "2023-09-29T15:05:49+00:00"
  ],
  "abstract": "QCD Laplace sum-rules are used to examine the constituent mass spectrum of $J^P\\in\\{0^+,1^+\\}$ heavy-light [Qq] diquarks with $Q\\in\\{c,b\\}$ and $q\\in\\{u,d,s\\}$. As in previous sum-rule studies, the negative parity $J^P\\in\\{0^-, 1^-\\}$ [Qq] diquark mass predictions do not stabilize, so the sum-rule analysis focuses on positive parity [Qq] diquarks. Doubly-strange $J^P=1^{+}$ [ss] diquarks are also examined, but the resulting sum rules do not stabilize. Hence there is no sum-rule evidence for $J^P=1^{+}$ [ss] diquark states, aiding the interpretation of sum-rule analyses of fully-strange tetraquark states. The SU(3) flavour splitting effects for [Qq] diquarks are obtained by calculating QCD correlation functions of $J^P\\in\\{0^+,1^+\\}$ diquark composite operators up to next-to-leading order in perturbation theory, leading-order in the strange quark mass, and in the chiral limit for non-strange (u,d) quarks with an isospin-symmetric vacuum $<\\bar nn>=<\\bar uu>=<\\bar dd>$. Apart from the strange quark mass parameter $m_s$, the strange quark condensate parameter $κ=<\\bar ss>/<\\bar nn>$ has an important impact on SU(3) flavour splittings. A Laplace sum-rule analysis methodology is developed for the mass difference $M_{[Qs]}-M_{[Qn]}$ between the strange and non-strange heavy-light diquarks to reduce the theoretical uncertainties from all other QCD input parameters. The mass splitting is found to decrease with increasing $κ$, providing an upper bound on $κ$ where the $M_{[Qs]}-M_{[Qn]}$ mass hierarchy reverses. In the typical QCD sum-rule range $0.56<κ< 0.74$, $55~MeV < M_{[cs]}-M_{[cn]} < 100~MeV$ and $75~MeV < M_{[bs]}-M_{[bn]}< 150~MeV$, with a slight tendency for larger splittings for the $J^P=1^+$ channels. These constituent mass splitting results are discussed in comparison with values used in constituent diquark models for tetraquark and pentaquark hadronic states.",
  "categories": [
    "hep-ph"
  ],
  "primary_category": "hep-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15815",
  "pdf_url": "https://arxiv.org/pdf/2307.15815v2",
  "comment": "30 pages, 19 figures, 7 tables. v2 contains extended discussion",
  "num_versions": null,
  "size_before_bytes": 7913440,
  "size_after_bytes": 414960
}