{
  "title": "Efficient InGaN-based Red Light-Emitting Diodes by Modulating Trench Defects",
  "authors": [
    "Z. Pan",
    "Z. Chen",
    "H. Zhang",
    "H. Yang",
    "Y. Chen",
    "J. Nie",
    "C. Deng",
    "B. Dong",
    "D. Wang",
    "Y. Li",
    "H. Lin",
    "W. Chen",
    "F. Jiao",
    "X. Kang",
    "C. Jia",
    "Z. Liang",
    "Q. Wang",
    "G. Zhang",
    "B. Shen"
  ],
  "submission_date": "2023-07-30T16:20:49+00:00",
  "revised_dates": [
    "2023-12-29T04:20:33+00:00"
  ],
  "abstract": "Trench defects in multi-quantum wells (MQWs) have been considered as flawed structures that severely degrade the internal quantum efficiency of light-emitting diodes (LEDs) in the past. In this research, trench defects are innovatively modulated into the structure to enhance the efficiency of red InGaN LEDs. Specifically, dual-color MQWs structures are grown with green MQWs at the bottom and red MQWs at the top. When high-density trench defects are introduced into the green MQWs, the upper red MQWs exhibit a significant wavelength redshift of 68 nm and approximately 6-fold luminescence enhancement compared to those without trench defects. The wavelength redshift is attributed to the increased indium incorporation due to the strain relaxation effect of trench defects. Moreover, the luminescence enhancement originates from the strong emission of the red MQWs inside trench defects. The mechanisms behind the superior luminescent properties of red MQWs within trench defects are explored in detail. Red InGaN LEDs with an internal quantum efficiency of 16.4% are achieved by modulating the trench defects. The method of achieving InGaN-based red emission by introducing trench defects is simple and reproducible, requiring no additional substrate designs. This research provides a novel pathway toward achieving high-efficiency red InGaN LEDs.",
  "categories": [
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": "10.1002/adfm.202315781",
  "journal_ref": null,
  "arxiv_id": "2307.16267",
  "pdf_url": "https://arxiv.org/pdf/2307.16267v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 5822175,
  "size_after_bytes": 3398475
}