{
  "title": "Resonance-aware NLOPS matching for off-shell $t\\bar t+tW$ production with semileptonic decays",
  "authors": [
    "Tomáš Ježo",
    "Jonas M. Lindert",
    "Stefano Pozzorini"
  ],
  "submission_date": "2023-07-28T16:30:25+00:00",
  "revised_dates": [],
  "abstract": "The increasingly high accuracy of top-quark studies at the LHC calls for a theoretical description of $t\\bar t$ production and decay in terms of exact matrix elements for the full $2\\to 6$ process that includes the off-shell production and the chain decays of $t\\bar t$ and $tW$ intermediate states, together with their quantum interference. Corresponding NLO QCD calculations matched to parton showers are available for the case of dileptonic channels and are implemented in the bb4l Monte Carlo generator, which is based on the resonance-aware POWHEG method. In this paper, we present the first NLOPS predictions of this kind for the case of semileptonic channels. In this context, the interplay of off-shell $t\\bar t+tW$ production with various other QCD and electroweak subprocesses that yield the same semileptonic final state is discussed in detail. On the technical side, we improve the resonance-aware POWHEG procedure by means of new resonance histories based on matrix elements, which enable a realistic separation of $t\\bar t$ and $tW$ contributions. Moreover, we introduce a general approach which makes it possible to avoid certain spurious terms that arise from the perturbative expansion of decay widths in any off-shell higher-order calculation, and which are large enough to jeopardise physical finite-width effects. These methods are implemented in a new version of the bb4l Monte Carlo generator, which is applicable to all dileptonic and semileptonic channels, and can be extended to fully hadronic channels. The presented results include a NLOPS comparison of off-shell against on-shell $t\\bar t+tW$ production and decay, where we highlight various non-trivial aspects related to NLO and parton-shower radiation in leptonic and hadronic top decays.",
  "categories": [
    "hep-ph"
  ],
  "primary_category": "hep-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15653",
  "pdf_url": "https://arxiv.org/pdf/2307.15653v1",
  "comment": "78 pages, 20 figures, 6 tables",
  "num_versions": null,
  "size_before_bytes": 16622928,
  "size_after_bytes": 13717233
}