{
  "title": "RoSAS: Deep Semi-Supervised Anomaly Detection with Contamination-Resilient Continuous Supervision",
  "authors": [
    "Hongzuo Xu",
    "Yijie Wang",
    "Guansong Pang",
    "Songlei Jian",
    "Ning Liu",
    "Yongjun Wang"
  ],
  "submission_date": "2023-07-25T04:04:49+00:00",
  "revised_dates": [],
  "abstract": "Semi-supervised anomaly detection methods leverage a few anomaly examples to yield drastically improved performance compared to unsupervised models. However, they still suffer from two limitations: 1) unlabeled anomalies (i.e., anomaly contamination) may mislead the learning process when all the unlabeled data are employed as inliers for model training; 2) only discrete supervision information (such as binary or ordinal data labels) is exploited, which leads to suboptimal learning of anomaly scores that essentially take on a continuous distribution. Therefore, this paper proposes a novel semi-supervised anomaly detection method, which devises \\textit{contamination-resilient continuous supervisory signals}. Specifically, we propose a mass interpolation method to diffuse the abnormality of labeled anomalies, thereby creating new data samples labeled with continuous abnormal degrees. Meanwhile, the contaminated area can be covered by new data samples generated via combinations of data with correct labels. A feature learning-based objective is added to serve as an optimization constraint to regularize the network and further enhance the robustness w.r.t. anomaly contamination. Extensive experiments on 11 real-world datasets show that our approach significantly outperforms state-of-the-art competitors by 20%-30% in AUC-PR and obtains more robust and superior performance in settings with different anomaly contamination levels and varying numbers of labeled anomalies. The source code is available at https://github.com/xuhongzuo/rosas/.",
  "categories": [
    "cs.LG",
    "cs.AI"
  ],
  "primary_category": "cs.LG",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13239",
  "pdf_url": null,
  "comment": "Accepted by Information Processing and Management (IP&M)",
  "num_versions": null,
  "size_before_bytes": 8187167,
  "size_after_bytes": 219096
}