{
  "title": "Hierarchical physically based machine learning in material science: the case study of spider silk",
  "authors": [
    "Vincenzo Fazio",
    "Nicola Maria Pugno",
    "Orazio Giustolisi",
    "Giuseppe Puglisi"
  ],
  "submission_date": "2023-07-24T17:17:49+00:00",
  "revised_dates": [],
  "abstract": "Multiscale phenomena exhibit complex structure-function relationships, and predicting their macroscopic behavior requires deducing differential equations at different scales. The complexity of these equations and the number of essential parameters make developing effective, predictive models challenging. To overcome this, researchers explore leveraging advanced numerical techniques from artificial intelligence and machine learning. Here, we focus on a fundamental aspect in multiscale phenomena, i.e the recognition of the hierarchical role of variables. By adopting a Pareto front interpretation, we aim to deduce simple and accurate relations for material modeling, starting from experimental multiscale analyses. From a physical point of view, the aim is to deduce information at higher scales from lower scales data, possibly respecting their hierarchical order. A crucial aspect of the proposed approach is the deduction of causality relations among the different variables to be compared with the available theoretical notions and possibly new interpretations resulting by the data modelling. This result in a stepwise approximation going from data modelling to theoretical equations and back to data modelling. To demonstrate the key advantages of our multiscale numerical approach, compared to classical, non-physically based data modelling techniques, we consider the explicit example of spider silk, known for its exceptional properties and bioinspiration potential. Indeed, it presents a complex behavior resulting from mesostructures formed by the aggregation of amino acids at the molecular scale. We argue that, due to the generality of our results, our approach may represent a proof of concept in many fields where multiscale, hierarchical differential equations regulate the observed phenomenon.",
  "categories": [
    "math-ph"
  ],
  "primary_category": "math-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12945",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 535976,
  "size_after_bytes": 151596
}