{
  "title": "The PAU Survey: Classifying low-z SEDs using Machine Learning clustering",
  "authors": [
    "A. L. González-Morán",
    "P. Arrabal Haro",
    "C. Muñóz-Tuñón",
    "J. M. Rodríguez-Espinosa",
    "J. Sánchez-Almeida",
    "J. Calhau",
    "E. Gaztañaga",
    "F. J. Castander",
    "P. Renard",
    "L. Cabayol",
    "E. Fernandez",
    "C. Padilla",
    "J. Garcia-Bellido",
    "R. Miquel",
    "J. De Vicente",
    "E. Sanchez",
    "I. Sevilla-Noarbe",
    "D. Navarro-Gironés"
  ],
  "submission_date": "2023-07-25T22:23:32+00:00",
  "revised_dates": [],
  "abstract": "We present an application of unsupervised Machine Learning Clustering to the PAU Survey of galaxy spectral energy distribution (SED) within the COSMOS field. The clustering algorithm is implemented and optimized to get the relevant groups in the data SEDs. We find 12 groups from a total number of 5,234 targets in the survey at $0.01 <$ z $< 0.28$. Among the groups, 3,545 galaxies (68\\%) show emission lines in the SEDs. These groups also include 1,689 old galaxies with no active star formation. We have fitted the SED to every single galaxy in each group with CIGALE. The mass, age and specific star formation rates (sSFR) of the galaxies range from $0.15 <$ age/Gyr $< 11$; $6 <$ log (M$_{\\star}$/M$_{\\odot}$) $< 11.26$, and $-14.67 <$ log (sSFR/yr $^{-1}$) $< -8$. The groups are well defined in their properties with galaxies having clear emission lines also having lower mass, are younger and have higher sSFR than those with elliptical like patterns. The characteristic values of galaxies showing clear emission lines are in agreement with the literature for starburst galaxies in COSMOS and GOODS-N fields at low redshift. The star-forming main sequence, sSFR vs. stellar mass and UVJ diagram show clearly that different groups fall into different regions with some overlap among groups. Our main result is that the joint of low-resolution (R $\\sim$ 50) photometric spectra provided by the PAU survey together with the unsupervised classification provides an excellent way to classify galaxies. Moreover, it helps to find and extend the analysis of extreme ELGs to lower masses and lower SFRs in the local Universe.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.1093/mnras/stad2123",
  "journal_ref": null,
  "arxiv_id": "2307.13840",
  "pdf_url": null,
  "comment": "Published in the main journal of the Monthly Notices of the Royal Astronomical Society, July 2023",
  "num_versions": null,
  "size_before_bytes": 3855300,
  "size_after_bytes": 1396473
}