{
  "title": "Exact extreme, order and sum statistics in a class of strongly correlated system",
  "authors": [
    "Marco Biroli",
    "Hernán Larralde",
    "Satya N. Majumdar",
    "Grégory Schehr"
  ],
  "submission_date": "2023-07-28T06:59:31+00:00",
  "revised_dates": [
    "2024-01-03T15:15:50+00:00"
  ],
  "abstract": "Even though strongly correlated systems are abundant, only a few exceptional cases admit analytical solutions. In this paper we present a large class of solvable systems with strong correlations.. We consider a set of $N$ independent and identically distributed (i.i.d) random variables $\\{X_1,\\, X_2,\\ldots, X_N\\}$ whose common distribution has a parameter $Y$ (or a set of parameters) which itself is random with its own distribution. For a fixed value of this parameter $Y$, the $X_i$ variables are independent and we call them conditionally independent and identically distributed (c.i.i.d). However, once integrated over the distribution of the parameter $Y$, the $X_i$ variables get strongly correlated, yet retaining a solvable structure for various observables, such as for the sum and the extremes of $X_i$'s. This provides a simple procedure to generate a class of solvable strongly correlated systems. We illustrate how this procedure works via three physical examples where $N$ particles on a line perform independent (i) Brownian motions, (ii) ballistic motions with random initial velocities, and (iii) Lévy flights, but they get strongly correlated via {\\it simultaneous resetting} to the origin. Our results are verified in numerical simulations. This procedure can be used to generate an endless variety of solvable strongly correlated systems.",
  "categories": [
    "cond-mat.stat-mech"
  ],
  "primary_category": "cond-mat.stat-mech",
  "doi": "10.1103/PhysRevE.109.014101",
  "journal_ref": "Phys. Rev. E 109, 014101 (2024)",
  "arxiv_id": "2307.15351",
  "pdf_url": "https://arxiv.org/pdf/2307.15351v2",
  "comment": "26 pages, 9 figures",
  "num_versions": null,
  "size_before_bytes": 2968519,
  "size_after_bytes": 1519804
}