{
  "title": "Singularity Distance Computations for 3-RPR Manipulators Using Intrinsic Metrics",
  "authors": [
    "Aditya Kapilavai",
    "Georg Nawratil"
  ],
  "submission_date": "2023-07-27T09:21:08+00:00",
  "revised_dates": [
    "2023-09-21T08:23:44+00:00",
    "2023-10-11T09:51:04+00:00"
  ],
  "abstract": "We present an efficient algorithm for computing the closest singular configuration to each non-singular pose of a 3-RPR planar manipulator performing a 1-parametric motion. By considering a 3-RPR manipulator as a planar framework, one can use methods from rigidity theory to compute the singularity distance with respect to an intrinsic metric. Such a metric has the advantage over any performance index used for indicating the closeness to singularities, that the obtained value is a distance, which equals the radius of a guaranteed singularity-free sphere in the joint space of the manipulator. The proposed method can take different design options into account as the platform/base can be seen as a triangular plate or as a pin-jointed triangular bar structure. Moreover, we also allow the additional possibility of pinning down the base/platform triangle to the fixed/moving system thus it cannot be deformed. For the resulting nine interpretations, we compute the corresponding intrinsic metrics based on the total elastic strain energy density of the framework using the physical concept of Green-Lagrange strain. The global optimization problem of finding the closest singular configuration with respect to these metrics is solved by using tools from numerical algebraic geometry. The proposed algorithm is demonstrated based on an example, which is also used to compare the obtained intrinsic singularity distances with the corresponding extrinsic ones.",
  "categories": [
    "cs.RO",
    "cs.CG"
  ],
  "primary_category": "cs.RO",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14721",
  "pdf_url": "https://arxiv.org/pdf/2307.14721v3",
  "comment": "30 pages, 10 figures",
  "num_versions": null,
  "size_before_bytes": 3409344,
  "size_after_bytes": 413102
}