{
  "title": "The Crystallographic Spin Point Groups and their Representations",
  "authors": [
    "Hana Schiff",
    "Alberto Corticelli",
    "Afonso Guerreiro",
    "Judit Romhányi",
    "Paul McClarty"
  ],
  "submission_date": "2023-07-24T13:32:23+00:00",
  "revised_dates": [
    "2023-08-11T00:18:24+00:00",
    "2024-05-22T00:13:38+00:00",
    "2024-06-12T00:21:10+00:00",
    "2025-03-26T13:36:02+00:00"
  ],
  "abstract": "The spin point groups are finite groups whose elements act on both real space and spin space. Among these groups are the magnetic point groups in the case where the real and spin space operations are locked to one another. The magnetic point groups are central to magnetic crystallography for strong spin-orbit coupled systems and the spin point groups generalize these to the intermediate and weak spin-orbit coupled cases. The spin point groups were introduced in the 1960's in the context of condensed matter physics and enumerated shortly thereafter. In this paper, we complete the theory ofcrystallographic spin point groups by presenting an account of these groups and their representation theory. Our main findings are that the so-called nontrivial spin point groups (numbering $598$ groups) have co-irreps corresponding exactly to the (co-)-irreps of regular or black and white groups and we tabulate this correspondence for each nontrivial group. However a total spin group, comprising the product of a nontrivial group and a spin-only group, has new co-irreps in cases where there is continuous rotational freedom. We provide explicit co-irrep tables for all these instances. We also discuss new forms of spin-only group extending the Litvin-Opechowski classes. To exhibit the usefulness of these groups to physically relevant problems we discuss a number of examples from electronic band structures of altermagnets to magnons.",
  "categories": [
    "cond-mat.str-el",
    "cond-mat.mtrl-sci",
    "math-ph"
  ],
  "primary_category": "cond-mat.str-el",
  "doi": "10.21468/SciPostPhys.18.3.109",
  "journal_ref": "SciPost Phys. 18, 109 (2025)",
  "arxiv_id": "2307.12784",
  "pdf_url": null,
  "comment": "99 pages, 73 figures (mostly tables). v2: Citations added, and on grey groups. v3: Funding source acknowledgmed for JR and HS. v5: Specified groups are crystallographic, added details about rutile & MnTe altermagnetism in section 4, updated figures 2 and 3. Slightly restructured to differentiate new results from known group/rep theory (now in appendix)",
  "num_versions": null,
  "size_before_bytes": 37794462,
  "size_after_bytes": 7340642
}