{
  "title": "Investigation of Floquet engineered non-Abelian geometric phase for holonomic quantum computing",
  "authors": [
    "Logan W. Cooke",
    "Arina Tashchilina",
    "Mason Protter",
    "Joseph Lindon",
    "Tian Ooi",
    "Frank Marsiglio",
    "Joseph Maciejko",
    "Lindsay J. LeBlanc"
  ],
  "submission_date": "2023-07-24T17:34:22+00:00",
  "revised_dates": [
    "2024-03-07T01:46:21+00:00"
  ],
  "abstract": "Holonomic quantum computing (HQC) functions by transporting an adiabatically degenerate manifold of computational states around a closed loop in a control-parameter space; this cyclic evolution results in a non-Abelian geometric phase which may couple states within the manifold. Realizing the required degeneracy is challenging, and typically requires auxiliary levels or intermediate-level couplings. One potential way to circumvent this is through Floquet engineering, where the periodic driving of a nondegenerate Hamiltonian leads to degenerate Floquet bands, and subsequently non-Abelian gauge structures may emerge. Here we present an experiment in ultracold $^{87}$Rb atoms where atomic spin states are dressed by modulated RF fields to induce periodic driving of a family of Hamiltonians linked through a fully tuneable parameter space. The adiabatic motion through this parameter space leads to the holonomic evolution of the degenerate spin states in $SU(2)$, characterized by a non-Abelian connection. We study the holonomic transformations of spin eigenstates in the presence of a background magnetic field, characterizing the fidelity of these single-qubit gate operations. Results indicate that while the Floquet engineering technique removes the need for explicit degeneracies, it inherits many of the same limitations present in degenerate systems.",
  "categories": [
    "quant-ph",
    "cond-mat.quant-gas",
    "physics.atom-ph"
  ],
  "primary_category": "quant-ph",
  "doi": "10.1103/PhysRevResearch.6.013057",
  "journal_ref": "Phys. Rev. Research 6, 013057 (2024)",
  "arxiv_id": "2307.12957",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 2296206,
  "size_after_bytes": 260999
}