{
  "title": "A Differentially Private Weighted Empirical Risk Minimization Procedure and its Application to Outcome Weighted Learning",
  "authors": [
    "Spencer Giddens",
    "Yiwang Zhou",
    "Kevin R. Krull",
    "Tara M. Brinkman",
    "Peter X. K. Song",
    "Fang Liu"
  ],
  "submission_date": "2023-07-24T21:03:25+00:00",
  "revised_dates": [
    "2024-09-30T00:53:56+00:00"
  ],
  "abstract": "It is common practice to use data containing personal information to build predictive models in the framework of empirical risk minimization (ERM). While these models can be highly accurate in prediction, sharing the results from these models trained on sensitive data may be susceptible to privacy attacks. Differential privacy (DP) is an appealing framework for addressing such data privacy issues by providing mathematically provable bounds on the privacy loss incurred when releasing information from sensitive data. Previous work has primarily concentrated on applying DP to unweighted ERM. We consider weighted ERM (wERM), an important generalization, where each individual's contribution to the objective function can be assigned varying weights. We propose the first differentially private algorithm for general wERM, with theoretical DP guarantees. Extending the existing DP-ERM procedures to wERM creates a pathway for deriving privacy-preserving learning methods for individualized treatment rules, including the popular outcome weighted learning (OWL). We evaluate the performance of the DP-wERM framework applied to OWL in both simulation studies and in a real clinical trial. All empirical results demonstrate the feasibility of training OWL models via wERM with DP guarantees while maintaining sufficiently robust model performance, providing strong evidence for the practicality of implementing the proposed privacy-preserving OWL procedure in real-world scenarios involving sensitive data.",
  "categories": [
    "stat.ML",
    "cs.LG"
  ],
  "primary_category": "stat.ML",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13127",
  "pdf_url": null,
  "comment": "29 pages, 1 figure, and 1 table for the main manuscript; 10 pages, 4 figures, and 1 table for the supplementary materials",
  "num_versions": null,
  "size_before_bytes": 1709523,
  "size_after_bytes": 532587
}