{
  "title": "Investigating structural and functional aspects of the brain's criticality in stroke",
  "authors": [
    "Jakub Janarek",
    "Zbigniew Drogosz",
    "Jacek Grela",
    "Jeremi K. Ochab",
    "Paweł Oświęcimka"
  ],
  "submission_date": "2023-07-26T10:58:53+00:00",
  "revised_dates": [],
  "abstract": "This paper addresses the question of the brain's critical dynamics after an injury such as a stroke. It is hypothesized that the healthy brain operates near a phase transition (critical point), which provides optimal conditions for information transmission and responses to inputs. If structural damage could cause the critical point to disappear and thus make self-organized criticality unachievable, it would offer the theoretical explanation for the post-stroke impairment of brain function. In our contribution, however, we demonstrate using network models of the brain, that the dynamics remain critical even after a stroke. In cases where the average size of the second-largest cluster of active nodes, which is one of the commonly used indicators of criticality, shows an anomalous behavior, it results from the loss of integrity of the network, quantifiable within graph theory, and not from genuine non-critical dynamics. We propose a new simple model of an artificial stroke that explains this anomaly. The proposed interpretation of the results is confirmed by an analysis of real connectomes acquired from post-stroke patients and a control group. The results presented refer to neurobiological data; however, the conclusions reached apply to a broad class of complex systems that admit a critical state.",
  "categories": [
    "q-bio.NC",
    "cond-mat.dis-nn",
    "q-bio.QM"
  ],
  "primary_category": "q-bio.NC",
  "doi": "10.1038/s41598-023-39467-x",
  "journal_ref": "Scientific Reports 13: 12341 (2023)",
  "arxiv_id": "2307.14099",
  "pdf_url": null,
  "comment": "24 pages, 11 figures",
  "num_versions": null,
  "size_before_bytes": 7323851,
  "size_after_bytes": 1868908
}