{
  "title": "Reversible and nonvolatile manipulation of the spin-orbit interaction in ferroelectric field-effect transistors based on a two-dimensional bismuth oxychalcogenide",
  "authors": [
    "Ming-Yuan Yan",
    "Shuang-Shuang Li",
    "Jian-Min Yan",
    "Li Xie",
    "Meng Xu",
    "Lei Guo",
    "Shu-Juan Zhang",
    "Guan-Yin Gao",
    "Fei-Fei Wang",
    "Shan-Tao Zhang",
    "Xiaolin Wang",
    "Yang Chai",
    "Weiyao Zhao",
    "Ren-Kui Zheng"
  ],
  "submission_date": "2023-07-25T10:25:52+00:00",
  "revised_dates": [],
  "abstract": "Spin-orbit interaction (SOI) offers a nonferromagnetic scheme to realize spin polarization through utilizing an electric field. Electrically tunable SOI through electrostatic gates have been investigated, however, the relatively weak and volatile tunability limit its practical applications in spintronics. Here, we demonstrate the nonvolatile electric-field control of SOI via constructing ferroelectric Rashba architectures, i.e., 2D Bi2O2Se/PMN-PT ferroelectric field effect transistors. The experimentally observed weak antilocalization (WAL) cusp in Bi2O2Se films implies the Rashba-type SOI that arises from asymmetric confinement potential. Significantly, taking advantage of the switchable ferroelectric polarization, the WAL-to-weak localization (WL) transition trend reveals the competition between spin relaxation and dephasing process, and the variation of carrier density leads to a reversible and nonvolatile modulation of spin relaxation time and spin splitting energy of Bi2O2Se films by this ferroelectric gating. Our work provides a scheme to achieve nonvolatile control of Rashba SOI with the utilization of ferroelectric remanent polarization.",
  "categories": [
    "cond-mat.mtrl-sci",
    "physics.app-ph"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": "10.1103/PhysRevApplied.18.044073",
  "journal_ref": "Physical Review Applied 18.4 (2022): 044073",
  "arxiv_id": "2307.13392",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}