{
  "title": "Sentinel of the extraordinary: the IceCube alert system for neutrino flares",
  "authors": [
    "Caterina Boscolo Meneguolo",
    "Elisa Bernardini",
    "Sarah Mancina"
  ],
  "submission_date": "2023-07-28T11:54:58+00:00",
  "revised_dates": [],
  "abstract": "The IceCube Neutrino Observatory has the invaluable capability of continuously monitoring the whole sky. This has affirmed the role of IceCube as a sentinel, providing real-time alerts to the astrophysical community on the detection of high-energy neutrinos and neutrino flares from a variety of astrophysical sources. As a response to the IceCube alerts, different observatories can join forces in the multi-messenger observation of transient events and the characterisation of their astrophysical sources. The 2017 breakthrough identification of blazar TXS 0506+056 as the source of high-energy neutrinos and UHE gamma rays was proof of this strategy. The Gamma-ray Follow-Up (GFU) is the IceCube program for identifying high-energy muon neutrino single events, as well as outstanding neutrino flares from relevant sources and the whole wide universe. While the identification of single high-energy neutrinos is shared on public alert distribution networks, partner Imaging Air Cherenkov Telescopes are sent low-latency alerts following the detection of neutrino flares, for which they have dedicated follow-up programs. I will present an overview of the GFU platform together with new results from the analysis of recorded neutrino flares, after a dozen years of GFU operation and hundreds of alerts being sent.",
  "categories": [
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.HE",
  "doi": "10.22323/1.444.1500",
  "journal_ref": "PoS(ICRC2023)1500",
  "arxiv_id": "2307.15501",
  "pdf_url": "https://arxiv.org/pdf/2307.15501v1",
  "comment": "Presented at the 38th International Cosmic Ray Conference (ICRC2023). See arXiv:2307.13047 for all IceCube contributions. 11 pages and 6 figures",
  "num_versions": null,
  "size_before_bytes": 1549699,
  "size_after_bytes": 205300
}