{
  "title": "Giant spin-charge conversion in ultrathin films of the MnPtSb half-Heusler compound",
  "authors": [
    "E. Longo",
    "A. Markou",
    "C. Felser",
    "M. Belli",
    "A. Serafini",
    "P. Targa",
    "D. Codegoni",
    "M. Fanciulli",
    "R. Mantovan"
  ],
  "submission_date": "2023-07-26T21:29:47+00:00",
  "revised_dates": [],
  "abstract": "Half-metallic half-Heusler compounds with strong spin-orbit-coupling and broken inversion symmetry in their crystal structure are promising materials for generating and absorbing spin-currents, thus enabling the electric manipulation of magnetization in energy-efficient spintronic devices. In this work, we report the spin-to-charge conversion in sputtered ultrathin films of the half-Heusler compound MnPtSb with thickness (t) in the range from 1 to 6 nm. A combination of X-ray and transmission electron microscopy measurements evidence the epitaxial nature of these ultrathin non-centrosymmetric MnPtSb films, with a clear (111)-orientation obtained on top of (0001) single-crystal sapphire substrates. The study of the thickness (t)-dependent magnetization dynamics of the MnPtSb(t)/Co(5nm)/Au(5nm) heterostructure revealed that the MnPtSb compound can be used as an efficient spin current generator, even at film thicknesses as low as 1 nm. By making use of spin pumping FMR, we measure a remarkable t-dependent spin-charge conversion in the MnPtSb layers, which clearly demonstrate the interfacial origin of the conversion. When interpreted as arising from the inverse Edelstein effect (IEE), the spin-charge conversion efficiency extracted at room temperature for the thinnest MnPtSb layer reaches λIEE~3 nm, representing an extremely high spin-charge conversion efficiency at room temperature. The still never explored ultrathin regime of the MnPtSb films studied in this work and the discover of their outstanding functionality are two ingredients which demonstrate the potentiality of such materials for future applications in spintronics.",
  "categories": [
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": "10.1002/adfm.202407968",
  "journal_ref": "Adv. Funct. Mater. 2024, 2407968",
  "arxiv_id": "2307.14516",
  "pdf_url": null,
  "comment": "main text: 17 pages (with 4 figures), plus additional 8 pages of Supplementary Information",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}