{
  "title": "Characteristics and Predictive Modeling of Short-term Impacts of Hurricanes on the US Employment",
  "authors": [
    "Gan Zhang",
    "Wenjun Zhu"
  ],
  "submission_date": "2023-07-25T17:46:57+00:00",
  "revised_dates": [],
  "abstract": "The physical and economic damages of hurricanes can acutely affect employment and the well-being of employees. However, a comprehensive understanding of these impacts remains elusive as many studies focused on narrow subsets of regions or hurricanes. Here we present an open-source dataset that serves interdisciplinary research on hurricane impacts on US employment. Compared to past domain-specific efforts, this dataset has greater spatial-temporal granularity and variable coverage. To demonstrate potential applications of this dataset, we focus on the short-term employment disruptions related to hurricanes during 1990-2020. The observed county-level employment changes in the initial month are small on average, though large employment losses (>30%) can occur after extreme storms. The overall small changes partly result from compensation among different employment sectors, which may obscure large, concentrated employment losses after hurricanes. Additional econometric analyses concur on the post-storm employment losses in hospitality and leisure but disagree on employment changes in the other industries. The dataset also enables data-driven analyses that highlight vulnerabilities such as pronounced employment losses related to Puerto Rico and rainy hurricanes. Furthermore, predictive modeling of short-term employment changes shows promising performance for service-providing industries and high-impact storms. In the examined cases, the nonlinear Random Forests model greatly outperforms the multiple linear regression model. The nonlinear model also suggests that more severe hurricane hazards projected by physical models may cause more extreme losses in US service-providing employment. Finally, we share our dataset and analytical code to facilitate the study and modeling of hurricane impacts in a changing climate.",
  "categories": [
    "econ.EM",
    "physics.ao-ph"
  ],
  "primary_category": "econ.EM",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13686",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}