{
  "title": "Embedding Models for Supervised Automatic Extraction and Classification of Named Entities in Scientific Acknowledgements",
  "authors": [
    "Nina Smirnova",
    "Philipp Mayr"
  ],
  "submission_date": "2023-07-25T09:51:17+00:00",
  "revised_dates": [],
  "abstract": "Acknowledgments in scientific papers may give an insight into aspects of the scientific community, such as reward systems, collaboration patterns, and hidden research trends. The aim of the paper is to evaluate the performance of different embedding models for the task of automatic extraction and classification of acknowledged entities from the acknowledgment text in scientific papers. We trained and implemented a named entity recognition (NER) task using the Flair NLP framework. The training was conducted using three default Flair NER models with four differently-sized corpora and different versions of the Flair NLP framework. The Flair Embeddings model trained on the medium corpus with the latest FLAIR version showed the best accuracy of 0.79. Expanding the size of a training corpus from very small to medium size massively increased the accuracy of all training algorithms, but further expansion of the training corpus did not bring further improvement. Moreover, the performance of the model slightly deteriorated. Our model is able to recognize six entity types: funding agency, grant number, individuals, university, corporation, and miscellaneous. The model works more precisely for some entity types than for others; thus, individuals and grant numbers showed a very good F1-Score over 0.9. Most of the previous works on acknowledgment analysis were limited by the manual evaluation of data and therefore by the amount of processed data. This model can be applied for the comprehensive analysis of acknowledgment texts and may potentially make a great contribution to the field of automated acknowledgment analysis.",
  "categories": [
    "cs.DL",
    "cs.CL",
    "cs.IR"
  ],
  "primary_category": "cs.DL",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13377",
  "pdf_url": null,
  "comment": "The present paper is an extended version of the article Evaluation of Embedding Models for Automatic Extraction and Classification of Acknowledged Entities in Scientific Documents (Smirnova and Mayr, 2022) presented at the 3rd Workshop on Extraction and Evaluation of Knowledge Entities from Scientific Documents (EEKE2022). arXiv admin note: substantial text overlap with arXiv:2206.10939",
  "num_versions": null,
  "size_before_bytes": 1185847,
  "size_after_bytes": 216251
}