{
  "title": "Accurate Vertical Nanoelectromechanical Measurements",
  "authors": [
    "Roger Proksch",
    "Ryan Wagner",
    "Joel Lefever"
  ],
  "submission_date": "2023-07-28T20:28:57+00:00",
  "revised_dates": [
    "2023-08-08T19:12:11+00:00",
    "2023-10-09T00:00:46+00:00"
  ],
  "abstract": "Accurate measurements of the nanoscale electromechanical coupling in materials, including piezo and ferroelectrics, twisted 2D layers, and biological systems is of both fundamental scientific and applied importance. Piezoresponse Force Microscopy (PFM) is capable of detecting strains in these materials, down to the picometer range. Following the emergence of weaker materials, the smaller signals associated with them have revealed various crosstalk challenges that have limited the accuracy of measurements. Previous work demonstrated that the use of an interferometric displacement sensor (IDS) positioned appropriately above the tip of the cantilever (x/L~1), where x is the spot position and L is the cantilever length, has enabled sensitive and artifact-free electromechanical measurements. A similar approach has been employed in removing unwanted electrostatic and in-plane response contributions for the optical beam deflection (OBD) measurement technique commonly used in most atomic force microscopes. In the present study, extensive automated sub-resonance spot position dependent PFM measurements were conducted on periodically poled lithium niobate (PPLN). In this work, both IDS and OBD responses were measured simultaneously, allowing direct comparisons of the two approaches. The IDS showed a blind spot at x/L~1, as expected. However, for OBD measurements, the blind spot's location exhibited wider variation, ranging from 0.15<x/L<0.61. Furthermore, the magnitudes of the amplitudes measured with IDS and OBD were typically different, sometimes approaching disagreement by a factor of two. These measurements have important implications, not only for the PPLN measured here, but for more complex and unknown samples that have a heterogeneous polarization and electrical characteristic.",
  "categories": [
    "cond-mat.mes-hall",
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.mes-hall",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15795",
  "pdf_url": "https://arxiv.org/pdf/2307.15795v3",
  "comment": "40 pages, 16 Figures, 24 Supplemental Figures",
  "num_versions": null,
  "size_before_bytes": 15410085,
  "size_after_bytes": 9023201
}