{
  "title": "Comparative $^{181}$Ta-NQR Study of Weyl Monopnictides TaAs and TaP: Relevance of Weyl Fermion Excitations",
  "authors": [
    "Tetsuro Kubo",
    "Hiroshi Yasuoka",
    "Balázs Dóra",
    "Deepa Kasinathan",
    "Yurii Prots",
    "Helge Rosner",
    "Takuto Fujii",
    "Marcus Schmidt",
    "Michael Baenitz"
  ],
  "submission_date": "2023-07-29T15:37:35+00:00",
  "revised_dates": [],
  "abstract": "Based on our first detailed $^{181}$Ta nuclear quadrupole resonance (NQR) studies from 2017 on the Weyl semimetal TaP, we now extended our NQR studies to another Ta-based monopnictide TaAs. In the present work, we have determined the temperature-dependent $^{181}$Ta-NQR spectra, the spin-lattice relaxation time $T_{1}$, and the spin-spin relaxation time $T_{2}$. We found the following characteristic features that showed great contrast to what was found in TaP: (1) The quadrupole coupling constant and asymmetry parameter of EFG, extracted from three NQR frequencies, have a strong temperature dependence above $\\sim$80 K that cannot be explained by the density functional theory calculation incorporating the thermal expansion of the lattice. (2) The temperature dependence of the spin-lattice relaxation rate, $1/T_{1} T$, shows a $T^{4}$ power law behavior above $\\sim$30 K. This is a great contrast with the $1/T_{1} T \\propto T^{2}$ behavior found in TaP, which was ascribed to the magnetic excitations at the Weyl nodes with a temperature-dependent orbital hyperfine coupling. (3) Regarding the nuclear spin-spin interaction, we found the spin-echo signal decays with the pulse separation simply by a Lorentzian function in TaAs, but we have observed spin-echo modulations in TaP that is most likely due to the indirect nuclear spin-spin coupling via virtually excited Weyl fermions. From our experimental findings, we conclude that the present NQR results do not show dominant contributions from Weyl fermion excitations in TaAs.",
  "categories": [
    "cond-mat.str-el",
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.str-el",
  "doi": "10.7566/JPSJ.92.094706",
  "journal_ref": "J. Phys. Soc. Jpn. 92, 094706 (2023)",
  "arxiv_id": "2307.16009",
  "pdf_url": "https://arxiv.org/pdf/2307.16009v1",
  "comment": "8 pages, 10 figures",
  "num_versions": null,
  "size_before_bytes": 11006380,
  "size_after_bytes": 35724
}