{
  "title": "Quasi-two-body decays $B_c \\to K^{*} h \\to K πh $ in the perturbative QCD",
  "authors": [
    "Zi-Yu Zhang",
    "Zhi-Qing Zhang",
    "Si-Yang Wang",
    "Zhi-Jie Sun",
    "You-Ya Yang"
  ],
  "submission_date": "2023-07-23T15:28:58+00:00",
  "revised_dates": [],
  "abstract": "In this work we study the quasi-two-body decays $B_c \\to \\ K^{*} h \\to K πh (h = D, D_s, K, π, η, η')$ in the perturbative QCD (PQCD) approach. The two-meson distribution amplitudes (DAs) $Φ^{\\text{P-wave}}_{Kπ}$ are introduced to describe the final state interactions of the K πpair, which involve the time-like form factors F_{Kπ}(s) parameterized by the relativistic Breit-Wigner function and the Gegenbauer polynomials. We calculate the branching ratios for these quasi-two-body decays, from which one can obtain the branching raios for the corresponding two-body decays under the narrow width approximation relation. We find that $B^+_c\\to K^{*+}D^0$ and $B^+_c\\to K^{*0}D^+$ have the largest branching ratios, which can reach up to $10^{-6}$, while the branching ratios for other two-body decays are very small and only about $10^{-8}\\sim10^{-7}$. As we expected that the branching ratios of the pure annihilation decays are usually small, while in our considered such type of decays, the channel $B_c^+ \\to \\bar K^{*0}K^{+}$ has the largest branching ratio, which is near $10^{-6}$. These results are consistent with the previously PQCD calculations obtained in the two-body framework, which can be tested by the future LHCb experiments. For the decays $B_c^+ \\to K^{*+} D^{0}\\to K^{0}π^+D^{0} , B_c^+ \\to K^{*0}D^{+}\\to K^{+}π^-D^{+}$ and $B_c^+ \\to \\bar K^{*0}D_s^{+}\\to K^{-}π^+D_s^{+}$, we calculate their direct CP violations and find that $A_{CP}(B_c^+ \\to K^{*+}D^{0}\\to K^{0}π^+D^{0})=(-14.6_{-1.12}^{+9.19})\\%$ is the largest one, which is possible measured by the present LHCb experiments. For the pure annihilation type decays, there is no CP violations because only the tree operators are involved. Furthermore, we also give the differential distributions of the branching ratios and the direct CP violations for the decays $B_c\\to K^* D_{(s)}\\to K πD_{(s)}$.",
  "categories": [
    "hep-ph"
  ],
  "primary_category": "hep-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12351",
  "pdf_url": null,
  "comment": "15 pages, 3 figures, 2 tables",
  "num_versions": null,
  "size_before_bytes": 593805,
  "size_after_bytes": 66924
}