{
  "title": "Discovery potential of the Glashow resonance in an air shower neutrino telescope",
  "authors": [
    "Guo-yuan Huang"
  ],
  "submission_date": "2023-07-22T19:57:00+00:00",
  "revised_dates": [],
  "abstract": "The in-ice or in-water Cherenkov neutrino telescope such as IceCube has already proved its power in measuring the Glashow resonance by searching for the bump around $E^{}_{\\rm ν} = 6.3~{\\rm PeV}$ arising from the $W$-boson production. In the next few decades, there are many proposals that observe cosmic tau neutrinos with extensive air showers, also known as tau neutrino telescopes. As has been recognized, the air shower telescope is in principle sensitive to the Glashow resonance via the channel $W \\to τν^{}_τ$ followed by the tau decay in the air. However, with a thorough numerical analysis we have identified several limitations for those telescopes on hunting the resonance. If ultrahigh-energy neutrinos are dominantly produced from the meson decay, it will be statistically difficult for a rather advanced proposal, such as TAMBO with a geometric area around $500~{\\rm km^2}$, to discriminate the Glashow resonance induced by $\\overlineν^{}_{e}$ from the intrinsic $ν^{}_τ/\\overlineν^{}_τ$ background. The discovery significance is only around $1σ$ considering the flux parameters measured by IceCube as the input. Nevertheless, the significance will be improved to $90\\%$ if PeV neutrinos mainly originate from the neutron decay, which is, however, thought to be only a subdominant neutrino source. The presence of new physics can also increase the significance. Compared to the in-ice or in-water telescope, the challenge for the Glashow resonance search is ascribed to several factors: (i) a suppressed branching ratio of $11\\%$ for the decay $W \\to τν^{}_τ$; (ii) the smearing effect and the reduced acceptance because the daughter neutrino takes away $\\langle y \\rangle \\sim 75\\%$ of the energy from the $W$ decay; (iii) a large attenuation effect for Earth-skimming neutrinos with the resonance.",
  "categories": [
    "astro-ph.HE",
    "hep-ex",
    "hep-ph"
  ],
  "primary_category": "astro-ph.HE",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12153",
  "pdf_url": null,
  "comment": "21 pages, 4 figures, and comments are welcome",
  "num_versions": null,
  "size_before_bytes": 10071500,
  "size_after_bytes": 550556
}