{
  "title": "Fitting Auditory Filterbanks with Multiresolution Neural Networks",
  "authors": [
    "Vincent Lostanlen",
    "Daniel Haider",
    "Han Han",
    "Mathieu Lagrange",
    "Peter Balazs",
    "Martin Ehler"
  ],
  "submission_date": "2023-07-25T21:20:12+00:00",
  "revised_dates": [],
  "abstract": "Waveform-based deep learning faces a dilemma between nonparametric and parametric approaches. On one hand, convolutional neural networks (convnets) may approximate any linear time-invariant system; yet, in practice, their frequency responses become more irregular as their receptive fields grow. On the other hand, a parametric model such as LEAF is guaranteed to yield Gabor filters, hence an optimal time-frequency localization; yet, this strong inductive bias comes at the detriment of representational capacity. In this paper, we aim to overcome this dilemma by introducing a neural audio model, named multiresolution neural network (MuReNN). The key idea behind MuReNN is to train separate convolutional operators over the octave subbands of a discrete wavelet transform (DWT). Since the scale of DWT atoms grows exponentially between octaves, the receptive fields of the subsequent learnable convolutions in MuReNN are dilated accordingly. For a given real-world dataset, we fit the magnitude response of MuReNN to that of a well-established auditory filterbank: Gammatone for speech, CQT for music, and third-octave for urban sounds, respectively. This is a form of knowledge distillation (KD), in which the filterbank ''teacher'' is engineered by domain knowledge while the neural network ''student'' is optimized from data. We compare MuReNN to the state of the art in terms of goodness of fit after KD on a hold-out set and in terms of Heisenberg time-frequency localization. Compared to convnets and Gabor convolutions, we find that MuReNN reaches state-of-the-art performance on all three optimization problems.",
  "categories": [
    "cs.SD",
    "cs.AI",
    "cs.LG",
    "eess.AS",
    "math.FA"
  ],
  "primary_category": "cs.SD",
  "doi": "10.1109/waspaa58266.2023.10248131",
  "journal_ref": "2023 IEEE Workshop on Applications of Signal Processing to Audio and Acoustics (WASPAA 2023)",
  "arxiv_id": "2307.13821",
  "pdf_url": null,
  "comment": "4 pages, 4 figures, 1 table, conference",
  "num_versions": null,
  "size_before_bytes": 572456,
  "size_after_bytes": 148082
}