{
  "title": "Stable sets mapping with Taylor differential algebra with application to ballistic capture orbits around Mars",
  "authors": [
    "Thomas Caleb",
    "Gianmario Merisio",
    "Pierluigi Di Lizia",
    "Francesco Topputo"
  ],
  "submission_date": "2023-07-27T18:06:07+00:00",
  "revised_dates": [
    "2023-07-31T08:35:44+00:00"
  ],
  "abstract": "Ballistic capture orbits offer safer Mars injection at longer transfer time. However, the search for such an extremely rare event is a computationally intensive process. Indeed, it requires the propagation of a grid sampling the whole search space. This work proposes a novel ballistic capture search algorithm based on Taylor differential algebra propagation. This algorithm provides a continuous description of the search space compared to classical grid sampling research and focuses on areas where the nonlinearities are the largest. Macroscopic analyses have been carried out to obtain cartography of large sets of solutions. Two criteria, named consistency and quality, are defined to assess this new algorithm and to compare its performances with classical grid sampling of the search space around Mars. Results show that differential algebra mapping works on large search spaces, and automatic domain splitting captures the dynamical variations on the whole domain successfully. The consistency criterion shows that more than 87% of the search space is guaranteed as accurate, with the quality criterion kept over 80%.",
  "categories": [
    "math.DS",
    "nlin.CD"
  ],
  "primary_category": "math.DS",
  "doi": "10.1007/s10569-022-10090-8",
  "journal_ref": "Celestial Mechanics and Dynamical Astronomy 134, no. 5 (2022): 39",
  "arxiv_id": "2307.15129",
  "pdf_url": "https://arxiv.org/pdf/2307.15129v2",
  "comment": "Post-print submitted to \"Celestial Mechanics and Dynamical Astronomy\". EXTREMA - Engineering Extremely Rare Events in Astrodynamics for Deep-Space Missions in Autonomy, European Research Council (ERC), European Union (EU), Horizon 2020. The content of this document reflects only the author's view. ERC is not responsible for any use that may be made of the information it contains",
  "num_versions": null,
  "size_before_bytes": 15176043,
  "size_after_bytes": 506703
}