{
  "title": "Decoherence and entropy generation at one loop in the inflationary de Sitter spacetime for Yukawa interaction",
  "authors": [
    "Sourav Bhattacharya",
    "Nitin Joshi"
  ],
  "submission_date": "2023-07-25T12:14:19+00:00",
  "revised_dates": [
    "2024-03-06T01:18:36+00:00"
  ],
  "abstract": "The decoherence mechanism is believed to be possibly connected to the quantum to classical transition of the primordial cosmological perturbations in the early universe. In this paper, we extend our previous analysis on decoherence in a fermion and scalar quantum field theory coupled via the Yukawa interaction in the Minkowski spacetime, to the inflationary de Sitter background. We treat the scalar field as the system and the fermions as the environment, and both the fields are taken to be massless. We utilise a non-equilibrium effective field theory formalism, suitable for open quantum systems such as this. We assume that an observer measures only the Gaussian 2-point correlator for the scalar field, as the simplest realistic scenario. In order to compute the von Neumann entropy generated at late times as a measure of the decoherence, we construct the one loop renormalised Kadanoff-Baym equation, which is the equation of motion satisfied by the 2-point correlators in the closed time path Schwinger-Keldysh formalism. These equations account to the self energy corrections. Using this, we next construct the one loop corrected statistical propagator for the scalar, which is related to its phase space area, to compute the von Neumann entropy. We also compute the variation of the von Neumann entropy with respect to relevant parameters. We note the qualitative similarity between our findings and the scenario where both the system and the environment are scalars. Our result is also qualitatively similar to an earlier one found by using the influence functional technique for a massive Yukawa theory.",
  "categories": [
    "hep-th",
    "gr-qc",
    "quant-ph"
  ],
  "primary_category": "hep-th",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13443",
  "pdf_url": null,
  "comment": "v2; 25pp, 4 figs; Added a figure and many clarifications, results unchanged; Accepted in JCAP",
  "num_versions": null,
  "size_before_bytes": 324598,
  "size_after_bytes": 184013
}