{
  "title": "Exploring Freeze-out and Freeze-in Dark Matter via Effective Froggatt-Nielsen Theory",
  "authors": [
    "Rusa Mandal",
    "Tom Tong"
  ],
  "submission_date": "2023-07-27T16:08:00+00:00",
  "revised_dates": [
    "2023-11-08T14:43:55+00:00"
  ],
  "abstract": "Motivated by the dynamical reasons for the hierarchical structure of the Yukawa sector of the Standard Model (SM), we consider an extension of the SM with a complex scalar field, known as `flavon', based on the Froggatt-Nielsen mechanism. In an effective theory approach, the SM fermion masses and mixing patterns are generated in orders of the parameter related to the vacuum expectation value of the flavon field and the cut-off of the effective theory. By introducing right-handed neutrinos, we study the viability of the lightest right-handed neutrino as a dark matter candidate, where the same flavon field acts as a mediator between the dark and the SM sectors. We find that dark matter genesis is achieved both through freeze-out and freeze-in mechanisms encompassing the $\\mathcal{O}(\\text{GeV})$ -- $\\mathcal{O}(\\text{TeV})$ mass range of the mediator and the dark matter particle. In addition to tree-level spin-dependent cross section, the model gives rise to tree- and loop-level contributions to spin-independent scattering cross section at the direct detection experiments such as XENON and LUX-ZEPLIN which can be probed in their future upgrades. By choosing suitable Froggatt-Nielsen charges for the fermions, we also generate the mass spectrum of the SM neutrinos via the Type-I seesaw mechanism. Flavor-changing neutral current processes, such as radiative lepton decay, meson mixing, and top-quark decay remain the most constraining channels and provide testability for this minimal setup that addresses several major shortcomings of the SM.",
  "categories": [
    "hep-ph"
  ],
  "primary_category": "hep-ph",
  "doi": "10.1088/1475-7516/2023/11/074",
  "journal_ref": "JCAP11(2023)074",
  "arxiv_id": "2307.14972",
  "pdf_url": "https://arxiv.org/pdf/2307.14972v2",
  "comment": "37 pages, 8 figures. Version accepted for publication in JCAP",
  "num_versions": null,
  "size_before_bytes": 8583911,
  "size_after_bytes": 224522
}