{
  "title": "Tell me, what are you most afraid of? Exploring the Effects of Agent Representation on Information Disclosure in Human-Chatbot Interaction",
  "authors": [
    "Anna Stock",
    "Stephan Schlögl",
    "Aleksander Groth"
  ],
  "submission_date": "2023-07-23T14:57:44+00:00",
  "revised_dates": [],
  "abstract": "Self-disclosure counts as a key factor influencing successful health treatment, particularly when it comes to building a functioning patient-therapist-connection. To this end, the use of chatbots may be considered a promising puzzle piece that helps foster respective information provision. Several studies have shown that people disclose more information when they are interacting with a chatbot than when they are interacting with another human being. If and how the chatbot is embodied, however, seems to play an important role influencing the extent to which information is disclosed. Here, research shows that people disclose less if the chatbot is embodied with a human avatar in comparison to a chatbot without embodiment. Still, there is only little information available as to whether it is the embodiment with a human face that inhibits disclosure, or whether any type of face will reduce the amount of shared information. The study presented in this paper thus aims to investigate how the type of chatbot embodiment influences self-disclosure in human-chatbot-interaction. We conducted a quasi-experimental study in which $n=178$ participants were asked to interact with one of three settings of a chatbot app. In each setting, the humanness of the chatbot embodiment was different (i.e., human vs. robot vs. disembodied). A subsequent discourse analysis explored difference in the breadth and depth of self-disclosure. Results show that non-human embodiment seems to have little effect on self-disclosure. Yet, our data also shows, that, contradicting to previous work, human embodiment may have a positive effect on the breadth and depth of self-disclosure.",
  "categories": [
    "cs.HC"
  ],
  "primary_category": "cs.HC",
  "doi": "10.1007/978-3-031-35894-4_13",
  "journal_ref": null,
  "arxiv_id": "2307.12345",
  "pdf_url": null,
  "comment": "13 pages",
  "num_versions": null,
  "size_before_bytes": 307328,
  "size_after_bytes": 155048
}