{
  "title": "Influence of early dark matter halos on the primordial black holes merger rate",
  "authors": [
    "Viktor Stasenko",
    "Konstantin Belotsky"
  ],
  "submission_date": "2023-07-24T16:33:14+00:00",
  "revised_dates": [
    "2023-10-19T00:22:03+00:00"
  ],
  "abstract": "Primordial black hole (PBH) binaries forming in the early Universe may contribute to the merger events observed by the LIGO-Virgo-KAGRA collaborations. Moreover, the inferred merger rate constraints the fraction of PBH with masses $m \\sim 10 \\, M_{\\odot}$ in the dark matter (DM) to $f_{PBH} \\lesssim 10^{-3}$. This constraint assumes that after the formation of PBH binaries, they do not get destroyed or their parameters are not perturbed until the merger. However, PBHs themselves contribute to the formation of early DM structures in which the interactions between PBHs take place actively. This leads to the fact that the binaries can be perturbed in such a way that their lifetime becomes longer than the Hubble time $t_H$. In this work, we consider the effect of the initial spatial Poisson distribution of PBHs on the structure formation at the high redshifts $z \\gtrsim 10$. Next, we explore the evolution of such halos due to the interaction of PBHs with each other and with DM particles. We show that the early halos evolve on timescales much shorter than the age of the Universe. Furthermore, for fractions of PBHs $f_{PBH} < 1$, the internal dynamics of a halo is significantly accelerated due to the dynamical friction of PBHs against DM particles. As a result, a significant fraction of binaries will be perturbed in such structures, and the gravitational waves constraints on PBHs with masses $m \\sim 10 \\, M_{\\odot}$ can be weakened to $f_{PBH} \\sim 0.1$.",
  "categories": [
    "astro-ph.CO"
  ],
  "primary_category": "astro-ph.CO",
  "doi": "10.1093/mnras/stad3032",
  "journal_ref": "MNRAS, 526, 4308 (2023)",
  "arxiv_id": "2307.12924",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1000509,
  "size_after_bytes": 350183
}