{
  "title": "String amplitudes and mutual information in confining backgrounds: the partonic behavior",
  "authors": [
    "Mahdis Ghodrati"
  ],
  "submission_date": "2023-07-25T12:34:12+00:00",
  "revised_dates": [
    "2023-12-05T01:24:23+00:00",
    "2024-02-15T01:04:26+00:00",
    "2024-04-30T00:12:42+00:00",
    "2024-05-01T00:15:49+00:00",
    "2025-03-18T01:28:27+00:00",
    "2025-08-18T00:41:46+00:00"
  ],
  "abstract": "In the background of several holographic confining backgrounds, we present the connections between the behaviors of string scattering amplitudes and mutual information. We lay down the analogies between the logarithmic branch cut behavior of the string scattering amplitude in $4d$, $ \\mathcal{A}_4 $, at low and medium Mandelstam variable $s$ observed in \\cite{Bianchi:2021sug}, which is due to the dependence of the string tension on the holographic coordinate, and the branch cut behavior observed in mutual information and critical distance $D_c$ at low-cut-off variable $u_{KK}$ studied in our previous work \\cite{Ghodrati:2021ozc}. It can also be seen that in both cases, as $s$ or $u_{KK}$ increases, the peaks in the branch cuts fade away in the form of $\\text{Re}\\lbrack \\mathcal{A}_4 \\rbrack \\propto s^{-1}$. Then, we used modular flow and modular Hamiltonian as intermediary concept to further clarify the observed connection. We discussed how mutual information itself can detect chaos in various scenarios. In addition, we considered two examples of Compton scattering between two photons and also the decay of a highly excited string into two tachyons and scrutinized the pattern of entanglement entropy and the change in the mutual information in these examples. Then, the kink-kink and kink-antikink scatterings as simple models of scattering in confining geometries have been used to examine the fractal structures in the scatterings of topological defects. Finally, the relationships between Regge conformal block and quantum error correction codes through pole-skipping and chaos bound have been postulated. These observed connections can further establish the ER$=$EPR conjecture and the general interdependence between the scattering amplitudes and entanglement entropy.",
  "categories": [
    "hep-th"
  ],
  "primary_category": "hep-th",
  "doi": "10.1103/mv9d-kmq4",
  "journal_ref": null,
  "arxiv_id": "2307.13454",
  "pdf_url": null,
  "comment": "46 pages, 27 figures",
  "num_versions": null,
  "size_before_bytes": 47885780,
  "size_after_bytes": 977703
}