{
  "title": "Formation of a wide-orbit giant planet in a gravitationally unstable subsolar-metallicity protoplanetary disc",
  "authors": [
    "Ryoki Matsukoba",
    "Eduard I. Vorobyov",
    "Takashi Hosokawa",
    "Manuel Guedel"
  ],
  "submission_date": "2023-07-25T18:00:00+00:00",
  "revised_dates": [],
  "abstract": "Direct imaging observations of planets revealed that wide-orbit ($>10$ au) giant planets exist even around subsolar-metallicity host stars and do not require metal-rich environments for their formation. A possible formation mechanism of wide-orbit giant planets in subsolar-metallicity environments is the gravitational fragmentation of massive protoplanetary discs. Here, we follow the long-term evolution of the disc for 1 Myr after its formation, which is comparable to disc lifetime, by way of a two-dimensional thin-disc hydrodynamic simulation with the metallicity of 0.1 ${\\rm Z}_{\\odot}$. We find a giant protoplanet that survives until the end of the simulation. The protoplanet is formed by the merger of two gaseous clumps at $\\sim$0.5 Myr after disc formation, and then it orbits $\\sim$200 au from the host star for $\\sim$0.5 Myr. The protoplanet's mass is $\\sim$10 ${\\rm M}_{\\rm J}$ at birth and gradually decreases to 1 ${\\rm M}_{\\rm J}$ due to the tidal effect from the host star. The result provides the minimum mass of 1 ${\\rm M}_{\\rm J}$ for protoplanets formed by gravitational instability in a subsolar-metallicity disc. We anticipate that the mass of a protoplanet experiencing reduced mass loss thanks to the protoplanetary contraction in higher resolution simulations can increase to $\\sim$10 ${\\rm M}_{\\rm J}$. We argue that the disc gravitational fragmentation would be a promising pathway to form wide-orbit giant planets with masses of $\\ge1$ ${\\rm M}_{\\rm J}$ in subsolar-metallicity environments.",
  "categories": [
    "astro-ph.EP",
    "astro-ph.SR"
  ],
  "primary_category": "astro-ph.EP",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13722",
  "pdf_url": null,
  "comment": "11 pages, 8 figures, submitted to MNRAS",
  "num_versions": null,
  "size_before_bytes": 2779575,
  "size_after_bytes": 183543
}