{
  "title": "3D Radar and Camera Co-Calibration: A Flexible and Accurate Method for Target-based Extrinsic Calibration",
  "authors": [
    "Lei Cheng",
    "Arindam Sengupta",
    "Siyang Cao"
  ],
  "submission_date": "2023-07-28T02:17:48+00:00",
  "revised_dates": [],
  "abstract": "Advances in autonomous driving are inseparable from sensor fusion. Heterogeneous sensors are widely used for sensor fusion due to their complementary properties, with radar and camera being the most equipped sensors. Intrinsic and extrinsic calibration are essential steps in sensor fusion. The extrinsic calibration, independent of the sensor's own parameters, and performed after the sensors are installed, greatly determines the accuracy of sensor fusion. Many target-based methods require cumbersome operating procedures and well-designed experimental conditions, making them extremely challenging. To this end, we propose a flexible, easy-to-reproduce and accurate method for extrinsic calibration of 3D radar and camera. The proposed method does not require a specially designed calibration environment, and instead places a single corner reflector (CR) on the ground to iteratively collect radar and camera data simultaneously using Robot Operating System (ROS), and obtain radar-camera point correspondences based on their timestamps, and then use these point correspondences as input to solve the perspective-n-point (PnP) problem, and finally get the extrinsic calibration matrix. Also, RANSAC is used for robustness and the Levenberg-Marquardt (LM) nonlinear optimization algorithm is used for accuracy. Multiple controlled environment experiments as well as real-world experiments demonstrate the efficiency and accuracy (AED error is 15.31 pixels and Acc up to 89\\%) of the proposed method.",
  "categories": [
    "cs.RO",
    "eess.SP",
    "eess.SY"
  ],
  "primary_category": "cs.RO",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15264",
  "pdf_url": "https://arxiv.org/pdf/2307.15264v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 20576878,
  "size_after_bytes": 256414
}