{
  "title": "Bayesian dependent mixture models: A predictive comparison and survey",
  "authors": [
    "Sara Wade",
    "Vanda Inacio",
    "Sonia Petrone"
  ],
  "submission_date": "2023-07-30T18:37:43+00:00",
  "revised_dates": [],
  "abstract": "For exchangeable data, mixture models are an extremely useful tool for density estimation due to their attractive balance between smoothness and flexibility. When additional covariate information is present, mixture models can be extended for flexible regression by modeling the mixture parameters, namely the weights and atoms, as functions of the covariates. These types of models are interpretable and highly flexible, allowing non only the mean but the whole density of the response to change with the covariates, which is also known as density regression. This article reviews Bayesian covariate-dependent mixture models and highlights which data types can be accommodated by the different models along with the methodological and applied areas where they have been used. In addition to being highly flexible, these models are also numerous; we focus on nonparametric constructions and broadly organize them into three categories: 1) joint models of the responses and covariates, 2) conditional models with single-weights and covariate-dependent atoms, and 3) conditional models with covariate-dependent weights. The diversity and variety of the available models in the literature raises the question of how to choose among them for the application at hand. We attempt to shed light on this question through a careful analysis of the predictive equations for the conditional mean and density function as well as predictive comparisons in three simulated data examples.",
  "categories": [
    "stat.ME"
  ],
  "primary_category": "stat.ME",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16298",
  "pdf_url": "https://arxiv.org/pdf/2307.16298v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 7109536,
  "size_after_bytes": 633481
}