{
  "title": "Reflective centers of module categories and quantum K-matrices",
  "authors": [
    "Robert Laugwitz",
    "Chelsea Walton",
    "Milen Yakimov"
  ],
  "submission_date": "2023-07-27T10:49:56+00:00",
  "revised_dates": [
    "2025-05-07T13:20:07+00:00"
  ],
  "abstract": "Our work is motivated by obtaining solutions to the quantum reflection equation (qRE) by categorical methods. To start, given a braided monoidal category $\\mathcal{C}$ and $\\mathcal{C}$-module category $\\mathcal{M}$, we introduce a version of the Drinfeld center $\\mathcal{Z}(\\mathcal{C})$ of $\\mathcal{C}$ adapted for $\\mathcal{M}$; we refer to this category as the \"reflective center\" $\\mathcal{E}_{\\mathcal{C}}(\\mathcal{M})$ of $\\mathcal{M}$. Just like $\\mathcal{Z}(\\mathcal{C})$ is a canonical braided monoidal category attached to $\\mathcal{C}$, we show that $\\mathcal{E}_{\\mathcal{C}}(\\mathcal{M})$ is a canonical braided module category attached to $\\mathcal{M}$; its properties are investigated in detail. Our second goal pertains to when $\\mathcal{C}$ is the category of modules over a quasitriangular Hopf algebra $H$, and $\\mathcal{M}$ is the category of modules over an $H$-comodule algebra $A$. We show that the reflective center $\\mathcal{E}_{\\mathcal{C}}(\\mathcal{M})$ here is equivalent to a category of modules over an explicit algebra, denoted by $R_H(A)$, which we call the \"reflective algebra\" of $A$. This result is akin to $\\mathcal{Z}(\\mathcal{C})$ being represented by the Drinfeld double Drin($H$) of $H$. We also study the properties of reflective algebras. Our third set of results is also in the Hopf setting above. We show that reflective algebras are quasitriangular $H$-comodule algebras, and examine their corresponding quantum $K$-matrices; this yields solutions to the qRE. We also establish that the reflective algebra $R_H(\\Bbbk)$ is an initial object in the category of quasitriangular $H$-comodule algebras, where $\\Bbbk$ is the ground field. The case when $H$ is the Drinfeld double of a finite group is illustrated.",
  "categories": [
    "math.QA",
    "math.RT"
  ],
  "primary_category": "math.QA",
  "doi": "10.1017/fms.2025.10055",
  "journal_ref": "Forum of Mathematics, Sigma 13 (2025) e95",
  "arxiv_id": "2307.14764",
  "pdf_url": "https://arxiv.org/pdf/2307.14764v2",
  "comment": "v2: Shortened significantly. 36 pages. To appear in Forum Math. Sigma",
  "num_versions": null,
  "size_before_bytes": 379467,
  "size_after_bytes": 381868
}