{
  "title": "Mathematical modeling for sustainability: How can it promote sustainable learning in mathematics education?",
  "authors": [
    "N. Karjanto"
  ],
  "submission_date": "2023-07-20T08:55:27+00:00",
  "revised_dates": [],
  "abstract": "This article reviews the current state of teaching and learning mathematical modeling in the context of sustainable development goals for education at the tertiary level. While ample research on mathematical modeling education and published textbooks on the topic are available, there is a lack of focus on mathematical modeling for sustainability. This review aims to address this gap by exploring the powerful intersection of mathematical modeling and sustainability. Mathematical modeling for sustainability connects two distinct realms: learning about the mathematics of sustainability and promoting sustainable learning in mathematics education. The former involves teaching and learning sustainability quantitatively, while the latter encompasses pedagogy that enables learners to apply quantitative knowledge and skills to everyday life and continue learning and improving mathematically beyond formal education. To demonstrate the practical application of mathematical modeling for sustainability, we discuss a specific textbook suitable for a pilot liberal arts course. We illustrate how learners can grasp mathematical concepts related to sustainability through simple yet mathematically diverse examples, which can be further developed for teaching such a course. Indeed, by filling the gap in the literature and providing practical resources, this review contributes to the advancement of mathematical modeling education in the context of sustainability.",
  "categories": [
    "math.HO",
    "physics.ed-ph"
  ],
  "primary_category": "math.HO",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13663",
  "pdf_url": null,
  "comment": "20 pages, 3 figures, 4 tables, 128 references",
  "num_versions": null,
  "size_before_bytes": 166175,
  "size_after_bytes": 87815
}