{
  "title": "Magnetization dynamics due to field interplay in field free spin Hall nano-oscillators",
  "authors": [
    "Ayush K Gupta",
    "Sourabh Manna",
    "Rajdeep Singh Rawat",
    "Rohit Medwal"
  ],
  "submission_date": "2023-07-22T12:30:23+00:00",
  "revised_dates": [],
  "abstract": "Spin Hall nano oscillators (SHNOs) have shown applications in unconventional computing schemes and broadband frequency generation in the presence of applied external magnetic field. However, under field-free conditions, the oscillation characteristics of SHNOs display a significant dependence on the effective field, which can be tuned by adjusting the constriction width, thereby presenting an intriguing area of study. Here we study the effect of nano constriction width on the magnetization dynamics in anisotropy assisted field free SHNOs. In uniaxial anisotropy-based field-free SHNOs, either the anisotropy field or the demagnetization field can dominate the magnetization dynamics depending on the constriction width. Our findings reveal distinct auto-oscillation characteristics in narrower constrictions with 20 nm and 30 nm constriction width compared to their wider counterpart with 100 nm width. The observed frequency shift variations with input current and constriction widths stem from the inherent nonlinearity of the system. The interplay between the B_demag and B_anis, coupled with changes in constriction width, yields rich dynamics and offers control over frequency tunability, auto oscillation amplitude, and threshold current. Notably, the spatial configuration of spin wave wells within the constriction undergoes transformations in response to changes in both constriction width and anisotropy. The findings highlight the significant influence of competing fields at the constriction on the field-free auto oscillations of SHNOs, with this impact intensifying as the constriction width is varied.",
  "categories": [
    "physics.app-ph"
  ],
  "primary_category": "physics.app-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12068",
  "pdf_url": null,
  "comment": "25 pages, 11 figures",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}