{
  "title": "Deep learning denoising by dimension reduction: Application to the ORION-B line cubes",
  "authors": [
    "Lucas Einig",
    "Jérôme Pety",
    "Antoine Roueff",
    "Paul Vandame",
    "Jocelyn Chanussot",
    "Maryvonne Gerin",
    "Jan H. Orkisz",
    "Pierre Palud",
    "Miriam Garcia Santa-Maria",
    "Victor de Souza Magalhaes",
    "Ivana Bešlić",
    "Sébastien Bardeau",
    "Emeric E. Bron",
    "Pierre Chainais",
    "Javier R Goicoechea",
    "Pierre Gratier",
    "Viviana Guzman Veloso",
    "Annie Hughes",
    "Jouni Kainulainen",
    "David Languignon",
    "Rosine Lallement",
    "François Levrier",
    "Dariuscz C. Lis",
    "Harvey Liszt",
    "Jacques Le Bourlot",
    "Franck Le Petit",
    "Karin Danielsson Öberg",
    "Nicolas Peretto",
    "Evelyne Roueff",
    "Albrecht Sievers",
    "Pierre-Antoine Thouvenin",
    "Pascal Tremblin"
  ],
  "submission_date": "2023-07-24T13:02:31+00:00",
  "revised_dates": [],
  "abstract": "Context. The availability of large bandwidth receivers for millimeter radio telescopes allows the acquisition of position-position-frequency data cubes over a wide field of view and a broad frequency coverage. These cubes contain much information on the physical, chemical, and kinematical properties of the emitting gas. However, their large size coupled with inhomogenous signal-to-noise ratio (SNR) are major challenges for consistent analysis and interpretation.Aims. We search for a denoising method of the low SNR regions of the studied data cubes that would allow to recover the low SNR emission without distorting the signals with high SNR.Methods. We perform an in-depth data analysis of the 13 CO and C 17 O (1 -- 0) data cubes obtained as part of the ORION-B large program performed at the IRAM 30m telescope. We analyse the statistical properties of the noise and the evolution of the correlation of the signal in a given frequency channel with that of the adjacent channels. This allows us to propose significant improvements of typical autoassociative neural networks, often used to denoise hyperspectral Earth remote sensing data. Applying this method to the 13 CO (1 -- 0) cube, we compare the denoised data with those derived with the multiple Gaussian fitting algorithm ROHSA, considered as the state of the art procedure for data line cubes.Results. The nature of astronomical spectral data cubes is distinct from that of the hyperspectral data usually studied in the Earth remote sensing literature because the observed intensities become statistically independent beyond a short channel separation. This lack of redundancy in data has led us to adapt the method, notably by taking into account the sparsity of the signal along the spectral axis. The application of the proposed algorithm leads to an increase of the SNR in voxels with weak signal, while preserving the spectral shape of the data in high SNR voxels.Conclusions. The proposed algorithm that combines a detailed analysis of the noise statistics with an innovative autoencoder architecture is a promising path to denoise radio-astronomy line data cubes. In the future, exploring whether a better use of the spatial correlations of the noise may further improve the denoising performances seems a promising avenue. In addition,",
  "categories": [
    "astro-ph.IM"
  ],
  "primary_category": "astro-ph.IM",
  "doi": "10.1051/0004-6361/202346064",
  "journal_ref": "A&A 677, A158 (2023)",
  "arxiv_id": "2307.13009",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 58150067,
  "size_after_bytes": 245585
}