{
  "title": "Proceeding of the 1st Workshop on Social Robots Personalisation At the crossroads between engineering and humanities (CONCATENATE)",
  "authors": [
    "Imene Tarakli",
    "Georgios Angelopoulos",
    "Mehdi Hellou",
    "Camille Vindolet",
    "Boris Abramovic",
    "Rocco Limongelli",
    "Dimitri Lacroix",
    "Andrea Bertolini",
    "Silvia Rossi",
    "Alessandro Di Nuovo",
    "Angelo Cangelosi",
    "Gordon Cheng"
  ],
  "submission_date": "2023-07-10T11:11:24+00:00",
  "revised_dates": [
    "2023-11-27T01:20:50+00:00"
  ],
  "abstract": "Nowadays, robots are expected to interact more physically, cognitively, and socially with people. They should adapt to unpredictable contexts alongside individuals with various behaviours. For this reason, personalisation is a valuable attribute for social robots as it allows them to act according to a specific user's needs and preferences and achieve natural and transparent robot behaviours for humans. If correctly implemented, personalisation could also be the key to the large-scale adoption of social robotics. However, achieving personalisation is arduous as it requires us to expand the boundaries of robotics by taking advantage of the expertise of various domains. Indeed, personalised robots need to analyse and model user interactions while considering their involvement in the adaptative process. It also requires us to address ethical and socio-cultural aspects of personalised HRI to achieve inclusive and diverse interaction and avoid deception and misplaced trust when interacting with the users. At the same time, policymakers need to ensure regulations in view of possible short-term and long-term adaptive HRI. This workshop aims to raise an interdisciplinary discussion on personalisation in robotics. It aims at bringing researchers from different fields together to propose guidelines for personalisation while addressing the following questions: how to define it - how to achieve it - and how it should be guided to fit legal and ethical requirements.",
  "categories": [
    "cs.RO",
    "cs.AI",
    "cs.HC"
  ],
  "primary_category": "cs.RO",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12777",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}