{
  "title": "PCA, SVD, and Centering of Data",
  "authors": [
    "Donggun Kim",
    "Kisung You"
  ],
  "submission_date": "2023-07-27T22:10:28+00:00",
  "revised_dates": [
    "2024-04-01T17:10:52+00:00"
  ],
  "abstract": "The research detailed in this paper scrutinizes Principal Component Analysis (PCA), a seminal method employed in statistics and machine learning for the purpose of reducing data dimensionality. Singular Value Decomposition (SVD) is often employed as the primary means for computing PCA, a process that indispensably includes the step of centering - the subtraction of the mean location from the data set. In our study, we delve into a detailed exploration of the influence of this critical yet often ignored or downplayed data centering step. Our research meticulously investigates the conditions under which two PCA embeddings, one derived from SVD with centering and the other without, can be viewed as aligned. As part of this exploration, we analyze the relationship between the first singular vector and the mean direction, subsequently linking this observation to the congruity between two SVDs of centered and uncentered matrices. Furthermore, we explore the potential implications arising from the absence of centering in the context of performing PCA via SVD from a spectral analysis standpoint. Our investigation emphasizes the importance of a comprehensive understanding and acknowledgment of the subtleties involved in the computation of PCA. As such, we believe this paper offers a crucial contribution to the nuanced understanding of this foundational statistical method and stands as a valuable addition to the academic literature in the field of statistics.",
  "categories": [
    "stat.ME",
    "stat.ML"
  ],
  "primary_category": "stat.ME",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15213",
  "pdf_url": "https://arxiv.org/pdf/2307.15213v2",
  "comment": "16 pages, 2 figures",
  "num_versions": null,
  "size_before_bytes": 1800841,
  "size_after_bytes": 1399160
}