{
  "title": "Lensing impact on cosmic relics and tensions",
  "authors": [
    "William Giarè",
    "Olga Mena",
    "Eleonora Di Valentino"
  ],
  "submission_date": "2023-07-26T14:03:32+00:00",
  "revised_dates": [
    "2023-11-30T01:37:28+00:00"
  ],
  "abstract": "Cosmological bounds on neutrinos and additional hypothetical light thermal relics, such as QCD axions, are currently among the most restrictive ones. These limits mainly rely on Cosmic Microwave Background temperature anisotropies. Nonetheless, one of the largest cosmological signatures of thermal relics is that on gravitational lensing, due to their free streaming behavior before their non-relativistic period. We investigate late time only hot relic mass constraints, primarily based on recently released lensing data from the Atacama Cosmology Telescope, both alone and in combination with lensing data from the Planck Satellite. Additionally, we consider other local probes, such as Baryon Acoustic Oscillations measurements, shear-shear, galaxy-galaxy, and galaxy-shear correlation functions from the Dark Energy Survey, and distance moduli measurements from Type Ia Supernovae. The tightest bounds we find are $\\sum m_ν<0.43$ eV and $m_a<1.1$ eV, both at $95\\%$ CL. Interestingly, these limits are still much stronger than those found on e.g. laboratory neutrino mass searches, reassessing the robustness of the extraction of thermal relic properties via cosmological observations. In addition, when considering lensing-only data, the significance of the Hubble constant tension is considerably reduced, while the clustering parameter $σ_8$ controversy is completely absent.",
  "categories": [
    "astro-ph.CO",
    "hep-ph"
  ],
  "primary_category": "astro-ph.CO",
  "doi": "10.1103/PhysRevD.108.103539",
  "journal_ref": null,
  "arxiv_id": "2307.14204",
  "pdf_url": null,
  "comment": "10 pages, 3 figures, 7 tables. Edited to Match the PRD published version",
  "num_versions": null,
  "size_before_bytes": 3490083,
  "size_after_bytes": 376135
}