{
  "title": "On the origin of outward migration of Population III stars",
  "authors": [
    "Jongwon Park",
    "Massimo Ricotti",
    "Kazuyuki Sugimura"
  ],
  "submission_date": "2023-07-27T00:48:54+00:00",
  "revised_dates": [
    "2024-02-15T16:42:47+00:00"
  ],
  "abstract": "Outward migration of massive binary stars or black holes in their circumbinary disc is often observed in simulations and it is key to the formation of wide black hole binaries. Using numerical simulations of Population III (Pop III) star formation, we study the angular momentum of Pop III binaries and the torques between stars and gas discs to understand the origin of outward migration and high ellipticity. The outward migration of protostars is produced by gravitational torques exerted on them by their circumstellar minidiscs. The minidiscs, on the other hand, migrate outward mainly by gaining angular momentum by accreting gas from the circumbinary disc. The angular momentum transfer is most efficient for rapidly accreting equal-mass binaries, and weaker when the secondary mass is small or the massive companion evaporates the gas disc via radiative feedback. We conclude that outward migration and the formation of wide equal-mass massive binaries is common in metal-free/metal-poor star formation, mainly driven by their large accretion rates. We expect that the lower gas temperature and accretion rates in metal-enriched circumstellar discs would lead more often to inward migration and closer binary separations. We also observe inward migration for smaller mass Pop III protostars/fragments, leading to the rapid merging of sink particles and likely the formation of close binary black holes that, however, reach separations below the resolution of our simulations. We discuss the implications that Pop III separations and ellipticity may have on the interpretation that gravitational wave signals from merging intermediate-mass black holes come from Pop III remnants.",
  "categories": [
    "astro-ph.GA",
    "astro-ph.SR"
  ],
  "primary_category": "astro-ph.GA",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14562",
  "pdf_url": "https://arxiv.org/pdf/2307.14562v2",
  "comment": "20 pages, 17+4 figures. Accepted for publication in MNRAS",
  "num_versions": null,
  "size_before_bytes": 18112033,
  "size_after_bytes": 193491
}