{
  "title": "A tight Monte-Carlo algorithm for Steiner Tree parameterized by clique-width",
  "authors": [
    "Narek Bojikian",
    "Stefan Kratsch"
  ],
  "submission_date": "2023-07-26T15:51:49+00:00",
  "revised_dates": [
    "2024-02-27T03:17:54+00:00"
  ],
  "abstract": "Recently, Hegerfeld and Kratsch [ESA 2023] obtained the first tight algorithmic results for hard connectivity problems parameterized by clique-width. Concretely, they gave one-sided error Monte-Carlo algorithms that given a $k$-clique-expression solve Connected Vertex Cover in time $6^kn^{O(1)}$ and Connected Dominating Set in time $5^kn^{O(1)}$. Moreover, under the Strong Exponential-Time Hypothesis (SETH) these results were showed to be tight. However, they leave open several important benchmark problems, whose complexity relative to treewidth had been settled by Cygan et al. [SODA 2011 & TALG 2018]. Among which is the Steiner Tree problem. As a key obstruction they point out the exponential gap between the rank of certain compatibility matrices, which is often used for algorithms, and the largest triangular submatrix therein, which is essential for current lower bound methods. Concretely, for Steiner Tree the $GF(2)$-rank is $4^k$, while no triangular submatrix larger than $3^k$ was known. This yields time $4^kn^{O(1)}$, while the obtainable impossibility of time $(3-\\varepsilon)^kn^{O(1)}$ under SETH was already known relative to pathwidth.\n  We close this gap by showing that Steiner Tree can be solved in time $3^kn^{O(1)}$ given a $k$-clique-expression. Hence, for all parameters between cutwidth and clique-width it has the same tight complexity. We first show that there is a ``representative submatrix'' of GF(2)-rank $3^k$ (ruling out larger triangular submatrices). At first glance, this only allows to count (modulo 2) the number of representations of valid solutions, but not the number of solutions (even if a unique solution exists). We show how to overcome this problem by isolating a unique representative of a unique solution, if one exists. We believe that our approach will be instrumental for settling further open problems in this research program.",
  "categories": [
    "cs.DS"
  ],
  "primary_category": "cs.DS",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14264",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 502459,
  "size_after_bytes": 504628
}