{
  "title": "Nonlocal photonic quantum gates over 7.0 km",
  "authors": [
    "Xiao Liu",
    "Xiao-Min Hu",
    "Tian-Xiang Zhu",
    "Chao Zhang",
    "Yi-Xin Xiao",
    "Jia-Le Miao",
    "Zhong-Wen Ou",
    "Bi-Heng Liu",
    "Zong-Quan Zhou",
    "Chuan-Feng Li",
    "Guang-Can Guo"
  ],
  "submission_date": "2023-07-28T15:49:00+00:00",
  "revised_dates": [
    "2024-10-07T14:29:00+00:00"
  ],
  "abstract": "Quantum networks provide a prospective paradigm to connect separated quantum nodes, which relies on the distribution of long-distance entanglement and active feedforward control of qubits between remote nodes. Such approaches can be utilized to construct nonlocal quantum gates, forming building blocks for distributed quantum computing and other novel quantum applications. However, these gates have only been realized within single nodes or between nodes separated by a few tens of meters, limiting the ability to harness computing resources in large-scale quantum networks. Here, we demonstrate nonlocal photonic quantum gates between two nodes spatially separated by 7.0 km using stationary qubits based on multiplexed quantum memories, flying qubits at telecom wavelengths, and active feedforward control based on field-deployed fibers. Furthermore, we illustrate quantum parallelism by implementing the Deutsch-Jozsa algorithm and the quantum phase estimation algorithm between the two remote nodes. These results represent a proof-of-principle demonstration of quantum gates over metropolitan-scale distances and lay the foundation for the construction of large-scale distributed quantum networks relying on existing fiber channels.",
  "categories": [
    "quant-ph",
    "physics.optics"
  ],
  "primary_category": "quant-ph",
  "doi": "10.1038/s41467-024-52912-3",
  "journal_ref": "Nature Communications 15, 8529 (2024)",
  "arxiv_id": "2307.15634",
  "pdf_url": "https://arxiv.org/pdf/2307.15634v2",
  "comment": "26 pages, 18 figures",
  "num_versions": null,
  "size_before_bytes": 22011268,
  "size_after_bytes": 187636
}