{
  "title": "Two-level Continuous Topology Optimization in Structural Mechanics",
  "authors": [
    "Rafael Merli",
    "Antolín Martínez-Martínez",
    "Juan José Ródenas",
    "Marc Bosch-Galera",
    "Enrique Nadal"
  ],
  "submission_date": "2023-07-28T16:52:46+00:00",
  "revised_dates": [],
  "abstract": "In the current industry, the development of optimized mechanical components able to satisfy the customer requirements evolves quickly. Therefore, companies are asked for efficient solutions to improve their products in terms of stiffness and strength. In this sense, Topology Optimization has been extensively used to determine the best topology of structural components from the mechanical point of view. Its main objective is to distribute a given amount of material into a predefined domain to reach the maximum overall stiffness of the component. Besides, high-resolution solutions are essential to define the final distribution of material. Standard Topological Optimization tools are able to propose an optimal topology for the whole component, but when small topological details are required (i.e. trabecular-type structures) the computational cost is prohibitive. In order to mitigate this issue, the present work proposes a two-level topology optimization method to solve high-resolution problems by using density-based methods. The proposed methodology includes three steps: The first one subdivides the whole component in cells and generates a coarse optimized low-definition material distribution assigning one different density to each cell. The second one uses an equilibrating technique that provides tractions continuity between adjacent cells, thus ensuring the material inter-cell continuity after the cells optimization process. Finally, each cell is optimized at fine scale taking as input data the densities and the equilibrated tractions obtained from the macro problem. The main goal of this work is to efficiently solve high-resolution topology optimization problems using density-based methods, which would be unaffordable with standard computing facilities and the current methodologies.",
  "categories": [
    "cs.CE",
    "math.NA"
  ],
  "primary_category": "cs.CE",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15665",
  "pdf_url": "https://arxiv.org/pdf/2307.15665v1",
  "comment": "23 pages",
  "num_versions": null,
  "size_before_bytes": 7416495,
  "size_after_bytes": 106354
}