{
  "title": "Galaxy evolution in compact groups I: Revealing a transitional galaxy population through a multiwavelength approach",
  "authors": [
    "Gissel P. Montaguth",
    "Sergio Torres-Flores",
    "Antonela Monachesi",
    "Facundo A. Gómez",
    "Ciria Lima-Dias",
    "Arianna Cortesi",
    "Claudia Mendes de Oliveira",
    "Eduardo Telles",
    "Swayamtrupta Panda",
    "Marco Grossi",
    "Paulo A. A. Lopes",
    "Jose A. Hernandez-Jimenez",
    "Antonio Kanaan",
    "Tiago Ribeiro",
    "William Schoenell"
  ],
  "submission_date": "2023-07-21T18:01:07+00:00",
  "revised_dates": [],
  "abstract": "Compact groups of galaxies (CGs) show members with morphological disturbances, mainly products of galaxy-galaxy interactions, thus making them ideal systems to study galaxy evolution, in high-density environment. To understand how this environment affects the properties of galaxies, we select a sample of 340 CGs in the Stripe 82 region, for a total of 1083 galaxies, and a sample of 2281 field galaxies as a control sample. By performing a multi-wavelength morphological fitting process using S-PLUS data, we divide our sample into early-type (ETG), late-type (LTG), and transition galaxies using the r-band Sérsic index and the colour (u-r). We find a bimodal distribution in the plane of the effective radius-Sérsic index, where a secondary \"peculiar\" galaxy population of smaller and more compact galaxies is found in CGs, which is not observed in the control sample. This indicates that galaxies are undergoing a morphological transformation in CGs. In addition, we find significant statistical differences in the distribution of specific Star Formation Rate (sSFR) when we compare both environments for LTGs and ETGs. We also find a higher fraction of quenched galaxies and a lower median sSFR in CGs than in the control sample, suggesting the existence of environmental effects favoring the cessation of star formation, regardless of galaxy type. Our results support the notion that CGs promote morphological and physical transformations, highlighting their potential as ideal systems for galaxy pre-processing.",
  "categories": [
    "astro-ph.GA",
    "astro-ph.CO"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.1093/mnras/stad2235",
  "journal_ref": null,
  "arxiv_id": "2307.11825",
  "pdf_url": null,
  "comment": "17 pages, 15 figures. Accepted for publication in MNRAS",
  "num_versions": null,
  "size_before_bytes": 3397349,
  "size_after_bytes": 455573
}