{
  "title": "Stochastic Flight Plan Optimization",
  "authors": [
    "Ítalo Romani de Oliveira",
    "Steve Altus",
    "Sergey Tiourine",
    "Euclides C. Pinto Neto",
    "Alexandre Leite",
    "Felipe C. F. de Azevedo"
  ],
  "submission_date": "2023-07-27T14:14:18+00:00",
  "revised_dates": [],
  "abstract": "Airline operations are subject to many uncertainties, such as weather, varying demand, maintenance events, congestion, etc. Large amounts of information are currently ignored due to difficulties in processing big data sets. We explore the use of ensemble weather forecast, which presents several distinct weather predictions for the same time horizon. So far, ensemble forecasts have been very little exploited for flight planning purposes.\n  Currently, airlines already carry out lots of statistical analyses on past data, and devise effective policies for how much fuel and payload an aircraft should carry and how much of time buffer should be used in the schedule. But these buffers can be further reduced by doing forward-looking stochastic optimization. The use of ensemble forecast allows to select a trajectory that optimizes the expected outcome of a flight for an array of scenarios, instead of optimizing for a single one. Besides, aircraft payload is another considerable source of uncertainty.\n  We tested stochastic optimization, first with the objective of optimizing single flights, then with the objective of optimizing whole schedules. In one of the experiments, it was observed that, in 55.8% of the cases, stochastic optimization outperforms conventional optimization in terms of fuel consumption; in only 0.4% of the cases, conventional optimization wins; and, in the remaining 43.8% of the cases, they achieve equal results. The experiments with stochastic payload demonstrated that the use of payload uncertainty can squeeze a bit more fuel savings from the flight plan outcomes. But the use of this technology is not driven only by reducing overall fuel consumption. One optimization criterion can be the minimization of diversions or fuel emergencies, that is, choosing the candidate that minimizes the maximum fuel consumption (minimax).",
  "categories": [
    "eess.SY"
  ],
  "primary_category": "eess.SY",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14883",
  "pdf_url": "https://arxiv.org/pdf/2307.14883v1",
  "comment": "Preprint to the 2023 IEEE/AIAA Digital Aviation Systems Conference, October 1-5, 2023, Barcelona, Spain",
  "num_versions": null,
  "size_before_bytes": 989987,
  "size_after_bytes": 577148
}