{
  "title": "Ab initio calculations of neutrinoless $ββ$ decay refine neutrino mass limits",
  "authors": [
    "A. Belley",
    "T. Miyagi",
    "S. R. Stroberg",
    "J. D. Holt"
  ],
  "submission_date": "2023-07-27T19:07:55+00:00",
  "revised_dates": [],
  "abstract": "Neutrinos are perhaps the most elusive known particles in the universe. We know they have some nonzero mass, but unlike all other particles, the absolute scale remains unknown. In addition, their fundamental nature is uncertain; they can either be their own antiparticles or exist as distinct neutrinos and antineutrinos. The observation of the hypothetical process of neutrinoless double-beta ($0νββ$) decay would at once resolve both questions, while providing a strong lead in understanding the abundance of matter over antimatter in our universe. In the scenario of light-neutrino exchange, the decay rate is governed by, and thereby linked to the effective mass of the neutrino via, the theoretical nuclear matrix element (NME). In order to extract the neutrino mass, if a discovery is made, or to assess the discovery potential of next-generation searches, it is essential to obtain accurate NMEs for all isotopes of experimental interest. However, two of the most important cases, $^{130}$Te and $^{136}$Xe, lie in the heavy region and have only been accessible to phenomenological nuclear models. In this work we utilize powerful advances in ab initio nuclear theory to compute NMEs from the underlying nuclear and weak forces driving this decay, including the recently discovered short-range component. We find that ab initio NMEs are generally smaller than those from nuclear models, challenging the expected reach of future ton-scale searches as well as claims to probe the inverted hierarchy of neutrino masses. With this step, ab initio calculations with theoretical uncertainties are now feasible for all isotopes relevant for next-generation $0νββ$ decay experiments.",
  "categories": [
    "nucl-th",
    "hep-ex",
    "hep-ph",
    "nucl-ex"
  ],
  "primary_category": "nucl-th",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15156",
  "pdf_url": "https://arxiv.org/pdf/2307.15156v1",
  "comment": "5 pages, 3 figures, supplemental material included",
  "num_versions": null,
  "size_before_bytes": 833396,
  "size_after_bytes": 147196
}