{
  "title": "Non-volatile Phase-only Transmissive Spatial Light Modulators",
  "authors": [
    "Zhuoran Fang",
    "Rui Chen",
    "Johannes E. Fröch",
    "Quentin A. A. Tanguy",
    "Asir Intisar Khan",
    "Xiangjin Wu",
    "Virat Tara",
    "Arnab Manna",
    "David Sharp",
    "Christopher Munley",
    "Forrest Miller",
    "Yang Zhao",
    "Sarah J. Geiger",
    "Karl F. Böhringer",
    "Matthew Reynolds",
    "Eric Pop",
    "Arka Majumdar"
  ],
  "submission_date": "2023-07-22T15:26:45+00:00",
  "revised_dates": [],
  "abstract": "Free-space modulation of light is crucial for many applications, from light detection and ranging to virtual or augmented reality. Traditional means of modulating free-space light involves spatial light modulators based on liquid crystals and microelectromechanical systems, which are bulky, have large pixel areas (~10 micron x 10 micron), and require high driving voltage. Recent progress in meta-optics has shown promise to circumvent some of the limitations. By integrating active materials with sub-wavelength pixels in a meta-optic, the power consumption can be dramatically reduced while achieving a faster speed. However, these reconfiguration methods are volatile and hence require constant application of control signals, leading to phase jitter and crosstalk. Additionally, to control a large number of pixels, it is essential to implement a memory within each pixel to have a tractable number of control signals. Here, we develop a device with nonvolatile, electrically programmable, phase-only modulation of free-space infrared radiation in transmission using the low-loss phase-change material (PCM) Sb2Se3. By coupling an ultra-thin PCM layer to a high quality (Q)-factor (Q~406) diatomic metasurface, we demonstrate a phase-only modulation of ~0.25pi (~0.2pi) in simulation (experiment), ten times larger than a bare PCM layer of the same thickness. The device shows excellent endurance over 1,000 switching cycles. We then advance the device geometry, to enable independent control of 17 meta-molecules, achieving ten deterministic resonance levels with a 2pi phase shift. By independently controlling the phase delay of pixels, we further show tunable far-field beam shaping. Our work paves the way to realizing non-volatile transmissive phase-only spatial light modulators.",
  "categories": [
    "physics.optics"
  ],
  "primary_category": "physics.optics",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12103",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}