{
  "title": "Qualitative study of ballistic capture at Mars via Lagrangian descriptors",
  "authors": [
    "Alessio Quinci",
    "Gianmario Merisio",
    "Francesco Topputo"
  ],
  "submission_date": "2023-07-28T05:24:08+00:00",
  "revised_dates": [
    "2023-07-31T08:22:04+00:00"
  ],
  "abstract": "Lagrangian descriptors reveal the dynamical skeleton governing transport mechanisms of a generic flow. In doing so, they unveil geometrical structures in the phase space that separate regions with different qualitative behavior. This work investigates to what extent Lagrangian descriptors provide information about non-Keplerian motion in Mars proximity, which is modeled under the planar elliptic restricted three-body problem. We propose a novel technique to reveal ballistic capture orbits extracting separatrices of the phase space highlighted by Lagrangian descriptor scalar fields. The Roberts' operator to approximate the gradient is used to detect the edges in the fields. Results demonstrate the chaos indicator ability to distinguish sets of initial conditions exhibiting different dynamics, including ballistic capture ones. Separatrices are validated against reference weak stability boundary derived on similar integration intervals. Compared to other techniques, Lagrangian descriptors provide dynamics insight bypassing the propagation of the variational equations.",
  "categories": [
    "math.DS",
    "nlin.CD"
  ],
  "primary_category": "math.DS",
  "doi": "10.1016/j.cnsns.2023.107285",
  "journal_ref": "Communications in Nonlinear Science and Numerical Simulation 123 (2023): 107285",
  "arxiv_id": "2307.15314",
  "pdf_url": "https://arxiv.org/pdf/2307.15314v2",
  "comment": "Post-print submitted to \"Communications in Nonlinear Science and Numerical Simulation\". EXTREMA - Engineering Extremely Rare Events in Astrodynamics for Deep-Space Missions in Autonomy, European Research Council (ERC), European Union (EU), Horizon 2020. The content of this document reflects only the author's view. ERC is not responsible for any use that may be made of the information it contains",
  "num_versions": null,
  "size_before_bytes": 2231469,
  "size_after_bytes": 319123
}