{
  "title": "CoVid-19 Detection leveraging Vision Transformers and Explainable AI",
  "authors": [
    "Pangoth Santhosh Kumar",
    "Kundrapu Supriya",
    "Mallikharjuna Rao K",
    "Taraka Satya Krishna Teja Malisetti"
  ],
  "submission_date": "2023-07-29T17:45:27+00:00",
  "revised_dates": [
    "2024-05-06T16:32:44+00:00"
  ],
  "abstract": "Lung disease is a common health problem in many parts of the world. It is a significant risk to people health and quality of life all across the globe since it is responsible for five of the top thirty leading causes of death. Among them are COVID 19, pneumonia, and tuberculosis, to name just a few. It is critical to diagnose lung diseases in their early stages. Several different models including machine learning and image processing have been developed for this purpose. The earlier a condition is diagnosed, the better the patient chances of making a full recovery and surviving into the long term. Thanks to deep learning algorithms, there is significant promise for the autonomous, rapid, and accurate identification of lung diseases based on medical imaging. Several different deep learning strategies, including convolutional neural networks (CNN), vanilla neural networks, visual geometry group based networks (VGG), and capsule networks , are used for the goal of making lung disease forecasts. The standard CNN has a poor performance when dealing with rotated, tilted, or other aberrant picture orientations. As a result of this, within the scope of this study, we have suggested a vision transformer based approach end to end framework for the diagnosis of lung disorders. In the architecture, data augmentation, training of the suggested models, and evaluation of the models are all included. For the purpose of detecting lung diseases such as pneumonia, Covid 19, lung opacity, and others, a specialised Compact Convolution Transformers (CCT) model have been tested and evaluated on datasets such as the Covid 19 Radiography Database. The model has achieved a better accuracy for both its training and validation purposes on the Covid 19 Radiography Database.",
  "categories": [
    "eess.IV",
    "cs.CV"
  ],
  "primary_category": "eess.IV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16033",
  "pdf_url": "https://arxiv.org/pdf/2307.16033v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 5030593,
  "size_after_bytes": 660466
}