{
  "title": "The GANfather: Controllable generation of malicious activity to improve defence systems",
  "authors": [
    "Ricardo Ribeiro Pereira",
    "Jacopo Bono",
    "João Tiago Ascensão",
    "David Aparício",
    "Pedro Ribeiro",
    "Pedro Bizarro"
  ],
  "submission_date": "2023-07-25T19:45:46+00:00",
  "revised_dates": [],
  "abstract": "Machine learning methods to aid defence systems in detecting malicious activity typically rely on labelled data. In some domains, such labelled data is unavailable or incomplete. In practice this can lead to low detection rates and high false positive rates, which characterise for example anti-money laundering systems. In fact, it is estimated that 1.7--4 trillion euros are laundered annually and go undetected. We propose The GANfather, a method to generate samples with properties of malicious activity, without label requirements. We propose to reward the generation of malicious samples by introducing an extra objective to the typical Generative Adversarial Networks (GANs) loss. Ultimately, our goal is to enhance the detection of illicit activity using the discriminator network as a novel and robust defence system. Optionally, we may encourage the generator to bypass pre-existing detection systems. This setup then reveals defensive weaknesses for the discriminator to correct. We evaluate our method in two real-world use cases, money laundering and recommendation systems. In the former, our method moves cumulative amounts close to 350 thousand dollars through a network of accounts without being detected by an existing system. In the latter, we recommend the target item to a broad user base with as few as 30 synthetic attackers. In both cases, we train a new defence system to capture the synthetic attacks.",
  "categories": [
    "cs.LG",
    "cs.CR"
  ],
  "primary_category": "cs.LG",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13787",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 5837507,
  "size_after_bytes": 238532
}