{
  "title": "Establishing Magnetic Coupling in Spin-crossover-2D Hybrid Nanostructures via Interfacial Charge-transfer Interaction",
  "authors": [
    "Shatabda Bhattacharya",
    "Shubhadip Moulick",
    "Chinmoy Das",
    "Shiladitya Karmakar",
    "Hirokazu Tada",
    "Tanusri Saha-Dasgupta",
    "Pradip Chakraborty",
    "Atindra Nath Pal"
  ],
  "submission_date": "2023-07-26T12:02:34+00:00",
  "revised_dates": [],
  "abstract": "Despite a clear demonstration of bistability in spin-crossover (SCO) materials, the absence of long-range magnetic order and poor electrical conductivity limit their prospect in spintronic and nanoelectronic applications. Intending to create hybrid devices made of spin-crossover (SCO)-2D architecture, here, we report an easily processable Fe-based SCO nanostructures grown on 2D reduced graphene oxide (rGO). The heterostructure shows enhanced cooperativity due to formation of interfacial charge transfer induced inter-molecular interaction. The spin transition temperature is controlled by tuning the coverage area of SCO nanostructured networks over the 2D surfaces, thus manipulating hysteresis (aka memory) of the heterostructure. The enhanced magnetic coupling of the heterostructure leads to the spontaneous magnetization states with a large coercive field of $\\sim$ 3000 Oe. Additionally, the low conductivity of the pristine SCO nanostructures is addressed by encapsulating them on suitable 2D rGO template, enabling detection of magnetic bistable spin states during high-spin/low-spin conductance change. This adds spin functionality in conductance switching for realizing hybrid 2D spintronic devices. Ab-inito calculations, on the experimentally proposed nanostructures, corroborate the enhanced magnetic interaction in the proposed architecture facilitated by interfacial charge transfer and provide insights on the microscopic mechanism.",
  "categories": [
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14135",
  "pdf_url": null,
  "comment": "23 pages, 6 figures and supplementary information included",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}