{
  "title": "Entanglement-Assisted Quantum Networks: Mechanics, Enabling Technologies, Challenges, and Research Directions",
  "authors": [
    "Zhonghui Li",
    "Kaiping Xue",
    "Jian Li",
    "Lutong Chen",
    "Ruidong Li",
    "Zhaoying Wang",
    "Nenghai Yu",
    "David S. L. Wei",
    "Qibin Sun",
    "Jun Lu"
  ],
  "submission_date": "2023-07-24T02:48:22+00:00",
  "revised_dates": [
    "2023-07-27T00:07:34+00:00"
  ],
  "abstract": "Over the past few decades, significant progress has been made in quantum information technology, from theoretical studies to experimental demonstrations. Revolutionary quantum applications are now in the limelight, showcasing the advantages of quantum information technology and becoming a research hotspot in academia and industry. To enable quantum applications to have a more profound impact and wider application, the interconnection of multiple quantum nodes through quantum channels becomes essential. Building an entanglement-assisted quantum network, capable of realizing quantum information transmission between these quantum nodes, is the primary goal. However, entanglement-assisted quantum networks are governed by the unique laws of quantum mechanics, such as the superposition principle, the no-cloning theorem, and quantum entanglement, setting them apart from classical networks. Consequently, fundamental efforts are required to establish entanglement-assisted quantum networks. While some insightful surveys have paved the way for entanglement-assisted quantum networks, most of these studies focus on enabling technologies and quantum applications, neglecting critical network issues. In response, this paper presents a comprehensive survey of entanglement-assisted quantum networks. Alongside reviewing fundamental mechanics and enabling technologies, the paper provides a detailed overview of the network structure, working principles, and development stages, highlighting the differences from classical networks. Additionally, the challenges of building wide-area entanglement-assisted quantum networks are addressed. Furthermore, the paper emphasizes open research directions, including architecture design, entanglement-based network issues, and standardization, to facilitate the implementation of future entanglement-assisted quantum networks.",
  "categories": [
    "quant-ph"
  ],
  "primary_category": "quant-ph",
  "doi": "10.1109/COMST.2023.3294240",
  "journal_ref": "IEEE Communications Surveys & Tutorials 2023",
  "arxiv_id": "2307.12490",
  "pdf_url": null,
  "comment": "58 pages,34 figures, published in IEEE Communications Surveys & Tutorials 2023 (URL: https://ieeexplore.ieee.org/abstract/document/10177948)",
  "num_versions": null,
  "size_before_bytes": 26440781,
  "size_after_bytes": 10483061
}