{
  "title": "Rheology of Pseudomonas fluorescens biofilms: from experiments to predictive DPD mesoscopic modelling",
  "authors": [
    "Jose Mart. n-Roca",
    "Valentino Bianco",
    "Francisco Alarcon",
    "Ajay K. Monnappa",
    "Paolo Natale",
    "Francisco Monroy",
    "Belen Orgaz",
    "Ivan L. pez-Montero",
    "Chantal Valeriani"
  ],
  "submission_date": "2023-07-31T13:24:35+00:00",
  "revised_dates": [],
  "abstract": "Bacterial biofilms mechanically behave as viscoelastic media consisting of micron-sized bacteria crosslinked to a selfproduced network of extracellular polymeric substances (EPS) embedded in water. Structural principles for numerical modelling aim at describing mesoscopic viscoelasticity without loosing detail on the underlying interactions existing in wide regimes of deformation under hydrodynamic stress. Here we approach the computational challenge to model bacterial biofilms for predictive mechanics in silico under variable stress conditions. Up-to-date models are not entirely satisfactory due to the plethora of parameters required to make them functioning under the effects of stress. As guided by the structural depiction gained in a previous work with Pseudomonas fluorescens (Jara et al. Front. Microbiol. (2021)), we propose a mechanical modeling by means of Dissipative Particle Dynamics (DPD), which captures the essentials of the topological and compositional interactions between bacteria particles and crosslinked EPS-embedding under imposed shear. The P. fluorescens biofilms have been modeled under mechanical stress mimicking shear stresses as undergone in vitro. The predictive capacity for mechanical features in DPD-simulated biofilms has been investigated by varying the externally imposed field of shear strain at variable amplitude and frequency. The parametric map of essential biofilm ingredients has been explored by making the rheological responses to emerge among conservative mesoscopic interactions and frictional dissipation in the underlying microscale. The proposed coarse grained DPD simulation qualitatively catches the rheology of the P. fluorescens biofilm over several decades of dynamic scaling.",
  "categories": [
    "cond-mat.soft"
  ],
  "primary_category": "cond-mat.soft",
  "doi": "10.1063/5.0131935",
  "journal_ref": "J. Chem. Phys. 158, 074902 (2023)",
  "arxiv_id": "2307.16641",
  "pdf_url": "https://arxiv.org/pdf/2307.16641v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 2680381,
  "size_after_bytes": 135108
}