{
  "title": "Cosmographic view on the $H_0$ and $σ_8$ tensions",
  "authors": [
    "Rocco D'Agostino",
    "Rafael C. Nunes"
  ],
  "submission_date": "2023-07-25T12:47:30+00:00",
  "revised_dates": [],
  "abstract": "Measurements of the $H_0$ and $σ_8$ parameters within the standard cosmological model recently highlighted significant statistical tensions between the cosmic microwave background and low-redshift probes, such as local distance ladder, weak lensing and galaxy clustering surveys. In this work, we frame geometrical distances in a model-independent way by means of cosmographic approximations in the range $z \\in (0, 2.3)$ to take into account a robust dataset composed of Baryon Acoustic Oscillations (BAO), type Ia Supernovae (SN), Cosmic Chronometer (CC) data, and measurements from Redshift Space Distortions (RSD). From the joint analysis BAO\\,+\\,SN\\,+\\,CC\\,+\\,RSD, we find an accuracy of $\\sim$1.4\\% and $\\sim$3.7\\% on $H_0$ and $σ_8$, respectively. Our result for $H_0$ is at 2$σ$ tension with local measurements by the SH0ES team, while our $σ_8$ estimate is at 2.6$σ$ tension with Planck-CMB analysis. This inference shows a tension statistically smaller when compared to those estimated via the $Λ$CDM model. We also find that the jerk parameter can deviate more than 3$σ$ from the $Λ$CDM prediction. Under the same cosmographic setup, we also present results by considering a SH0ES Gaussian prior on $H_0$ that allows for improved accuracy of the parameter space of the models. The present work brings observational constraints on $H_0$ and $σ_8$ into a new model-independent perspective, which differs from the predictions obtained within the $Λ$CDM paradigm.",
  "categories": [
    "astro-ph.CO",
    "gr-qc"
  ],
  "primary_category": "astro-ph.CO",
  "doi": "10.1103/PhysRevD.108.023523",
  "journal_ref": "Phys. Rev. D 108, 023523 (2023)",
  "arxiv_id": "2307.13464",
  "pdf_url": null,
  "comment": "12 pages, 6 figures. Matches the version published in PRD",
  "num_versions": null,
  "size_before_bytes": 1282726,
  "size_after_bytes": 117638
}