{
  "title": "Integrability breaking and bound states in Google's decorated XXZ circuits",
  "authors": [
    "Ana Hudomal",
    "Ryan Smith",
    "Andrew Hallam",
    "Zlatko Papić"
  ],
  "submission_date": "2023-07-24T18:00:10+00:00",
  "revised_dates": [],
  "abstract": "Recent quantum simulation by Google [Nature 612, 240 (2022)] has demonstrated the formation of bound states of interacting photons in a quantum-circuit version of the XXZ spin chain. While such bound states are protected by integrability in a one-dimensional chain, the experiment found the bound states to be unexpectedly robust when integrability was broken by decorating the circuit with additional qubits, at least for small numbers of qubits ($\\leq 24$) within the experimental capability. Here we scrutinize this result by state-of-the-art classical simulations, which greatly exceed the experimental system sizes and provide a benchmark for future studies in larger circuits. We find that the bound states consisting of a small and finite number of photons are indeed robust in the non-integrable regime, even after scaling to the infinite time and infinite system size limit. Moreover, we show that such systems possess unusual spectral properties, with level statistics that deviates from the random matrix theory expectation. On the other hand, for low but finite density of photons, we find a much faster onset of thermalization and significantly weaker signatures of bound states, suggesting that anomalous dynamics may only be a property of dilute systems with zero density of photons in the thermodynamic limit. The robustness of the bound states is also influenced by the number of decoration qubits and, to a lesser degree, by the regularity of their spatial arrangement.",
  "categories": [
    "cond-mat.stat-mech",
    "cond-mat.str-el",
    "quant-ph"
  ],
  "primary_category": "cond-mat.stat-mech",
  "doi": "10.1103/PRXQuantum.5.010316",
  "journal_ref": "PRX Quantum 5, 010316 (2024)",
  "arxiv_id": "2307.13042",
  "pdf_url": null,
  "comment": "19 pages, 15 figures",
  "num_versions": null,
  "size_before_bytes": 4553697,
  "size_after_bytes": 179294
}