{
  "title": "Improved simulation of quantum circuits dominated by free fermionic operations",
  "authors": [
    "Oliver Reardon-Smith",
    "Michał Oszmaniec",
    "Kamil Korzekwa"
  ],
  "submission_date": "2023-07-24T11:36:28+00:00",
  "revised_dates": [
    "2023-07-27T00:02:25+00:00",
    "2024-05-08T00:26:33+00:00",
    "2024-12-11T14:35:50+00:00"
  ],
  "abstract": "We present a classical algorithm for simulating universal quantum circuits composed of \"free\" nearest-neighbour matchgates or equivalently fermionic-linear-optical (FLO) gates, and \"resourceful\" non-Gaussian gates. We achieve the promotion of the efficiently simulable FLO subtheory to universal quantum computation by gadgetizing controlled phase gates with arbitrary phases employing non-Gaussian resource states. Our key contribution is the development of a novel phase-sensitive algorithm for simulating FLO circuits. This allows us to decompose the resource states arising from gadgetization into free states at the level of statevectors rather than density matrices. The runtime cost of our algorithm for estimating the Born-rule probability of a given quantum circuit scales polynomially in all circuit parameters, except for a linear dependence on the newly introduced FLO extent, which scales exponentially with the number of controlled-phase gates. More precisely, as a result of finding optimal decompositions of relevant resource states, the runtime doubles for every maximally resourceful (e.g., swap or CZ) gate added. Crucially, this cost compares very favourably with the best known prior algorithm, where each swap gate increases the simulation cost by a factor of approximately 9. For a quantum circuit containing arbitrary FLO unitaries and $k$ controlled-Z gates, we obtain an exponential improvement $O(4.5^k)$ over the prior state-of-the-art.",
  "categories": [
    "quant-ph"
  ],
  "primary_category": "quant-ph",
  "doi": "10.22331/q-2024-12-04-1549",
  "journal_ref": "Quantum 8, 1549 (2024)",
  "arxiv_id": "2307.12702",
  "pdf_url": null,
  "comment": "Final version after peer review",
  "num_versions": null,
  "size_before_bytes": 1845125,
  "size_after_bytes": 1788838
}