{
  "title": "SoK: Design, Vulnerabilities, and Security Measures of Cryptocurrency Wallets",
  "authors": [
    "Yimika Erinle",
    "Yathin Kethepalli",
    "Yebo Feng",
    "Jiahua Xu"
  ],
  "submission_date": "2023-07-24T15:13:39+00:00",
  "revised_dates": [
    "2023-07-26T00:20:49+00:00",
    "2023-08-08T00:02:04+00:00",
    "2025-01-15T01:48:38+00:00",
    "2025-11-05T01:29:32+00:00"
  ],
  "abstract": "With the advent of decentralised digital currencies powered by blockchain technology, a new era of peer-to-peer transactions has commenced. The rapid growth of the cryptocurrency economy has led to increased use of transaction-enabling wallets, making them a focal point for security risks. As the frequency of wallet-related incidents rises, there is a critical need for a systematic approach to measure and evaluate these attacks, drawing lessons from past incidents to enhance wallet security. In response, we introduce a multi-dimensional design taxonomy for existing and novel wallets with various design decisions. We classify existing industry wallets based on this taxonomy, identify previously occurring vulnerabilities and discuss the security implications of design decisions. We also systematise threats to the wallet mechanism and analyse the adversary's goals, capabilities and required knowledge. We present a multi-layered attack framework and investigate 84 incidents between 2012 and 2024, accounting for $5.4B. Following this, we classify defence implementations for these attacks on the precautionary and remedial axes. We map the mechanism and design decisions to vulnerabilities, attacks, and possible defence methods to discuss various insights.",
  "categories": [
    "cs.CR",
    "cs.DC"
  ],
  "primary_category": "cs.CR",
  "doi": "10.1016/j.comnet.2025.111691",
  "journal_ref": "Computer Networks 273 (2025) 111691",
  "arxiv_id": "2307.12874",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 21098313,
  "size_after_bytes": 13245541
}