{
  "title": "Fragmented superconductivity in the Hubbard model as solitons in Ginzburg-Landau theory",
  "authors": [
    "Niccolò Baldelli",
    "Hannes Karlsson",
    "Benedikt Kloss",
    "Matthew Fishman",
    "Alexander Wietek"
  ],
  "submission_date": "2023-07-21T18:00:07+00:00",
  "revised_dates": [
    "2025-09-22T00:41:18+00:00"
  ],
  "abstract": "The phenomena of superconductivity and charge density waves are observed in close vicinity in many strongly correlated materials. Increasing evidence from experiments and numerical simulations suggests both phenomena can also occur in an intertwined manner, where the superconducting order parameter is coupled to the electronic density. Employing density matrix renormalization group simulations, we investigate the nature of such an intertwined state of matter stabilized in the phase diagram of the elementary $t$-$t^\\prime$-$U$ Hubbard model in the strong coupling regime. Remarkably, the condensate of Cooper pairs is shown to be fragmented in the presence of a charge density wave where more than one pairing wave function is macroscopically occupied. Moreover, we provide conclusive evidence that the macroscopic wave functions of the superconducting fragments are well-described by soliton solutions of a Ginzburg-Landau equation in a periodic potential constituted by the charge density wave. In the presence of an orbital magnetic field, the order parameters are gauge invariant, and superconducting vortices are pinned between the stripes. This intertwined Ginzburg-Landau theory is proposed as an effective low-energy description of the stripe fragmented superconductor.",
  "categories": [
    "cond-mat.str-el",
    "cond-mat.supr-con",
    "quant-ph"
  ],
  "primary_category": "cond-mat.str-el",
  "doi": "10.1038/s41535-024-00718-3",
  "journal_ref": "npj Quantum Mater. 10, 22 (2025)",
  "arxiv_id": "2307.11820",
  "pdf_url": null,
  "comment": "14 pages, 9 figures",
  "num_versions": null,
  "size_before_bytes": 7408917,
  "size_after_bytes": 434191
}