{
  "title": "A Pairwise Dataset for GUI Conversion and Retrieval between Android Phones and Tablets",
  "authors": [
    "Han Hu",
    "Haolan Zhan",
    "Yujin Huang",
    "Di Liu"
  ],
  "submission_date": "2023-07-25T03:25:56+00:00",
  "revised_dates": [
    "2023-10-10T00:12:56+00:00",
    "2023-11-07T01:24:19+00:00"
  ],
  "abstract": "With the popularity of smartphones and tablets, users have become accustomed to using different devices for different tasks, such as using their phones to play games and tablets to watch movies. To conquer the market, one app is often available on both smartphones and tablets. However, although one app has similar graphic user interfaces (GUIs) and functionalities on phone and tablet, current app developers typically start from scratch when developing a tablet-compatible version of their app, which drives up development costs and wastes existing design resources. Researchers are attempting to employ deep learning in automated GUIs development to enhance developers' productivity. Deep learning models rely heavily on high-quality datasets. There are currently several publicly accessible GUI page datasets for phones, but none for pairwise GUIs between phones and tablets. This poses a significant barrier to the employment of deep learning in automated GUI development. In this paper, we collect and make public the Papt dataset, which is a pairwise dataset for GUI conversion and retrieval between Android phones and tablets. The dataset contains 10,035 phone-tablet GUI page pairs from 5,593 phone-tablet app pairs. We illustrate the approaches of collecting pairwise data and statistical analysis of this dataset. We also illustrate the advantages of our dataset compared to other current datasets. Through preliminary experiments on this dataset, we analyse the present challenges of utilising deep learning in automated GUI development and find that our dataset can assist the application of some deep learning models to tasks involving automatic GUI development.",
  "categories": [
    "cs.HC",
    "cs.SE"
  ],
  "primary_category": "cs.HC",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13225",
  "pdf_url": null,
  "comment": "7 pages, 8 figures",
  "num_versions": null,
  "size_before_bytes": 13591879,
  "size_after_bytes": 1264161
}