{
  "title": "AI Increases Global Access to Reliable Flood Forecasts",
  "authors": [
    "Grey Nearing",
    "Deborah Cohen",
    "Vusumuzi Dube",
    "Martin Gauch",
    "Oren Gilon",
    "Shaun Harrigan",
    "Avinatan Hassidim",
    "Daniel Klotz",
    "Frederik Kratzert",
    "Asher Metzger",
    "Sella Nevo",
    "Florian Pappenberger",
    "Christel Prudhomme",
    "Guy Shalev",
    "Shlomo Shenzis",
    "Tadele Tekalign",
    "Dana Weitzner",
    "Yoss Matias"
  ],
  "submission_date": "2023-07-30T01:49:21+00:00",
  "revised_dates": [
    "2023-08-03T21:35:36+00:00",
    "2023-08-10T22:25:20+00:00",
    "2023-11-03T21:52:38+00:00"
  ],
  "abstract": "Floods are one of the most common natural disasters, with a disproportionate impact in developing countries that often lack dense streamflow gauge networks. Accurate and timely warnings are critical for mitigating flood risks, but hydrological simulation models typically must be calibrated to long data records in each watershed. Using AI, we achieve reliability in predicting extreme riverine events in ungauged watersheds at up to a 5-day lead time that is similar to or better than the reliability of nowcasts (0-day lead time) from a current state of the art global modeling system (the Copernicus Emergency Management Service Global Flood Awareness System). Additionally, we achieve accuracies over 5-year return period events that are similar to or better than current accuracies over 1-year return period events. This means that AI can provide flood warnings earlier and over larger and more impactful events in ungauged basins. The model developed in this paper was incorporated into an operational early warning system that produces publicly available (free and open) forecasts in real time in over 80 countries. This work highlights a need for increasing the availability of hydrological data to continue to improve global access to reliable flood warnings.",
  "categories": [
    "cs.LG",
    "cs.AI",
    "physics.soc-ph"
  ],
  "primary_category": "cs.LG",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16104",
  "pdf_url": "https://arxiv.org/pdf/2307.16104v4",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 23483035,
  "size_after_bytes": 771614
}