{
  "title": "Charge-Spin Conversion in Two-Subband Quantum Wells with Conventional and Unconventional Rashba Spin-Orbit Coupling",
  "authors": [
    "Gerson J. Ferreira",
    "Boyu Wang",
    "Jiyong Fu",
    "Roberto Raimondi"
  ],
  "submission_date": "2023-07-29T07:39:59+00:00",
  "revised_dates": [],
  "abstract": "The reciprocal interconversion between spin polarization and charge current (CSC) is the focus of intensive theoretical and experimental investigation in spintronics research. Its physical origin stems from the Rashba spin-orbit coupling (SOC) induced by the breaking of the structure inversion symmetry. The steady-state interconversion efficiency is the result of the non-trivial spin textures of the electric-field distorted Fermi surface. Its full understanding and evaluation requires the consideration of disorder-induced relaxation effects in the presence of spin-orbit induced band splitting. In this paper the additional effect of the orbital degree of freedom is analyzed in a two-subband quantum well with both conventional and unconventional Rashba SOC in the presence of disorder impurity scattering. The latter is treated at the level of the Born approximation in the Green's function self-energy and with the inclusion of vertex corrections in the linear response functions for the charge current and the spin polarization. By explicitly considering the symmetry properties of the Hamiltonian the matrix structure of the correlation functions is shown to decompose in independent blocks of symmetry-related physical observables. We find that the inclusion of vertex corrections is important for the correct estimate of the CSC efficiency, which also depends on the position of the Fermi level. We also find that the relative sign of the Rashba SOC in the two subbands plays a key role in determining the behavior of the CSC. Finally, we point out how the two-subband model compares with the standard single-band two-dimensional electron gas.",
  "categories": [
    "cond-mat.mes-hall"
  ],
  "primary_category": "cond-mat.mes-hall",
  "doi": "10.1117/12.2669794",
  "journal_ref": "Proceedings Volume 12656, Spintronics XVI; 126560H (2023)",
  "arxiv_id": "2307.15923",
  "pdf_url": "https://arxiv.org/pdf/2307.15923v1",
  "comment": "21 pages, 9 figures, To be Presented to Spintronics XVI, San Diego, August 2023",
  "num_versions": null,
  "size_before_bytes": 850834,
  "size_after_bytes": 181104
}