{
  "title": "CH$_4$ and CO$_2$ Adsorption Mechanisms on Monolayer Graphenylene and their Effects on Optical and Electronic Properties",
  "authors": [
    "A. Aligayev",
    "F. J. Dominguez-Gutierrez",
    "M. Chourashiya",
    "S. Papanikolaou",
    "Q. Huang"
  ],
  "submission_date": "2023-07-25T13:05:35+00:00",
  "revised_dates": [
    "2024-01-17T03:22:51+00:00",
    "2025-02-19T02:11:46+00:00"
  ],
  "abstract": "In this study, we employ a computational chemistry-based modeling approach to investigate the adsorption mechanisms of CH$_4$ and CO$_2$ on monolayer GPNL, with a specific focus on their effects on optical adsorption and electrical transport properties at room temperature. To simulate the adsorption dynamics as closely as possible to experimental conditions, we utilize the self-consistent charge tight-binding density functional theory (SCC-DFTB). Through semi-classical molecular dynamics (MD) simulations, we observe the formation of H$_2$ molecules from the dissociation of CH$_4$ and the formation of CO+O species from carbon dioxide molecules. This provides insights into the adsorption and dispersion mechanisms of CH$_4$ and CO$_2$ on GPNL. Furthermore, we explore the impact of molecular adsorption on optical absorption properties. Our results demonstrate that CH$_4$ and CH$_2$ affects drastically the optical adsorption of GPNL, while CO$_2$ does not significantly affect the optical properties of the two-dimensional material. To analyze electron transport, we employ the open-boundary non-equilibrium Green's function method. By studying the conductivity of GPNL and graphene under voltage bias up to 300 mV, we gain valuable insights into the electrical transport properties of GPNL under optical absorption conditions. The findings from our computational modeling approach might contribute to a deeper understanding of the potential applications of GPNL in hydrogen production and advanced electronic devices.",
  "categories": [
    "physics.comp-ph",
    "cond-mat.mtrl-sci",
    "physics.chem-ph"
  ],
  "primary_category": "physics.comp-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13472",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 28080482,
  "size_after_bytes": 292747
}