{
  "title": "Model Predictive Control (MPC) of an Artificial Pancreas with Data-Driven Learning of Multi-Step-Ahead Blood Glucose Predictors",
  "authors": [
    "Eleonora Maria Aiello",
    "Mehrad Jaloli",
    "Marzia Cescon"
  ],
  "submission_date": "2023-07-22T08:24:06+00:00",
  "revised_dates": [],
  "abstract": "We present the design and \\textit{in-silico} evaluation of a closed-loop insulin delivery algorithm to treat type 1 diabetes (T1D) consisting in a data-driven multi-step-ahead blood glucose (BG) predictor integrated into a Linear Time-Varying (LTV) Model Predictive Control (MPC) framework. Instead of identifying an open-loop model of the glucoregulatory system from available data, we propose to directly fit the entire BG prediction over a predefined prediction horizon to be used in the MPC, as a nonlinear function of past input-ouput data and an affine function of future insulin control inputs. For the nonlinear part, a Long Short-Term Memory (LSTM) network is proposed, while for the affine component a linear regression model is chosen. To assess benefits and drawbacks when compared to a traditional linear MPC based on an auto-regressive with exogenous (ARX) input model identified from data, we evaluated the proposed LSTM-MPC controller in three simulation scenarios: a nominal case with 3 meals per day, a random meal disturbances case where meals were generated with a recently published meal generator, and a case with 25$\\%$ decrease in the insulin sensitivity. Further, in all the scenarios, no feedforward meal bolus was administered. For the more challenging random meal generation scenario, the mean $\\pm$ standard deviation percent time in the range 70-180 [mg/dL] was 74.99 $\\pm$ 7.09 vs. 54.15 $\\pm$ 14.89, the mean $\\pm$ standard deviation percent time in the tighter range 70-140 [mg/dL] was 47.78$\\pm$8.55 vs. 34.62 $\\pm$9.04, while the mean $\\pm$ standard deviation percent time in sever hypoglycemia, i.e., $<$ 54 [mg/dl] was 1.00$\\pm$3.18 vs. 9.45$\\pm$11.71, for our proposed LSTM-MPC controller and the traditional ARX-MPC, respectively. Our approach provided accurate predictions of future glucose concentrations and good closed-loop performances of the overall MPC controller.",
  "categories": [
    "eess.SY",
    "cs.AI",
    "cs.LG"
  ],
  "primary_category": "eess.SY",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12015",
  "pdf_url": null,
  "comment": "10 pages, 5 Figures, 2 Tables",
  "num_versions": null,
  "size_before_bytes": 1838870,
  "size_after_bytes": 141084
}