{
  "title": "Energy preserving evolutions over Bosonic systems",
  "authors": [
    "Paul Gondolf",
    "Tim Möbus",
    "Cambyse Rouzé"
  ],
  "submission_date": "2023-07-25T20:13:30+00:00",
  "revised_dates": [
    "2023-10-17T00:53:02+00:00",
    "2024-01-25T01:11:37+00:00",
    "2024-12-11T14:35:50+00:00"
  ],
  "abstract": "The exponential convergence to invariant subspaces of quantum Markov semigroups plays a crucial role in quantum information theory. One such example is in bosonic error correction schemes, where dissipation is used to drive states back to the code-space - an invariant subspace protected against certain types of errors. In this paper, we investigate perturbations of quantum dynamical semigroups that operate on continuous variable (CV) systems and admit an invariant subspace. First, we prove a generation theorem for quantum Markov semigroups on CV systems under the physical assumptions that (i) the generator is in GKSL form with corresponding jump operators defined as polynomials of annihilation and creation operators; and (ii) the (possibly unbounded) generator increases all moments in a controlled manner. Additionally, we show that the level sets of operators with bounded first moments are admissible subspaces of the evolution, providing the foundations for a perturbative analysis. Our results also extend to time-dependent semigroups and multi-mode systems. We apply our general framework to two settings of interest in continuous variable quantum information processing. First, we provide a new scheme for deriving continuity bounds on the energy-constrained capacities of Markovian perturbations of quantum dynamical semigroups. Second, we provide quantitative perturbation bounds for the steady state of the quantum Ornstein-Uhlenbeck semigroup and the invariant subspace of the photon dissipation used in bosonic error correction.",
  "categories": [
    "quant-ph",
    "math-ph"
  ],
  "primary_category": "quant-ph",
  "doi": "10.22331/q-2024-12-04-1551",
  "journal_ref": "Quantum 8, 1551 (2024)",
  "arxiv_id": "2307.13801",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1769894,
  "size_after_bytes": 1780760
}