{
  "title": "QPLEX: Realizing the Integration of Quantum Computing into Combinatorial Optimization Software",
  "authors": [
    "Juan Giraldo",
    "José Ossorio",
    "Norha M. Villegas",
    "Gabriel Tamura",
    "Ulrike Stege"
  ],
  "submission_date": "2023-07-26T17:18:07+00:00",
  "revised_dates": [],
  "abstract": "Quantum computing has the potential to surpass the capabilities of current classical computers when solving complex problems. Combinatorial optimization has emerged as one of the key target areas for quantum computers as problems found in this field play a critical role in many different industrial application sectors (e.g., enhancing manufacturing operations or improving decision processes). Currently, there are different types of high-performance optimization software (e.g., ILOG CPLEX and Gurobi) that support engineers and scientists in solving optimization problems using classical computers. In order to utilize quantum resources, users require domain-specific knowledge of quantum algorithms, SDKs and libraries, which can be a limiting factor for any practitioner who wants to integrate this technology into their workflows. Our goal is to add software infrastructure to a classical optimization package so that application developers can interface with quantum platforms readily when setting up their workflows. This paper presents a tool for the seamless utilization of quantum resources through a classical interface. Our approach consists of a Python library extension that provides a backend to facilitate access to multiple quantum providers. Our pipeline enables optimization software developers to experiment with quantum resources selectively and assess performance improvements of hybrid quantum-classical optimization solutions.",
  "categories": [
    "quant-ph",
    "cs.SE"
  ],
  "primary_category": "quant-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14308",
  "pdf_url": null,
  "comment": "Accepted for the IEEE International Conference on Quantum Computing and Engineering (QCE) 2023",
  "num_versions": null,
  "size_before_bytes": 2661833,
  "size_after_bytes": 336942
}