{
  "title": "Manifestly Covariant Worldline Actions from Coadjoint Orbits. Part I: Generalities and Vectorial Descriptions",
  "authors": [
    "Thomas Basile",
    "Euihun Joung",
    "TaeHwan Oh"
  ],
  "submission_date": "2023-07-25T16:53:36+00:00",
  "revised_dates": [
    "2023-08-21T00:13:33+00:00",
    "2024-10-25T00:25:38+00:00"
  ],
  "abstract": "We derive manifestly covariant actions of spinning particles starting from coadjoint orbits of isometry groups, by using Hamiltonian reductions. We show that the defining conditions of a classical Lie group can be treated as Hamiltonian constraints which generate the coadjoint orbits of another, dual, Lie group. In case of (inhomogeneous) orthogonal groups, the dual groups are (centrally-extended inhomogeneous) symplectic groups. This defines a symplectic dual pair correspondence between the coadjoint orbits of the isometry group and those of the dual Lie group, whose quantum version is the reductive dual pair correspondence à la Howe. We show explicitly how various particle species arise from the classification of coadjoint orbits of Poincaré and (A)dS symmetry. In the Poincaré case, we recover the data of the Wigner classification, which includes continuous spin particles, (spinning) tachyons and null particles with vanishing momenta, besides the usual massive and massless spinning particles. In (A)dS case, our classification results are not only consistent with the pattern of the corresponding unitary irreducible representations observed in the literature, but also contain novel information. In dS, we find the presence of partially massless spinning particles, but continuous spin particles, spinning tachyons and null particles are absent. The AdS case shows the largest diversity of particle species. It has all particles species of Poincaré symmetry except for the null particle, but allows in addition various exotic entities such as one parameter extension of continuous particles and conformal particles living on the boundary of AdS. Notably, we also find a large class of particles living in \"bitemporal\" AdS space, including ones where mass and spin play an interchanged role. We also discuss the relative inclusion structure of the corresponding orbits.",
  "categories": [
    "hep-th"
  ],
  "primary_category": "hep-th",
  "doi": "10.1007/JHEP01(2024)018",
  "journal_ref": "J. High Energ. Phys. 2024, 18 (2024)",
  "arxiv_id": "2307.13644",
  "pdf_url": null,
  "comment": "89 pages. A few references are added. Other minor revisions are made",
  "num_versions": null,
  "size_before_bytes": 1272551,
  "size_after_bytes": 1230165
}