{
  "title": "A radio pulsar phase from SGR J1935+2154 provides clues to the magnetar FRB mechanism",
  "authors": [
    "Weiwei Zhu",
    "Heng Xu",
    "Dejiang Zhou",
    "Lin Lin",
    "Bojun Wang",
    "Pei Wang",
    "Chunfeng Zhang",
    "Jiarui Niu",
    "Yutong Chen",
    "Chengkui Li",
    "Lingqi Meng",
    "Kejia Lee",
    "Bing Zhang",
    "Yi Feng",
    "Mingyu Ge",
    "Ersin Göğüş",
    "Xing Guan",
    "Jinlin Han",
    "Jinchen Jiang",
    "Peng Jiang",
    "Chryssa Kouveliotou",
    "Di Li",
    "Chenchen Miao",
    "Xueli Miao",
    "Yunpeng Men",
    "Chenghui Niu",
    "Weiyang Wang",
    "Zhengli Wang",
    "Jiangwei Xu",
    "Renxin Xu",
    "Mengyao Xue",
    "Yuanpei Yang",
    "Wenfei Yu",
    "Mao Yuan",
    "Youling Yue",
    "Shuangnan Zhang",
    "Yongkun Zhang"
  ],
  "submission_date": "2023-07-30T04:16:16+00:00",
  "revised_dates": [],
  "abstract": "The megajansky radio burst, FRB 20200428, and other bright radio bursts detected from the Galactic source SGR J1935+2154 suggest that magnetars can make fast radio bursts (FRBs), but the emission site and mechanism of FRB-like bursts are still unidentified. Here we report the emergence of a radio pulsar phase of the magnetar five months after FRB 20200428. 795 pulses were detected in 16.5 hours over 13 days by the Five-hundred-meter Aperture Spherical Radio telescope, with luminosities about eight decades fainter than FRB 20200428. The pulses were emitted in a narrow phase window anti-aligned with the X-ray pulsation profile observed by the X-ray telescopes. The bursts, conversely, appear in random phases. This dichotomy suggests that radio pulses originate from a fixed region within the magnetosphere, but bursts occur in random locations and are possibly associated with explosive events in a dynamically evolving magnetosphere. This picture reconciles the lack of periodicity in cosmological repeating FRBs within the magnetar engine model.",
  "categories": [
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.HE",
  "doi": "10.1126/sciadv.adf6198",
  "journal_ref": "Science Advances (2023) 9, 30",
  "arxiv_id": "2307.16124",
  "pdf_url": "https://arxiv.org/pdf/2307.16124v1",
  "comment": "published on Science Advances, the authors' version",
  "num_versions": null,
  "size_before_bytes": 8537614,
  "size_after_bytes": 140672
}