{
  "title": "Moments of Autocorrelation Demerit Factors of Binary Sequences",
  "authors": [
    "Daniel J. Katz",
    "Miriam E. Ramirez"
  ],
  "submission_date": "2023-07-26T16:32:20+00:00",
  "revised_dates": [
    "2024-02-27T01:48:36+00:00",
    "2024-06-11T00:08:02+00:00",
    "2024-08-19T00:41:10+00:00"
  ],
  "abstract": "Sequences with low aperiodic autocorrelation are used in communications and remote sensing for synchronization and ranging. The autocorrelation demerit factor of a sequence is the sum of the squared magnitudes of its autocorrelation values at every nonzero shift when we normalize the sequence to have unit Euclidean length. The merit factor, introduced by Golay, is the reciprocal of the demerit factor. We consider the uniform probability measure on the $2^\\ell$ binary sequences of length $\\ell$ and investigate the distribution of the demerit factors of these sequences. Sarwate and Jedwab have respectively calculated the mean and variance of this distribution. We develop new combinatorial techniques to calculate the $p$th central moment of the demerit factor for binary sequences of length $\\ell$. These techniques prove that for $p\\geq 2$ and $\\ell \\geq 4$, all the central moments are strictly positive. For any given $p$, one may use the technique to obtain an exact formula for the $p$th central moment of the demerit factor as a function of the length $\\ell$. Jedwab's formula for variance is confirmed by our technique with a short calculation, and we go beyond previous results by also deriving an exact formula for the skewness. A computer-assisted application of our method also obtains exact formulas for the kurtosis, which we report here, as well as the fifth central moment.",
  "categories": [
    "cs.IT",
    "cs.DM",
    "eess.SP",
    "math.CO",
    "math.PR"
  ],
  "primary_category": "cs.IT",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14281",
  "pdf_url": null,
  "comment": "41 pages",
  "num_versions": null,
  "size_before_bytes": 627101,
  "size_after_bytes": 635838
}