{
  "title": "DIP-RL: Demonstration-Inferred Preference Learning in Minecraft",
  "authors": [
    "Ellen Novoseller",
    "Vinicius G. Goecks",
    "David Watkins",
    "Josh Miller",
    "Nicholas Waytowich"
  ],
  "submission_date": "2023-07-22T20:05:31+00:00",
  "revised_dates": [],
  "abstract": "In machine learning for sequential decision-making, an algorithmic agent learns to interact with an environment while receiving feedback in the form of a reward signal. However, in many unstructured real-world settings, such a reward signal is unknown and humans cannot reliably craft a reward signal that correctly captures desired behavior. To solve tasks in such unstructured and open-ended environments, we present Demonstration-Inferred Preference Reinforcement Learning (DIP-RL), an algorithm that leverages human demonstrations in three distinct ways, including training an autoencoder, seeding reinforcement learning (RL) training batches with demonstration data, and inferring preferences over behaviors to learn a reward function to guide RL. We evaluate DIP-RL in a tree-chopping task in Minecraft. Results suggest that the method can guide an RL agent to learn a reward function that reflects human preferences and that DIP-RL performs competitively relative to baselines. DIP-RL is inspired by our previous work on combining demonstrations and pairwise preferences in Minecraft, which was awarded a research prize at the 2022 NeurIPS MineRL BASALT competition, Learning from Human Feedback in Minecraft. Example trajectory rollouts of DIP-RL and baselines are located at https://sites.google.com/view/dip-rl.",
  "categories": [
    "cs.LG",
    "cs.AI",
    "cs.HC"
  ],
  "primary_category": "cs.LG",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12158",
  "pdf_url": null,
  "comment": "Paper accepted at The Many Facets of Preference Learning Workshop at the International Conference on Machine Learning (ICML), Honolulu, Hawaii, USA, 2023",
  "num_versions": null,
  "size_before_bytes": 496592,
  "size_after_bytes": 148279
}