{
  "title": "Spatiotemporal Patterns Corresponding to Phase Synchronization and Generalized Synchronization States of Thermoacoustic Instability",
  "authors": [
    "Samadhan A. Pawar",
    "P. R. Midhun",
    "K. V. Reeja",
    "Abin Krishnan",
    "Krishna Manoj",
    "R. I. Sujith"
  ],
  "submission_date": "2023-07-30T01:10:40+00:00",
  "revised_dates": [],
  "abstract": "Thermoacoustic instability in turbulent combustion systems emerges from the complex interplay among the flame, flow, and acoustic subsystems. While the onset of thermoacoustic instability exhibits global order in system dynamics, the characteristics of local interactions between subsystems responsible for this order are not well understood. In this study, we utilize the framework of synchronization to elucidate the spatiotemporal interactions among heat release rate fluctuations in the flame, velocity fluctuations in the flow, and acoustic pressure fluctuations in a turbulent combustor. We examine two forms of thermoacoustic instability, characterized by phase synchronization and generalized synchronization of the acoustic pressure and global heat release rate oscillations. Despite the presence of global synchrony, we uncover a coexistence of frequency synchrony and desynchrony in the local interaction of these oscillations within the reaction field. In regions of frequency-locked oscillations, various phase-locking patterns occur, including phase synchrony and partial phase synchrony. We discover that the local development of small pockets of phase synchrony and strong amplitude correlation between these oscillations is sufficient to trigger global phase synchronization in the system. Furthermore, as the global dynamics approach generalized synchronization, these local regions of synchrony expand throughout the reaction field. Additionally, through coupled analysis of acoustic pressure and local flow velocity fluctuations, we infer that the spatial region of flow-acoustic synchrony plays a significant role in governing thermoacoustic instabilities. Our findings imply that, in turbulent combustors, an intrinsic local balance between order, partial order, and disorder within the coupled subsystems sustains the global order during thermoacoustic instability.",
  "categories": [
    "physics.flu-dyn"
  ],
  "primary_category": "physics.flu-dyn",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16101",
  "pdf_url": "https://arxiv.org/pdf/2307.16101v1",
  "comment": "35 pages, 12 figures",
  "num_versions": null,
  "size_before_bytes": 21124319,
  "size_after_bytes": 215168
}