{
  "title": "Flow of gas detected from beyond the filaments to protostellar scales in Barnard 5",
  "authors": [
    "M. T. Valdivia-Mena",
    "J. E. Pineda",
    "D. M. Segura-Cox",
    "P. Caselli",
    "A. Schmiedeke",
    "S. Choudhury",
    "S. S. R. Offner",
    "R. Neri",
    "A. Goodman",
    "G. A. Fuller"
  ],
  "submission_date": "2023-07-26T17:58:06+00:00",
  "revised_dates": [
    "2023-09-13T13:30:13+00:00"
  ],
  "abstract": "The infall of gas from outside natal cores has proven to feed protostars after the main accretion phase (Class 0). This changes our view of star formation to a picture that includes asymmetric accretion (streamers), and a larger role of the environment. However, the connection between streamers and the filaments that prevail in star-forming regions is unknown. We investigate the flow of material toward the filaments within Barnard 5 (B5) and the infall from the envelope to the protostellar disk of the embedded protostar B5-IRS1. Our goal is to follow the flow of material from the larger, dense core scale, to the protostellar disk scale. We present new HC$_3$N line data from the NOEMA and 30m telescopes covering the coherence zone of B5, together with ALMA H$_2$CO and C$^{18}$O maps toward the protostellar envelope. We fit multiple Gaussian components to the lines so as to decompose their individual physical components. We investigate the HC$_3$N velocity gradients to determine the direction of chemically-fresh gas flow. At envelope scales, we use a clustering algorithm to disentangle the different kinematic components within H$_2$CO emission. At dense core scales, HC$_3$N traces the infall from the B5 region toward the filaments. HC$_3$N velocity gradients are consistent with accretion toward the filament spines plus flow along them. We found a $\\sim2800$ au streamer in H$_2$CO emission which is blueshifted with respect to the protostar and deposits gas at outer disk scales. The strongest velocity gradients at large scales curve toward the position of the streamer at small scales, suggesting a connection between both flows. Our analysis suggests that the gas can flow from the dense core to the protostar. This implies that the mass available for a protostar is not limited to its envelope, and can receiving chemically-unprocessed gas after the main accretion phase.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.1051/0004-6361/202346357",
  "journal_ref": "A&A 677, A92 (2023)",
  "arxiv_id": "2307.14337",
  "pdf_url": null,
  "comment": "25 pages, 27 figures, accepted for publication on Astronomy and Astrophysics. The scripts used for analysis can be seen at https://github.com/tere-valdivia/Barnard_5_infall",
  "num_versions": null,
  "size_before_bytes": 29407170,
  "size_after_bytes": 4579846
}