{
  "title": "Collective behavior from surprise minimization",
  "authors": [
    "Conor Heins",
    "Beren Millidge",
    "Lancelot da Costa",
    "Richard Mann",
    "Karl Friston",
    "Iain Couzin"
  ],
  "submission_date": "2023-07-27T12:19:09+00:00",
  "revised_dates": [
    "2023-07-28T10:04:07+00:00",
    "2023-08-01T17:15:51+00:00",
    "2024-05-14T13:11:51+00:00"
  ],
  "abstract": "Collective motion is ubiquitous in nature; groups of animals, such as fish, birds, and ungulates appear to move as a whole, exhibiting a rich behavioral repertoire that ranges from directed movement to milling to disordered swarming. Typically, such macroscopic patterns arise from decentralized, local interactions among constituent components (e.g., individual fish in a school). Preeminent models of this process describe individuals as self-propelled particles, subject to self-generated motion and 'social forces' such as short-range repulsion and long-range attraction or alignment. However, organisms are not particles; they are probabilistic decision-makers. Here, we introduce an approach to modelling collective behavior based on active inference. This cognitive framework casts behavior as the consequence of a single imperative: to minimize surprise. We demonstrate that many empirically-observed collective phenomena, including cohesion, milling and directed motion, emerge naturally when considering behavior as driven by active Bayesian inference -- without explicitly building behavioral rules or goals into individual agents. Furthermore, we show that active inference can recover and generalize the classical notion of social forces as agents attempt to suppress prediction errors that conflict with their expectations. By exploring the parameter space of the belief-based model, we reveal non-trivial relationships between the individual beliefs and group properties like polarization and the tendency to visit different collective states. We also explore how individual beliefs about uncertainty determine collective decision-making accuracy. Finally, we show how agents can update their generative model over time, resulting in groups that are collectively more sensitive to external fluctuations and encode information more robustly.",
  "categories": [
    "nlin.AO",
    "cs.MA",
    "q-bio.NC"
  ],
  "primary_category": "nlin.AO",
  "doi": "10.1073/pnas.2320239121",
  "journal_ref": "Proceedings of the National Academy of Sciences, 121(17), e2320239121 (2024)",
  "arxiv_id": "2307.14804",
  "pdf_url": "https://arxiv.org/pdf/2307.14804v4",
  "comment": "29 pages (main text), 29 pages (supplemental appendices), 4 figures, 1 supplemental figure, 5 movies",
  "num_versions": null,
  "size_before_bytes": 100064708,
  "size_after_bytes": 51481333
}