{
  "title": "EnrichEvent: Enriching Social Data with Contextual Information for Emerging Event Extraction",
  "authors": [
    "Mohammadali Sefidi Esfahani",
    "Mohammad Akbari"
  ],
  "submission_date": "2023-07-29T21:37:55+00:00",
  "revised_dates": [
    "2023-08-16T09:00:25+00:00",
    "2023-12-25T14:27:55+00:00",
    "2023-12-27T09:58:25+00:00",
    "2024-11-27T15:19:51+00:00",
    "2024-12-03T10:18:20+00:00",
    "2025-04-05T18:22:29+00:00",
    "2025-06-11T08:21:45+00:00"
  ],
  "abstract": "Social platforms have emerged as crucial platforms for distributing information and discussing social events, offering researchers an excellent opportunity to design and implement novel event detection frameworks. Identifying unspecified events and detecting events without prior knowledge enables governments, aid agencies, and experts to respond swiftly and effectively to unfolding situations, such as natural disasters, by assessing severity and optimizing aid delivery. Social data is characterized by misspellings, incompleteness, word sense ambiguation, and irregular language. While discussing an ongoing event, users share different opinions and perspectives based on their prior experience, background, and knowledge. Prior works primarily leverage tweets' lexical and structural patterns to capture users' opinions and views about events. In this study, we propose an end-to-end novel framework, EnrichEvent, to identify unspecified events from streaming social data. In addition to lexical and structural patterns, we leverage contextual knowledge of the tweets to enrich their representation and gain a better perspective on users' opinions about events. Compared to our baselines, the EnrichEvent framework achieves the highest values for Consolidation outcome with an average of 87% vs. 67% and the lowest for Discrimination outcome with an average of 10% vs. 16%. Moreover, the Trending Data Extraction module in the EnrichEvent framework improves efficiency by reducing Runtime by up to 50% by identifying and discarding irrelevant tweets within message blocks, making the framework highly scalable for processing streaming data. Our source code and dataset are available in our official replication package.",
  "categories": [
    "cs.CL",
    "cs.AI"
  ],
  "primary_category": "cs.CL",
  "doi": "10.1007/s42044-025-00284-2",
  "journal_ref": null,
  "arxiv_id": "2307.16082",
  "pdf_url": "https://arxiv.org/pdf/2307.16082v8",
  "comment": "Iran J Comput Sci (2025)",
  "num_versions": null,
  "size_before_bytes": 3608862,
  "size_after_bytes": 991263
}