{
  "title": "Novel tests of gravity using nano-Hertz stochastic gravitational-wave background signals",
  "authors": [
    "Enrico Cannizzaro",
    "Gabriele Franciolini",
    "Paolo Pani"
  ],
  "submission_date": "2023-07-21T16:07:51+00:00",
  "revised_dates": [
    "2024-05-08T00:43:37+00:00"
  ],
  "abstract": "Gravity theories that modify General Relativity in the slow-motion regime can introduce nonperturbative corrections to the stochastic gravitational-wave background~(SGWB) from supermassive black-hole binaries in the nano-Hertz band, while remaining perturbative in the highly-relativistic regime and satisfying current post-Newtonian~(PN) constraints. We present a model-agnostic formalism to map such theories into a modified tilt for the SGWB spectrum, showing that negative PN corrections (in particular -2PN) can alleviate the tension in the recent pulsar-timing-array data if the detected SGWB is interpreted as arising from supermassive binaries. Despite being preliminary, current data have already strong constraining power, for example they set a novel (conservative) upper bound on theories with time-varying Newton's constant at least at the level of $\\dot{G}/G \\lesssim 10^{-5} \\text{yr}^{-1}$ for redshift $z=[0.1\\div1]$. We also show that NANOGrav data are best fitted by a broken power-law interpolating between a dominant -2PN or -3PN modification at low frequency, and the standard general-relativity scaling at high frequency. Nonetheless, a modified gravity explanation should be confronted with binary eccentricity, environmental effects, nonastrophysical origins of the signal, and scrutinized against statistical uncertainties. These novel tests of gravity will soon become more stringent when combining all pulsar-timing-array facilities and when collecting more data.",
  "categories": [
    "gr-qc",
    "astro-ph.CO",
    "astro-ph.HE",
    "hep-ph"
  ],
  "primary_category": "gr-qc",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11665",
  "pdf_url": null,
  "comment": "7 pages, 4 figures. Matches the published version",
  "num_versions": null,
  "size_before_bytes": 1358095,
  "size_after_bytes": 441670
}