{
  "title": "Bike Assisted Evacuation on a Line of Robots with Communication Faults",
  "authors": [
    "Khaled Jawhar",
    "Evangelos Kranakis"
  ],
  "submission_date": "2023-07-28T20:58:36+00:00",
  "revised_dates": [
    "2024-08-04T15:12:18+00:00"
  ],
  "abstract": "Two autonomous mobile robots and a non-autonomous one, also called bike, are placed at the origin of an infinite line. The autonomous robots can travel with maximum speed $1$. When a robot rides the bike its speed increases to $v>1$, however only exactly one robot at a time can ride the bike and the bike is non-autonomous in that it cannot move on its own. An Exit is placed on the line at an unknown location and at distance $d$ from the origin. The robots have limited communication behavior; one robot is a sender (denoted by S) in that it can send information wirelessly at any distance and receive messages only in F2F (Face-to-Face), while the other robot is a receiver (denoted by R) in that it can receive information wirelessly but can send information only F2F. The bike has no communication capabilities of its own. We refer to the resulting communication model of the ensemble of the two autonomous robots and the bike as S/R.\n  Our general goal is to understand the impact of the non-autonomous robot in assisting the evacuation of the two autonomous faulty robots. Our main contribution is to provide a new evacuation algorithm that enables both robots to evacuate from the unknown Exit in the S/R model. We also analyze the resulting evacuation time as a function of the bike's speed $v$ and give upper and lower bounds on the competitive ratio of the resulting algorithm for the entire range of possible values of $v$.",
  "categories": [
    "cs.DC"
  ],
  "primary_category": "cs.DC",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15808",
  "pdf_url": "https://arxiv.org/pdf/2307.15808v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 943257,
  "size_after_bytes": 183386
}