{
  "title": "CosSIF: Cosine similarity-based image filtering to overcome low inter-class variation in synthetic medical image datasets",
  "authors": [
    "Mominul Islam",
    "Hasib Zunair",
    "Nabeel Mohammed"
  ],
  "submission_date": "2023-07-25T22:37:10+00:00",
  "revised_dates": [
    "2024-03-19T00:32:15+00:00"
  ],
  "abstract": "Crafting effective deep learning models for medical image analysis is a complex task, particularly in cases where the medical image dataset lacks significant inter-class variation. This challenge is further aggravated when employing such datasets to generate synthetic images using generative adversarial networks (GANs), as the output of GANs heavily relies on the input data. In this research, we propose a novel filtering algorithm called Cosine Similarity-based Image Filtering (CosSIF). We leverage CosSIF to develop two distinct filtering methods: Filtering Before GAN Training (FBGT) and Filtering After GAN Training (FAGT). FBGT involves the removal of real images that exhibit similarities to images of other classes before utilizing them as the training dataset for a GAN. On the other hand, FAGT focuses on eliminating synthetic images with less discriminative features compared to real images used for training the GAN. Experimental results reveal that employing either the FAGT or FBGT method with modern transformer and convolutional-based networks leads to substantial performance gains in various evaluation metrics. FAGT implementation on the ISIC-2016 dataset surpasses the baseline method in terms of sensitivity by 1.59% and AUC by 1.88%. Furthermore, for the HAM10000 dataset, applying FABT outperforms the baseline approach in terms of recall by 13.75%, and with the sole implementation of FAGT, achieves a maximum accuracy of 94.44%.",
  "categories": [
    "cs.CV"
  ],
  "primary_category": "cs.CV",
  "doi": "10.1016/j.compbiomed.2024.108317",
  "journal_ref": "Volume 172, April 2024, 108317",
  "arxiv_id": "2307.13842",
  "pdf_url": null,
  "comment": "18 pages, 20 figures",
  "num_versions": null,
  "size_before_bytes": 23528434,
  "size_after_bytes": 230932
}