{
  "title": "Writer adaptation for offline text recognition: An exploration of neural network-based methods",
  "authors": [
    "Tobias van der Werff",
    "Maruf A. Dhali",
    "Lambert Schomaker"
  ],
  "submission_date": "2023-07-11T11:35:08+00:00",
  "revised_dates": [],
  "abstract": "Handwriting recognition has seen significant success with the use of deep learning. However, a persistent shortcoming of neural networks is that they are not well-equipped to deal with shifting data distributions. In the field of handwritten text recognition (HTR), this shows itself in poor recognition accuracy for writers that are not similar to those seen during training. An ideal HTR model should be adaptive to new writing styles in order to handle the vast amount of possible writing styles. In this paper, we explore how HTR models can be made writer adaptive by using only a handful of examples from a new writer (e.g., 16 examples) for adaptation. Two HTR architectures are used as base models, using a ResNet backbone along with either an LSTM or Transformer sequence decoder. Using these base models, two methods are considered to make them writer adaptive: 1) model-agnostic meta-learning (MAML), an algorithm commonly used for tasks such as few-shot classification, and 2) writer codes, an idea originating from automatic speech recognition. Results show that an HTR-specific version of MAML known as MetaHTR improves performance compared to the baseline with a 1.4 to 2.0 improvement in word error rate (WER). The improvement due to writer adaptation is between 0.2 and 0.7 WER, where a deeper model seems to lend itself better to adaptation using MetaHTR than a shallower model. However, applying MetaHTR to larger HTR models or sentence-level HTR may become prohibitive due to its high computational and memory requirements. Lastly, writer codes based on learned features or Hinge statistical features did not lead to improved recognition performance.",
  "categories": [
    "cs.CV",
    "cs.CL"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15071",
  "pdf_url": "https://arxiv.org/pdf/2307.15071v1",
  "comment": "21 pages including appendices, 6 figures, 10 tables",
  "num_versions": null,
  "size_before_bytes": 1177132,
  "size_after_bytes": 109142
}