{
  "title": "Non-axisymmetric modes of magnetorotational and possible hydrodynamical instabilities in the upcoming DRESDYN-MRI experiments -- linear and nonlinear dynamics",
  "authors": [
    "A. Mishra",
    "G. Mamatsashvili",
    "F. Stefani"
  ],
  "submission_date": "2023-07-30T18:20:16+00:00",
  "revised_dates": [
    "2024-03-06T16:43:06+00:00"
  ],
  "abstract": "The quest for an unambiguous detection of magnetorotational instability (MRI) in experiments is still ongoing despite recent promising results. To conclusively identify MRI in the laboratory, a large cylindrical Taylor-Couette experiment with liquid sodium is under construction within the DRESDYN project. In this paper, we investigate the linear and nonlinear dynamics of non-axisymmetric MRI in the magnetized Taylor-Couette flow of liquid sodium, which is a model flow in this experiment. We show that the achievable highest Lundquist $Lu = 10$ and magnetic Reynolds $Rm = 40$ numbers in this experiment are large enough for the linear instability of non-axisymmetric modes with azimuthal wavenumber $|m|=1$, although the corresponding critical values of these numbers are usually higher than those for the axisymmetric mode. The structure of the ensuing nonlinear saturated state and its scaling properties with respect to Reynolds number $Re$ are analyzed, which are important for the DRESDYN-MRI experiment having very high $Re \\gtrsim 10^6$. It is shown that for $Re \\lesssim 4\\times 10^4$, the non-axisymmetric MRI modes eventually decay, since the modified shear profile of the mean azimuthal velocity due to the nonlinear axisymmetric MRI appears to be stable against non-axisymmetric instabilities. By contrast, for larger $Re \\gtrsim 4\\times 10^4$, a rapid growth and saturation of the non-axisymmetric modes of nonmagnetic origin occurs, which are radially localized near the inner cylinder wall, forming a turbulent boundary layer. However, for all the parameters considered, the saturation amplitude of these non-axisymmetric modes is always a few orders smaller than that of the axisymmetric MRI mode. Therefore, the results of our previous axisymmetric study on the scaling properties of nonlinear MRI states also hold when non-axisymmetric modes are included.",
  "categories": [
    "physics.flu-dyn",
    "astro-ph.EP",
    "astro-ph.HE",
    "astro-ph.SR",
    "physics.plasm-ph"
  ],
  "primary_category": "physics.flu-dyn",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16295",
  "pdf_url": "https://arxiv.org/pdf/2307.16295v2",
  "comment": "19 pages, 20 figures, 2 Tables, accepted for publication in Physical Review Fluids",
  "num_versions": null,
  "size_before_bytes": 54634091,
  "size_after_bytes": 301423
}