{
  "title": "Circumgalactic Ly$α$ Nebulae in Overdense Quasar Pair Regions Observed with the Palomar Cosmic Web Imager",
  "authors": [
    "Jessica S. Li",
    "Carlos J. Vargas",
    "Donal O'Sullivan",
    "Erika Hamden",
    "Zheng Cai",
    "Mateusz Matuszewski",
    "Christopher Martin",
    "Miriam Keppler",
    "Haeun Chung",
    "Nicole Melso",
    "Shiwu Zhang"
  ],
  "submission_date": "2023-07-28T19:41:51+00:00",
  "revised_dates": [],
  "abstract": "The recent discovery of enormous Ly$α$ nebulae (ELANe), characterized by physical extents $>200$ kpc and Ly$α$ luminosities $>10^{44}$ erg s$^{-1}$, provide a unique opportunity to study the intergalactic and circumgalactic medium (IGM/CGM) in distant galaxies. Many existing ELANe detections are associated with local overdensities of active galactic nuclei (AGN). We have initiated a search for ELANe around regions containing pairs of quasi-stellar objects (QSOs) using the Palomar Cosmic Web Imager (PCWI). The first study of this search, Cai et al., presented results of ELAN0101+0201 which was associated with a QSO pair at $z=2.45$. In this study, all targets residing in QSO pair environments analyzed have Ly$α$ detections, but only one of the four targets meets the classification criteria of an ELANe associated with a QSO pair region (z$\\sim2.87$). The other three sample detections of Ly$α$ nebulae do not meet the size and luminosity criteria to be classified as ELANe. We find kinematic evidence that the ELANe J1613, is possibly powered {mostly by AGN outflows.} The analysis of circularly-averaged surface brightness profiles of emission from the Ly$α$ regions show that the {Ly$α$ emission around $z\\sim2$ QSO pairs is consistent with emission around individual QSOs at $z\\sim2$, which is fainter than that around $z\\sim3$ QSOs. A larger sample of Ly$α$ at z$\\sim$2 will be needed to determine if there is evidence of redshift evolution when compared to nebular emissions at z$\\sim$3 from other studies.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.3847/1538-4357/acda22",
  "journal_ref": "ApJ 952 137 (2023)",
  "arxiv_id": "2307.15779",
  "pdf_url": "https://arxiv.org/pdf/2307.15779v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 4206093,
  "size_after_bytes": 652603
}