{
  "title": "Multi-UAV Enabled Integrated Sensing and Wireless Powered Communication: A Robust Multi-Objective Approach",
  "authors": [
    "Omid Rezaei",
    "Mohammad Mahdi Naghsh",
    "Seyed Mohammad Karbasi",
    "Mohammad Mahdi Nayebi"
  ],
  "submission_date": "2023-07-26T17:01:27+00:00",
  "revised_dates": [],
  "abstract": "In this paper, we consider an integrated sensing and communication (ISAC) system with wireless power transfer (WPT) where multiple unmanned aerial vehicle (UAV)-based radars serve multiple clusters of energy-limited communication users in addition to their sensing functionality. In this architecture, the radars sense the environment in phase 1 (namely sensing phase) and meanwhile, the communications users (nodes) harvest and store the energy from the radar transmit signals. The stored energy is then used for information transmission from the nodes to UAVs in phase 2, i.e., uplink phase. Performance of the radar systems depends on the transmit signals as well as the receive filters; the energy of the transmit signals also affects the communication network because it serves as the source of uplink powers. Therefore, we cast a multi-objective design problem addressing performance of both radar and communication systems via optimizing UAV trajectories, radar transmit waveforms, radar receive filters, time scheduling and uplink powers. The design problem is further formulated as a robust non-convex optimization problem taking into account the the user location uncertainty. Hence, we devise a method based on alternating optimization followed by concepts of fractional programming, S-procedure, and tricky majorization-minimization (MM) technique to tackle it. Numerical examples illustrate the effectiveness of the proposed method for different scenarios.",
  "categories": [
    "eess.SP"
  ],
  "primary_category": "eess.SP",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14299",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 2995985,
  "size_after_bytes": 1538342
}