{
  "title": "Virtual Mirrors: Non-Line-of-Sight Imaging Beyond the Third Bounce",
  "authors": [
    "Diego Royo",
    "Talha Sultan",
    "Adolfo Muñoz",
    "Khadijeh Masumnia-Bisheh",
    "Eric Brandt",
    "Diego Gutierrez",
    "Andreas Velten",
    "Julio Marco"
  ],
  "submission_date": "2023-07-26T17:59:20+00:00",
  "revised_dates": [],
  "abstract": "Non-line-of-sight (NLOS) imaging methods are capable of reconstructing complex scenes that are not visible to an observer using indirect illumination. However, they assume only third-bounce illumination, so they are currently limited to single-corner configurations, and present limited visibility when imaging surfaces at certain orientations. To reason about and tackle these limitations, we make the key observation that planar diffuse surfaces behave specularly at wavelengths used in the computational wave-based NLOS imaging domain. We call such surfaces virtual mirrors. We leverage this observation to expand the capabilities of NLOS imaging using illumination beyond the third bounce, addressing two problems: imaging single-corner objects at limited visibility angles, and imaging objects hidden behind two corners. To image objects at limited visibility angles, we first analyze the reflections of the known illuminated point on surfaces of the scene as an estimator of the position and orientation of objects with limited visibility. We then image those limited visibility objects by computationally building secondary apertures at other surfaces that observe the target object from a direct visibility perspective. Beyond single-corner NLOS imaging, we exploit the specular behavior of virtual mirrors to image objects hidden behind a second corner by imaging the space behind such virtual mirrors, where the mirror image of objects hidden around two corners is formed. No specular surfaces were involved in the making of this paper.",
  "categories": [
    "cs.CV"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14341",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 20481606,
  "size_after_bytes": 346869
}