{
  "title": "Gradient-Based Spectral Embeddings of Random Dot Product Graphs",
  "authors": [
    "Marcelo Fiori",
    "Bernardo Marenco",
    "Federico Larroca",
    "Paola Bermolen",
    "Gonzalo Mateos"
  ],
  "submission_date": "2023-07-25T21:09:55+00:00",
  "revised_dates": [
    "2023-12-11T01:34:12+00:00"
  ],
  "abstract": "The Random Dot Product Graph (RDPG) is a generative model for relational data, where nodes are represented via latent vectors in low-dimensional Euclidean space. RDPGs crucially postulate that edge formation probabilities are given by the dot product of the corresponding latent positions. Accordingly, the embedding task of estimating these vectors from an observed graph is typically posed as a low-rank matrix factorization problem. The workhorse Adjacency Spectral Embedding (ASE) enjoys solid statistical properties, but it is formally solving a surrogate problem and can be computationally intensive. In this paper, we bring to bear recent advances in non-convex optimization and demonstrate their impact to RDPG inference. We advocate first-order gradient descent methods to better solve the embedding problem, and to organically accommodate broader network embedding applications of practical relevance. Notably, we argue that RDPG embeddings of directed graphs loose interpretability unless the factor matrices are constrained to have orthogonal columns. We thus develop a novel feasible optimization method in the resulting manifold. The effectiveness of the graph representation learning framework is demonstrated on reproducible experiments with both synthetic and real network data. Our open-source algorithm implementations are scalable, and unlike the ASE they are robust to missing edge data and can track slowly-varying latent positions from streaming graphs.",
  "categories": [
    "cs.LG",
    "math.OC"
  ],
  "primary_category": "cs.LG",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13818",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 17445894,
  "size_after_bytes": 1022919
}