{
  "title": "Hyperboloidal approach for static spherically symmetric spacetimes: a didactical introduction and applications in black-hole physics",
  "authors": [
    "Rodrigo Panosso Macedo"
  ],
  "submission_date": "2023-07-28T18:00:01+00:00",
  "revised_dates": [
    "2024-01-15T10:13:48+00:00"
  ],
  "abstract": "This work offers a didactical introduction to the calculations and geometrical properties of a static, spherically symmetric spacetime foliated by hyperboloidal time surfaces. We discuss the various degrees of freedom involved, namely the height function, responsible for introducing the hyperboloidal time coordinate, and a radial compactification function. A central outcome is the expression of the Trautman-Bondi mass in terms of the hyperboloidal metric functions. Moreover, we apply this formalism to a class of wave equations commonly used in black-hole perturbation theory. Additionally, we provide a comprehensive derivation of the hyperboloidal minimal gauge, introducing two alternative approaches within this conceptual framework: the in-out and out-in strategies. Specifically, we demonstrate that the height function in the in-out strategy follows from the well-known tortoise coordinate by changing the sign of the terms that become singular at future null infinity. Similarly, for the out-in strategy, a sign change also occurs in the tortoise coordinate's regular terms. We apply the methodology to the following spacetimes: Singularity-approaching slices in Schwarzschild, higher-dimensional black holes, black hole with matter halo, and Reissner- Nordström-de Sitter. From this heuristic study, we conjecture that the out-in strategy is best adapted for black hole geometries that account for environmental or effective quantum effects.",
  "categories": [
    "gr-qc"
  ],
  "primary_category": "gr-qc",
  "doi": "10.1098/rsta.2023.0046",
  "journal_ref": "Phil. Trans. R. Soc. A. 382 20230046 (2024)",
  "arxiv_id": "2307.15735",
  "pdf_url": "https://arxiv.org/pdf/2307.15735v2",
  "comment": "41 pages, 6 figures. Published to Philosophical Transactions A issue: \"At the interface of asymptotics, conformal methods and analysis in general relativity\" --- updated version to include referees suggestions and extend literature",
  "num_versions": null,
  "size_before_bytes": 844423,
  "size_after_bytes": 349282
}