{
  "title": "Entangling quantum logic gates in neutral atoms via the microwave-driven spin-flip blockade",
  "authors": [
    "Vikas Buchemmavari",
    "Sivaprasad Omanakuttan",
    "Yuan-Yu Jau",
    "Ivan Deutsch"
  ],
  "submission_date": "2023-07-31T06:41:26+00:00",
  "revised_dates": [
    "2024-01-17T17:59:20+00:00"
  ],
  "abstract": "The Rydberg dipole-blockade has emerged as the standard mechanism to induce entanglement between neutral atom qubits. In these protocols, laser fields that couple qubit states to Rydberg states are modulated to implement entangling gates. Here we present an alternative protocol to implement entangling gates via Rydberg dressing and a microwave-field-driven spin-flip blockade [Y.-Y. Jau et al, Nat. Phys. 12, 71 (2016)]. We consider the specific example of qubits encoded in the clock states states of cesium. An auxiliary hyperfine state is optically dressed so that it acquires partial Rydberg character. It thus acts as a proxy Rydberg state, with a nonlinear light-shift that plays the role of blockade strength. A microwave-frequency field coupling a qubit state to this dressed auxiliary state can be modulated to implement entangling gates. Logic gate protocols designed for the optical regime can be imported to this microwave regime, for which experimental control methods are more robust. We show that unlike the strong dipole-blockade regime usually employed in Rydberg experiments, going to a moderate-spin-flip-blockade regime results in faster gates and smaller Rydberg decay. We study various regimes of operations that can yield high-fidelity two-qubit entangling gates and characterize their analytical behavior. In addition to the inherent robustness of microwave control, we can design these gates to be more robust to thermal fluctuations in atomic motion as well to laser amplitude, and other noise sources such as stray background fields.",
  "categories": [
    "quant-ph"
  ],
  "primary_category": "quant-ph",
  "doi": "10.1103/PhysRevA.109.012615",
  "journal_ref": "Phys. Rev. A 109, 012615 (2024)",
  "arxiv_id": "2307.16434",
  "pdf_url": "https://arxiv.org/pdf/2307.16434v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 996411,
  "size_after_bytes": 284104
}