{
  "title": "Study of the nonleptonic decay $Ξ^0_c \\to Λ^+_c π^-$ in the covariant confined quark model",
  "authors": [
    "Mikhail A. Ivanov",
    "Valery E. Lyubovitskij",
    "Zhomart Tyulemissov"
  ],
  "submission_date": "2023-07-27T12:45:19+00:00",
  "revised_dates": [
    "2023-09-19T10:43:03+00:00",
    "2023-10-22T14:26:07+00:00"
  ],
  "abstract": "The nonleptonic decay $Ξ^0_c \\to Λ^+_c π^-$ with $ΔC=0$ is systematically studied in the framework of the covariant confined quark model with accounting for both short and long distance effects. The short distance effects are induced by four topologies of external and internal weak $W^\\pm$ exchange, while long distance effects are saturated by an inclusion of the so-called pole diagrams with an intermediate $\\frac12^+$ and $\\frac12^-$ baryon resonances. The contributions from $\\frac12^+$~resonances are calculated straightforwardly by accounting for single charmed $Σ^0_c$ and $Ξ^{'\\,+}_c$~baryons whereas the contributions from $\\frac12^-$~resonances are calculated by using the well-known soft-pion theorem in the current-algebra approach. It allows to express the parity-violating S-wave amplitude in terms of parity-conserving matrix elements. It is found that the contribution of external and internal $W$-exchange diagrams is significantly suppressed by more than one order of magnitude in comparison with data. The pole diagrams play the major role to get consistency with experiment.",
  "categories": [
    "hep-ph",
    "hep-ex"
  ],
  "primary_category": "hep-ph",
  "doi": "10.1103/PhysRevD.108.073002",
  "journal_ref": "Phys. Rev. D 108, no.7, 073002 (2023)",
  "arxiv_id": "2307.14816",
  "pdf_url": "https://arxiv.org/pdf/2307.14816v3",
  "comment": "21 pages, 5 figures. Some errors and typos corrected, more details and discussions added, new references added. Published in Phys. Rev. D 108, no.7, 073002 (2023). arXiv admin note: text overlap with arXiv:2107.08831",
  "num_versions": null,
  "size_before_bytes": 1568173,
  "size_after_bytes": 241049
}