{
  "title": "Incoherent electronic band states in Mn-substituted BaFe$_{2}$As$_{2}$",
  "authors": [
    "Marli R. Cantarino",
    "Kevin R. Pakuszewski",
    "Björn Salzmann",
    "Pedro H. A. Moya",
    "Wagner R. da Silva Neto",
    "Gabriel S. Freitas",
    "P. G. Pagliuso",
    "Walber H. Brito",
    "Claude Monney",
    "C. Adriano",
    "Fernando A. Garcia"
  ],
  "submission_date": "2023-07-24T15:24:27+00:00",
  "revised_dates": [
    "2023-12-15T01:16:01+00:00"
  ],
  "abstract": "Chemical substitution is commonly used to explore new ground states in materials, yet the role of disorder is often overlooked. In Mn-substituted BaFe$_{2}$As$_{2}$ (MnBFA), superconductivity (SC) is absent, despite being observed for nominal hole-doped phases. Instead, a glassy magnetic phase emerges, associated with the $S=5/2$ Mn local spins. In this work, we present a comprehensive investigation of the electronic structure of MnBFA using angle-resolved photoemission spectroscopy (ARPES). We find that Mn causes a small and orbital-specific reduction of the electron pockets, only partially disrupting nesting conditions. Based upon the analysis of the spectral properties, we observe, for all bands, an increase in the electronic scattering rate as a function of Mn content. This is interpreted as increasing band incoherence, which we propose as the primary contributor to the suppression of the magnetic order in MnBFA. This finding connects the MnBFA electronic band structure properties to the glassy magnetic behavior observed in these materials and suggests that SC is absent because of the collective magnetic impurity behavior that scatters the Fe-derived excitations. Additionally, our analysis shows that the binding energy ($E_{B}$) dependence of the imaginary part of the self-energy [$\\text{Im}Σ(E_{B})$] is best described by a fractional scaling ($\\text{Im}Σ(E_{B})\\propto\\sqrt{-E_{B}}$). These results indicate that Mn tunes MnBFA into an electronic disordered phase between the correlated Hund's metal in BaFe$_{2}$As$_{2}$ and the Hund's insulator in BaMn$_{2}$As$_{2}$.",
  "categories": [
    "cond-mat.supr-con",
    "cond-mat.str-el"
  ],
  "primary_category": "cond-mat.supr-con",
  "doi": "10.1103/PhysRevB.108.245124",
  "journal_ref": null,
  "arxiv_id": "2307.12879",
  "pdf_url": null,
  "comment": "main 8 pages, 5 figures + supp 5 pages, 4 figures",
  "num_versions": null,
  "size_before_bytes": 7969429,
  "size_after_bytes": 424519
}