{
  "title": "An Unconditionally Energy-Stable and Orthonormality-Preserving Iterative Scheme for the Kohn-Sham Gradient Flow Based Model",
  "authors": [
    "Xiuping Wang",
    "Huangxin Chen",
    "Jisheng Kou",
    "Shuyu Sun"
  ],
  "submission_date": "2023-07-28T19:51:30+00:00",
  "revised_dates": [],
  "abstract": "We propose an unconditionally energy-stable, orthonormality-preserving, component-wise splitting iterative scheme for the Kohn-Sham gradient flow based model in the electronic structure calculation. We first study the scheme discretized in time but still continuous in space. The component-wise splitting iterative scheme changes one wave function at a time, similar to the Gauss-Seidel iteration for solving a linear equation system. Rigorous mathematical derivations are presented to show our proposed scheme indeed satisfies the desired properties. We then study the fully-discretized scheme, where the space is further approximated by a conforming finite element subspace. For the fully-discretized scheme, not only the preservation of orthogonality and normalization (together we called orthonormalization) can be quickly shown using the same idea as for the semi-discretized scheme, but also the highlight property of the scheme, i.e., the unconditional energy stability can be rigorously proven. The scheme allows us to use large time step sizes and deal with small systems involving only a single wave function during each iteration step. Several numerical experiments are performed to verify the theoretical analysis, where the number of iterations is indeed greatly reduced as compared to similar examples solved by the Kohn-Sham gradient flow based model in the literature.",
  "categories": [
    "math.NA"
  ],
  "primary_category": "math.NA",
  "doi": "10.1016/j.jcp.2023.112670",
  "journal_ref": null,
  "arxiv_id": "2307.15782",
  "pdf_url": "https://arxiv.org/pdf/2307.15782v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 6915412,
  "size_after_bytes": 78740
}