{
  "title": "Coherent Dynamics of Charge Carriers in γ-InSe Revealed by Ultrafast Spectroscopy",
  "authors": [
    "Jianwei Shen",
    "Jiayu Liang",
    "Qixu Zhao",
    "Menghui Jia",
    "Jinquan Chen",
    "Haitao Sun",
    "Qinghong Yuan",
    "Hong-Guang Duan",
    "Ajay Jha",
    "Yan Yang",
    "Zhenrong Sun"
  ],
  "submission_date": "2023-07-24T14:23:26+00:00",
  "revised_dates": [],
  "abstract": "For highly efficient ultrathin solar cells, layered indium selenide (InSe), a van der Waals solid, has shown a great promise. In this paper, we study the coherent dynamics of charge carriers generation in γ-InSe single crystals. We employ ultrafast transient absorption spectroscopy to examine the dynamics of hot electrons after resonant photoexcitation. To study the effect of excess kinetic energy of electrons after creating A exciton (VB1 to CB transition), we excite the sample with broadband pulses centered at 600, 650, 700 and 750 nm, respectively. We analyze the relaxation and recombination dynamics in γ-InSe by global fitting approach. Five decay associated spectra with their associated lifetimes are obtained, which have been assigned to intraband vibrational relaxation and interband recombination processes. We extract characteristic carrier thermalization times from 1 to 10 ps. To examine the coherent vibrations accompanying intraband relaxation dynamics, we analyze the kinetics by fitting to exponential functions and the obtained residuals are further processed for vibrational analysis. A few key phonon coherences are resolved and ab-initio quantum calculations reveal the nature of the associated phonons. The wavelet analysis is employed to study the time evolution of the observed coherences, which show that the low-frequency coherences last for more than 5 ps. Associated calculations reveal that the contribution of the intralayer phonon modes is the key determining factor for the scattering between free electrons and lattice. Our results provide fundamental insights into the photophysics in InSe and help to unravel their potential for high-performance optoelectronic devices.",
  "categories": [
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12825",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 5145387,
  "size_after_bytes": 73925
}