{
  "title": "Collinear fragmentation at NNLL: generating functionals, groomed correlators and angularities",
  "authors": [
    "Melissa van Beekveld",
    "Mrinal Dasgupta",
    "Basem Kamal El-Menoufi",
    "Jack Helliwell",
    "Pier Francesco Monni"
  ],
  "submission_date": "2023-07-28T18:00:01+00:00",
  "revised_dates": [
    "2023-08-29T15:07:12+00:00",
    "2024-04-23T15:31:11+00:00"
  ],
  "abstract": "Jet calculus offers a unique mathematical technique to bridge the area of QCD resummation with Monte Carlo parton showers. With the ultimate goal of constructing next-to-next-to-leading logarithmic (NNLL) parton showers we study, using the language of generating functionals, the collinear fragmentation of final-state partons. In particular, we focus on the definition and calculation of the Sudakov form factor, which physically describes the no-emission probability in an ordered branching process. We review recent results for quark jets and compute the Sudakov form factor for the collinear fragmentation of gluon jets at NNLL. The NNLL corrections are encoded in a $z$ dependent two-loop anomalous dimension $B_2(z)$, with $z$ being a suitably defined longitudinal momentum fraction. This is obtained from the integration of the relevant $1\\to 3$ collinear splitting kernels combined with the one-loop corrections to the $1\\to 2$ counterpart. This work provides the missing ingredients to extend the methods of jet calculus in the collinear limit to NNLL and gives an important element of the next generation of NNLL parton shower algorithms. As an application we derive new NNLL results for both the fractional moments of energy-energy correlation $FC_x$ and the angularities $λ_x$ measured on mMDT/Soft-Drop ($β=0$) groomed jets.",
  "categories": [
    "hep-ph"
  ],
  "primary_category": "hep-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15734",
  "pdf_url": "https://arxiv.org/pdf/2307.15734v3",
  "comment": "Added numerical checks at fixed-order",
  "num_versions": null,
  "size_before_bytes": 1187028,
  "size_after_bytes": 916615
}