{
  "title": "Superimposed RIS-phase Modulation for MIMO Communications: A Novel Paradigm of Information Transfer",
  "authors": [
    "Jiacheng Yao",
    "Jindan Xu",
    "Wei Xu",
    "Chau Yuen",
    "Xiaohu You"
  ],
  "submission_date": "2023-07-24T13:44:45+00:00",
  "revised_dates": [
    "2023-08-11T00:07:26+00:00"
  ],
  "abstract": "Reconfigurable intelligent surface (RIS) is regarded as an important enabling technology for the sixth-generation (6G) network. Recently, modulating information in reflection patterns of RIS, referred to as reflection modulation (RM), has been proven in theory to have the potential of achieving higher transmission rate than existing passive beamforming (PBF) schemes of RIS. To fully unlock this potential of RM, we propose a novel superimposed RIS-phase modulation (SRPM) scheme for multiple-input multiple-output (MIMO) systems, where tunable phase offsets are superimposed onto predetermined RIS phases to bear extra information messages. The proposed SRPM establishes a universal framework for RM, which retrieves various existing RM-based schemes as special cases. Moreover, the advantages and applicability of the SRPM in practice is also validated in theory by analytical characterization of its performance in terms of average bit error rate (ABER) and ergodic capacity. To maximize the performance gain, we formulate a general precoding optimization at the base station (BS) for a single-stream case with uncorrelated channels and obtain the optimal SRPM design via the semidefinite relaxation (SDR) technique. Furthermore, to avoid extremely high complexity in maximum likelihood (ML) detection for the SRPM, we propose a sphere decoding (SD)-based layered detection method with near-ML performance and much lower complexity. Numerical results demonstrate the effectiveness of SRPM, precoding optimization, and detection design. It is verified that the proposed SRPM achieves a higher diversity order than that of existing RM-based schemes and outperforms PBF significantly especially when the transmitter is equipped with limited radio-frequency (RF) chains.",
  "categories": [
    "cs.IT",
    "eess.SP"
  ],
  "primary_category": "cs.IT",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12795",
  "pdf_url": null,
  "comment": "Accepted by IEEE TWC",
  "num_versions": null,
  "size_before_bytes": 11812213,
  "size_after_bytes": 3049330
}