{
  "title": "Which Ion Dominates Temperature and Pressure Response of Halide Perovskites and Elpasolites?",
  "authors": [
    "Loreta A. Muscarella",
    "Huygen J. Jöbsis",
    "Bettina Baumgartner",
    "P. Tim Prins",
    "D. Nicolette Maaskant",
    "Andrei V. Petukhov",
    "Dmitry Chernyshov",
    "Charles J. McMonagle",
    "Eline M. Hutter"
  ],
  "submission_date": "2023-07-31T12:57:14+00:00",
  "revised_dates": [],
  "abstract": "Halide perovskite and elpasolite semiconductors are extensively studied for optoelectronic applications due to their excellent performance together with significant chemical and structural flexibility. However, there is still limited understanding of their basic elastic properties and how they vary with composition and temperature, which is relevant for synthesis and device operation. To address this, we performed temperature- and pressure-dependent synchrotron-based powder X-ray diffraction (XRD). In contrast to previous pressure-dependent XRD studies, our relatively low pressures (ambient to 0.06 GPa) enabled us to investigate the elastic properties of halide perovskites and elpasolites in their ambient crystal structure. We find that halide perovskites and elpasolites show common trends in the bulk modulus and thermal expansivity. Both materials become softer as the halide ionic radius increases from Cl to Br to I, exhibiting higher compressibility and larger thermal expansivity. The mixed-halide compositions show intermediate properties to the pure compounds. Contrary, cations show a minor effect on the elastic properties. Finally, we observe that thermal phase transitions in e.g., MAPbI3 and CsPbCl3 lead to a softening of the lattice, together with negative expansivity for certain crystal axes, already tens of degrees away from the transition temperature. Hence, the range in which the phase transition affects thermal and elastic properties is substantially broader than previously thought. These findings highlight the importance of considering the temperature-dependent elastic properties of these materials, since stress induced during manufacturing or temperature sweeps can significantly impact the stability and performance of the corresponding devices.",
  "categories": [
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16621",
  "pdf_url": "https://arxiv.org/pdf/2307.16621v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 3913838,
  "size_after_bytes": 2291294
}