{
  "title": "Spin-Peierls instability of the U(1) Dirac spin liquid",
  "authors": [
    "Urban F. P. Seifert",
    "Josef Willsher",
    "Markus Drescher",
    "Frank Pollmann",
    "Johannes Knolle"
  ],
  "submission_date": "2023-07-23T11:14:34+00:00",
  "revised_dates": [
    "2023-08-15T00:47:01+00:00",
    "2024-08-20T01:29:52+00:00"
  ],
  "abstract": "A complicating factor in the realization and observation of quantum spin liquids in materials is the ubiquitous presence of other degrees of freedom, in particular lattice distortion modes (phonons). These provide additional routes for relieving magnetic frustration, thereby possibly destabilizing spin-liquid ground states. In this work, we focus on triangular-lattice Heisenberg antiferromagnets, where recent numerical evidence suggests the presence of an extended U(1) Dirac spin liquid phase which is described by compact quantum electrodynamics in 2+1 dimensions (QED$_3$), featuring gapless spinons and monopoles as gauge excitations, and believed to flow to a strongly-coupled fixed point with conformal symmetry. Using complementary perturbation theory and scaling arguments, we show that a symmetry-allowed coupling between (classical) finite-wavevector lattice distortions and monopole operators of the U(1) Dirac spin liquid generally induces a spin-Peierls instability towards a (confining) 12-site valence-bond solid state. We support our theoretical analysis with state-of-the-art density matrix renormalization group simulations. Away from the limit of static distortions, we demonstrate that the phonon energy gap establishes a parameter regime where the spin liquid is expected to be stable, and show that the monopole-lattice coupling leads to softening of the phonon in analogy to the Kohn anomaly. We discuss the applicability of our results to similar systems, in particular the Dirac spin liquid on the Kagome lattice.",
  "categories": [
    "cond-mat.str-el",
    "hep-th"
  ],
  "primary_category": "cond-mat.str-el",
  "doi": "10.1038/s41467-024-51367-w",
  "journal_ref": "Nat Commun 15, 7110 (2024)",
  "arxiv_id": "2307.12295",
  "pdf_url": null,
  "comment": "26 pages, 14 figures",
  "num_versions": null,
  "size_before_bytes": 8017504,
  "size_after_bytes": 850126
}