{
  "title": "Explainable Equivariant Neural Networks for Particle Physics: PELICAN",
  "authors": [
    "Alexander Bogatskiy",
    "Timothy Hoffman",
    "David W. Miller",
    "Jan T. Offermann",
    "Xiaoyang Liu"
  ],
  "submission_date": "2023-07-31T09:08:40+00:00",
  "revised_dates": [
    "2023-10-13T16:09:19+00:00",
    "2023-12-13T21:05:18+00:00",
    "2024-02-23T20:27:25+00:00"
  ],
  "abstract": "PELICAN is a novel permutation equivariant and Lorentz invariant or covariant aggregator network designed to overcome common limitations found in architectures applied to particle physics problems. Compared to many approaches that use non-specialized architectures that neglect underlying physics principles and require very large numbers of parameters, PELICAN employs a fundamentally symmetry group-based architecture that demonstrates benefits in terms of reduced complexity, increased interpretability, and raw performance. We present a comprehensive study of the PELICAN algorithm architecture in the context of both tagging (classification) and reconstructing (regression) Lorentz-boosted top quarks, including the difficult task of specifically identifying and measuring the $W$-boson inside the dense environment of the Lorentz-boosted top-quark hadronic final state. We also extend the application of PELICAN to the tasks of identifying quark-initiated vs.~gluon-initiated jets, and a multi-class identification across five separate target categories of jets. When tested on the standard task of Lorentz-boosted top-quark tagging, PELICAN outperforms existing competitors with much lower model complexity and high sample efficiency. On the less common and more complex task of 4-momentum regression, PELICAN also outperforms hand-crafted, non-machine learning algorithms. We discuss the implications of symmetry-restricted architectures for the wider field of machine learning for physics.",
  "categories": [
    "hep-ph",
    "cs.LG",
    "hep-ex"
  ],
  "primary_category": "hep-ph",
  "doi": "10.1007/JHEP03(2024)113",
  "journal_ref": "J. High Energ. Phys. 2024, 113 (2024)",
  "arxiv_id": "2307.16506",
  "pdf_url": "https://arxiv.org/pdf/2307.16506v4",
  "comment": "52 pages, 34 figures, 12 tables",
  "num_versions": null,
  "size_before_bytes": 62618102,
  "size_after_bytes": 1339926
}