{
  "title": "A cautionary lesson from Gaia systematics: the mono-metallic globular cluster NGC 5904",
  "authors": [
    "Paolo Bianchini",
    "Alessandra Mastrobuono-Battisti"
  ],
  "submission_date": "2023-07-28T09:27:50+00:00",
  "revised_dates": [
    "2023-09-27T12:21:04+00:00"
  ],
  "abstract": "The study of the chemistry of the stellar populations in Globular Clusters (GCs) is a fundamental task to unveil their formation in the high-redshift universe and to reconstruct the build up of our Galaxy. Using metallicity estimates from BP/RP low-resolution Gaia DR3 spectra, a recent work presented the surprising detection of two stellar populations with distinct metallicities in the stellar stream of the GC NGC 5904, otherwise considered a mono-metallic system. The presence of these two populations, with [Fe/H]=-1.4 and [Fe/H]=-2.0 dex, was taken as the evidence of a merger origin of the cluster. In this Letter, using the same data set complemented by new robust metallicity estimates, we carry out a detailed analysis of the metallicity distribution of stars belonging both to the cluster and to its stellar stream, explicitly focusing on the subtle effects of data systematics. We demonstrate that the population at [Fe/H]~-2.0 dex is a data artefact due to error systematics, affecting especially faint stars. The new higher quality metallicity sample corroborates this finding, and it indicates the presence of only one population of stars with metallicity of [Fe/H]~-1.3 dex, in agreement with previous literature studies. We, therefore, conclude that both NGC 5904 and its stellar stream are mono-metallic systems, and emphasize the need of carefully examining systematic effects in large and complex data.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15431",
  "pdf_url": "https://arxiv.org/pdf/2307.15431v2",
  "comment": "Accepted for publication on MNRAS, 5 pages, 3 figures",
  "num_versions": null,
  "size_before_bytes": 2950203,
  "size_after_bytes": 687820
}