{
  "title": "Quantifying interictal intracranial EEG to predict focal epilepsy",
  "authors": [
    "Ryan S Gallagher",
    "Nishant Sinha",
    "Akash R Pattnaik",
    "William K. S. Ojemann",
    "Alfredo Lucas",
    "Joshua J. LaRocque",
    "John M Bernabei",
    "Adam S Greenblatt",
    "Elizabeth M Sweeney",
    "H Isaac Chen",
    "Kathryn A Davis",
    "Erin C Conrad",
    "Brian Litt"
  ],
  "submission_date": "2023-07-27T19:59:45+00:00",
  "revised_dates": [],
  "abstract": "Intracranial EEG (IEEG) is used for 2 main purposes, to determine: (1) if epileptic networks are amenable to focal treatment and (2) where to intervene. Currently these questions are answered qualitatively and sometimes differently across centers. There is a need for objective, standardized methods to guide surgical decision making and to enable large scale data analysis across centers and prospective clinical trials.\n  We analyzed interictal data from 101 patients with drug resistant epilepsy who underwent presurgical evaluation with IEEG. We chose interictal data because of its potential to reduce the morbidity and cost associated with ictal recording. 65 patients had unifocal seizure onset on IEEG, and 36 were non-focal or multi-focal. We quantified the spatial dispersion of implanted electrodes and interictal IEEG abnormalities for each patient. We compared these measures against the 5 Sense Score (5SS), a pre-implant estimate of the likelihood of focal seizure onset, and assessed their ability to predict the clinicians choice of therapeutic intervention and the patient outcome.\n  The spatial dispersion of IEEG electrodes predicted network focality with precision similar to the 5SS (AUC = 0.67), indicating that electrode placement accurately reflected pre-implant information. A cross-validated model combining the 5SS and the spatial dispersion of interictal IEEG abnormalities significantly improved this prediction (AUC = 0.79; p<0.05). The combined model predicted ultimate treatment strategy (surgery vs. device) with an AUC of 0.81 and post-surgical outcome at 2 years with an AUC of 0.70. The 5SS, interictal IEEG, and electrode placement were not correlated and provided complementary information.\n  Quantitative, interictal IEEG significantly improved upon pre-implant estimates of network focality and predicted treatment with precision approaching that of clinical experts.",
  "categories": [
    "q-bio.NC"
  ],
  "primary_category": "q-bio.NC",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15170",
  "pdf_url": "https://arxiv.org/pdf/2307.15170v1",
  "comment": "25 pages, 4 Figures, 1 table",
  "num_versions": null,
  "size_before_bytes": 1633520,
  "size_after_bytes": 954748
}