{
  "title": "Select2Col: Leveraging Spatial-Temporal Importance of Semantic Information for Efficient Collaborative Perception",
  "authors": [
    "Yuntao Liu",
    "Qian Huang",
    "Rongpeng Li",
    "Xianfu Chen",
    "Zhifeng Zhao",
    "Shuyuan Zhao",
    "Yongdong Zhu",
    "Honggang Zhang"
  ],
  "submission_date": "2023-07-31T09:33:19+00:00",
  "revised_dates": [
    "2023-09-09T11:29:23+00:00",
    "2024-02-07T04:53:54+00:00"
  ],
  "abstract": "Collaborative perception by leveraging the shared semantic information plays a crucial role in overcoming the individual limitations of isolated agents. However, existing collaborative perception methods tend to focus solely on the spatial features of semantic information, while neglecting the importance of the temporal dimension. Consequently, the potential benefits of collaboration remain underutilized. In this article, we propose Select2Col, a novel collaborative perception framework that takes into account the \\underline{s}patial-t\\underline{e}mpora\\underline{l} importanc\\underline{e} of semanti\\underline{c} informa\\underline{t}ion. Within the Select2Col, we develop a collaborator selection method that utilizes a lightweight graph neural network (GNN) to estimate the importance of semantic information (IoSI) of each collaborator in enhancing perception performance, thereby identifying contributive collaborators while excluding those that potentially bring negative impact. Moreover, we present a semantic information fusion algorithm called HPHA (historical prior hybrid attention), which integrates multi-scale attention and short-term attention modules to capture the IoSI in feature representation from the spatial and temporal dimensions respectively, and assigns IoSI-consistent weights for efficient fusion of information from selected collaborators. Extensive experiments on three open datasets demonstrate that our proposed Select2Col significantly improves the perception performance compared to state-of-the-art approaches. The code associated with this research is publicly available at https://github.com/huangqzj/Select2Col/.",
  "categories": [
    "cs.CV",
    "cs.AI"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16517",
  "pdf_url": "https://arxiv.org/pdf/2307.16517v3",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 11502619,
  "size_after_bytes": 268893
}