{
  "title": "On the Formation of Eccentric Millisecond Pulsars by Accretion-induced Collapse of Massive White Dwarfs",
  "authors": [
    "D. Wang",
    "B. P. Gong"
  ],
  "submission_date": "2023-07-27T14:16:44+00:00",
  "revised_dates": [
    "2023-10-20T20:18:13+00:00"
  ],
  "abstract": "The millisecond pulsar(MSP) is believed to be an old neutron star(NS) having undergone spin-up by the accreting material from the donor. Whereas, the discovery of eccentric millisecond pulsars (eMSPs) in the Galactic field challenges such a scenario producing MSP-white dwarf (WD) only in the circular orbit. As orbital periods and companion mass of these eMSPs are located in a narrow range, a reasonable postulation is that they have the same origin. Although many models have been proposed to interpret their origin, however, the origin of the narrow range of the orbital period is still an open question. The accretion-induced collapse(AIC) of the ONe WD is considered to be an important pathway to form MSP, which was expected to result in the formation of MSP in the circular orbit due to tidal circularization. Here we revisited this scenario by the binary population synthesis including the specific circularization calculation. Our results indicate that binaries with insufficient circularization in this scenario can evolve into the eMSPs. The narrow initial binary parameters required by insufficient circularization can naturally account for the narrow range of the orbital period. Although the evolution of WD's AIC process has not been well understood, the characteristic of a narrow range in the orbital period of eMSPs can still set constraints on the physics of their evolution.",
  "categories": [
    "astro-ph.SR",
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.SR",
  "doi": "10.1093/mnras/stad2951",
  "journal_ref": null,
  "arxiv_id": "2307.14886",
  "pdf_url": "https://arxiv.org/pdf/2307.14886v2",
  "comment": "accepted by MNRAS",
  "num_versions": null,
  "size_before_bytes": 5808422,
  "size_after_bytes": 2063681
}