{
  "title": "Pressure-induced Superconductivity in Zintl Topological Insulator SrIn2As2",
  "authors": [
    "Weizheng Cao",
    "Haifeng Yang",
    "Yongkai Li",
    "Cuiying Pei",
    "Qi Wang",
    "Yi Zhao",
    "Changhua Li",
    "Mingxin Zhang",
    "Shihao Zhu",
    "Juefei Wu",
    "Lili Zhang",
    "Zhiwei Wang",
    "Yugui Yao",
    "Zhongkai Liu",
    "Yulin Chen",
    "Yanpeng Qi"
  ],
  "submission_date": "2023-07-28T15:37:41+00:00",
  "revised_dates": [],
  "abstract": "The Zintl compound AIn2X2 (A = Ca, Sr, and X = P, As), as a theoretically predicted new non-magnetic topological insulator, requires experiments to understand their electronic structure and topological characteristics. In this paper, we systematically investigate the crystal structures and electronic properties of the Zintl compound SrIn2As2 under both ambient and high-pressure conditions. Based on systematic angle-resolved photoemission spectroscopy (ARPES) measurements, we observed the topological surface states on its (001) surface as predicted by calculations, indicating that SrIn2As2 is a strong topological insulator. Interestingly, application of pressure effectively tuned the crystal structure and electronic properties of SrIn2As2. Superconductivity is observed in SrIn2As2 for pressure where the temperature dependence of the resistivity changes from a semiconducting-like behavior to that of a metal. The observation of nontrivial topological states and pressure-induced superconductivity in SrIn2As2 provides crucial insights into the relationship between topology and superconductivity, as well as stimulates further studies of superconductivity in topological materials.",
  "categories": [
    "cond-mat.supr-con",
    "cond-mat.mtrl-sci",
    "cond-mat.str-el"
  ],
  "primary_category": "cond-mat.supr-con",
  "doi": "10.1103/PhysRevB.108.224510",
  "journal_ref": "Physical Review B 108, 224510 (2023)",
  "arxiv_id": "2307.15629",
  "pdf_url": "https://arxiv.org/pdf/2307.15629v1",
  "comment": "15 pages,5 figures",
  "num_versions": null,
  "size_before_bytes": 3103552,
  "size_after_bytes": 1786315
}