{
  "title": "Physical Characteristics and Maximum Allowable Mass of Hybrid Star in the Context of $f(Q)$ Gravity",
  "authors": [
    "Piyali Bhar",
    "Sneha Pradhan",
    "Adnan Malik",
    "P. K. Sahoo"
  ],
  "submission_date": "2023-07-21T17:42:57+00:00",
  "revised_dates": [],
  "abstract": "In this study, we explore several new characteristics of a static anisotropic hybrid star with strange quark matter (SQM) and ordinary baryonic matter (OBM) distribution. Here, we use the MIT bag model equation of state to connect the density and pressure of SQM inside stars, whereas the linear equation of state $p_r =αρ-β$ connects the radial pressure and matter density caused by baryonic matter. The stellar model was developed under a background of $f(Q)$ gravity using the quadratic form of $f(Q)$. We utilized the Tolman-Kuchowicz ansatz to find the solutions to the field equations under modified gravity. We have matched the interior solution to the external Schwarzschild spacetime in order to acquire the numerical values of the model parameters. We have selected the star Her X-1 to develop various profiles of the model parameters. Several significant physical characteristics have been examined analytically and graphically, including matter densities, tangential and radial pressures, energy conditions, anisotropy factor, redshirt, compactness, etc. The main finding is that there is no core singularity present in the formations of the star under investigation. The nature of mass and the bag constant $B_g$ have been studied in details through equi-mass and equi-$B_g$ contour. The maximum allowable mass and the corresponding radius have been obtained via $M-R$ plots.",
  "categories": [
    "gr-qc",
    "hep-th"
  ],
  "primary_category": "gr-qc",
  "doi": "10.1140/epjc/s10052-023-11745-y",
  "journal_ref": "Eur. Phys. J. C 83(7), 646 (2023)",
  "arxiv_id": "2307.11809",
  "pdf_url": null,
  "comment": "EPJ C published version",
  "num_versions": null,
  "size_before_bytes": 2730082,
  "size_after_bytes": 78256
}