{
  "title": "Measuring Centralization of Online Platforms Through Size and Interconnection of Communities",
  "authors": [
    "Milo Z. Trujillo",
    "Laurent Hébert-Dufresne",
    "James Bagrow"
  ],
  "submission_date": "2023-07-27T17:35:18+00:00",
  "revised_dates": [],
  "abstract": "Decentralized architecture offers a robust and flexible structure for online platforms, since centralized moderation and computation can be easy to disrupt with targeted attacks. However, a platform offering a decentralized architecture does not guarantee that users will use it in a decentralized way, and measuring the centralization of socio-technical networks is not an easy task. In this paper we introduce a method of characterizing community influence in terms of how many edges between communities would be disrupted by a community's removal. Our approach provides a careful definition of \"centralization\" appropriate in bipartite user-community socio-technical networks, and demonstrates the inadequacy of more trivial methods for interrogating centralization such as examining the distribution of community sizes. We use this method to compare the structure of multiple socio-technical platforms -- Mastodon, git code hosting servers, BitChute, Usenet, and Voat -- and find a range of structures, from interconnected but decentralized git servers to an effectively centralized use of Mastodon servers, as well as multiscale hybrid network structures of disconnected Voat subverses. As the ecosystem of socio-technical platforms diversifies, it becomes critical to not solely focus on the underlying technologies but also consider the structure of how users interact through the technical infrastructure.",
  "categories": [
    "cs.SI",
    "cs.CY"
  ],
  "primary_category": "cs.SI",
  "doi": "10.1016/j.osnem.2024.100292",
  "journal_ref": null,
  "arxiv_id": "2307.15027",
  "pdf_url": "https://arxiv.org/pdf/2307.15027v1",
  "comment": "11 pages, 5 figures, 6 pages and 9 figures of supplemental material",
  "num_versions": null,
  "size_before_bytes": 1833907,
  "size_after_bytes": 246943
}