{
  "title": "Text-CRS: A Generalized Certified Robustness Framework against Textual Adversarial Attacks",
  "authors": [
    "Xinyu Zhang",
    "Hanbin Hong",
    "Yuan Hong",
    "Peng Huang",
    "Binghui Wang",
    "Zhongjie Ba",
    "Kui Ren"
  ],
  "submission_date": "2023-07-31T13:08:16+00:00",
  "revised_dates": [
    "2024-06-11T15:40:43+00:00"
  ],
  "abstract": "The language models, especially the basic text classification models, have been shown to be susceptible to textual adversarial attacks such as synonym substitution and word insertion attacks. To defend against such attacks, a growing body of research has been devoted to improving the model robustness. However, providing provable robustness guarantees instead of empirical robustness is still widely unexplored. In this paper, we propose Text-CRS, a generalized certified robustness framework for natural language processing (NLP) based on randomized smoothing. To our best knowledge, existing certified schemes for NLP can only certify the robustness against $\\ell_0$ perturbations in synonym substitution attacks. Representing each word-level adversarial operation (i.e., synonym substitution, word reordering, insertion, and deletion) as a combination of permutation and embedding transformation, we propose novel smoothing theorems to derive robustness bounds in both permutation and embedding space against such adversarial operations. To further improve certified accuracy and radius, we consider the numerical relationships between discrete words and select proper noise distributions for the randomized smoothing. Finally, we conduct substantial experiments on multiple language models and datasets. Text-CRS can address all four different word-level adversarial operations and achieve a significant accuracy improvement. We also provide the first benchmark on certified accuracy and radius of four word-level operations, besides outperforming the state-of-the-art certification against synonym substitution attacks.",
  "categories": [
    "cs.CR",
    "cs.CL",
    "cs.LG"
  ],
  "primary_category": "cs.CR",
  "doi": "10.1109/SP54263.2024.00053",
  "journal_ref": null,
  "arxiv_id": "2307.16630",
  "pdf_url": "https://arxiv.org/pdf/2307.16630v2",
  "comment": "Published in the 2024 IEEE Symposium on Security and Privacy (SP)",
  "num_versions": null,
  "size_before_bytes": 11687476,
  "size_after_bytes": 1370802
}