{
  "title": "G2L: Semantically Aligned and Uniform Video Grounding via Geodesic and Game Theory",
  "authors": [
    "Hongxiang Li",
    "Meng Cao",
    "Xuxin Cheng",
    "Yaowei Li",
    "Zhihong Zhu",
    "Yuexian Zou"
  ],
  "submission_date": "2023-07-26T16:14:21+00:00",
  "revised_dates": [
    "2023-08-21T00:43:00+00:00",
    "2023-11-15T01:13:03+00:00",
    "2024-01-10T01:27:20+00:00"
  ],
  "abstract": "The recent video grounding works attempt to introduce vanilla contrastive learning into video grounding. However, we claim that this naive solution is suboptimal. Contrastive learning requires two key properties: (1) \\emph{alignment} of features of similar samples, and (2) \\emph{uniformity} of the induced distribution of the normalized features on the hypersphere. Due to two annoying issues in video grounding: (1) the co-existence of some visual entities in both ground truth and other moments, \\ie semantic overlapping; (2) only a few moments in the video are annotated, \\ie sparse annotation dilemma, vanilla contrastive learning is unable to model the correlations between temporally distant moments and learned inconsistent video representations. Both characteristics lead to vanilla contrastive learning being unsuitable for video grounding. In this paper, we introduce Geodesic and Game Localization (G2L), a semantically aligned and uniform video grounding framework via geodesic and game theory. We quantify the correlations among moments leveraging the geodesic distance that guides the model to learn the correct cross-modal representations. Furthermore, from the novel perspective of game theory, we propose semantic Shapley interaction based on geodesic distance sampling to learn fine-grained semantic alignment in similar moments. Experiments on three benchmarks demonstrate the effectiveness of our method.",
  "categories": [
    "cs.CV"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14277",
  "pdf_url": null,
  "comment": "ICCV2023 oral, release the code",
  "num_versions": null,
  "size_before_bytes": 3888155,
  "size_after_bytes": 723967
}