{
  "title": "Polarization properties of X-ray tubes used for Imaging X-ray Polarimetry Explorer calibration",
  "authors": [
    "Ajay Ratheesh",
    "John Rankin",
    "Enrico Costa",
    "Ettore Del Monte",
    "Alessandro Di Marco",
    "Sergio Fabiani",
    "Fabio La Monaca",
    "Fabio Muleri",
    "Alda Rubini",
    "Paolo Soffitta",
    "Luca Baldini",
    "Massimo Minuti",
    "Michele Pinchera",
    "Carmelo Sgrò"
  ],
  "submission_date": "2023-07-27T12:41:28+00:00",
  "revised_dates": [],
  "abstract": "In this work, we measured the polarization properties of the X-rays emitted from the X-ray tubes, which were used during the calibration of the instrument onboard Imaging X-ray Polarimetry Explorer (IXPE). X-ray tubes are used as a source of unpolarized X-rays to calibrate the response of the gas pixel detectors to unpolarized radiation. However, even though the characteristic fluorescent emission lines are unpolarized, continuum bremsstrahlung emission can be polarized based on the geometry of the accelerated electrons and emitted photons. Hence, characterizing the contribution of polarized X-rays from bremsstrahlung emission is of interest, also for future measurements. We find that when accelerated electrons are parallel to the emitted photons, the bremsstrahlung emission is unpolarized, and when they are perpendicular, the polarization increases with energy, as expected from the theoretical predictions. A comparison with the theoretical predictions is also shown.",
  "categories": [
    "astro-ph.IM",
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.IM",
  "doi": "10.1117/1.JATIS.9.3.038002",
  "journal_ref": "J. Astron. Telesc. Instrum. Syst. 9(3), 038002 (2023)",
  "arxiv_id": "2307.14814",
  "pdf_url": "https://arxiv.org/pdf/2307.14814v1",
  "comment": "30 pages, 12 Figures and 6 tables. Published in Journal of Astronomical Telescopes, Instruments, and Systems (JATIS). DOI: 10.1117/1.JATIS.9.3.038002",
  "num_versions": null,
  "size_before_bytes": 3636111,
  "size_after_bytes": 112948
}