{
  "title": "A Novel Framework for Optimizing Gurney Flaps using RBF Neural Network and Cuckoo Search Algorithm",
  "authors": [
    "Aryan Tyagi",
    "Paras Singh",
    "Aryaman Rao",
    "Gaurav Kumar",
    "Raj Kumar Singh"
  ],
  "submission_date": "2023-07-25T16:18:38+00:00",
  "revised_dates": [],
  "abstract": "Enhancing aerodynamic efficiency is vital for optimizing aircraft performance and operational effectiveness. It enables greater speeds and reduced fuel consumption, leading to lower operating costs. Hence, the implementation of Gurney flaps represents a promising avenue for improving airfoil aerodynamics. The optimization of Gurney flaps holds considerable ramifications for improving the lift and stall characteristics of airfoils in aircraft and wind turbine blade designs. The efficacy of implementing Gurney flaps hinges significantly on its design parameters, namely, flap height and mounting angle. This study attempts to optimize these parameters using a design optimization framework, which incorporates training a Radial Basis Function surrogate model based on CFD data from two-dimensional (2D) Reynolds-Averaged Navier-Stokes (RANS) simulations. The Cuckoo Search algorithm is then employed to obtain the optimal design parameters and compared with other competing optimization algorithms. The optimized Gurney flap configuration shows a notable improvement of 10.28% in Cl/Cd, with a flap height of 1.9%c and a flap mounting angle of -58 degrees. The study highlights the effectiveness of the proposed design optimization framework and furnishes valuable insights into optimizing Gurney flap parameters. The comparison of metaheuristic algorithms serves to enhance the study's contribution to Gurney flap design optimization.",
  "categories": [
    "physics.flu-dyn"
  ],
  "primary_category": "physics.flu-dyn",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13612",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 47175015,
  "size_after_bytes": 269044
}