{
  "title": "A cell membrane model that reproduces cortical flow-driven cell migration and collective movement",
  "authors": [
    "Katsuhiko Sato"
  ],
  "submission_date": "2023-07-22T02:38:35+00:00",
  "revised_dates": [],
  "abstract": "Many fundamental biological processes are dependent on cellular migration. Although the mechanical mechanisms of single-cell migration are relatively well understood, those underlying migration of multiple cells adhered to each other in a cluster, referred to as cluster migration, are poorly understood. A key reason for this knowledge gap is that many forces-including contraction forces from actomyosin networks, hydrostatic pressure from the cytosol, frictional forces from the substrate, and forces from adjacent cells-contribute to cell cluster movement, making it challenging to model, and ultimately elucidate, the final result of these forces. This paper describes a two-dimensional cell membrane model that represents cells on a substrate with polygons and expresses various mechanical forces on the cell surface, keeping these forces balanced at all times by neglecting cell inertia. The model is discrete but equivalent to a continuous model if appropriate replacement rules for cell surface segments are chosen. When cells are given a polarity, expressed by a direction-dependent surface tension reflecting the location dependence of contraction and adhesion on a cell boundary, the cell surface begins to flow from front to rear as a result of force balance. This flow produces unidirectional cell movement, not only for a single cell but also for multiple cells in a cluster, with migration speeds that coincide with analytical results from a continuous model. Further, if the direction of cell polarity is tilted with respect to the cluster center, surface flow induces cell cluster rotation. The reason why this model moves while keeping force balance on cell surface (i.e., under no net forces from outside) is because of the implicit inflow and outflow of cell surface components through the inside of the cell.",
  "categories": [
    "physics.bio-ph",
    "cond-mat.soft"
  ],
  "primary_category": "physics.bio-ph",
  "doi": "10.3389/fcell.2023.1126819",
  "journal_ref": null,
  "arxiv_id": "2307.11963",
  "pdf_url": null,
  "comment": "5 figures",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}