{
  "title": "The chemical evolution of the solar neighbourhood for planet-hosting stars",
  "authors": [
    "Marco Pignatari",
    "Thomas C. L. Trueman",
    "Kate A. Womack",
    "Brad K. Gibson",
    "Benoit Côté",
    "Diego Turrini",
    "Christopher Sneden",
    "Stephen J. Mojzsis",
    "Richard J. Stancliffe",
    "Paul Fong",
    "Thomas V. Lawson",
    "James D. Keegans",
    "Kate Pilkington",
    "Jean-Claude Passy",
    "Timothy C. Beers",
    "Maria Lugaro"
  ],
  "submission_date": "2023-07-23T13:56:53+00:00",
  "revised_dates": [],
  "abstract": "Theoretical physical-chemical models for the formation of planetary systems depend on data quality for the Sun's composition, that of stars in the solar neighbourhood, and of the estimated \"pristine\" compositions for stellar systems. The effective scatter and the observational uncertainties of elements within a few hundred parsecs from the Sun, even for the most abundant metals like carbon, oxygen and silicon, are still controversial. Here we analyse the stellar production and the chemical evolution of key elements that underpin the formation of rocky (C, O, Mg, Si) and gas/ice giant planets (C, N, O, S). We calculate 198 galactic chemical evolution (GCE) models of the solar neighbourhood to analyse the impact of different sets of stellar yields, of the upper mass limit for massive stars contributing to GCE ($M_{\\rm up}$) and of supernovae from massive-star progenitors which do not eject the bulk of the iron-peak elements (faint supernovae). Even considering the GCE variation produced via different sets of stellar yields, the observed dispersion of elements reported for stars in the Milky Way disk is not reproduced. Among others, the observed range of super-solar [Mg/Si] ratios, sub-solar [S/N], and the dispersion of up to 0.5 dex for [S/Si] challenge our models. The impact of varying $M_{\\rm up}$ depends on the adopted supernova yields. Thus, observations do not provide a constraint on the M$_{\\rm up}$ parametrization. When including the impact of faint supernova models in GCE calculations, elemental ratios vary by up to 0.1-0.2 dex in the Milky Way disk; this modification better reproduces observations.",
  "categories": [
    "astro-ph.GA",
    "astro-ph.EP",
    "astro-ph.SR"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.1093/mnras/stad2167",
  "journal_ref": null,
  "arxiv_id": "2307.12330",
  "pdf_url": null,
  "comment": "36 pages, 26 figures, 1 Table, 1 Appendix, Accepted for publication in MNRAS",
  "num_versions": null,
  "size_before_bytes": 7629673,
  "size_after_bytes": 505777
}