{
  "title": "The lowest discriminant ideal of a Cayley-Hamilton Hopf algebra",
  "authors": [
    "Zhongkai Mi",
    "Quanshui Wu",
    "Milen Yakimov"
  ],
  "submission_date": "2023-07-28T11:05:09+00:00",
  "revised_dates": [
    "2023-11-03T12:22:23+00:00",
    "2024-10-21T17:23:51+00:00"
  ],
  "abstract": "Discriminant ideals of noncommutative algebras $A$, which are module finite over a central sublagebra $C$, are key invariants that carry important information about $A$, such as the sum of the squares of the dimensions of its irreducible modules with a given central character. There has been substantial research on the computation of discriminants, but very little is known about the computation of discriminant ideals. In this paper we carry out a detailed investigation of the lowest discriminant ideals of Cayley-Hamilton Hopf algebras in the sense of De Concini, Reshetikhin, Rosso and Procesi, whose identity fiber algebras are basic. The lowest discriminant ideals are the most complicated ones, because they capture the most degenerate behaviour of the fibers in the exact opposite spectrum of the picture from the Azumaya locus. We provide a description of the zero sets of the lowest discriminant ideals of Cayley-Hamilton Hopf algebras in terms of maximally stable modules of Hopf algebras, irreducible modules that are stable under tensoring with the maximal possible number of irreducible modules with trivial central character. In important situations, this is shown to be governed by the actions of the winding automorphism groups. The results are illustrated with applications to the group algebras of central extensions of abelian groups, big quantum Borel subalgebras at roots of unity and quantum coordinate rings at roots of unity.",
  "categories": [
    "math.RT",
    "math.QA",
    "math.RA"
  ],
  "primary_category": "math.RT",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15477",
  "pdf_url": "https://arxiv.org/pdf/2307.15477v3",
  "comment": "34 pages",
  "num_versions": null,
  "size_before_bytes": 339815,
  "size_after_bytes": 346952
}