{
  "title": "Rewriting and Completeness of Sum-Over-Paths in Dyadic Fragments of Quantum Computing",
  "authors": [
    "Renaud Vilmart"
  ],
  "submission_date": "2023-07-26T14:40:21+00:00",
  "revised_dates": [
    "2024-01-30T01:44:23+00:00",
    "2024-02-15T01:28:57+00:00",
    "2024-08-07T17:26:57+00:00"
  ],
  "abstract": "The \"Sum-Over-Paths\" formalism is a way to symbolically manipulate linear maps that describe quantum systems, and is a tool that is used in formal verification of such systems. We give here a new set of rewrite rules for the formalism, and show that it is complete for \"Toffoli-Hadamard\", the simplest approximately universal fragment of quantum mechanics. We show that the rewriting is terminating, but not confluent (which is expected from the universality of the fragment). We do so using the connection between Sum-over-Paths and graphical language ZH-calculus, and also show how the axiomatisation translates into the latter. We provide generalisations of the presented rewrite rules, that can prove useful when trying to reduce terms in practice, and we show how to graphically make sense of these new rules. We show how to enrich the rewrite system to reach completeness for the dyadic fragments of quantum computation, used in particular in the Quantum Fourier Transform, and obtained by adding phase gates with dyadic multiples of $π$ to the Toffoli-Hadamard gate-set. Finally, we show how to perform sums and concatenation of arbitrary terms, something which is not native in a system designed for analysing gate-based quantum computation, but necessary when considering Hamiltonian-based quantum computation.",
  "categories": [
    "cs.LO",
    "quant-ph"
  ],
  "primary_category": "cs.LO",
  "doi": "10.46298/lmcs-20(1:20)2024",
  "journal_ref": "Logical Methods in Computer Science, Volume 20, Issue 1 (March 7, 2024) lmcs:11667",
  "arxiv_id": "2307.14223",
  "pdf_url": null,
  "comment": "arXiv admin note: text overlap with arXiv:2205.02600",
  "num_versions": null,
  "size_before_bytes": 1309606,
  "size_after_bytes": 953590
}