{
  "title": "Individual and Averaged Power Density Spectra of X-ray bursts from SGR J1935+2154: Quasiperiodic Oscillation Search and Slopes",
  "authors": [
    "Shuo Xiao",
    "Xiao-Bo Li",
    "Wang-Chen Xue",
    "Shao-Lin Xiong",
    "Shuang-Nan Zhang",
    "Wen-Xi Peng",
    "Ai-Jun Dong",
    "You-Li Tuo",
    "Ce Cai",
    "Xi-Hong Luo",
    "Jiao-Jiao Yang",
    "Yue Wang",
    "Chao Zheng",
    "Yan-Qiu Zhang",
    "Jia-Cong Liu",
    "Wen-Jun Tan",
    "Chen-Wei Wang",
    "Ping Wang",
    "Cheng-Kui Li",
    "Shu-Xu Yi",
    "Shi-Jun Dang",
    "Lun-Hua Shang",
    "Ru-Shuang Zhao",
    "Qing-Bo Ma",
    "Wei Xie",
    "Jian-Chao Feng",
    "Bin Zhang",
    "Zhen Zhang",
    "Ming-Yu Ge",
    "Shi-Jie Zheng",
    "Li-Ming Song",
    "Qi-Jun Zhi"
  ],
  "submission_date": "2023-07-27T14:14:59+00:00",
  "revised_dates": [],
  "abstract": "The study of quasi-periodic oscillations (QPOs) and power density spectra (PDS) continuum properties can help shed light on the still illusive emission physics of magnetars and as a window into the interiors of neutron stars using asteroseismology. In this work, we employ a Bayesian method to search for the QPOs in the hundreds of X-ray bursts from SGR J1935+2154 observed by {\\it Insight}-HXMT, GECAM and Fermi/GBM from July 2014 to January 2022. Although no definitive QPO signal (significance $>3σ$) is detected in individual bursts or the averaged periodogram of the bursts grouped by duration, we identify several bursts exhibiting possible QPO at $\\sim$ 40 Hz, which is consistent with that reported in the X-ray burst associated with FRB 200428. We investigate the PDS continuum properties and find that the distribution of the PDS slope in the simple power-law model peaks $\\sim$ 2.5, which is consistent with other magnetars but higher than 5/3 commonly seen in gamma-ray bursts. Besides, the distribution of the break frequency in the broken power-law model peaks at $\\sim$ 60 Hz. Finally, we report that the power-law index of PDS has an anti-correlation and power-law dependence on the burst duration as well as the minimum variation timescale.",
  "categories": [
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.HE",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14884",
  "pdf_url": "https://arxiv.org/pdf/2307.14884v1",
  "comment": "comments welcome",
  "num_versions": null,
  "size_before_bytes": 1736060,
  "size_after_bytes": 383337
}