{
  "title": "It Is Easy For Multi-Issue Bundles To Advance Anti-Democratic Agendas",
  "authors": [
    "Matthew I. Jones",
    "Matthew Chervenak",
    "Nicholas A. Christakis"
  ],
  "submission_date": "2023-07-21T19:27:12+00:00",
  "revised_dates": [
    "2023-07-27T00:20:56+00:00"
  ],
  "abstract": "When confronted with a host of issues, groups often save time and energy by compiling many issues into a single bundle when making decisions. This reduces the time and cost of group decision-making, but it also leads to suboptimal outcomes as individuals lose the ability to express their preferences on each specific issue. We examine this trade-off by quantifying the value of bundled voting compared to a more tedious issue-by-issue voting process. Our research investigates multi-issue bundles and their division into multiple subbundles, confirming that bundling generally yields positive outcomes for the group. However, bundling and issue-by-issue voting can easily yield opposite results regardless of the number of votes the bundle receives. Furthermore, we show that most combinations of voters and issues are vulnerable to manipulation if the subundling is controlled by a bad actor. By carefully crafting bundles, such an antagonist can achieve the minority preference on almost every issue. Thus, naturally occurring undemocratic outcomes may be rare, but they can be easily manufactured. To thoroughly investigate this problem, we employ three techniques throughout the paper: mathematical analysis, computer simulations, and the analysis of American voter survey data. This study provides valuable insights into the dynamics of bundled voting and its implications for group decision-making. By highlighting the potential for manipulation and suboptimal outcomes, our findings add another layer to our understanding of voting paradoxes and offer insights for those designing group decision-making systems that are safer and more fair.",
  "categories": [
    "physics.soc-ph"
  ],
  "primary_category": "physics.soc-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11873",
  "pdf_url": null,
  "comment": "31 pages, 10 figures, 4 tables",
  "num_versions": null,
  "size_before_bytes": 4910894,
  "size_after_bytes": 152006
}