{
  "title": "Bi-level Network Design for UAM Vertiport Allocation Using Activity-Based Transport Simulations",
  "authors": [
    "Sebastian Brulin",
    "Markus Olhofer"
  ],
  "submission_date": "2023-07-27T09:38:17+00:00",
  "revised_dates": [],
  "abstract": "The design or the optimization of transport systems is a difficult task. This is especially true in the case of the introduction of new transport modes in an existing system. The main reason is, that even small additions and changes result in the emergence of new travel patterns, likely resulting in an adaptation of the travel behavior of multiple other agents in the system. Here we consider the optimization of future Urban Air Mobility services under consideration of effects induced by the new mode to an existing system. We tackle this problem through a bi-level network design approach, in which the discrete decisions of the network design planner are optimized based on the evaluated dynamic demand of the user's mode choices. We solve the activity-based network design problem (AB-NDP) using a Genetic Algorithm on a multi-objective optimization problem while evaluating the dynamic demand with the large-scale Multi-Agent Transport Simulation (MATSim) framework. The proposed bi-level approach is compared against the results of a coverage approach using a static demand method. The bi-level study shows better results for expected UAM demand and total travel time savings across the transportation system. Due to its generic character, the demonstrated utilization of a bi-level method is applicable to other mobility service design questions and to other regions.",
  "categories": [
    "cs.MA",
    "math.OC"
  ],
  "primary_category": "cs.MA",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14731",
  "pdf_url": "https://arxiv.org/pdf/2307.14731v1",
  "comment": "6th International Electric Vehicle Technology Conference 2023 (EVTeC)",
  "num_versions": null,
  "size_before_bytes": 341588,
  "size_after_bytes": 207125
}