{
  "title": "A Continuous-Time Dynamic Factor Model for Intensive Longitudinal Data Arising from Mobile Health Studies",
  "authors": [
    "Madeline R. Abbott",
    "Walter H. Dempsey",
    "Inbal Nahum-Shani",
    "Cho Y. Lam",
    "David W. Wetter",
    "Jeremy M. G. Taylor"
  ],
  "submission_date": "2023-07-28T17:15:50+00:00",
  "revised_dates": [
    "2023-12-08T21:19:48+00:00",
    "2024-02-20T18:42:12+00:00"
  ],
  "abstract": "Intensive longitudinal data (ILD) collected in mobile health (mHealth) studies contain rich information on multiple outcomes measured frequently over time that have the potential to capture short-term and long-term dynamics. Motivated by an mHealth study of smoking cessation in which participants self-report the intensity of many emotions multiple times per day, we describe a dynamic factor model that summarizes the ILD as a low-dimensional, interpretable latent process. This model consists of two submodels: (i) a measurement submodel--a factor model--that summarizes the multivariate longitudinal outcome as lower-dimensional latent variables and (ii) a structural submodel--an Ornstein-Uhlenbeck (OU) stochastic process--that captures the temporal dynamics of the multivariate latent process in continuous time. We derive a closed-form likelihood for the marginal distribution of the outcome and the computationally-simpler sparse precision matrix for the OU process. We propose a block coordinate descent algorithm for estimation. Finally, we apply our method to the mHealth data to summarize the dynamics of 18 different emotions as two latent processes. These latent processes are interpreted by behavioral scientists as the psychological constructs of positive and negative affect and are key in understanding vulnerability to lapsing back to tobacco use among smokers attempting to quit.",
  "categories": [
    "stat.ME"
  ],
  "primary_category": "stat.ME",
  "doi": "10.1017/psy.2025.10023",
  "journal_ref": "Psychometrika 90 (2025) 1175-1196",
  "arxiv_id": "2307.15681",
  "pdf_url": "https://arxiv.org/pdf/2307.15681v3",
  "comment": "Main text is 20 pages with 5 figures and 1 table. Supplementary material is 26 pages",
  "num_versions": null,
  "size_before_bytes": 2413998,
  "size_after_bytes": 658520
}