{
  "title": "Tuning the magnetic properties in MPS3 (M = Mn, Fe, and Ni) by proximity-induced Dzyaloshinskii Moriya interactions",
  "authors": [
    "Suvodeep Paul",
    "Devesh Negi",
    "Saswata Talukdar",
    "Saheb Karak",
    "Shalini Badola",
    "Bommareddy Poojitha",
    "Manasi Mandal",
    "Sourav Marik",
    "R. P. Singh",
    "Nashra Pistawala",
    "Luminita Harnagea",
    "Aksa Thomas",
    "Ajay Soni",
    "Subhro Bhattacharjee",
    "Surajit Saha"
  ],
  "submission_date": "2023-07-25T10:42:54+00:00",
  "revised_dates": [],
  "abstract": "Tailoring the quantum many-body interactions in layered materials through appropriate heterostructure engineering can result in emergent properties that are absent in the constituent materials thus promising potential future applications. In this article, we have demonstrated controlling the otherwise robust magnetic properties of transition metal phosphorus trisulphides (Mn/Fe/NiPS3) in their heterostructures with Weyl semimetallic MoTe2 which can be attributed to the Dzyaloshinskii Moriya (DM) interactions at the interface of the two different layered materials. While the DM interaction is known to scale with the strength of the spin-orbit coupling (SOC), we also demonstrate here that the effect of DM interaction strongly varies with the spin orientation/dimensionality of the magnetic layer and the low-energy electronic density of state of the spin-orbit coupled layer. The observations are further supported by a series of experiments on heterostructures with a variety of substrates/underlayers hosting variable SOC and electronic density of states.",
  "categories": [
    "cond-mat.mes-hall",
    "cond-mat.mtrl-sci",
    "physics.atm-clus",
    "quant-ph"
  ],
  "primary_category": "cond-mat.mes-hall",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13400",
  "pdf_url": null,
  "comment": "35 pages, 5 figures (main text), supporting information",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}