{
  "title": "The phase transition for the Gaussian free field is sharp",
  "authors": [
    "Pete Rigas"
  ],
  "submission_date": "2023-07-24T16:33:22+00:00",
  "revised_dates": [
    "2024-03-13T00:10:10+00:00",
    "2024-08-08T00:35:04+00:00"
  ],
  "abstract": "We prove that the phase transition for the Gaussian free field (GFF) is sharp. In comparison to a previous argument due to Rodriguez in 2017 which characterized a $0-1$ law for the Massive Gaussian Free Field by analyzing crossing probabilities below a threshold $h_{**}$, we implement a strategy due to Duminil-Copin and Manolescu in 2016, which establishes that two parameters are equal, one of which encapsulates the probability of obtaining an infinite connected component under free boundary conditions, while the other encapsulates the natural logarithm of the probability of obtaining a connected component from the origin to the box of length $n$ which is also taken under free boundary conditions. We quantify the probability of obtaining crossings in easy and hard directions, without imposing conditions that the graph is invariant with respect to reflections, in addition to making use of a differential inequality adapted for the GFF. The sharpness of the phase transition is characterized by the fact that below a certain height parameter of the GFF, the probability of obtaining an infinite cluster a.s. decays exponentially fast, while above the parameter, the probability of obtaining an infinite cluster occurs a.s. with good probability.",
  "categories": [
    "math.PR",
    "math-ph"
  ],
  "primary_category": "math.PR",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12925",
  "pdf_url": null,
  "comment": "16 pages. Presentation discussing reference material is at: https://www.youtube.com/watch?v=8wH7KbdjkFY. Related topics are at:https://youtu.be/tIO0AwbQp6Q,https://youtu.be/93KhYI8Fy_M,https://youtu.be/PQBB5ENUO-g,https://youtu.be/P1EF54ZF84s,https://youtu.be/SHYwtt81Q3E,https://youtu.be/LM9xakHYAog, https://youtu.be/sdfYV6ESEe8",
  "num_versions": null,
  "size_before_bytes": 211199,
  "size_after_bytes": 214901
}