{
  "title": "Towards a New Interface for Music Listening: A User Experience Study on YouTube",
  "authors": [
    "Ahyeon Choi",
    "Eunsik Shin",
    "Haesun Joung",
    "Joongseek Lee",
    "Kyogu Lee"
  ],
  "submission_date": "2023-07-27T09:19:20+00:00",
  "revised_dates": [],
  "abstract": "In light of the enduring success of music streaming services, it is noteworthy that an increasing number of users are positively gravitating toward YouTube as their preferred platform for listening to music. YouTube differs from typical music streaming services in that they provide a diverse range of music-related videos as well as soundtracks. However, despite the increasing popularity of using YouTube as a platform for music consumption, there is still a lack of comprehensive research on this phenomenon. As independent researchers unaffiliated with YouTube, we conducted semi-structured interviews with 27 users who listen to music through YouTube more than three times a week to investigate its usability and interface satisfaction. Our qualitative analysis found that YouTube has five main meanings for users as a music streaming service: 1) exploring musical diversity, 2) sharing unique playlists, 3) providing visual satisfaction, 4) facilitating user interaction, and 5) allowing free and easy access. We also propose wireframes of a video streaming service for better audio-visual music listening in two stages: search and listening. By these wireframes, we offer practical solutions to enhance user satisfaction with YouTube for music listening. These findings have wider implications beyond YouTube and could inform enhancements in other music streaming services as well.",
  "categories": [
    "cs.HC"
  ],
  "primary_category": "cs.HC",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14718",
  "pdf_url": "https://arxiv.org/pdf/2307.14718v1",
  "comment": "6 pages without reference, 1 figure, 3 tables",
  "num_versions": null,
  "size_before_bytes": 660167,
  "size_after_bytes": 147289
}