{
  "title": "Platinum-based Catalysts for Oxygen Reduction Reaction simulated with a Quantum Computer",
  "authors": [
    "Cono Di Paola",
    "Evgeny Plekhanov",
    "Michal Krompiec",
    "Chandan Kumar",
    "Emanuele Marsili",
    "Fengmin Du",
    "Daniel Weber",
    "Jasper Simon Krauser",
    "Elvira Shishenina",
    "David Muñoz Ramo"
  ],
  "submission_date": "2023-07-28T21:49:00+00:00",
  "revised_dates": [
    "2024-04-12T12:04:32+00:00"
  ],
  "abstract": "Hydrogen has emerged as a promising energy source, holding the key to achieve low-carbon and sustainable mobility. However, its applications are still limited by modest conversion efficiency in the electrocatalytic oxygen reduction reaction (ORR) within fuel cells. Consequently, the development of novel catalysts and a profound understanding of the underlying reactions have become of paramount importance. The complex nature of the ORR potential energy landscape and the presence of strong electronic correlations present challenges to atomistic modelling using classical computers. This scenario opens new avenues for the implementation of novel quantum computing workflows to address these molecular systems. Here, we present a pioneering study that combines classical and quantum computational approaches to investigate the ORR on pure platinum and platinum/cobalt surfaces. Our research demonstrates, for the first time, the feasibility of implementing this workflow on the H1-series trapped-ion quantum computer and identify the challenges of the quantum chemistry modelling of this reaction. The results highlight the involvement of strongly correlated species in the cobalt-containing catalyst, suggesting their potential as ideal candidates for showcasing quantum advantage in future applications.",
  "categories": [
    "quant-ph",
    "cond-mat.mtrl-sci",
    "physics.chem-ph"
  ],
  "primary_category": "quant-ph",
  "doi": "10.1038/s41524-024-01460-x",
  "journal_ref": null,
  "arxiv_id": "2307.15823",
  "pdf_url": "https://arxiv.org/pdf/2307.15823v2",
  "comment": "Main paper: 29 pages, 4 figures, Supplementary Material: 10 pages, 5 figures, 5 tables",
  "num_versions": null,
  "size_before_bytes": 72085714,
  "size_after_bytes": 323529
}