{
  "title": "Fabry-Perot Resonance of Bilayer Metasurfaces",
  "authors": [
    "G. Alagappan",
    "F. J. Garcia-Vidal",
    "C. E. Png"
  ],
  "submission_date": "2023-07-28T09:07:04+00:00",
  "revised_dates": [
    "2024-04-26T23:26:47+00:00"
  ],
  "abstract": "In this study, we constructed a Fabry-Perot cavity with nanostructured, thin resonant metasurfaces as meta-mirrors. We developed a temporal coupled-mode theory and provided an accurate generalization of Fabry-Perot resonance and analytically derived the transmission characteristics. The presence of metasurface mirrors introduces a substantial group delay, causing the field concentration to shift from the center of the Fabry-Perot cavity toward the metasurface region. This shift is accompanied by a significant increase in the quality factor of the FP resonance. In the frequency space, there are singular points where the quality factor increases exponentially. These singular points in meta-mirror cavities exist even when the cavity separations are smaller than the cavity length of the fundamental mode in the standard cavities. We discover two characteristic cavity separations, Lc and LQ, that differentiate the resonance in terms of lineshapes and the dominance of the quality factor. When L < Lc, there is strong evanescent interaction between the two metasurface mirrors, and the coupling of this interaction with the traditional resonance produces sharp Fano-shaped transmission peaks. When Lc < L< LQ, we have induced transparency peaks with lorentzian line-shapes and length-independent quality factors. This length-independence enables, the meta-mirror cavity to outperform the traditional cavities by achiveing high quality factor despite a shorter cavity length.",
  "categories": [
    "physics.optics"
  ],
  "primary_category": "physics.optics",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15414",
  "pdf_url": "https://arxiv.org/pdf/2307.15414v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 3017806,
  "size_after_bytes": 1763785
}