{
  "title": "Implementing and Benchmarking the Locally Competitive Algorithm on the Loihi 2 Neuromorphic Processor",
  "authors": [
    "Gavin Parpart",
    "Sumedh R. Risbud",
    "Garrett T. Kenyon",
    "Yijing Watkins"
  ],
  "submission_date": "2023-07-25T18:43:08+00:00",
  "revised_dates": [],
  "abstract": "Neuromorphic processors have garnered considerable interest in recent years for their potential in energy-efficient and high-speed computing. The Locally Competitive Algorithm (LCA) has been utilized for power efficient sparse coding on neuromorphic processors, including the first Loihi processor. With the Loihi 2 processor enabling custom neuron models and graded spike communication, more complex implementations of LCA are possible. We present a new implementation of LCA designed for the Loihi 2 processor and perform an initial set of benchmarks comparing it to LCA on CPU and GPU devices. In these experiments LCA on Loihi 2 is orders of magnitude more efficient and faster for large sparsity penalties, while maintaining similar reconstruction quality. We find this performance improvement increases as the LCA parameters are tuned towards greater representation sparsity.\n  Our study highlights the potential of neuromorphic processors, particularly Loihi 2, in enabling intelligent, autonomous, real-time processing on small robots, satellites where there are strict SWaP (small, lightweight, and low power) requirements. By demonstrating the superior performance of LCA on Loihi 2 compared to conventional computing device, our study suggests that Loihi 2 could be a valuable tool in advancing these types of applications. Overall, our study highlights the potential of neuromorphic processors for efficient and accurate data processing on resource-constrained devices.",
  "categories": [
    "cs.CV",
    "cs.AR"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13762",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1395510,
  "size_after_bytes": 174908
}