{
  "title": "A quantitative phase-field model for void evolution in defect supersaturated environments: a novel introduction of defect reaction asymmetry",
  "authors": [
    "Sreekar Rayaprolu",
    "Kyle Starkey",
    "Anter El-Azab"
  ],
  "submission_date": "2023-07-28T15:36:10+00:00",
  "revised_dates": [],
  "abstract": "Voids develop in crystalline materials under energetic particle irradiation, as in nuclear reactors. Understanding the underlying mechanisms of void nucleation and growth is of utmost importance as it leads to dimensional instability of the metallic materials. In the past two decades, researchers have adopted the phase-field approach to study the phenomena of void evolution under irradiation. The approach involves modeling the boundary between the void and matrix with a diffused interface. However, none of the existing models are quantitative in nature. This work introduces a thermodynamically consistent, quantitative diffuse interface model based on KKS formalism to describe the void evolution under irradiation. The model concurrently considers both vacancies and self-interstitials in the description of void evolution. Unique to our model is the presence of two mobility parameters in the equation of motion of the phase-field variable. The two mobility parameters relate the driving force for vacancy and self-interstitial interaction to the interface motion, analogous to dislocation motion through climb and glide processes. The asymptotic matching of the phase-field model with the sharp-interface theory fixes the two mobility parameters in terms of the material parameters in the sharp-interface model. The Landau coefficient, which controls the height of the double-well function in the phase field variable, and the gradient coefficient of the phase field variable are fixed based on the interfacial energy and interface width of the boundary. With all the parameters in the model determined in terms of the material parameters, we thus have a new phase field model for void evolution. Simple test cases will show the void evolution under various defect supersaturation to validate our new phase-field model.",
  "categories": [
    "cond-mat.mtrl-sci",
    "physics.comp-ph"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15626",
  "pdf_url": "https://arxiv.org/pdf/2307.15626v2",
  "comment": "We have developed a much better version of this work. The derivation of the phase-field model in the arxiv version is incorrect. Also, we did not expand on the different contributions to the heat flux. Moreover, we have now developed a new numerical strategy to solve the equations using the KKS model. So, for the aforementioned reasons, we request the arxiv to withdraw this article",
  "num_versions": null,
  "size_before_bytes": 915041,
  "size_after_bytes": 555707
}