{
  "title": "Precise determination of $^{210}$Pb $β$ Decay Spectrum at 0 keV and its Implication to Theoretical Calculations",
  "authors": [
    "Shuo Zhang",
    "Xavier Mougeot",
    "Hao-Ran Liu",
    "Ke Han",
    "Tao Sun",
    "Wen-Tao Wu",
    "Robin Cantor",
    "Jing-Kai Xia",
    "Jun-Cheng Liang",
    "Fu-You Fan",
    "Bing-Jun Wu",
    "Le Zhang",
    "Ming-Yu Ge",
    "XiaoPeng Zhou",
    "Zhi Liu"
  ],
  "submission_date": "2023-07-30T17:08:33+00:00",
  "revised_dates": [],
  "abstract": "The atomic exchange effect will lead to a significant increase in the probability density of $β$ decays below a few keV. This effect is very important for scientific experiments that performed by low-energy electron spectroscopy measurements. However, the atomic exchange effect involves multi-electron interactions, especially for a system with 82 electrons such as lead. Different parameters will lead to different trends in the energy spectrum predicted by the theory, so it is urgent to carry out experimental measurements to provide parameter limits for the theory. The probability increase brought about by the atomic exchange effect is most obvious near 0keV, and the $β$ energy spectrum is accurately measured near this energy point, so as to provide constraints for the physical model of atomic exchange. However, it is extremely difficult to measure the $β$ energy spectrum at 0keV due to the limitations of electronic noise and internal conversion effects. The excited decay path of $^{210}$Pb was taken as the observation object,by measuring the total energy spectrum of $β$ rays and cascaded gamma rays, the precise measurement of the $β$ energy spectrum near 0keV has been completed. The analysis of the $β$ energy spectrum of $^{210}$Pb gives the following conclusions. The experimental results first verified the theory that the exchange effect causes the probability increase at the low energy end near 0keV. At the same time, the experimental results are higher than the existing predictions of the atomic exchange effect. At least for Pb element, all the electron shells have played a role in improving the probability density of the low end of the $β$ energy spectrum. This discovery will promote the theoretical calculation of the $β$ energy spectrum of $^{214}$Pb, at the same time, it also indicates that the reactor neutrinos have a higher probability density at the omnipotent end.",
  "categories": [
    "nucl-ex",
    "nucl-th"
  ],
  "primary_category": "nucl-ex",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16276",
  "pdf_url": "https://arxiv.org/pdf/2307.16276v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 7491115,
  "size_after_bytes": 41467
}