{
  "title": "Downstream-agnostic Adversarial Examples",
  "authors": [
    "Ziqi Zhou",
    "Shengshan Hu",
    "Ruizhi Zhao",
    "Qian Wang",
    "Leo Yu Zhang",
    "Junhui Hou",
    "Hai Jin"
  ],
  "submission_date": "2023-07-23T10:16:47+00:00",
  "revised_dates": [
    "2023-08-15T00:40:06+00:00"
  ],
  "abstract": "Self-supervised learning usually uses a large amount of unlabeled data to pre-train an encoder which can be used as a general-purpose feature extractor, such that downstream users only need to perform fine-tuning operations to enjoy the benefit of \"large model\". Despite this promising prospect, the security of pre-trained encoder has not been thoroughly investigated yet, especially when the pre-trained encoder is publicly available for commercial use.\n  In this paper, we propose AdvEncoder, the first framework for generating downstream-agnostic universal adversarial examples based on the pre-trained encoder. AdvEncoder aims to construct a universal adversarial perturbation or patch for a set of natural images that can fool all the downstream tasks inheriting the victim pre-trained encoder. Unlike traditional adversarial example works, the pre-trained encoder only outputs feature vectors rather than classification labels. Therefore, we first exploit the high frequency component information of the image to guide the generation of adversarial examples. Then we design a generative attack framework to construct adversarial perturbations/patches by learning the distribution of the attack surrogate dataset to improve their attack success rates and transferability. Our results show that an attacker can successfully attack downstream tasks without knowing either the pre-training dataset or the downstream dataset. We also tailor four defenses for pre-trained encoders, the results of which further prove the attack ability of AdvEncoder.",
  "categories": [
    "cs.CV"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12280",
  "pdf_url": null,
  "comment": "This paper has been accepted by the International Conference on Computer Vision (ICCV '23, October 2--6, 2023, Paris, France)",
  "num_versions": null,
  "size_before_bytes": 6004156,
  "size_after_bytes": 524696
}