{
  "title": "Uncertainty-Encoded Multi-Modal Fusion for Robust Object Detection in Autonomous Driving",
  "authors": [
    "Yang Lou",
    "Qun Song",
    "Qian Xu",
    "Rui Tan",
    "Jianping Wang"
  ],
  "submission_date": "2023-07-30T04:00:41+00:00",
  "revised_dates": [],
  "abstract": "Multi-modal fusion has shown initial promising results for object detection of autonomous driving perception. However, many existing fusion schemes do not consider the quality of each fusion input and may suffer from adverse conditions on one or more sensors. While predictive uncertainty has been applied to characterize single-modal object detection performance at run time, incorporating uncertainties into the multi-modal fusion still lacks effective solutions due primarily to the uncertainty's cross-modal incomparability and distinct sensitivities to various adverse conditions. To fill this gap, this paper proposes Uncertainty-Encoded Mixture-of-Experts (UMoE) that explicitly incorporates single-modal uncertainties into LiDAR-camera fusion. UMoE uses individual expert network to process each sensor's detection result together with encoded uncertainty. Then, the expert networks' outputs are analyzed by a gating network to determine the fusion weights. The proposed UMoE module can be integrated into any proposal fusion pipeline. Evaluation shows that UMoE achieves a maximum of 10.67%, 3.17%, and 5.40% performance gain compared with the state-of-the-art proposal-level multi-modal object detectors under extreme weather, adversarial, and blinding attack scenarios.",
  "categories": [
    "cs.CV",
    "cs.AI"
  ],
  "primary_category": "cs.CV",
  "doi": "10.3233/FAIA230441",
  "journal_ref": null,
  "arxiv_id": "2307.16121",
  "pdf_url": "https://arxiv.org/pdf/2307.16121v1",
  "comment": "In proceedings of the 26th European Conference on Artificial Intelligence ECAI 2023. 8 pages + 2 appendix pages",
  "num_versions": null,
  "size_before_bytes": 1258037,
  "size_after_bytes": 156513
}