{
  "title": "SusTrainable: Promoting Sustainability as a Fundamental Driver in Software Development Training and Education. 2nd Teacher Training, January 23-27, 2023, Pula, Croatia. Revised lecture notes",
  "authors": [
    "Tihana Galinac Grbac",
    "Csaba Szabó",
    "João Paulo Fernandes"
  ],
  "submission_date": "2023-07-24T22:46:00+00:00",
  "revised_dates": [],
  "abstract": "This volume exhibits the revised lecture notes of the 2nd teacher training organized as part of the project Promoting Sustainability as a Fundamental Driver in Software Development Training and Education, held at the Juraj Dobrila University of Pula, Croatia, in the week January 23-27, 2023. It is the Erasmus+ project No. 2020-1-PT01-KA203-078646 - Sustrainable. More details can be found at the project web site https://sustrainable.github.io/\n  One of the most important contributions of the project are two summer schools. The 2nd SusTrainable Summer School (SusTrainable - 23) will be organized at the University of Coimbra, Portugal, in the week July 10-14, 2023. The summer school will consist of lectures and practical work for master and PhD students in computing science and closely related fields. There will be contributions from Babeş-Bolyai University, Eötvös Loránd University, Juraj Dobrila University of Pula, Radboud University Nijmegen, Roskilde University, Technical University of Košice, University of Amsterdam, University of Coimbra, University of Minho, University of Plovdiv, University of Porto, University of Rijeka.\n  To prepare and streamline the summer school, the consortium organized a teacher training in Pula, Croatia. This was an event of five full days, organized by Tihana Galinac Grbac and Neven Grbac. The Juraj Dobrila University of Pula is very concerned with the sustainability issues. The education, research and management are conducted with sustainability goals in mind.\n  The contributions in the proceedings were reviewed and provide a good overview of the range of topics that will be covered at the summer school. The papers in the proceedings, as well as the very constructive and cooperative teacher training, guarantee the highest quality and beneficial summer school for all participants.",
  "categories": [
    "cs.CY",
    "cs.SE"
  ],
  "primary_category": "cs.CY",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13156",
  "pdf_url": null,
  "comment": "85 pages, 8 figures, 3 code listings and 1 table; editors: Tihana Galinac Grbac, Csaba Szabó, João Paulo Fernandes",
  "num_versions": null,
  "size_before_bytes": 793108,
  "size_after_bytes": 335072
}