{
  "title": "Leptohadronic Multimessenger Modeling of 324 Gamma-Ray Blazars",
  "authors": [
    "Xavier Rodrigues",
    "Vaidehi S. Paliya",
    "Simone Garrappa",
    "Anastasiia Omeliukh",
    "Anna Franckowiak",
    "Walter Winter"
  ],
  "submission_date": "2023-07-24T18:00:00+00:00",
  "revised_dates": [
    "2024-03-04T01:35:13+00:00",
    "2024-03-05T06:35:42+00:00"
  ],
  "abstract": "The origin of the diffuse astrophysical neutrino flux observed by the IceCube experiment is still under debate. In recent years there have been associations of neutrino events with individual blazars, which are active galaxies with relativistic jets pointing toward Earth, such as the source TXS 0506+056. From a theoretical perspective, the properties of these sources as neutrino emitters are not yet well understood. In this work we model a sample of 324 blazars detected by the Fermi Large Area Telescope (LAT), most of which are flat-spectrum radio quasars (FSRQs). This amounts to 34% of all FSRQs in the latest Fermi catalog. By numerically modelling the interactions of cosmic-ray electrons and protons, we explain the emitted multi-wavelength fluxes from each source and self-consistently predict the emitted neutrino spectrum. We demonstrate that the optical and GeV gamma-ray broadband features are generally well described by electron emission. For 33% of the blazars in our sample, a description of the observed X-ray spectrum benefits from an additional component from proton interactions, in agreement with recent studies of individual IceCube candidate blazars. We conclude that blazars that are brighter in GeV gamma rays tend to have a higher neutrino production efficiency but a lower best-fit baryonic loading. The predicted neutrino luminosity shows a positive correlation with the observed GeV gamma-ray flux and with the predicted MeV gamma-ray flux. By extrapolating the results for this sample, we show that the diffuse neutrino flux from the population of gamma-ray-bright blazars may be at the level of about 20% of the IceCube flux, in agreement with current limits from stacking analyses. We discuss the implications of our results for future neutrino searches and suggest promising sources for potential detections with future experiments.",
  "categories": [
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.HE",
  "doi": "10.1051/0004-6361/202347540",
  "journal_ref": "Astron. Astrophys. 681, A119 (2024)",
  "arxiv_id": "2307.13024",
  "pdf_url": null,
  "comment": "Published in A&A. Model parameters and results available in full at https://github.com/xrod/lephad-blazars",
  "num_versions": null,
  "size_before_bytes": 17738015,
  "size_after_bytes": 965222
}