{
  "title": "Constraining neutron star properties and dark matter admixture with the NITR-I equation of state: Insights from observations and universal relations",
  "authors": [
    "Pinku Routaray",
    "H C Das",
    "Jeet Amrit Pattnaik",
    "Bharat Kumar"
  ],
  "submission_date": "2023-07-24T12:38:39+00:00",
  "revised_dates": [
    "2024-11-27T01:30:09+00:00"
  ],
  "abstract": "A recent observational study has constrained the maximum mass of neutron stars (NSs), with particular attention to PSR J0952-0607 and the compact star remnant HESS J1731-347, especially in the low-mass regime. Building on our earlier work, which developed the NITR energy density functional (EDF) to reproduce the mass limit of PSR J0952-0607 but did not satisfy other observational constraints, this study introduces a refined EDF named ``NITR-I\". NITR-I successfully reconciles the PSR J0952-0607 mass limit with observational data, including radius measurements from NICER+XMM and tidal deformability constraints from GW170817, demonstrating its robustness. The low-mass constraint associated with HESS J1731-347 indicates diverse NS compositions. Since NITR-I alone cannot satisfy this constraint, we explore the role of dark matter (DM) within NSs to bridge the gap. Incorporating DM, particularly at specific Fermi momentum values, enables the model to address this constraint. We further analyze the influence of DM on various NS properties, such as tidal deformability and non-radial $f$-mode oscillations, across multiple relativistic mean-field models. The presence of DM suggests a reduction in tidal deformability and shifts in oscillation frequencies, potentially offering detectable signatures in gravitational wave observations from neutron star mergers. Additionally, we investigate universal relations (URs) for DM-admixed NSs, focusing on correlations such as compactness versus tidal deformability and $f$-mode frequency versus tidal deformability. Canonical values for these properties are estimated using GW170817 data, offering further insights into the structure and composition of neutron stars.",
  "categories": [
    "math.NA",
    "astro-ph.HE",
    "nucl-th"
  ],
  "primary_category": "math.NA",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12748",
  "pdf_url": null,
  "comment": "Published in IJMPE",
  "num_versions": null,
  "size_before_bytes": 4960643,
  "size_after_bytes": 588814
}