{
  "title": "RCT Rejection Sampling for Causal Estimation Evaluation",
  "authors": [
    "Katherine A. Keith",
    "Sergey Feldman",
    "David Jurgens",
    "Jonathan Bragg",
    "Rohit Bhattacharya"
  ],
  "submission_date": "2023-07-27T20:11:07+00:00",
  "revised_dates": [
    "2023-11-27T14:35:05+00:00",
    "2024-01-31T12:40:40+00:00"
  ],
  "abstract": "Confounding is a significant obstacle to unbiased estimation of causal effects from observational data. For settings with high-dimensional covariates -- such as text data, genomics, or the behavioral social sciences -- researchers have proposed methods to adjust for confounding by adapting machine learning methods to the goal of causal estimation. However, empirical evaluation of these adjustment methods has been challenging and limited. In this work, we build on a promising empirical evaluation strategy that simplifies evaluation design and uses real data: subsampling randomized controlled trials (RCTs) to create confounded observational datasets while using the average causal effects from the RCTs as ground-truth. We contribute a new sampling algorithm, which we call RCT rejection sampling, and provide theoretical guarantees that causal identification holds in the observational data to allow for valid comparisons to the ground-truth RCT. Using synthetic data, we show our algorithm indeed results in low bias when oracle estimators are evaluated on the confounded samples, which is not always the case for a previously proposed algorithm. In addition to this identification result, we highlight several finite data considerations for evaluation designers who plan to use RCT rejection sampling on their own datasets. As a proof of concept, we implement an example evaluation pipeline and walk through these finite data considerations with a novel, real-world RCT -- which we release publicly -- consisting of approximately 70k observations and text data as high-dimensional covariates. Together, these contributions build towards a broader agenda of improved empirical evaluation for causal estimation.",
  "categories": [
    "cs.AI",
    "cs.CL",
    "cs.LG",
    "stat.ME"
  ],
  "primary_category": "cs.AI",
  "doi": null,
  "journal_ref": "Transactions on Machine Learning Research (TMLR) 2023",
  "arxiv_id": "2307.15176",
  "pdf_url": "https://arxiv.org/pdf/2307.15176v3",
  "comment": "Code and data at https://github.com/kakeith/rct_rejection_sampling",
  "num_versions": null,
  "size_before_bytes": 7956039,
  "size_after_bytes": 3032309
}