{
  "title": "Synchronizability in randomized weighted simplicial complexes",
  "authors": [
    "S. Nirmala Jenifer",
    "Dibakar Ghosh",
    "Paulsamy Muruganandam"
  ],
  "submission_date": "2023-07-30T08:16:59+00:00",
  "revised_dates": [
    "2024-02-21T06:19:53+00:00",
    "2024-04-10T06:28:46+00:00"
  ],
  "abstract": "We present a formula for determining synchronizability in large, randomized and weighted simplicial complexes. This formula leverages eigenratios and costs to assess complete synchronizability under diverse network topologies and intensity distributions. We systematically vary coupling strengths (pairwise and three-body), degree and intensity distributions to identify the synchronizability of these simplicial complexes of the identical oscillators with natural coupling. We focus on randomized weighted connections with diffusive couplings and check synchronizability for different cases. For all these scenarios, eigenratios and costs reliably gauge synchronizability, eliminating the need for explicit connectivity matrices and eigenvalue calculations. This efficient approach offers a general formula for manipulating synchronizability in diffusively coupled identical systems with higher-order interactions simply by manipulating degrees, weights, and coupling strengths. We validate our findings with simplicial complexes of Rössler oscillators and confirm that the results are independent of the number of oscillators, connectivity components and distributions of degrees and intensities. Finally, we validate the theory by considering a real-world connection topology using chaotic Rössler oscillators.",
  "categories": [
    "nlin.AO"
  ],
  "primary_category": "nlin.AO",
  "doi": "10.1103/PhysRevE.109.054302",
  "journal_ref": "Physical Review E 109, 054302 (2024)",
  "arxiv_id": "2307.16163",
  "pdf_url": "https://arxiv.org/pdf/2307.16163v3",
  "comment": "11 pages, 8 figures, accepted for publication in Phys. Rev. E",
  "num_versions": null,
  "size_before_bytes": 2417775,
  "size_after_bytes": 187656
}