{
  "title": "Touch if it's transparent! ACTOR: Active Tactile-based Category-Level Transparent Object Reconstruction",
  "authors": [
    "Prajval Kumar Murali",
    "Bernd Porr",
    "Mohsen Kaboli"
  ],
  "submission_date": "2023-07-30T15:22:12+00:00",
  "revised_dates": [],
  "abstract": "Accurate shape reconstruction of transparent objects is a challenging task due to their non-Lambertian surfaces and yet necessary for robots for accurate pose perception and safe manipulation. As vision-based sensing can produce erroneous measurements for transparent objects, the tactile modality is not sensitive to object transparency and can be used for reconstructing the object's shape. We propose ACTOR, a novel framework for ACtive tactile-based category-level Transparent Object Reconstruction. ACTOR leverages large datasets of synthetic object with our proposed self-supervised learning approach for object shape reconstruction as the collection of real-world tactile data is prohibitively expensive. ACTOR can be used during inference with tactile data from category-level unknown transparent objects for reconstruction. Furthermore, we propose an active-tactile object exploration strategy as probing every part of the object surface can be sample inefficient. We also demonstrate tactile-based category-level object pose estimation task using ACTOR. We perform an extensive evaluation of our proposed methodology with real-world robotic experiments with comprehensive comparison studies with state-of-the-art approaches. Our proposed method outperforms these approaches in terms of tactile-based object reconstruction and object pose estimation.",
  "categories": [
    "cs.RO"
  ],
  "primary_category": "cs.RO",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16254",
  "pdf_url": "https://arxiv.org/pdf/2307.16254v1",
  "comment": "Accepted for publication at IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS 2023)",
  "num_versions": null,
  "size_before_bytes": 21043251,
  "size_after_bytes": 719404
}