{
  "title": "One for Multiple: Physics-informed Synthetic Data Boosts Generalizable Deep Learning for Fast MRI Reconstruction",
  "authors": [
    "Zi Wang",
    "Xiaotong Yu",
    "Chengyan Wang",
    "Weibo Chen",
    "Jiazheng Wang",
    "Ying-Hua Chu",
    "Hongwei Sun",
    "Rushuai Li",
    "Peiyong Li",
    "Fan Yang",
    "Haiwei Han",
    "Taishan Kang",
    "Jianzhong Lin",
    "Chen Yang",
    "Shufu Chang",
    "Zhang Shi",
    "Sha Hua",
    "Yan Li",
    "Juan Hu",
    "Liuhong Zhu",
    "Jianjun Zhou",
    "Meijing Lin",
    "Jiefeng Guo",
    "Congbo Cai",
    "Zhong Chen",
    "Di Guo",
    "Guang Yang",
    "Xiaobo Qu"
  ],
  "submission_date": "2023-07-25T03:11:24+00:00",
  "revised_dates": [],
  "abstract": "Magnetic resonance imaging (MRI) is a widely used radiological modality renowned for its radiation-free, comprehensive insights into the human body, facilitating medical diagnoses. However, the drawback of prolonged scan times hinders its accessibility. The k-space undersampling offers a solution, yet the resultant artifacts necessitate meticulous removal during image reconstruction. Although Deep Learning (DL) has proven effective for fast MRI image reconstruction, its broader applicability across various imaging scenarios has been constrained. Challenges include the high cost and privacy restrictions associated with acquiring large-scale, diverse training data, coupled with the inherent difficulty of addressing mismatches between training and target data in existing DL methodologies. Here, we present a novel Physics-Informed Synthetic data learning framework for Fast MRI, called PISF. PISF marks a breakthrough by enabling generalized DL for multi-scenario MRI reconstruction through a single trained model. Our approach separates the reconstruction of a 2D image into many 1D basic problems, commencing with 1D data synthesis to facilitate generalization. We demonstrate that training DL models on synthetic data, coupled with enhanced learning techniques, yields in vivo MRI reconstructions comparable to or surpassing those of models trained on matched realistic datasets, reducing the reliance on real-world MRI data by up to 96%. Additionally, PISF exhibits remarkable generalizability across multiple vendors and imaging centers. Its adaptability to diverse patient populations has been validated through evaluations by ten experienced medical professionals. PISF presents a feasible and cost-effective way to significantly boost the widespread adoption of DL in various fast MRI applications.",
  "categories": [
    "eess.IV",
    "cs.AI",
    "physics.med-ph"
  ],
  "primary_category": "eess.IV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13220",
  "pdf_url": null,
  "comment": "38 pages, 19 figures, 5 tables",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}