{
  "title": "Deep learning-based radiointerferometric imaging with GAN-aided training",
  "authors": [
    "F. Geyer",
    "K. Schmidt",
    "J. Kummer",
    "M. Brüggen",
    "H. W. Edler",
    "D. Elsässer",
    "F. Griese",
    "A. Poggenpohl",
    "L. Rustige",
    "W. Rhode"
  ],
  "submission_date": "2023-07-26T11:00:22+00:00",
  "revised_dates": [
    "2024-12-19T01:40:52+00:00"
  ],
  "abstract": "Radio interferometry invariably suffers from an incomplete coverage of the spatial Fourier space, which leads to imaging artifacts. The current state-of-the-art technique is to create an image by Fourier-transforming the incomplete visibility data and to clean the systematic effects originating from incomplete data in Fourier space. Previously, we have shown how super-resolution methods based on convolutional neural networks can reconstruct sparse visibility data. Our previous work has suffered from a low realism of the training data. The aim of this work is to build a whole simulation chain for realistic radio sources that then leads to a vastly improved neural net for the reconstruction of missing visibilities. This method offers considerable improvements in terms of speed, automatization and reproducibility over the standard techniques. Here we generate large amounts of training data by creating images of radio galaxies with a generative adversarial network (GAN) that has been trained on radio survey data. Then, we applied the Radio Interferometer Measurement Equation (RIME) in order to simulate the measurement process of a radio interferometer. We show that our neural network can reconstruct faithfully images of realistic radio galaxies. The reconstructed images agree well with the original images in terms of the source area, integrated flux density, peak flux density, and the multi-scale structural similarity index. Finally, we show how the neural net can be adapted to estimate the uncertainties in the imaging process.",
  "categories": [
    "astro-ph.IM"
  ],
  "primary_category": "astro-ph.IM",
  "doi": "10.1051/0004-6361/202347073",
  "journal_ref": "A&A 677, A167 (2023)",
  "arxiv_id": "2307.14100",
  "pdf_url": null,
  "comment": "Accepted for publication in Astronomy & Astrophysics",
  "num_versions": null,
  "size_before_bytes": 9639090,
  "size_after_bytes": 374487
}