{
  "title": "DESI-253.2534+26.8843: A New Einstein Cross Spectroscopically Confirmed with VLT/MUSE and Modeled with GIGA-Lens",
  "authors": [
    "Aleksandar Cikota",
    "Ivonne Toro Bertolla",
    "Xiaosheng Huang",
    "Saul Baltasar",
    "Nicolas Ratier-Werbin",
    "William Sheu",
    "Christopher Storfer",
    "Nao Suzuki",
    "David J. Schlegel",
    "Regis Cartier",
    "Simon Torres",
    "Stefan Cikota",
    "Eric Jullo"
  ],
  "submission_date": "2023-07-24T01:49:19+00:00",
  "revised_dates": [],
  "abstract": "Gravitational lensing provides unique insights into astrophysics and cosmology, including the determination of galaxy mass profiles and constraining cosmological parameters. We present spectroscopic confirmation and lens modeling of the strong lensing system DESI-253.2534+26.8843, discovered in the Dark Energy Spectroscopic Instrument (DESI) Legacy Imaging Surveys data. This system consists of a massive elliptical galaxy surrounded by four blue images forming an Einstein Cross pattern. We obtained spectroscopic observations of this system using the Multi Unit Spectroscopic Explorer (MUSE) on ESO's Very Large Telescope (VLT) and confirmed its lensing nature. The main lens, which is the elliptical galaxy, has a redshift of $z_{L1} = 0.636\\pm 0.001$, while the spectra of the background source images are typical of a starburst galaxy and have a redshift of $z_s = 2.597 \\pm 0.001$. Additionally, we identified a faint galaxy foreground of one of the lensed images, with a redshift of $z_{L2} = 0.386$. We employed the GIGA-Lens modeling code to characterize this system and determined the Einstein radius of the main lens to be $θ_{E} =2.520{''}_{-0.031}^{+0.032}$, which corresponds to a velocity dispersion of $σ$ = 379 $\\pm$ 2 km s$^{-1}$. Our study contributes to a growing catalog of this rare kind of strong lensing systems and demonstrates the effectiveness of spectroscopic integral field unit observations and advanced modeling techniques in understanding the properties of these systems.",
  "categories": [
    "astro-ph.GA",
    "astro-ph.CO"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.3847/2041-8213/ace9da",
  "journal_ref": null,
  "arxiv_id": "2307.12470",
  "pdf_url": null,
  "comment": "Accepted for publication in ApJL",
  "num_versions": null,
  "size_before_bytes": 5303303,
  "size_after_bytes": 896050
}