{
  "title": "CEERS MIRI Imaging: Data Reduction and Quality Assessment",
  "authors": [
    "Guang Yang",
    "Casey Papovich",
    "Micaela Bagley",
    "Henry Ferguson",
    "Steven Finkelstein",
    "Anton Koekemoer",
    "Pablo Pérez-González",
    "Pablo Arrabal Haro",
    "Laura Bisigello",
    "Karina Caputi",
    "Yingjie Cheng",
    "Luca Costantin",
    "Mark Dickinson",
    "Adriano Fontana",
    "Jonathan Gardner",
    "Andrea Grazian",
    "Norman Grogin",
    "Santosh Harish",
    "Benne Holwerda",
    "Edoardo Iani",
    "Jeyhan Kartaltepe",
    "Lisa Kewley",
    "Allison Kirkpatrick",
    "Dale Kocevski",
    "Vasily Kokorev",
    "Jennifer M. Lotz",
    "Ray Lucas",
    "Rafael Navarro-Carrera",
    "Laura Pentericci",
    "Norbert Pirzkal",
    "Swara Ravindranath",
    "Pierluigi Rinaldi",
    "Lu Shen",
    "Rachel Somerville",
    "Jonathan Trump",
    "Alexander de la Vega",
    "Stephen Wilkins",
    "L Y Aaron Yung"
  ],
  "submission_date": "2023-07-26T21:19:07+00:00",
  "revised_dates": [
    "2023-09-18T00:15:37+00:00"
  ],
  "abstract": "The Cosmic Evolution Early Release Science Survey (CEERS), targeting the Extended Groth Strip extragalactic field, is one of the JWST Director's Discretionary Early Release Science programs. To date, all observations have been executed and include NIRCam/MIRI imaging and NIRSpec/NIRCam spectroscopic exposures. Here, we discuss the MIRI imaging, which includes eight pointings, four of which provide deep imaging with the bluer bands (F560W, F770W) and four with contiguous wavelength coverage in F1000W, F1280W, F1500W, and F1800W, where two of these also include coverage in F770W and F2100W. We present a summary of the data, the data quality, and data reduction. The data reduction is based on the JWST Calibration Pipeline combined with custom modifications and additional steps designed to enhance the output quality, including improvements in astrometry and the removal of detector artifacts. We estimate the image depth of the reduced mosaics, and show that these generally agree with expectations from the Exposure Time Calculator. We compare the MIRI F560W and F770W flux densities for bright sources to measurements from Spitzer/IRAC Ch3 (5.8 $μ$m) and Ch4 (8.0 $μ$m), and we find that they agree with systematic differences of $<0.1$ mag. For the redder MIRI bands, we assess their quality by studying the spectral energy distributions (SEDs) of Galactic stars. The SEDs are consistent with the expected Rayleigh-Jeans law with a deviation $\\sim 0.03$ mag, indicating that the MIRI colors are reliable. We also discuss all publicly released data products (images and source catalogs), which are available on the CEERS website (https://ceers.github.io/).",
  "categories": [
    "astro-ph.GA",
    "astro-ph.IM"
  ],
  "primary_category": "astro-ph.GA",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14509",
  "pdf_url": null,
  "comment": "17 pages, 11 figures, and 4 tables. ApJL in press",
  "num_versions": null,
  "size_before_bytes": 18125480,
  "size_after_bytes": 2947452
}