{
  "title": "Evidence for Two Dimensional Anisotropic Luttinger Liquids at Millikelvin Temperatures",
  "authors": [
    "Guo Yu",
    "Pengjie Wang",
    "Ayelet J. Uzan",
    "Yanyu Jia",
    "Michael Onyszczak",
    "Ratnadwip Singha",
    "Xin Gui",
    "Tiancheng Song",
    "Yue Tang",
    "Kenji Watanabe",
    "Takashi Taniguchi",
    "Robert J. Cava",
    "Leslie M. Schoop",
    "Sanfeng Wu"
  ],
  "submission_date": "2023-07-29T03:58:27+00:00",
  "revised_dates": [],
  "abstract": "While Landau's Fermi liquid theory provides the standard description for two- and three-dimensional (2D/3D) conductors, the physics of interacting one-dimensional (1D) conductors is governed by the distinct Luttinger liquid (LL) theory. Can a LL-like state, in which electronic excitations are fractionalized modes, emerge in a 2D system as a stable zero-temperature phase? This long-standing question, first brought up by Anderson decades ago, is crucial in the study of non-Fermi liquids but remains unsettled. A recent experiment identified a moiré superlattice of twisted bilayer tungsten ditelluride (tWTe_2) with a small interlayer twist angle as a 2D host of the LL physics at temperatures of a few kelvins. Here we report experimental evidence for a 2D anisotropic LL state in a substantially reduced temperature regime, down to at least 50 mK, spontaneously formed in a tWTe_2 system with a twist angle of ~ 3 degree. While the system is metallic-like and nearly isotropic above 2 K, a dramatically enhanced electronic anisotropy develops in the millikelvin regime, featuring distinct transport behaviors along two orthogonal in-plane directions. In the strongly anisotropic phase, we observe transport characteristics of a 2D LL phase, i.e., the universal power law scaling behaviors in across-wire conductance and a zero-bias dip in the differential resistance along the wire direction. Our results represent a step forward in the search for stable LL physics beyond 1D and related unconventional quantum matter.",
  "categories": [
    "cond-mat.mes-hall",
    "cond-mat.mtrl-sci",
    "cond-mat.str-el"
  ],
  "primary_category": "cond-mat.mes-hall",
  "doi": "10.1038/s41467-023-42821-2",
  "journal_ref": "Nature Communications 14, 7025 (2023)",
  "arxiv_id": "2307.15881",
  "pdf_url": "https://arxiv.org/pdf/2307.15881v1",
  "comment": "24 pages, 4 main figures and 10 extended data figures",
  "num_versions": null,
  "size_before_bytes": 3593766,
  "size_after_bytes": 2187904
}