{
  "title": "High efficiency coupling of free electrons to sub-$λ^3$ modal volume, high-Q photonic cavities",
  "authors": [
    "Malo Bézard",
    "Imène Si Hadj Mohand",
    "Luigi Ruggierio",
    "Arthur Le Roux",
    "Yves Auad",
    "Paul Baroux",
    "Luiz H. G. Tizei",
    "Xavier Chécoury",
    "Mathieu Kociak"
  ],
  "submission_date": "2023-07-28T13:50:44+00:00",
  "revised_dates": [],
  "abstract": "We report on the design, realization and experimental investigation by spatially resolved monochromated electron energy loss spectroscopy (EELS) of high quality factor cavities with modal volumes smaller than $λ^3$, with $λ$ the free-space wavelength of light. The cavities are based on a slot defect in a 2D photonic crystal slab made up of silicon. They are optimized for high coupling of electrons accelerated to 100 kV, to quasi-Transverse Electrical modes polarized along the slot direction. We studied the cavities in two geometries. The first geometry, for which the cavities have been designed, corresponds to an electron beam travelling along the slot direction. The second consists in the electron beam travelling perpendicular to the slab. In both cases, a large series of modes is identified. The dielectric slot modes energies are measured to be in the 0.8- 0.85 eV range, as per design, and surrounded by two bands of dielectric and air modes of the photonic structure. The dielectric even slot modes, to which the cavity mode belongs, are highly coupled to the electrons with up to 3.2$\\%$ probability of creating a slot photon per incident electron. Although the experimental spectral resolution (around 30 meV) alone does not allow to disentangle cavity photons from other slot photons, the remarkable agreement between the experiments and FDTD simulations permits us to deduce that amongst the photons created in the slot, around 30$\\%$ are stored in the cavity mode. A systematic study of the energy and coupling strength as a function of the photonic band gap parameters permits to foresee increase of coupling strength by fine-tuning phase matching. Our work demonstrates free electron coupling to high quality factor cavities with low mode density, sub-$λ^3$ modal volume, making it an excellent candidate for applications such as quantum nano-optics with free electrons.",
  "categories": [
    "physics.optics"
  ],
  "primary_category": "physics.optics",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15556",
  "pdf_url": "https://arxiv.org/pdf/2307.15556v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 2810238,
  "size_after_bytes": 338056
}