{
  "title": "High Speed Precise Refractive Index Modification for Photonic Chips through Phase Aberrated Pulsed Lasers",
  "authors": [
    "Bangshan Sun",
    "Simon Moser",
    "Alexander Jesacher",
    "Patrick S. Salter",
    "Robert R. Thomson",
    "Martin J. Booth"
  ],
  "submission_date": "2023-07-26T18:49:13+00:00",
  "revised_dates": [],
  "abstract": "Integrated photonic chips have significant potential in telecommunications, classic computing, quantum systems, and topological photonics. Direct laser writing offers unique capability for creating three-dimensional photonic devices in an optical glass chip with quick prototyping. However, existing laser writing schemes cannot create index-modified structures in glass that precisely match the laser focal shape while also achieving high scanning speed and high refractive index contrast. Here, we introduce the theory of a refractive index modification scheme that combines the advantages of both traditional non-thermal and thermal regime fabrication methods. We also propose a model of waveguide formation that was verified through a thorough study on the effects of phase aberrations on the laser focus. The presented new photonic chip fabrication scheme uses a novel focal intensity distribution, where pulse energy is relocated to the bottom of a laser focus by manipulating primary and higher order spherical aberrations. The technique can produce index modifications with high scanning speed (20 mm/s or higher), high index contrast (16 x 10-3), and high precision to fabricate with arbitrary cross-sections. This method has potential to expand the capabilities of photonic chips in applications that require small-scale, high precision, or high contrast refractive index control.",
  "categories": [
    "physics.optics",
    "physics.app-ph"
  ],
  "primary_category": "physics.optics",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14451",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}