{
  "title": "Cosmological parameter constraints using phenomenological symbolic expressions: On the significance of symbolic expression complexity and accuracy",
  "authors": [
    "S. M. Koksbang"
  ],
  "submission_date": "2023-07-31T07:58:42+00:00",
  "revised_dates": [],
  "abstract": "Phenomenological models are widely used in cosmology in relation to constraining different cosmological models, with two common examples being cosmographic expansions and modeling the equation-of-state parameter of dark energy. This work presents a study of how using different phenomenological expressions for observables and physical quantities versus using physically motivated, derived expressions affects cosmological parameter constraints. The study includes the redshift-distance relation and Hubble parameter as observables, and the dark energy equation-of-state parameter as a physical quantity, and focuses on constraining the cosmological parameter $Ω_Λ$. The observables and equation-of-state parameter are all modeled both using the physical, derived expressions and a variety of phenomenological models with different levels of accuracy and complexity. The results suggest that the complexity of phenomenological expressions only has minor impact on the parameter constraints unless the complexity is very high. The results also indicate that statistically significantly different results can be expected from parameter constraints using different phenomenological models if the models do not have very similar accuracy. This suggests that a good practice is to use multiple phenomenological models when possible, in order to assess the model dependence of results. Straightforward examples of this is that results obtained using cosmographic expansions should always be checked against similar results obtained with expansions of other order, and when using phenomenological models such as for the equation-of-state parameters, robustness of results could be assessed using fitted models from symbolic regression, similar to what is done in this study.",
  "categories": [
    "astro-ph.CO"
  ],
  "primary_category": "astro-ph.CO",
  "doi": "10.1103/PhysRevD.108.043539",
  "journal_ref": "Phys. Rev. D 108, 043539 (2023)",
  "arxiv_id": "2307.16468",
  "pdf_url": "https://arxiv.org/pdf/2307.16468v1",
  "comment": "17 pages, 8 captioned figures. To be published in PRD",
  "num_versions": null,
  "size_before_bytes": 2048067,
  "size_after_bytes": 78020
}