{
  "title": "Towards Imbalanced Motion: Part-Decoupling Network for Video Portrait Segmentation",
  "authors": [
    "Tianshu Yu",
    "Changqun Xia",
    "Jia Li"
  ],
  "submission_date": "2023-07-31T10:55:15+00:00",
  "revised_dates": [
    "2024-05-31T16:00:18+00:00"
  ],
  "abstract": "Video portrait segmentation (VPS), aiming at segmenting prominent foreground portraits from video frames, has received much attention in recent years. However, simplicity of existing VPS datasets leads to a limitation on extensive research of the task. In this work, we propose a new intricate large-scale Multi-scene Video Portrait Segmentation dataset MVPS consisting of 101 video clips in 7 scenario categories, in which 10,843 sampled frames are finely annotated at pixel level. The dataset has diverse scenes and complicated background environments, which is the most complex dataset in VPS to our best knowledge. Through the observation of a large number of videos with portraits during dataset construction, we find that due to the joint structure of human body, motion of portraits is part-associated, which leads that different parts are relatively independent in motion. That is, motion of different parts of the portraits is imbalanced. Towards this imbalance, an intuitive and reasonable idea is that different motion states in portraits can be better exploited by decoupling the portraits into parts. To achieve this, we propose a Part-Decoupling Network (PDNet) for video portrait segmentation. Specifically, an Inter-frame Part-Discriminated Attention (IPDA) module is proposed which unsupervisedly segments portrait into parts and utilizes different attentiveness on discriminative features specified to each different part. In this way, appropriate attention can be imposed to portrait parts with imbalanced motion to extract part-discriminated correlations, so that the portraits can be segmented more accurately. Experimental results demonstrate that our method achieves leading performance with the comparison to state-of-the-art methods.",
  "categories": [
    "cs.CV"
  ],
  "primary_category": "cs.CV",
  "doi": "10.1007/s11432-023-4030-y",
  "journal_ref": "Science China Information Sciences 67.7 (2024) 172104",
  "arxiv_id": "2307.16565",
  "pdf_url": "https://arxiv.org/pdf/2307.16565v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 5836207,
  "size_after_bytes": 175825
}