{
  "title": "The Importance of Distrust in AI",
  "authors": [
    "Tobias M. Peters",
    "Roel W. Visser"
  ],
  "submission_date": "2023-07-25T16:06:21+00:00",
  "revised_dates": [
    "2023-11-03T00:19:13+00:00"
  ],
  "abstract": "In recent years the use of Artificial Intelligence (AI) has become increasingly prevalent in a growing number of fields. As AI systems are being adopted in more high-stakes areas such as medicine and finance, ensuring that they are trustworthy is of increasing importance. A concern that is prominently addressed by the development and application of explainability methods, which are purported to increase trust from its users and wider society. While an increase in trust may be desirable, an analysis of literature from different research fields shows that an exclusive focus on increasing trust may not be warranted. Something which is well exemplified by the recent development in AI chatbots, which while highly coherent tend to make up facts. In this contribution, we investigate the concepts of trust, trustworthiness, and user reliance.\n  In order to foster appropriate reliance on AI we need to prevent both disuse of these systems as well as overtrust. From our analysis of research on interpersonal trust, trust in automation, and trust in (X)AI, we identify the potential merit of the distinction between trust and distrust (in AI). We propose that alongside trust a healthy amount of distrust is of additional value for mitigating disuse and overtrust. We argue that by considering and evaluating both trust and distrust, we can ensure that users can rely appropriately on trustworthy AI, which can both be useful as well as fallible.",
  "categories": [
    "cs.HC"
  ],
  "primary_category": "cs.HC",
  "doi": "10.1007/978-3-031-44070-0",
  "journal_ref": "Explainable Artificial Intelligence First World Conference, xAI 2023, Lisbon, Portugal, July 26-28, 2023, Proceedings, Part III (CCIS, volume 1903)",
  "arxiv_id": "2307.13601",
  "pdf_url": null,
  "comment": "This preprint has not undergone peer review or any post-submission improvements or corrections. The version of records of this contribution is published in Explainable Artificial Intelligence First World Conference, xAI 2023, Lisbon, Portugal, July 26-28, 2023, Proceedings, Part III (CCIS, volume 1903) and is available at https://doi.org/10.1007/978-3-031-44070-0",
  "num_versions": null,
  "size_before_bytes": 552980,
  "size_after_bytes": 476950
}