{
  "title": "Minor merger growth in action: JWST detects faint blue companions around massive quiescent galaxies at 0.5 < z < 3",
  "authors": [
    "Katherine A. Suess",
    "Christina C. Williams",
    "Brant Robertson",
    "Zhiyuan Ji",
    "Benjamin D. Johnson",
    "Erica Nelson",
    "Stacey Alberts",
    "Kevin Hainline",
    "Francesco DEugenio",
    "Hannah Ubler",
    "Marcia Rieke",
    "George Rieke",
    "Andrew J. Bunker",
    "Stefano Carniani",
    "Stephane Charlot",
    "Daniel J. Eisenstein",
    "Roberto Maiolino",
    "Daniel P. Stark",
    "Sandro Tacchella",
    "Chris Willott"
  ],
  "submission_date": "2023-07-26T14:14:50+00:00",
  "revised_dates": [],
  "abstract": "Minor mergers are thought to drive the structural evolution of massive quiescent galaxies; however, existing HST imaging is primarily sensitive to stellar mass ratios >1:10. Here, we report the discovery of a large population of low-mass companions within 35 kpc of known logM*/Msun > 10.5 quiescent galaxies at 0.5 < z < 3. While massive companions like those identified by HST are rare, JWST imaging from JADES reveals that the average massive quiescent galaxy hosts ~5 nearby companions with stellar mass ratios <1:10. Despite a median stellar mass ratio of just 1:900, these tiny companions are so numerous that they represent at least 30\\% of the total mass being added to quiescent galaxies via minor mergers. While relatively massive companions have colors similar to their hosts, companions with mass ratios <1:10 typically have bluer colors and lower mass-to-light ratios than their host galaxies at similar radii. The accretion of these tiny companions is likely to drive evolution in the color gradients and stellar population properties of the host galaxies. Our results suggest that the well-established ``minor merger growth\" model for quiescent galaxies extends down to very low mass ratios of <1:100, and demonstrates the power of JWST to constrain both the spatially-resolved properties of massive galaxies and the properties of low-mass companions beyond the local universe.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14209",
  "pdf_url": null,
  "comment": "10 pages, 5 figures, submitted to ApJL. Comments welcome",
  "num_versions": null,
  "size_before_bytes": 6855263,
  "size_after_bytes": 1005815
}