{
  "title": "Implicit Neural Representation in Medical Imaging: A Comparative Survey",
  "authors": [
    "Amirali Molaei",
    "Amirhossein Aminimehr",
    "Armin Tavakoli",
    "Amirhossein Kazerouni",
    "Bobby Azad",
    "Reza Azad",
    "Dorit Merhof"
  ],
  "submission_date": "2023-07-30T06:39:25+00:00",
  "revised_dates": [],
  "abstract": "Implicit neural representations (INRs) have gained prominence as a powerful paradigm in scene reconstruction and computer graphics, demonstrating remarkable results. By utilizing neural networks to parameterize data through implicit continuous functions, INRs offer several benefits. Recognizing the potential of INRs beyond these domains, this survey aims to provide a comprehensive overview of INR models in the field of medical imaging. In medical settings, numerous challenging and ill-posed problems exist, making INRs an attractive solution. The survey explores the application of INRs in various medical imaging tasks, such as image reconstruction, segmentation, registration, novel view synthesis, and compression. It discusses the advantages and limitations of INRs, highlighting their resolution-agnostic nature, memory efficiency, ability to avoid locality biases, and differentiability, enabling adaptation to different tasks. Furthermore, the survey addresses the challenges and considerations specific to medical imaging data, such as data availability, computational complexity, and dynamic clinical scene analysis. It also identifies future research directions and opportunities, including integration with multi-modal imaging, real-time and interactive systems, and domain adaptation for clinical decision support. To facilitate further exploration and implementation of INRs in medical image analysis, we have provided a compilation of cited studies along with their available open-source implementations on \\href{https://github.com/mindflow-institue/Awesome-Implicit-Neural-Representations-in-Medical-imaging}. Finally, we aim to consistently incorporate the most recent and relevant papers regularly.",
  "categories": [
    "eess.IV",
    "cs.CV"
  ],
  "primary_category": "eess.IV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16142",
  "pdf_url": "https://arxiv.org/pdf/2307.16142v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 7374940,
  "size_after_bytes": 177994
}