{
  "title": "A comparison of Bayesian and frequentist confidence intervals in the presence of a late Universe degeneracy",
  "authors": [
    "Eoin Ó Colgáin",
    "Saeed Pourojaghi",
    "M. M. Sheikh-Jabbari",
    "Darragh Sherwin"
  ],
  "submission_date": "2023-07-30T23:56:33+00:00",
  "revised_dates": [
    "2023-12-17T17:18:26+00:00",
    "2025-01-03T12:22:42+00:00"
  ],
  "abstract": "Hubble tension is a problem in one-dimensional (1D) posteriors, since local $H_0$ determinations are only sensitive to a single parameter. Projected 1D posteriors for $Λ$CDM cosmological parameters become more non-Gaussian with increasing effective redshift when the model is fitted to redshift-binned data in the late Universe. We explain mathematically why this non-Gaussianity arises and show using observational Hubble data (OHD) that Markov Chain Monte Carlo (MCMC) marginalisation leads to 1D posteriors that fail to track the $χ^2$ minimum at $68\\%$ confidence level in high redshift bins. To gain a second perspective, we resort to profile likelihoods as a complementary technique. Doing so, we observe that $z \\gtrsim 1$ cosmic chronometer (CC) data currently prefers a non-evolving (constant) Hubble parameter over a Planck-$Λ$CDM cosmology at $\\sim 2 σ$. Within the Hubble tension debate, it is imperative that subsamples of data sets with differing redshifts yield similar $H_0$ values. In addition, we confirm that MCMC degeneracies observed in 2D posteriors are not due to curves of constant $χ^2$. Finally, on the assumption that the Planck-$Λ$CDM cosmological model is correct, using profile likelihoods we confirm a $>2 σ$ discrepancy with Planck-$Λ$CDM in a combination of CC and baryon acoustic oscillations (BAO) data beyond $ z \\sim 1.5$. This confirms a discrepancy reported earlier with fresh methodology.",
  "categories": [
    "astro-ph.CO"
  ],
  "primary_category": "astro-ph.CO",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16349",
  "pdf_url": "https://arxiv.org/pdf/2307.16349v3",
  "comment": "22 pages, 11 figures; v2 presentation improved, figures added; v3 title change, figure added, to appear in EPJC",
  "num_versions": null,
  "size_before_bytes": 3839309,
  "size_after_bytes": 426710
}