{
  "title": "A transiting brown dwarf in a 2 hour orbit",
  "authors": [
    "Kareem El-Badry",
    "Kevin B. Burdge",
    "Jan van Roestel",
    "Antonio C. Rodriguez"
  ],
  "submission_date": "2023-07-28T18:00:00+00:00",
  "revised_dates": [
    "2023-09-13T22:27:47+00:00"
  ],
  "abstract": "We report the discovery of ZTF J2020+5033, a high-mass brown dwarf (BD) transiting a low-mass star with an orbital period of 1.90 hours. Phase-resolved spectroscopy, optical and infrared light curves, and precise astrometry from Gaia allow us to constrain the masses, radii, and temperatures of both components with few-percent precision. We infer a BD mass of $M_{\\rm BD} = 80.1\\pm 1.6\\,M_{\\rm J}$, almost exactly at the stellar/substellar boundary, and a moderately inflated radius, $R_{\\rm BD} = 1.05\\pm 0.02\\,R_{\\rm J}$. The transiting object's temperature, $T_{\\rm eff}\\approx 1700\\,\\rm K$, is well-constrained by the depth of the infrared secondary eclipse and strongly suggests it is a BD. The system's high tangential velocity ($v_\\perp = 98\\,\\rm km\\,s^{-1}$) and thick disk-like Galactic orbit imply the binary is old; its close distance ($d\\approx 140$ pc) suggests that BDs in short-period orbits are relatively common. ZTF J2020+5033 is the shortest-period known transiting BD by more than a factor of 7. Today, the entire binary would comfortably fit inside the Sun. However, both components must have been considerably larger in youth, implying that the orbit has shrunk by at least a factor of $\\sim 5$ since formation. The simplest explanation is that magnetic braking continues to operate efficiently in at least some low-mass stars and BDs.",
  "categories": [
    "astro-ph.SR",
    "astro-ph.EP"
  ],
  "primary_category": "astro-ph.SR",
  "doi": "10.21105/astro.2307.15729",
  "journal_ref": null,
  "arxiv_id": "2307.15729",
  "pdf_url": "https://arxiv.org/pdf/2307.15729v2",
  "comment": "15 pages, 9 figures. Accepted to OJA",
  "num_versions": null,
  "size_before_bytes": 5386679,
  "size_after_bytes": 290815
}