{
  "title": "The evolution of the Milky Way's thin disc radial metallicity gradient with K2 asteroseismic ages",
  "authors": [
    "Emma Willett",
    "Andrea Miglio",
    "J. Ted Mackereth",
    "Cristina Chiappini",
    "Alexander J. Lyttle",
    "Yvonne Elsworth",
    "Benoît Mosser",
    "Saniya Khan",
    "Friedrich Anders",
    "Giada Casali",
    "Valeria Grisoni"
  ],
  "submission_date": "2023-07-26T18:00:02+00:00",
  "revised_dates": [],
  "abstract": "The radial metallicity distribution of the Milky Way's disc is an important observational constraint for models of the formation and evolution of our Galaxy. It informs our understanding of the chemical enrichment of the Galactic disc and the dynamical processes therein, particularly radial migration. We investigate how the metallicity changes with guiding radius in the thin disc using a sample of red-giant stars with robust astrometric, spectroscopic and asteroseismic parameters. Our sample contains $668$ stars with guiding radii $4$ kpc < $R_\\mathrm{g}$ < $11$ kpc and asteroseismic ages covering the whole history of the thin disc with precision $\\approx 25\\%$. We use MCMC analysis to measure the gradient and its intrinsic spread in bins of age and construct a hierarchical Bayesian model to investigate the evolution of these parameters independently of the bins. We find a smooth evolution of the gradient from $\\approx -0.07$ dex/kpc in the youngest stars to $\\approx -0.04$ dex/kpc in stars older than $10$ Gyr, with no break at intermediate ages. Our results are consistent with those based on asteroseismic ages from CoRoT, with that found in Cepheid variables for stars younger than $1$ Gyr, and with open clusters for stars younger than $6$ Gyr. For older stars we find a significantly lower metallicity in our sample than in the clusters, suggesting a survival bias favouring more metal-rich clusters. We also find that the chemical evolution model of Chiappini (2009) is too metal-poor in the early stages of disc formation. Our results provide strong new constraints for the growth and enrichment of the thin disc and radial migration, which will facilitate new tests of model conditions and physics.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.1093/mnras/stad2374",
  "journal_ref": null,
  "arxiv_id": "2307.14422",
  "pdf_url": null,
  "comment": "15 pages, 16 figures. Accepted for publication in MNRAS",
  "num_versions": null,
  "size_before_bytes": 4849062,
  "size_after_bytes": 255154
}