{
  "title": "Constraining the evolution of the unstable accretion disk in SMC X-1 with NICER",
  "authors": [
    "McKinley C. Brumback",
    "Georgios Vasilopoulos",
    "Joel B. Coley",
    "Kristen Dage",
    "Jon M. Miller"
  ],
  "submission_date": "2023-07-28T14:49:51+00:00",
  "revised_dates": [
    "2023-08-03T16:52:04+00:00"
  ],
  "abstract": "Neutron star high mass X-ray binaries with superorbital modulations in luminosity host warped inner accretion disks that occult the neutron star during precession. In SMC X-1, the instability in the warped disk geometry causes superorbital period \"excursions:\" times of instability when the superorbital period decreases from its typical value of 55 days to $\\sim$40 days. Disk instability makes SMC X-1 an ideal system in which to investigate the effects of variable disk geometry on the inner accretion flow. Using the high resolution spectral and timing capabilities of the Neutron Star Interior Composition Explorer (NICER) we examined the high state of four different superorbital cycles of SMC X-1 to search forchanges in spectral shape and connections to the unstable disk geometry. We performed pulse phase-averaged and phase-resolved spectroscopy to closely compare the changes in spectral shape and any cycle-to-cycle variations. While some parameters including the photon index and absorbing column density show slight variations with superorbital phase, these changes are most evident during the intermediate state of the supeorbital cycle. Few spectral changes are observed within the high state of the superorbital cycle, possibly indicating the disk instability does not significantly change SMC X-1's accretion process.",
  "categories": [
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.HE",
  "doi": "10.3847/1538-4357/ace04f",
  "journal_ref": null,
  "arxiv_id": "2307.15591",
  "pdf_url": "https://arxiv.org/pdf/2307.15591v2",
  "comment": "11 pages, 5 figures. Accepted to ApJ",
  "num_versions": null,
  "size_before_bytes": 2776628,
  "size_after_bytes": 1168368
}