{
  "title": "Dynamical systems analysis of an interacting scalar field model in an anisotropic universe",
  "authors": [
    "Sujoy Bhanja",
    "Goutam Mandal",
    "Abdulla Al Mamon",
    "Sujay Kr. Biswas"
  ],
  "submission_date": "2023-07-23T15:56:04+00:00",
  "revised_dates": [
    "2023-11-17T01:23:31+00:00"
  ],
  "abstract": "In this paper, we investigate a non-canonical scalar field model in the background dynamics of anisotropic Locally Rotationally Symmetric (LRS) Bianchi type I universe where gravity is coupled minimally to scalar field which is taken as dark energy and pressureless dust as dark matter are the main matter content of the universe. We perform dynamical system analysis to characterize the cosmological evolution of the model with and without interaction in the dark sector separately. First, we convert the evolution equation into an autonomous system of ordinary differential equations by using a suitable choice of dimensionless variables, which are normalized over the Hubble scale. We choose scalar field coupling and potential in such a way that the autonomous system converted to a 2D system. Linear stability theory is employed to the extracted critical points to find the nature. From the analysis, we find some interesting cosmological scenarios, such as late-time scalar-field dominated solutions, which evolve in the quintessence era, cannot solve the coincidence problem. Accelerated scaling attractors are also obtained that correspond to the late phase evolution in agreement with present observational data, and these solutions also provide possible mechanisms to alleviate the coincidence problem. A complete cosmic evolution is obtained from early inflation to a late-time dark energy-dominated phase, connecting through a matter-dominated transient phase of the universe. Furthermore, we find that for different values of the interaction parameter $α$, the evolutionary trajectories of the Hubble parameter, and the distance modulus forecasted by the model are in quite well agreement with observational datasets.",
  "categories": [
    "gr-qc"
  ],
  "primary_category": "gr-qc",
  "doi": "10.1088/1475-7516/2023/10/050",
  "journal_ref": "Published in Journal of Cosmology and Astroparticle Physics; JCAP10(2023)050",
  "arxiv_id": "2307.13000",
  "pdf_url": null,
  "comment": "35 pages, six captioned figures",
  "num_versions": null,
  "size_before_bytes": 8281329,
  "size_after_bytes": 216255
}