{
  "title": "A supervised hybrid quantum machine learning solution to the emergency escape routing problem",
  "authors": [
    "Nathan Haboury",
    "Mo Kordzanganeh",
    "Sebastian Schmitt",
    "Ayush Joshi",
    "Igor Tokarev",
    "Lukas Abdallah",
    "Andrii Kurkin",
    "Basil Kyriacou",
    "Alexey Melnikov"
  ],
  "submission_date": "2023-07-28T17:16:58+00:00",
  "revised_dates": [],
  "abstract": "Managing the response to natural disasters effectively can considerably mitigate their devastating impact. This work explores the potential of using supervised hybrid quantum machine learning to optimize emergency evacuation plans for cars during natural disasters. The study focuses on earthquake emergencies and models the problem as a dynamic computational graph where an earthquake damages an area of a city. The residents seek to evacuate the city by reaching the exit points where traffic congestion occurs. The situation is modeled as a shortest-path problem on an uncertain and dynamically evolving map. We propose a novel hybrid supervised learning approach and test it on hypothetical situations on a concrete city graph. This approach uses a novel quantum feature-wise linear modulation (FiLM) neural network parallel to a classical FiLM network to imitate Dijkstra's node-wise shortest path algorithm on a deterministic dynamic graph. Adding the quantum neural network in parallel increases the overall model's expressivity by splitting the dataset's harmonic and non-harmonic features between the quantum and classical components. The hybrid supervised learning agent is trained on a dataset of Dijkstra's shortest paths and can successfully learn the navigation task. The hybrid quantum network improves over the purely classical supervised learning approach by 7% in accuracy. We show that the quantum part has a significant contribution of 45.(3)% to the prediction and that the network could be executed on an ion-based quantum computer. The results demonstrate the potential of supervised hybrid quantum machine learning in improving emergency evacuation planning during natural disasters.",
  "categories": [
    "quant-ph",
    "cs.AI",
    "cs.LG"
  ],
  "primary_category": "quant-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15682",
  "pdf_url": "https://arxiv.org/pdf/2307.15682v1",
  "comment": "15 pages, 9 figures, 2 tables",
  "num_versions": null,
  "size_before_bytes": 3594814,
  "size_after_bytes": 88473
}