{
  "title": "Integrated Digital Reconstruction of Welded Components: Supporting Improved Fatigue Life Prediction",
  "authors": [
    "Anders Faarbæk Mikkelstrup",
    "Morten Kristiansen"
  ],
  "submission_date": "2023-07-28T15:04:22+00:00",
  "revised_dates": [],
  "abstract": "In the design of offshore jacket foundations, fatigue life is crucial. Post-weld treatment has been proposed to enhance the fatigue performance of welded joints, where particularly high-frequency mechanical impact (HFMI) treatment has been shown to improve fatigue performance significantly. Automated HFMI treatment has improved quality assurance and can lead to cost-effective design when combined with accurate fatigue life prediction. However, the finite element method (FEM), commonly used for predicting fatigue life in complex or multi-axial joints, relies on a basic CAD depiction of the weld, failing to consider the actual weld geometry and defects. Including the actual weld geometry in the FE model improves fatigue life prediction and possible crack location prediction but requires a digital reconstruction of the weld. Current digital reconstruction methods are time-consuming or require specialised scanning equipment and potential component relocation. The proposed framework instead uses an industrial manipulator combined with a line scanner to integrate digital reconstruction as part of the automated HFMI treatment setup. This approach applies standard image processing, simple filtering techniques, and non-linear optimisation for aligning and merging overlapping scans. A screened Poisson surface reconstruction finalises the 3D model to create a meshed surface. The outcome is a generic, cost-effective, flexible, and rapid method that enables generic digital reconstruction of welded parts, aiding in component design, overall quality assurance, and documentation of the HFMI treatment.",
  "categories": [
    "cs.CV",
    "eess.IV"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15604",
  "pdf_url": "https://arxiv.org/pdf/2307.15604v1",
  "comment": "6 pages, 7 figures, submitted to 2023 IEEE International Conference on Imaging Systems and Techniques (IST2023)",
  "num_versions": null,
  "size_before_bytes": 22082466,
  "size_after_bytes": 327883
}