{
  "title": "Swapping of quantum correlations and the role of local filtering operations",
  "authors": [
    "Pedro Rosario",
    "Andrés F. Ducuara",
    "Cristian E. Susa"
  ],
  "submission_date": "2023-07-31T09:46:46+00:00",
  "revised_dates": [],
  "abstract": "We address the swapping of various quantum correlation measures including: Bell-nonlocality, EPR-steering, usefulness for teleportation, entanglement, quantum obesity, as well as the effect that local filtering operations have on the swapping of such correlations. In the first part of this work we address the raw swapping protocol (i. e. without local filtering) and our findings are as follows. First, using the Bloch representation of quantum states, we show that all of the above properties of a general quantum state can fully be preserved whenever the state is swapped together with arbitrary combinations of Bell states and Bell measurements. This generalises a result shown for the concurrence of states in the X-form. Second, we derive an explicit formula for the quantum obesity of the final post-swapping state in terms of the obesity of general input states and measurements, and therefore establishing the limit at which obesity can be swapped. In the second part we address the effect of local filtering operations on the swapping of quantum correlations. Specifically, we explore whether experimentalists should implement local filters before or after the swapping protocol takes place, so in order to maximize the final amount of correlations. In this regard, we first show that these two scenarios are equivalent for the family of Bell-diagonal states, for all of the above-mentioned quantum correlations. We then prove that applying local filters first can be more efficient when considering the strictly larger family of almost Bell-diagonal states, with the quantum obesity as the test property. Finally, we provide numerical evidence for this latter phenomenon (local filtering first is more efficient) holding true for general two-qubit states in the X-form, for all of the above-mentioned quantum correlations.",
  "categories": [
    "quant-ph"
  ],
  "primary_category": "quant-ph",
  "doi": "10.1002/qute.202500065",
  "journal_ref": "Adv Quantum Technol. 2500065 (2025)",
  "arxiv_id": "2307.16524",
  "pdf_url": "https://arxiv.org/pdf/2307.16524v1",
  "comment": "10+7 pages, 10 figures",
  "num_versions": null,
  "size_before_bytes": 528166,
  "size_after_bytes": 137853
}