{
  "title": "Internal kinematics of dwarf satellites of MW/M31-like galaxies in TNG50",
  "authors": [
    "Alberto Manuel Martínez-García",
    "Andrés del Pino",
    "Ewa L. Łokas",
    "Roeland P. van der Marel",
    "Antonio Aparicio"
  ],
  "submission_date": "2023-07-25T17:41:50+00:00",
  "revised_dates": [
    "2023-10-31T02:37:01+00:00"
  ],
  "abstract": "We present a kinematic study of a thousand of dwarf satellites of MW/M31-like hosts from the IllustrisTNG50 simulation. Internal kinematics were derived for all the snapshots to obtain a historical record of their rotation velocity in the plane of the sky ($|V_T|$) and the amplitude of their velocity gradients along the line of sight ($A_{\\rm grad}^{v_z}$) measured from the host. For the majority of the satellites we initially detected rotation in the plane of the sky (65%) or velocity gradients (80%), and this was progressively reduced to 45% and 68% at $z = 0$ respectively. We find that the evolution of the rotation in the plane of the sky and the velocity gradients differs according to type of dwarfs, which could be explained in terms of their different masses and orbital histories. We observe that interaction with the host has an impact on the evolution of the internal kinematics of the satellites. The rotation signal of the satellites is progressively reduced during pericentric passages, the first pericentre being especially disruptive for the initial kinematics. We observe temporary increases in $A_{\\rm grad}^{v_z}$ during pericentric passage caused by tidal interaction with the host, $A_{\\rm grad}^{v_z}$ increasing as the satellites approach their pericentre and dropping as they move away. In summary, we conclude that the presence of detectable rotation in dwarf satellites is not uncommon, and that the evolution of their internal kinematics is clearly affected by their interaction with the host.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13683",
  "pdf_url": null,
  "comment": "12 pages, 9 figures, 2 tables. Accepted for publication in MNRAS",
  "num_versions": null,
  "size_before_bytes": 4564240,
  "size_after_bytes": 979345
}