{
  "title": "Integrating processed-based models and machine learning for crop yield prediction",
  "authors": [
    "Michiel G. J. Kallenberg",
    "Bernardo Maestrini",
    "Ron van Bree",
    "Paul Ravensbergen",
    "Christos Pylianidis",
    "Frits van Evert",
    "Ioannis N. Athanasiadis"
  ],
  "submission_date": "2023-07-25T12:51:25+00:00",
  "revised_dates": [],
  "abstract": "Crop yield prediction typically involves the utilization of either theory-driven process-based crop growth models, which have proven to be difficult to calibrate for local conditions, or data-driven machine learning methods, which are known to require large datasets. In this work we investigate potato yield prediction using a hybrid meta-modeling approach. A crop growth model is employed to generate synthetic data for (pre)training a convolutional neural net, which is then fine-tuned with observational data. When applied in silico, our meta-modeling approach yields better predictions than a baseline comprising a purely data-driven approach. When tested on real-world data from field trials (n=303) and commercial fields (n=77), the meta-modeling approach yields competitive results with respect to the crop growth model. In the latter set, however, both models perform worse than a simple linear regression with a hand-picked feature set and dedicated preprocessing designed by domain experts. Our findings indicate the potential of meta-modeling for accurate crop yield prediction; however, further advancements and validation using extensive real-world datasets is recommended to solidify its practical effectiveness.",
  "categories": [
    "cs.LG",
    "cs.AI"
  ],
  "primary_category": "cs.LG",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13466",
  "pdf_url": null,
  "comment": "6 pages, 4 figures, Accepted after peer-review at the 1st workshop on Synergy of Scientific and Machine Learning Modeling, SynS & ML ICML, Honolulu, Hawaii, USA. July, 2023",
  "num_versions": null,
  "size_before_bytes": 2417472,
  "size_after_bytes": 185149
}