{
  "title": "TOPSEM, TwO Parameters Semi Empirical Model: Galaxy Evolution and Bulge/Disk Dicothomy from Two-Stage Halo Accretion",
  "authors": [
    "Lumen Boco",
    "Andrea Lapi",
    "Francesco Shankar",
    "Hao Fu",
    "Francesco Gabrielli",
    "Alex Sicilia"
  ],
  "submission_date": "2023-07-24T18:00:04+00:00",
  "revised_dates": [],
  "abstract": "In recent years, increasing attention has been devoted to semi empirical, data-driven models to tackle some aspects of the complex and still largely debated topic of galaxy formation and evolution. We here present a new semi empirical model whose marking feature is simplicity: it relies on solely two assumptions, one initial condition and two free parameters. Galaxies are connected to evolving dark matter haloes through abundance matching between specific halo accretion rate (sHAR) and specific star formation rate (sSFR). Quenching is treated separately, in a fully empirical way, to marginalize over quiescent galaxies and test our assumption on the sSFR evolution without contaminations from passive objects. Our flexible and transparent model is able to reproduce the observed stellar mass functions up to $z\\sim 5$, giving support to our hypothesis of a monotonic relation between sHAR and sSFR. We then exploit the model to test a hypothesis on morphological evolution of galaxies. We attempt to explain the bulge/disk bimodality in terms of the two halo accretion modes: fast and slow accretion. Specifically, we speculate that bulge/spheroidal components might form during the early phase of fast halo growth, while disks form during the later phase of slow accretion. We find excellent agreement with both the observational bulge and elliptical mass functions.",
  "categories": [
    "astro-ph.GA",
    "astro-ph.CO"
  ],
  "primary_category": "astro-ph.GA",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13036",
  "pdf_url": null,
  "comment": "22 pages, 13 Figures",
  "num_versions": null,
  "size_before_bytes": 1985457,
  "size_after_bytes": 218034
}