{
  "title": "Formation of Massive and Wide First-star Binaries in Radiation Hydrodynamics Simulations",
  "authors": [
    "Kazuyuki Sugimura",
    "Tomoaki Matsumoto",
    "Takashi Hosokawa",
    "Shingo Hirano",
    "Kazuyuki Omukai"
  ],
  "submission_date": "2023-07-27T18:00:00+00:00",
  "revised_dates": [
    "2024-01-23T11:49:48+00:00"
  ],
  "abstract": "We study the formation of Pop III stars by performing radiation hydrodynamics simulations for three different initial clouds extracted from cosmological hydrodynamics simulations. Starting from the cloud collapse stage, we follow the growth of protostars by accretion for $\\sim 10^5$ yr until the radiative feedback from the protostars suppresses the accretion and the stellar properties are nearly fixed. We find that the Pop III stars form in massive and wide binaries/small-multiple stellar systems, with masses $>30\\,M_\\odot$ and separations $>2000$ au. We also find that the properties of the final stellar system correlate with those of the initial clouds: the total mass increases with the cloud-scale accretion rate, and the angular momentum of the binary orbit matches that of the initial cloud. While the total mass of the system in our simulations is consistent with our previous single-star formation simulations, individual masses are lower due to mass sharing, suggesting potential modification in the extent of feedback from Pop III stars in the subsequent evolution of the Universe. We also identify such systems as mini-binaries embedded in a wider outer multiple-star system, which could evolve into progenitors for observed gravitational wave events.",
  "categories": [
    "astro-ph.CO",
    "astro-ph.GA",
    "astro-ph.SR"
  ],
  "primary_category": "astro-ph.CO",
  "doi": "10.3847/1538-4357/ad02fc",
  "journal_ref": "ApJ, 959, 17 (2023)",
  "arxiv_id": "2307.15108",
  "pdf_url": "https://arxiv.org/pdf/2307.15108v2",
  "comment": "30 pages, 20 figures, published in ApJ",
  "num_versions": null,
  "size_before_bytes": 27945697,
  "size_after_bytes": 797127
}