{
  "title": "The Impact of Beam Variations on Power Spectrum Estimation for 21 cm Cosmology II: Mitigation of Foreground Systematics for HERA",
  "authors": [
    "Honggeun Kim",
    "Nicholas S. Kern",
    "Jacqueline N. Hewitt",
    "Bang D. Nhan",
    "Joshua S. Dillon",
    "Eloy de Lera Acedo",
    "Scott B. C. Dynes",
    "Nivedita Mahesh",
    "Nicolas Fagnoni",
    "David R. DeBoer"
  ],
  "submission_date": "2023-07-24T14:24:03+00:00",
  "revised_dates": [],
  "abstract": "One key challenge in detecting 21 cm cosmological signal at z > 6 is to separate the cosmological signal from foreground emission. This can be studied in a power spectrum space where the foreground is confined to low delay modes whereas the cosmological signal can spread out to high delay modes. When there is a calibration error, however, chromaticity of gain errors propagates to the power spectrum estimate and contaminates the modes for cosmological detection. The Hydrogen Epoch of Reionization Array (HERA) employs a high-precision calibration scheme using redundancy in measurements. In this study, we focus on the gain errors induced by nonredundancies arising from feed offset relative to the HERA's 14 meter parabolic dish element, and investigate how to mitigate the chromatic gain errors using three different methods: restricting baseline lengths for calibration, smoothing the antenna gains, and applying a temporal filter prior to calibration. With 2 cm/2 degree perturbations for translation/tilting motions, a level achievable under normal HERA operating conditions, the combination of the baseline cut and temporal filtering indicates that the spurious gain feature due to nonredundancies is significantly reduced, and the power spectrum recovers the clean foreground-free region. We found that the mitigation technique works even for large feed motions but in order to keep a stable calibration process, the feed positions need to be constrained to 2 cm for translation motions and 2 degree for tilting offset relative to the dish's vertex.",
  "categories": [
    "astro-ph.CO",
    "astro-ph.IM"
  ],
  "primary_category": "astro-ph.CO",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12826",
  "pdf_url": null,
  "comment": "Accepted for publication in ApJ",
  "num_versions": null,
  "size_before_bytes": 2054991,
  "size_after_bytes": 272128
}