{
  "title": "Drive Asymmetry, Convergence and the Origin of Turbulence in ICF Implosions",
  "authors": [
    "Vincent A. Thomas",
    "Robert J. Kares"
  ],
  "submission_date": "2023-07-27T17:36:57+00:00",
  "revised_dates": [],
  "abstract": "2D and 3D numerical simulations with the adaptive mesh refinement Eulerian radiation-hydrocode RAGE are used to investigate hydrodynamic disruption of asymmetrically driven ICF implosions. A central aspect of this phenomenon is the connection between drive asymmetry and the generation of turbulence in the DT fuel. Long wavelength deviations from spherical symmetry in the pressure drive lead to the generation of coherent vortical structures in the DT gas and it is the three dimensional instability of these structures that in turn leads to turbulence and mix. RAGE simulations with spatial resolutions as high as 0.05 μm in 3D are presented to exhibit the detailed mechanisms of turbulence growth. These simulations suggest that the amplification of small initial surface imperfections by acceleration-induced instabilities is not the only important source of turbulent mix in ICF implosions as is commonly supposed. Rather, the three dimensional instability of coherent vortical structures induced in the gas by the asymmetries in the implosion are an additional important source of turbulent mixing in ICF, perhaps even the dominant source. The effect of convergence on the hydrodynamic disruption of an asymmetrically driven ICF capsule is also considered, demonstrating how higher convergence is expected to lead to greater hydrodynamic disruption by both large scale fingers of pusher material into the fuel as well as the formation of radially outgoing turbulent jets of fuel. Implications of these results for NIF ignition are discussed.",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph",
  "doi": "10.1017/CBO9781316480243",
  "journal_ref": "Coarse Grained Simulation and Turbulent Mixing, edited by F. Grinstein, ISBN 978-1-107-13704-2, Cambridge University Press, 282 (2016)",
  "arxiv_id": "2307.15028",
  "pdf_url": "https://arxiv.org/pdf/2307.15028v1",
  "comment": "43 pages, 19 figures, with hyperlinks to 7 YouTube videos",
  "num_versions": null,
  "size_before_bytes": 39023623,
  "size_after_bytes": 22597442
}