{
  "title": "Psy-LLM: Scaling up Global Mental Health Psychological Services with AI-based Large Language Models",
  "authors": [
    "Tin Lai",
    "Yukun Shi",
    "Zicong Du",
    "Jiajie Wu",
    "Ken Fu",
    "Yichao Dou",
    "Ziqi Wang"
  ],
  "submission_date": "2023-07-22T06:21:41+00:00",
  "revised_dates": [
    "2023-09-04T00:09:54+00:00"
  ],
  "abstract": "The demand for psychological counselling has grown significantly in recent years, particularly with the global outbreak of COVID-19, which has heightened the need for timely and professional mental health support. Online psychological counselling has emerged as the predominant mode of providing services in response to this demand. In this study, we propose the Psy-LLM framework, an AI-based assistive tool leveraging Large Language Models (LLMs) for question-answering in psychological consultation settings to ease the demand for mental health professions. Our framework combines pre-trained LLMs with real-world professional Q\\&A from psychologists and extensively crawled psychological articles. The Psy-LLM framework serves as a front-end tool for healthcare professionals, allowing them to provide immediate responses and mindfulness activities to alleviate patient stress. Additionally, it functions as a screening tool to identify urgent cases requiring further assistance. We evaluated the framework using intrinsic metrics, such as perplexity, and extrinsic evaluation metrics, with human participant assessments of response helpfulness, fluency, relevance, and logic. The results demonstrate the effectiveness of the Psy-LLM framework in generating coherent and relevant answers to psychological questions. This article discusses the potential and limitations of using large language models to enhance mental health support through AI technologies.",
  "categories": [
    "cs.CL",
    "cs.AI"
  ],
  "primary_category": "cs.CL",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11991",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 3995244,
  "size_after_bytes": 421128
}