{
  "title": "Probing mass orderings in presence of a very light sterile neutrino in a liquid argon detector",
  "authors": [
    "Animesh Chatterjee",
    "Srubabati Goswami",
    "Supriya Pan"
  ],
  "submission_date": "2023-07-24T15:29:16+00:00",
  "revised_dates": [],
  "abstract": "Results from experiments like LSND and MiniBooNE hint towards the possible presence of an extra eV scale sterile neutrino. The addition of such a neutrino will significantly impact the standard three flavour neutrino oscillations. In particular, it can give rise to additional degeneracies due to additional sterile parameters. For an eV scale sterile neutrino, the cosmological constraints dictate that the sterile state is heavier than the three active states. However, for lower masses of sterile neutrinos, it can be lighter than one and/or more of the three states. In such cases, the mass ordering of the sterile neutrinos also becomes unknown along with the mass ordering of the active states. In this paper, we explore the mass ordering sensitivity in the presence of a sterile neutrino assuming the mass squared difference $|Δ_{41}|$ to be in the range $10^{-4} - 1$ eV$^2$. We study (i) how the ordering of the active states, i.e. the determination of the sign of $Δ_{31}$ gets affected by the presence of a sterile neutrino in the above mass range, (ii) the possible determination of the sign of $Δ_{41}$ for $Δ_{41}$ in the range $10^{-4} - 0.1$ eV$^2$. This analysis is done in the context of a liquid argon detector using both beam neutrinos traveling a distance of 1300 km and atmospheric neutrinos which propagates through a distance ranging from 10 - 10000 km allowing resonant matter effects. Apart from presenting separate results from these sources, we also do a combined study and probe the synergy between these two in giving an enhanced sensitivity.",
  "categories": [
    "hep-ph"
  ],
  "primary_category": "hep-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12885",
  "pdf_url": null,
  "comment": "14 pages, 19 figures",
  "num_versions": null,
  "size_before_bytes": 3055442,
  "size_after_bytes": 157832
}