{
  "title": "Global k-Space Interpolation for Dynamic MRI Reconstruction using Masked Image Modeling",
  "authors": [
    "Jiazhen Pan",
    "Suprosanna Shit",
    "Özgün Turgut",
    "Wenqi Huang",
    "Hongwei Bran Li",
    "Nil Stolt-Ansó",
    "Thomas Küstner",
    "Kerstin Hammernik",
    "Daniel Rueckert"
  ],
  "submission_date": "2023-07-24T10:20:14+00:00",
  "revised_dates": [
    "2023-10-19T00:30:13+00:00"
  ],
  "abstract": "In dynamic Magnetic Resonance Imaging (MRI), k-space is typically undersampled due to limited scan time, resulting in aliasing artifacts in the image domain. Hence, dynamic MR reconstruction requires not only modeling spatial frequency components in the x and y directions of k-space but also considering temporal redundancy. Most previous works rely on image-domain regularizers (priors) to conduct MR reconstruction. In contrast, we focus on interpolating the undersampled k-space before obtaining images with Fourier transform. In this work, we connect masked image modeling with k-space interpolation and propose a novel Transformer-based k-space Global Interpolation Network, termed k-GIN. Our k-GIN learns global dependencies among low- and high-frequency components of 2D+t k-space and uses it to interpolate unsampled data. Further, we propose a novel k-space Iterative Refinement Module (k-IRM) to enhance the high-frequency components learning. We evaluate our approach on 92 in-house 2D+t cardiac MR subjects and compare it to MR reconstruction methods with image-domain regularizers. Experiments show that our proposed k-space interpolation method quantitatively and qualitatively outperforms baseline methods. Importantly, the proposed approach achieves substantially higher robustness and generalizability in cases of highly-undersampled MR data. For video presentation, poster, GIF results and code please check our project page: https://jzpeterpan.github.io/k-gin.github.io/.",
  "categories": [
    "eess.IV",
    "cs.CV",
    "cs.LG"
  ],
  "primary_category": "eess.IV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12672",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 29906495,
  "size_after_bytes": 273859
}