{
  "title": "Experimental validation of particle-in-cell/Monte Carlo collisions simulations in low-pressure neon capacitively coupled plasmas",
  "authors": [
    "Chan-Won Park",
    "Benedek Horváth",
    "Aranka Derzsi",
    "Julian Schulze",
    "J. H. Kim",
    "Zoltán Donkó",
    "Hyo-Chang Lee"
  ],
  "submission_date": "2023-07-27T12:55:58+00:00",
  "revised_dates": [],
  "abstract": "Plasma simulations are powerful tools for understanding fundamental plasma science phenomena and for process optimization in applications. To ensure their quantitative accuracy, they must be validated against experiments. In this work, such an experimental validation is performed for a 1d3v particle-in-cell simulation complemented with the Monte Carlo treatment of collision processes of a capacitively coupled radio frequency plasma driven at 13.56 MHz and operated in neon gas. In a geometrically symmetric reactor the electron density in the discharge center and the spatio-temporal distribution of the electron impact excitation rate from the ground into the Ne 2p$_1$ state are measured by a microwave cutoff probe and phase resolved optical emission spectroscopy, respectively. The measurements are conducted for electrode gaps between 50 mm and 90 mm, neutral gas pressures between 20 mTorr and 50 mTorr, and peak-to-peak values of the driving voltage waveform between 250 V and 650 V. Simulations are performed under identical discharge conditions. In the simulations, various combinations of surface coefficients characterising the interactions of electrons and heavy particles with the anodized aluminium electrode surfaces are adopted. We find, that the simulations using a constant effective heavy particle induced secondary electron emission coefficient of 0.3 and a realistic electron-surface interaction model (which considers energy-dependent and material specific elastic and inelastic electron reflection, as well as the emission of true secondary electrons from the surface) yield results which are in good quantitative agreement with the experimental data.",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14821",
  "pdf_url": "https://arxiv.org/pdf/2307.14821v1",
  "comment": "19 pages, 6 figures, submitted to Plasma Sources Science and Technology",
  "num_versions": null,
  "size_before_bytes": 8124140,
  "size_after_bytes": 240581
}