{
  "title": "Probabilistically robust conformal prediction",
  "authors": [
    "Subhankar Ghosh",
    "Yuanjie Shi",
    "Taha Belkhouja",
    "Yan Yan",
    "Jana Doppa",
    "Brian Jones"
  ],
  "submission_date": "2023-07-31T01:32:06+00:00",
  "revised_dates": [],
  "abstract": "Conformal prediction (CP) is a framework to quantify uncertainty of machine learning classifiers including deep neural networks. Given a testing example and a trained classifier, CP produces a prediction set of candidate labels with a user-specified coverage (i.e., true class label is contained with high probability). Almost all the existing work on CP assumes clean testing data and there is not much known about the robustness of CP algorithms w.r.t natural/adversarial perturbations to testing examples. This paper studies the problem of probabilistically robust conformal prediction (PRCP) which ensures robustness to most perturbations around clean input examples. PRCP generalizes the standard CP (cannot handle perturbations) and adversarially robust CP (ensures robustness w.r.t worst-case perturbations) to achieve better trade-offs between nominal performance and robustness. We propose a novel adaptive PRCP (aPRCP) algorithm to achieve probabilistically robust coverage. The key idea behind aPRCP is to determine two parallel thresholds, one for data samples and another one for the perturbations on data (aka \"quantile-of-quantile\" design). We provide theoretical analysis to show that aPRCP algorithm achieves robust coverage. Our experiments on CIFAR-10, CIFAR-100, and ImageNet datasets using deep neural networks demonstrate that aPRCP achieves better trade-offs than state-of-the-art CP and adversarially robust CP algorithms.",
  "categories": [
    "cs.LG",
    "stat.ML"
  ],
  "primary_category": "cs.LG",
  "doi": null,
  "journal_ref": "Uncertainty in Artificial Intelligence. PMLR 216:681-690, 2023",
  "arxiv_id": "2307.16360",
  "pdf_url": "https://arxiv.org/pdf/2307.16360v1",
  "comment": "Proceedings of the Thirty-Ninth Conference on Uncertainty in Artificial Intelligence, 2023",
  "num_versions": null,
  "size_before_bytes": 21260347,
  "size_after_bytes": 116411
}