{
  "title": "Equivariance and partial observations in Koopman operator theory for partial differential equations",
  "authors": [
    "Sebastian Peitz",
    "Hans Harder",
    "Feliks Nüske",
    "Friedrich Philipp",
    "Manuel Schaller",
    "Karl Worthmann"
  ],
  "submission_date": "2023-07-28T06:03:19+00:00",
  "revised_dates": [
    "2024-08-06T10:09:47+00:00",
    "2024-11-05T10:39:38+00:00"
  ],
  "abstract": "The Koopman operator has become an essential tool for data-driven analysis, prediction and control of complex systems. The main reason is the enormous potential of identifying linear function space representations of nonlinear dynamics from measurements. This equally applies to ordinary, stochastic, and partial differential equations (PDEs). Until now, with a few exceptions only, the PDE case is mostly treated rather superficially, and the specific structure of the underlying dynamics is largely ignored. In this paper, we show that symmetries in the system dynamics can be carried over to the Koopman operator, which allows us to significantly increase the model efficacy. Moreover, the situation where we only have access to partial observations (i.e., measurements, as is very common for experimental data) has not been treated to its full extent, either. Moreover, we address the highly-relevant case where we cannot measure the full state, where alternative approaches (e.g., delay coordinates) have to be considered. We derive rigorous statements on the required number of observables in this situation, based on embedding theory. We present numerical evidence using various numerical examples including the wave equation and the Kuramoto-Sivashinsky equation.",
  "categories": [
    "math.DS",
    "cs.LG"
  ],
  "primary_category": "math.DS",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15325",
  "pdf_url": "https://arxiv.org/pdf/2307.15325v3",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 13264229,
  "size_after_bytes": 265970
}