{
  "title": "Hierarchical Skeleton Meta-Prototype Contrastive Learning with Hard Skeleton Mining for Unsupervised Person Re-Identification",
  "authors": [
    "Haocong Rao",
    "Cyril Leung",
    "Chunyan Miao"
  ],
  "submission_date": "2023-07-24T16:18:22+00:00",
  "revised_dates": [
    "2023-07-27T00:06:19+00:00",
    "2023-09-19T00:08:54+00:00",
    "2023-09-20T00:06:19+00:00"
  ],
  "abstract": "With rapid advancements in depth sensors and deep learning, skeleton-based person re-identification (re-ID) models have recently achieved remarkable progress with many advantages. Most existing solutions learn single-level skeleton features from body joints with the assumption of equal skeleton importance, while they typically lack the ability to exploit more informative skeleton features from various levels such as limb level with more global body patterns. The label dependency of these methods also limits their flexibility in learning more general skeleton representations. This paper proposes a generic unsupervised Hierarchical skeleton Meta-Prototype Contrastive learning (Hi-MPC) approach with Hard Skeleton Mining (HSM) for person re-ID with unlabeled 3D skeletons. Firstly, we construct hierarchical representations of skeletons to model coarse-to-fine body and motion features from the levels of body joints, components, and limbs. Then a hierarchical meta-prototype contrastive learning model is proposed to cluster and contrast the most typical skeleton features (\"prototypes\") from different-level skeletons. By converting original prototypes into meta-prototypes with multiple homogeneous transformations, we induce the model to learn the inherent consistency of prototypes to capture more effective skeleton features for person re-ID. Furthermore, we devise a hard skeleton mining mechanism to adaptively infer the informative importance of each skeleton, so as to focus on harder skeletons to learn more discriminative skeleton representations. Extensive evaluations on five datasets demonstrate that our approach outperforms a wide variety of state-of-the-art skeleton-based methods. We further show the general applicability of our method to cross-view person re-ID and RGB-based scenarios with estimated skeletons.",
  "categories": [
    "cs.CV",
    "cs.AI"
  ],
  "primary_category": "cs.CV",
  "doi": "10.1007/s11263-023-01864-0",
  "journal_ref": null,
  "arxiv_id": "2307.12917",
  "pdf_url": null,
  "comment": "Published at International Journal of Computer Vision (IJCV) 2023. Codes are available at https://github.com/Kali-Hac/Hi-MPC. The Appendix A for Proof (6 pages) and Appendix B for Experiments (13 pages) are included in the version [v3] at arXiv:2307.12917",
  "num_versions": null,
  "size_before_bytes": 23182895,
  "size_after_bytes": 1743859
}