{
  "title": "Context Perception Parallel Decoder for Scene Text Recognition",
  "authors": [
    "Yongkun Du",
    "Zhineng Chen",
    "Caiyan Jia",
    "Xiaoting Yin",
    "Chenxia Li",
    "Yuning Du",
    "Yu-Gang Jiang"
  ],
  "submission_date": "2023-07-23T09:04:13+00:00",
  "revised_dates": [
    "2023-10-10T00:40:21+00:00"
  ],
  "abstract": "Scene text recognition (STR) methods have struggled to attain high accuracy and fast inference speed. Autoregressive (AR)-based models implement the recognition in a character-by-character manner, showing superiority in accuracy but with slow inference speed. Alternatively, parallel decoding (PD)-based models infer all characters in a single decoding pass, offering faster inference speed but generally worse accuracy. We first present an empirical study of AR decoding in STR, and discover that the AR decoder not only models linguistic context, but also provides guidance on visual context perception. Consequently, we propose Context Perception Parallel Decoder (CPPD) to predict the character sequence in a PD pass. CPPD devises a character counting module to infer the occurrence count of each character, and a character ordering module to deduce the content-free reading order and placeholders. Meanwhile, the character prediction task associates the placeholders with characters. They together build a comprehensive recognition context. We construct a series of CPPD models and also plug the proposed modules into existing STR decoders. Experiments on both English and Chinese benchmarks demonstrate that the CPPD models achieve highly competitive accuracy while running approximately 8x faster than their AR-based counterparts. Moreover, the plugged models achieve significant accuracy improvements. Code is at \\href{https://github.com/PaddlePaddle/PaddleOCR/blob/dygraph/doc/doc_en/algorithm_rec_cppd_en.md}{this https URL}.",
  "categories": [
    "cs.CV"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12270",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 6161633,
  "size_after_bytes": 301599
}