{
  "title": "Mitigating Cross-Database Differences for Learning Unified HRTF Representation",
  "authors": [
    "Yutong Wen",
    "You Zhang",
    "Zhiyao Duan"
  ],
  "submission_date": "2023-07-27T00:06:22+00:00",
  "revised_dates": [],
  "abstract": "Individualized head-related transfer functions (HRTFs) are crucial for accurate sound positioning in virtual auditory displays. As the acoustic measurement of HRTFs is resource-intensive, predicting individualized HRTFs using machine learning models is a promising approach at scale. Training such models require a unified HRTF representation across multiple databases to utilize their respectively limited samples. However, in addition to differences on the spatial sampling locations, recent studies have shown that, even for the common location, HRTFs across databases manifest consistent differences that make it trivial to tell which databases they come from. This poses a significant challenge for learning a unified HRTF representation across databases. In this work, we first identify the possible causes of these cross-database differences, attributing them to variations in the measurement setup. Then, we propose a novel approach to normalize the frequency responses of HRTFs across databases. We show that HRTFs from different databases cannot be classified by their database after normalization. We further show that these normalized HRTFs can be used to learn a more unified HRTF representation across databases than the prior art. We believe that this normalization approach paves the road to many data-intensive tasks on HRTF modeling.",
  "categories": [
    "eess.AS",
    "cs.SD"
  ],
  "primary_category": "eess.AS",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14547",
  "pdf_url": "https://arxiv.org/pdf/2307.14547v1",
  "comment": "5 pages, 4 figures, accepted by IEEE Workshop on Applications of Signal Processing to Audio and Acoustics (WASPAA) 2023",
  "num_versions": null,
  "size_before_bytes": 6801193,
  "size_after_bytes": 158437
}