{
  "title": "Tunable topological phase transition in soft Rayleigh beam system with imperfect interfaces",
  "authors": [
    "Tao Feng",
    "Letian Gan",
    "Shiheng Zhao",
    "Zheng Chang",
    "Siyang Li",
    "Yaoting Xue",
    "Xuxu Yang",
    "Tuck-Whye Wong",
    "Tiefeng Li",
    "Weiqiu Chen"
  ],
  "submission_date": "2023-07-28T12:11:23+00:00",
  "revised_dates": [],
  "abstract": "Acoustic metamaterials, particularly the topological insulators, exhibit exceptional wave characteristics that have sparked considerable research interest. The study of imperfect interfaces affect is of significant importance for the modeling of wave propagation behavior in topological insulators. This paper models a soft Rayleigh beam system with imperfect interfaces, and investigates its topological phase transition process tuned by mechanical loadings. The model reveals that the topological phase transition process can be observed by modifying the distance between imperfect interfaces in the system. When a uniaxial stretch is applied, the topological phase transition points for longitudinal waves decrease within a limited frequency range, while they increase within a larger frequency scope for transverse waves. Enhancing the rigidity of the imperfect interfaces also enables shifting of the topological phase transition point within a broader frequency range for longitudinal waves and a confined range for transverse waves. The transition of topologically protected interface modes in the transmission performance of a twenty-cell system is verified, which include altering frequencies, switching from interface mode to edge mode. Overall, this study provides a new approach and guideline for controlling topological phase transition in composite and soft phononic crystal systems.",
  "categories": [
    "cond-mat.soft"
  ],
  "primary_category": "cond-mat.soft",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15509",
  "pdf_url": "https://arxiv.org/pdf/2307.15509v1",
  "comment": "39 pages,8 figures",
  "num_versions": null,
  "size_before_bytes": 3151446,
  "size_after_bytes": 1938166
}