{
  "title": "Fairness Under Demographic Scarce Regime",
  "authors": [
    "Patrik Joslin Kenfack",
    "Samira Ebrahimi Kahou",
    "Ulrich Aïvodji"
  ],
  "submission_date": "2023-07-24T19:07:34+00:00",
  "revised_dates": [
    "2024-09-19T00:05:42+00:00"
  ],
  "abstract": "Most existing works on fairness assume the model has full access to demographic information. However, there exist scenarios where demographic information is partially available because a record was not maintained throughout data collection or for privacy reasons. This setting is known as demographic scarce regime. Prior research has shown that training an attribute classifier to replace the missing sensitive attributes (proxy) can still improve fairness. However, using proxy-sensitive attributes worsens fairness-accuracy tradeoffs compared to true sensitive attributes. To address this limitation, we propose a framework to build attribute classifiers that achieve better fairness-accuracy tradeoffs. Our method introduces uncertainty awareness in the attribute classifier and enforces fairness on samples with demographic information inferred with the lowest uncertainty. We show empirically that enforcing fairness constraints on samples with uncertain sensitive attributes can negatively impact the fairness-accuracy tradeoff. Our experiments on five datasets showed that the proposed framework yields models with significantly better fairness-accuracy tradeoffs than classic attribute classifiers. Surprisingly, our framework can outperform models trained with fairness constraints on the true sensitive attributes in most benchmarks. We also show that these findings are consistent with other uncertainty measures such as conformal prediction.",
  "categories": [
    "cs.LG",
    "cs.AI"
  ],
  "primary_category": "cs.LG",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13081",
  "pdf_url": null,
  "comment": "Published in Transactions on Machine Learning Research (TMLR), 2024",
  "num_versions": null,
  "size_before_bytes": 2316386,
  "size_after_bytes": 290464
}