{
  "title": "Effective Statistical Control Strategies for Complex Turbulent Dynamical Systems",
  "authors": [
    "Jeffrey Covington",
    "Di Qi",
    "Nan Chen"
  ],
  "submission_date": "2023-07-28T15:55:08+00:00",
  "revised_dates": [],
  "abstract": "Control of complex turbulent dynamical systems involving strong nonlinearity and high degrees of internal instability is an important topic in practice. Different from traditional methods for controlling individual trajectories, controlling the statistical features of a turbulent system offers a more robust and efficient approach. Crude first-order linear response approximations were typically employed in previous works for statistical control with small initial perturbations. This paper aims to develop two new statistical control strategies for scenarios with more significant initial perturbations and stronger nonlinear responses, allowing the statistical control framework to be applied to a much wider range of problems. First, higher-order methods, incorporating the second-order terms, are developed to resolve the full control-forcing relation. The corresponding changes to recovering the forcing perturbation effectively improve the performance of the statistical control strategy. Second, a mean closure model for the mean response is developed, which is based on the explicit mean dynamics given by the underlying turbulent dynamical system. The dependence of the mean dynamics on higher-order moments is closed using linear response theory but for the response of the second-order moments to the forcing perturbation rather than the mean response directly. The performance of these methods is evaluated extensively on prototype nonlinear test models, which exhibit crucial turbulent features, including non-Gaussian statistics and regime switching with large initial perturbations. The numerical results illustrate the feasibility of different approaches due to their physical and statistical structures and provide detailed guidelines for choosing the most suitable method based on the model properties.",
  "categories": [
    "math.DS",
    "math-ph"
  ],
  "primary_category": "math.DS",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15637",
  "pdf_url": "https://arxiv.org/pdf/2307.15637v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 4911712,
  "size_after_bytes": 111085
}