{
  "title": "The sum of root-leaf distance interdiction problem with cardinality constraint by upgrading edges on trees",
  "authors": [
    "Xiao Li",
    "Xiucui Guan",
    "Qiao Zhang",
    "Xinyi Yin",
    "Panos M. Pardalos"
  ],
  "submission_date": "2023-07-31T03:47:50+00:00",
  "revised_dates": [],
  "abstract": "A network for the transportation of supplies can be described as a rooted tree with a weight of a degree of congestion for each edge. We take the sum of root-leaf distance (SRD) on a rooted tree as the whole degree of congestion of the tree. Hence, we consider the SRD interdiction problem on trees with cardinality constraint by upgrading edges (denoted by (SDIPTC) in brief). It aims to maximize the SRD by upgrading the weights of $N$ critical edges such that the total upgrade cost under some measurement is upper-bounded by a given value. The relevant minimum cost problem (MCSDIPTC) aims to minimize the total upgrade cost on the premise that the SRD is lower-bounded by a given value. We develop two different norms including weighted $l_\\infty$ norm and weighted bottleneck Hamming distance to measure the upgrade cost. We propose two binary search algorithms within O($n\\log n$) time for the problems (SDIPTC) under the two norms, respectively. For problems (MCSDIPTC),we propose two binary search algorithms within O($N n^2$) and O($n \\log n$) under weighted $l_\\infty$ norm and weighted bottleneck Hamming distance, respectively. These problems are solved through their subproblems (SDIPT) and (MCSDIPT), in which we ignore the cardinality constraint on the number of upgraded edges. Finally, we design numerical experiments to show the effectiveness of these algorithms.",
  "categories": [
    "math.OC",
    "math.CO"
  ],
  "primary_category": "math.OC",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16392",
  "pdf_url": "https://arxiv.org/pdf/2307.16392v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1467640,
  "size_after_bytes": 235096
}