{
  "title": "EnTri: Ensemble Learning with Tri-level Representations for Explainable Scene Recognition",
  "authors": [
    "Amirhossein Aminimehr",
    "Amirali Molaei",
    "Erik Cambria"
  ],
  "submission_date": "2023-07-23T22:11:23+00:00",
  "revised_dates": [
    "2024-07-16T01:21:02+00:00"
  ],
  "abstract": "Scene recognition based on deep-learning has made significant progress, but there are still limitations in its performance due to challenges posed by inter-class similarities and intra-class dissimilarities. Furthermore, prior research has primarily focused on improving classification accuracy, yet it has given less attention to achieving interpretable, precise scene classification. Therefore, we are motivated to propose EnTri, an ensemble scene recognition framework that employs ensemble learning using a hierarchy of visual features. EnTri represents features at three distinct levels of detail: pixel-level, semantic segmentation-level, and object class and frequency level. By incorporating distinct feature encoding schemes of differing complexity and leveraging ensemble strategies, our approach aims to improve classification accuracy while enhancing transparency and interpretability via visual and textual explanations. To achieve interpretability, we devised an extension algorithm that generates both visual and textual explanations highlighting various properties of a given scene that contribute to the final prediction of its category. This includes information about objects, statistics, spatial layout, and textural details. Through experiments on benchmark scene classification datasets, EnTri has demonstrated superiority in terms of recognition accuracy, achieving competitive performance compared to state-of-the-art approaches, with an accuracy of 87.69%, 75.56%, and 99.17% on the MIT67, SUN397, and UIUC8 datasets, respectively.",
  "categories": [
    "cs.CV"
  ],
  "primary_category": "cs.CV",
  "doi": "10.2139/ssrn.4482110",
  "journal_ref": null,
  "arxiv_id": "2307.12442",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 49379524,
  "size_after_bytes": 1028474
}