{
  "title": "Normal state quantum geometry and superconducting domes in (111) oxide interfaces",
  "authors": [
    "Florian Simon",
    "Mark O. Goerbig",
    "Marc Gabay"
  ],
  "submission_date": "2023-07-26T07:02:29+00:00",
  "revised_dates": [
    "2023-11-22T01:21:38+00:00",
    "2024-04-12T00:43:53+00:00",
    "2024-07-19T00:48:33+00:00"
  ],
  "abstract": "We theoretically investigate the influence of the normal state quantum geometry on the superconducting phase in (111) oriented oxide interfaces and discuss some of the implications for the $\\text{LaAlO}_3/\\text{SrTiO}_3$ (LAO/STO) heterostructure. From a tight-binding modeling of the interface, we derive a two-band low-energy model, allowing us to analytically compute the quantum geometry and giving us access to the superfluid weight, as well as to showcase the role of two particular relevant energy scales. One is given by the trigonal crystal field which stems from the local trigonal symmetry at the interface, and the other one is due to orbital mixing at the interface. Our calculations indicate that the variation of the superfluid weight with the chemical potential $μ$ is controlled by the quantum geometry in the low-$μ$ limit where it presents a dome. At higher values of $μ$ the conventional contribution dominates. In order to make quantitative comparisons between our results and experimental findings, we rely on an experimentally observed global reduction of the superfluid weight that we apply to both the conventional and geometric contributions. Furthermore, an experimentally measured non-monotonic variation of $μ$ with the gate voltage $V_g$ is taken into account and yields a two-dome scenario for the superconducting critical temperature as a function of $V_g$. The observed dome in the low-$V_g$ regime is explained by the non-monotonic evolution of a dominant conventional part of the superfluid density. In contrast, the expected second dome at larger values of $V_g$ limit would be due to a dominant quantum-geometric contribution.",
  "categories": [
    "cond-mat.supr-con",
    "cond-mat.mes-hall"
  ],
  "primary_category": "cond-mat.supr-con",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13993",
  "pdf_url": null,
  "comment": "email of corresponding author: florian.simon1@universite-paris-saclay.fr",
  "num_versions": null,
  "size_before_bytes": 16693528,
  "size_after_bytes": 425934
}