{
  "title": "Improved guarantees for optimal Nash equilibrium seeking and bilevel variational inequalities",
  "authors": [
    "Sepideh Samadi",
    "Farzad Yousefian"
  ],
  "submission_date": "2023-07-24T03:56:31+00:00",
  "revised_dates": [
    "2023-08-04T00:26:06+00:00",
    "2024-04-18T00:22:39+00:00",
    "2024-09-30T00:23:58+00:00"
  ],
  "abstract": "We consider a class of hierarchical variational inequality (VI) problems that subsumes VI-constrained optimization and several other problem classes including the optimal solution selection problem and the optimal Nash equilibrium (NE) seeking problem. Our main contributions are threefold. (i) We consider bilevel VIs with monotone and Lipschitz continuous mappings and devise a single-timescale iteratively regularized extragradient method, named IR-EG$_{\\texttt{m,m}}$. We improve the existing iteration complexity results for addressing both bilevel VI and VI-constrained convex optimization problems. (ii) Under the strong monotonicity of the outer level mapping, we develop a method named IR-EG$_{\\texttt{s,m}}$ and derive faster guarantees than those in (i). We also study the iteration complexity of this method under a constant regularization parameter. These results appear to be new for both bilevel VIs and VI-constrained optimization. (iii) To our knowledge, complexity guarantees for computing the optimal NE in nonconvex settings do not exist. Motivated by this lacuna, we consider VI-constrained nonconvex optimization problems and devise an inexactly-projected gradient method, named IPR-EG, where the projection onto the unknown set of equilibria is performed using IR-EG$_{\\texttt{s,m}}$ with a prescribed termination criterion and an adaptive regularization parameter. We obtain new complexity guarantees in terms of a residual map and an infeasibility metric for computing a stationary point. We validate the theoretical findings using preliminary numerical experiments for computing the best and the worst Nash equilibria.",
  "categories": [
    "math.OC"
  ],
  "primary_category": "math.OC",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12511",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 6316878,
  "size_after_bytes": 4199330
}