{
  "title": "Cascade of polarized Compton scattering and Breit-Wheeler pair production",
  "authors": [
    "Qian Zhao",
    "Ting Sun",
    "Kun Xue",
    "Feng Wan",
    "Jian-Xing Li"
  ],
  "submission_date": "2023-07-31T04:40:13+00:00",
  "revised_dates": [
    "2023-11-06T08:45:52+00:00"
  ],
  "abstract": "Cascaded Compton scattering and Breit-Wheeler (BW) processes play fundamental roles in high-energy astrophysical sources and laser-driven quantum electrodynamics (QED) plasmas. A thorough comprehension of the polarization transfer in these cascaded processes is essential for elucidating the polarization mechanism of high-energy cosmic gamma rays and laser-driven QED plasmas. In this study, we employ analytical cross-sectional calculations and Monte Carlo (MC) numerical simulations to investigate the polarization transfer in the cascade of electron-seeded inverse Compton scattering (ICS) and BW process. Theoretical analysis indicates that the polarization of background photons can effectively transfer to final-state particles in the first-generation cascade due to helicity transfer. Through MC simulations involving polarized background photons and non-polarized seed electrons, we reveal the characteristic polarization curves as a function of particle energy produced by the cascaded processes of ICS and BW pair production. Our results demonstrate that the first-generation photons from ICS exhibit the non-decayed stair-shape polarization curves, in contrast to the linearly decayed ones of the first-generation electrons. Interestingly, this polarization curve trend can be reversed in the second-generation cascade, facilitated by the presence of polarized first-generation BW pairs with fluctuant polarization curves. The cascade culminates with the production of second-generation BW pairs, due to diminished energy of second-generation photons below the threshold of BW process. Our findings provide crucial insights into the cascaded processes of Compton scattering and BW process, significantly contributing to the understanding and further exploration of laser-driven QED plasma creation in laboratory settings and high-energy astrophysics research.",
  "categories": [
    "hep-ph"
  ],
  "primary_category": "hep-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16401",
  "pdf_url": "https://arxiv.org/pdf/2307.16401v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 19195494,
  "size_after_bytes": 211298
}