{
  "title": "TROPHY: A Topologically Robust Physics-Informed Tracking Framework for Tropical Cyclones",
  "authors": [
    "Lin Yan",
    "Hanqi Guo",
    "Thomas Peterka",
    "Bei Wang",
    "Jiali Wang"
  ],
  "submission_date": "2023-07-28T00:44:55+00:00",
  "revised_dates": [],
  "abstract": "Tropical cyclones (TCs) are among the most destructive weather systems. Realistically and efficiently detecting and tracking TCs are critical for assessing their impacts and risks. Recently, a multilevel robustness framework has been introduced to study the critical points of time-varying vector fields. The framework quantifies the robustness of critical points across varying neighborhoods. By relating the multilevel robustness with critical point tracking, the framework has demonstrated its potential in cyclone tracking. An advantage is that it identifies cyclonic features using only 2D wind vector fields, which is encouraging as most tracking algorithms require multiple dynamic and thermodynamic variables at different altitudes. A disadvantage is that the framework does not scale well computationally for datasets containing a large number of cyclones. This paper introduces a topologically robust physics-informed tracking framework (TROPHY) for TC tracking. The main idea is to integrate physical knowledge of TC to drastically improve the computational efficiency of multilevel robustness framework for large-scale climate datasets. First, during preprocessing, we propose a physics-informed feature selection strategy to filter 90% of critical points that are short-lived and have low stability, thus preserving good candidates for TC tracking. Second, during in-processing, we impose constraints during the multilevel robustness computation to focus only on physics-informed neighborhoods of TCs. We apply TROPHY to 30 years of 2D wind fields from reanalysis data in ERA5 and generate a number of TC tracks. In comparison with the observed tracks, we demonstrate that TROPHY can capture TC characteristics that are comparable to and sometimes even better than a well-validated TC tracking algorithm that requires multiple dynamic and thermodynamic scalar fields.",
  "categories": [
    "physics.ao-ph",
    "cs.CV"
  ],
  "primary_category": "physics.ao-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15243",
  "pdf_url": "https://arxiv.org/pdf/2307.15243v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 17255792,
  "size_after_bytes": 242486
}