{
  "title": "Holistic Survey of Privacy and Fairness in Machine Learning",
  "authors": [
    "Sina Shaham",
    "Arash Hajisafi",
    "Minh K Quan",
    "Dinh C Nguyen",
    "Bhaskar Krishnamachari",
    "Charith Peris",
    "Gabriel Ghinita",
    "Cyrus Shahabi",
    "Pubudu N. Pathirana"
  ],
  "submission_date": "2023-07-28T23:39:29+00:00",
  "revised_dates": [],
  "abstract": "Privacy and fairness are two crucial pillars of responsible Artificial Intelligence (AI) and trustworthy Machine Learning (ML). Each objective has been independently studied in the literature with the aim of reducing utility loss in achieving them. Despite the significant interest attracted from both academia and industry, there remains an immediate demand for more in-depth research to unravel how these two objectives can be simultaneously integrated into ML models. As opposed to well-accepted trade-offs, i.e., privacy-utility and fairness-utility, the interrelation between privacy and fairness is not well-understood. While some works suggest a trade-off between the two objective functions, there are others that demonstrate the alignment of these functions in certain scenarios. To fill this research gap, we provide a thorough review of privacy and fairness in ML, including supervised, unsupervised, semi-supervised, and reinforcement learning. After examining and consolidating the literature on both objectives, we present a holistic survey on the impact of privacy on fairness, the impact of fairness on privacy, existing architectures, their interaction in application domains, and algorithms that aim to achieve both objectives while minimizing the utility sacrificed. Finally, we identify research challenges in achieving privacy and fairness concurrently in ML, particularly focusing on large language models.",
  "categories": [
    "cs.LG"
  ],
  "primary_category": "cs.LG",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15838",
  "pdf_url": "https://arxiv.org/pdf/2307.15838v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 8817434,
  "size_after_bytes": 481886
}