{
  "title": "On the survivability of a population of gas giant planets on wide orbits",
  "authors": [
    "Ethan Carter",
    "Dimitris Stamatellos"
  ],
  "submission_date": "2023-07-27T14:48:24+00:00",
  "revised_dates": [],
  "abstract": "The existence of giant planets on wide orbits ($\\stackrel{>}{_\\sim}100$AU) challenge planet formation theories; the core accretion scenario has difficulty in forming them, whereas the disc instability model forms an overabundance of them that is not seen observations. We perform $N$-body simulations investigating the effect of close stellar encounters ($\\leq 1200$AU) on systems hosting wide-orbit giant planets and the extent at which such interactions may disrupt the initial wide-orbit planet population. We find that the effect of an interaction on the orbit of a planet is stronger for high-mass, low-velocity perturbers, as expected. We find that due to just a single encounter there is a $\\sim 17%$ chance that the wide-orbit giant planet is liberated in the field, a $\\sim 10$% chance it is scattered significantly outwards, and a $\\sim 6$% chance it is significantly scattered inwards. Moreover, there is a $\\sim 21\\%$ chance that its eccentricity is excited to e>0.1, making it more prone to disruption in subsequent encounters. The results strongly suggest that the effect of even a single stellar encounter is significant in disrupting the primordial wide-orbit giant planet population; in reality the effect will be even more prominent, as in a young star-forming region more such interactions are expected to occur. We conclude that the low occurrence rate of wide-orbit planets revealed by observational surveys does not exclude the possibility that such planetary systems are initially abundant, and therefore the disc-instability model may be a plausible scenario for their formation.",
  "categories": [
    "astro-ph.EP",
    "astro-ph.SR"
  ],
  "primary_category": "astro-ph.EP",
  "doi": "10.1093/mnras/stad2314",
  "journal_ref": null,
  "arxiv_id": "2307.14908",
  "pdf_url": "https://arxiv.org/pdf/2307.14908v1",
  "comment": "10 pages, 9 figures",
  "num_versions": null,
  "size_before_bytes": 16015667,
  "size_after_bytes": 9422001
}