{
  "title": "Numerical Simulation of an Idealised Richtmyer-Meshkov Instability Shock Tube Experiment",
  "authors": [
    "Michael Groom",
    "Ben Thornber"
  ],
  "submission_date": "2023-07-30T09:50:32+00:00",
  "revised_dates": [],
  "abstract": "The effects of initial conditions on the evolution of the Richtmyer-Meshkov instability (RMI) at early to intermediate times are analysed, using numerical simulations of an idealised version of recent shock tube experiments performed at the University of Arizona. The experimental results are bracketed by performing both implicit large-eddy simulations of the high-Reynolds-number limit as well as direct numerical simulations (DNS) at Reynolds numbers lower than those observed in the experiments. Various measures of the mixing layer width, based on both the plane-averaged turbulent kinetic energy and volume fraction profiles are used to explore the effects of initial conditions on $θ$ and are compared with the experimental results. The decay rate of the total fluctuating kinetic energy is also used to estimate $θ$ based on a relationship that assumes self-similar growth of the mixing layer. The estimates for $θ$ range between 0.44 and 0.52 for each of the broadband perturbations considered and are in good agreement with the experimental results. Overall, the results demonstrate important differences between broadband and narrowband surface perturbations, as well as persistent effects of finite bandwidth on the growth rate of mixing layers evolving from broadband perturbations. Good agreement is obtained with the experiments for the different quantities considered; however, the results also show that care must be taken when using measurements based on the velocity field to infer properties of the concentration field.",
  "categories": [
    "physics.flu-dyn"
  ],
  "primary_category": "physics.flu-dyn",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16187",
  "pdf_url": "https://arxiv.org/pdf/2307.16187v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 16532100,
  "size_after_bytes": 586712
}