{
  "title": "Mixed state entanglement measures for the dipole deformed supersymmetric Yang-Mills theory",
  "authors": [
    "Anirban Roy Chowdhury",
    "Ashis Saha",
    "Sunandan Gangopadhyay"
  ],
  "submission_date": "2023-07-25T05:22:49+00:00",
  "revised_dates": [
    "2023-08-01T00:07:44+00:00",
    "2023-12-12T01:50:00+00:00"
  ],
  "abstract": "Two different entanglement measures for mixed states, namely, the entanglement of purification and entanglement negativity has been holographically computed for the dipole deformed supersymmetric Yang-Mills (SYM) theory by considering its gravity dual. The dipole deformation induces non-locality in the SYM theory which is characterized by a length-scale $a=λ^{\\frac{1}{2}}\\tilde{L}$. Considering a strip like subsystem of length $\\frac{l}{a}$ (in dimensionless form), we first analytically calculate the holographic entanglement entropy for and compare the obtained results with that of obtained numerically.~The analytical calculations have been carried out by considering $au_t \\leq 1$,~$1\\leq au_t < au_b$ and $au_t\\sim au_b$, where $au_b$ is the UV cut-off. The choice of these regions enable us to identify the expansion parameters needed to carry out binomial expansions. The entanglement measures expectedly displays a smooth behaviour with respect to the subsystem size as the geometry has a smooth transition between the mentioned regions. Using these results, the holographic mutual information is then computed for two disjoint subsystems $A$ and $B$. Based upon the $E_{P}=E_{W}$ duality, the entanglement of purification ($E_{P}$) is then computed and the effects of dipole deformation in this context have been studied. Finally, we proceed to compute entanglement negativity for this theory and compare the obtained result with that of the standard SYM theory in order to get a better understanding about the effects of the non-locality.",
  "categories": [
    "hep-th"
  ],
  "primary_category": "hep-th",
  "doi": null,
  "journal_ref": "Annals of Physics 460(2024)169565",
  "arxiv_id": "2307.13712",
  "pdf_url": null,
  "comment": "23 pages Latex,7 figures",
  "num_versions": null,
  "size_before_bytes": 2363457,
  "size_after_bytes": 599482
}