{
  "title": "Benchmarking and Analyzing Robust Point Cloud Recognition: Bag of Tricks for Defending Adversarial Examples",
  "authors": [
    "Qiufan Ji",
    "Lin Wang",
    "Cong Shi",
    "Shengshan Hu",
    "Yingying Chen",
    "Lichao Sun"
  ],
  "submission_date": "2023-07-31T01:34:24+00:00",
  "revised_dates": [
    "2023-08-10T02:45:55+00:00"
  ],
  "abstract": "Deep Neural Networks (DNNs) for 3D point cloud recognition are vulnerable to adversarial examples, threatening their practical deployment. Despite the many research endeavors have been made to tackle this issue in recent years, the diversity of adversarial examples on 3D point clouds makes them more challenging to defend against than those on 2D images. For examples, attackers can generate adversarial examples by adding, shifting, or removing points. Consequently, existing defense strategies are hard to counter unseen point cloud adversarial examples. In this paper, we first establish a comprehensive, and rigorous point cloud adversarial robustness benchmark to evaluate adversarial robustness, which can provide a detailed understanding of the effects of the defense and attack methods. We then collect existing defense tricks in point cloud adversarial defenses and then perform extensive and systematic experiments to identify an effective combination of these tricks. Furthermore, we propose a hybrid training augmentation methods that consider various types of point cloud adversarial examples to adversarial training, significantly improving the adversarial robustness. By combining these tricks, we construct a more robust defense framework achieving an average accuracy of 83.45\\% against various attacks, demonstrating its capability to enabling robust learners. Our codebase are open-sourced on: \\url{https://github.com/qiufan319/benchmark_pc_attack.git}.",
  "categories": [
    "cs.CV",
    "cs.CR",
    "cs.LG"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16361",
  "pdf_url": "https://arxiv.org/pdf/2307.16361v2",
  "comment": "8 pages 6 figures",
  "num_versions": null,
  "size_before_bytes": 2390736,
  "size_after_bytes": 1314750
}