{
  "title": "The SNR Kes 17-ISM interaction: a fresh view from radio and $γ$ rays",
  "authors": [
    "Leonardo Supán",
    "Gabriela Castelletti",
    "Anne Lemière"
  ],
  "submission_date": "2023-07-28T16:12:40+00:00",
  "revised_dates": [],
  "abstract": "This paper presents a comprehensive analysis of the Galactic SNR Kes 17 (G304.6+0.1) with focus on its radio synchrotron emission, environs, and the factors contributing to the observed gamma rays. The firstly-obtained integrated radio continuum spectrum from 88 to 8800 MHz yields an index alpha = -0.488 +/- 0.023 (S_nu $\\propto$ nu^alpha), indicative of a linear particle acceleration process at the shock front. Accounting for the SNR radio shell size, the distribution of atomic hydrogen (n_H ~ 10 cm^-3), and assuming the SNR is in the Sedov-Taylor stage of its evolution, we estimate Kes 17 to be roughly 11 kyr. From 12CO and 13CO (J=1-0) emission-line data as a proxy for molecular hydrogen we provided the first evidence that the eastern shell of Kes 17 is engulfing a molecular enhancement, with 4.2 x 10^4 M_sun and n ~ 300 cm^-3. Towards the western boundary of Kes 17 there are not CO signatures above 3 sigma, despite previously reported infrared observations have revealed shocked molecular gas at that location. This suggests the existence of a CO-dark interacting molecular gas, a phenomenon also recorded in other Galactic SNRs (e.g. CTB 37A and RX J1713.7-3946). Additionally, by analysing ~14.5 yr of data from Fermi-LAT, we determined a power-law photon index in the 0.3-300 GeV range of Gamma = 2.39 +/- 0.04^+0.063_-0.114 (+/-stat +/-syst) in agreement with prior studies. The energy flux turns out to be (2.98 +/- 0.14) x 10^-11 erg cm-2 s-1 implying a luminosity (2.22 +/- 0.45) x 10^35 erg s-1 at ~8 kpc. Finally, we successfully modelled the multiwavelength SED by incorporating the improved radio synchrotron spectrum and the new gamma-ray measurements. Our analysis indicates that the observed GeV flux most likely originates from the interaction of Kes 17 with western ''dark'' CO zone with a proton density n_p ~ 400 cm-3.",
  "categories": [
    "astro-ph.HE",
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.HE",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15649",
  "pdf_url": "https://arxiv.org/pdf/2307.15649v1",
  "comment": "9 pages, 6 figures, 2 tables. Accepted for publication in the Astronomy & Astrophysics Journal. The quality of the figures has been degraded",
  "num_versions": null,
  "size_before_bytes": 1633214,
  "size_after_bytes": 87015
}