{
  "title": "Finding regions of bounded motion in binary asteroid environment using Lagrangian descriptors",
  "authors": [
    "Sebastiano Raffa",
    "Gianmario Merisio",
    "Francesco Topputo"
  ],
  "submission_date": "2023-07-27T15:33:11+00:00",
  "revised_dates": [
    "2023-08-01T08:10:34+00:00"
  ],
  "abstract": "Trajectory design in highly-perturbed environments like binary asteroids is challenging. It typically requires using realistic, non-autonomous dynamical models in which periodic solutions derived in autonomous systems vanish. In this work, Lagrangian descriptors are employed in the perturbed planar bi-elliptic restricted four-body problem to find regions of bounded motion over a finite horizon about Dimorphos, the secondary body of the (65803) Didymos binary system. Results show that Lagrangian descriptors successfully reveal phase space organizing structures both in the unperturbed and perturbed planar bi-elliptic restricted four-body problem. With no solar radiation pressure, regions of bounded motion are visually identified, so granting access to a vast selection of bounded orbits about Dimorphos. Conversely, the presence of solar radiation pressure breaks down the majority of structures, leading to a large region of unstable motion with rare exceptions. Lagrangian descriptors are computationally inexpensive dynamical indicators that could be conveniently applied to astrodynamics.",
  "categories": [
    "astro-ph.EP",
    "math.DS",
    "nlin.CD"
  ],
  "primary_category": "astro-ph.EP",
  "doi": "10.1016/j.cnsns.2023.107198",
  "journal_ref": "Communications in Nonlinear Science and Numerical Simulation 121 (2023): 107198",
  "arxiv_id": "2307.14943",
  "pdf_url": "https://arxiv.org/pdf/2307.14943v2",
  "comment": "Post-print submitted to \"Communications in Nonlinear Science and Numerical Simulation\". EXTREMA - Engineering Extremely Rare Events in Astrodynamics for Deep-Space Missions in Autonomy, European Research Council (ERC), European Union (EU), Horizon 2020. The content of this document reflects only the author's view. ERC is not responsible for any use that may be made of the information it contains",
  "num_versions": null,
  "size_before_bytes": 11236742,
  "size_after_bytes": 6420010
}