{
  "title": "Protein sizing with Differential Dynamic Microscopy",
  "authors": [
    "Chiara Guidolin",
    "Christopher Heim",
    "Nathan B P Adams",
    "Philipp Baaske",
    "Valeria Rondelli",
    "Roberto Cerbino",
    "Fabio Giavazzi"
  ],
  "submission_date": "2023-07-24T08:34:58+00:00",
  "revised_dates": [],
  "abstract": "Introduced more than fifty years ago, dynamic light scattering is routinely used to determine the size distribution of colloidal suspensions, as well as of macromolecules in solution, such as proteins, nucleic acids, and their complexes. More recently, differential dynamic microscopy has been proposed as a way to perform dynamic light scattering experiments with a microscope, with much less stringent constraints in terms of cleanliness of the optical surfaces, but a potentially lower sensitivity due to the use of camera-based detectors. In this work, we push bright-field differential dynamic microscopy beyond known limits and show it to be sufficiently sensitive to size small macromolecules in diluted solutions. By considering solutions of three different proteins (Bovine Serum Albumin, Lysozyme, and Pepsin), we accurately determine the diffusion coefficient and hydrodynamic radius of both single proteins and small protein aggregates down to concentrations of a few milligrams per milliliter. In addition, we present preliminary results showing unexplored potential for the determination of virial coefficients. Our results are in excellent agreement with the ones obtained in parallel with a state-of-the-art commercial dynamic light scattering setup, showing that differential dynamic microscopy represents a valuable alternative for rapid, label-free protein sizing with an optical microscope.",
  "categories": [
    "cond-mat.soft"
  ],
  "primary_category": "cond-mat.soft",
  "doi": "10.1021/acs.macromol.3c00782",
  "journal_ref": null,
  "arxiv_id": "2307.12608",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 3792945,
  "size_after_bytes": 98012
}