{
  "title": "Anatomy-Aware Lymph Node Detection in Chest CT using Implicit Station Stratification",
  "authors": [
    "Ke Yan",
    "Dakai Jin",
    "Dazhou Guo",
    "Minfeng Xu",
    "Na Shen",
    "Xian-Sheng Hua",
    "Xianghua Ye",
    "Le Lu"
  ],
  "submission_date": "2023-07-28T02:41:41+00:00",
  "revised_dates": [],
  "abstract": "Finding abnormal lymph nodes in radiological images is highly important for various medical tasks such as cancer metastasis staging and radiotherapy planning. Lymph nodes (LNs) are small glands scattered throughout the body. They are grouped or defined to various LN stations according to their anatomical locations. The CT imaging appearance and context of LNs in different stations vary significantly, posing challenges for automated detection, especially for pathological LNs. Motivated by this observation, we propose a novel end-to-end framework to improve LN detection performance by leveraging their station information. We design a multi-head detector and make each head focus on differentiating the LN and non-LN structures of certain stations. Pseudo station labels are generated by an LN station classifier as a form of multi-task learning during training, so we do not need another explicit LN station prediction model during inference. Our algorithm is evaluated on 82 patients with lung cancer and 91 patients with esophageal cancer. The proposed implicit station stratification method improves the detection sensitivity of thoracic lymph nodes from 65.1% to 71.4% and from 80.3% to 85.5% at 2 false positives per patient on the two datasets, respectively, which significantly outperforms various existing state-of-the-art baseline techniques such as nnUNet, nnDetection and LENS.",
  "categories": [
    "cs.CV"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15271",
  "pdf_url": "https://arxiv.org/pdf/2307.15271v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1001171,
  "size_after_bytes": 111849
}