{
  "title": "Broadband parametric amplification for multiplexed SiMOS quantum dot signals",
  "authors": [
    "Victor Elhomsy",
    "Luca Planat",
    "David J. Niegemann",
    "Bruna Cardoso-Paz",
    "Ali Badreldin",
    "Bernhard Klemt",
    "Vivien Thiney",
    "Renan Lethiecq",
    "Eric Eyraud",
    "Matthieu C. Dartiailh",
    "Benoit Bertrand",
    "Heimanu Niebojewski",
    "Christopher Bäuerle",
    "Maud Vinet",
    "Tristan Meunier",
    "Nicolas Roch",
    "Matias Urdampilleta"
  ],
  "submission_date": "2023-07-27T09:18:15+00:00",
  "revised_dates": [
    "2023-08-02T12:00:54+00:00"
  ],
  "abstract": "Spins in semiconductor quantum dots hold great promise as building blocks of quantum processors. Trapping them in SiMOS transistor-like devices eases future industrial scale fabrication. Among the potentially scalable readout solutions, gate-based dispersive radiofrequency reflectometry only requires the already existing transistor gates to readout a quantum dot state, relieving the need for additional elements. In this effort towards scalability, traveling-wave superconducting parametric amplifiers significantly enhance the readout signal-to-noise ratio (SNR) by reducing the noise below typical cryogenic low-noise amplifiers, while offering a broad amplification band, essential to multiplex the readout of multiple resonators. In this work, we demonstrate a 3GHz gate-based reflectometry readout of electron charge states trapped in quantum dots formed in SiMOS multi-gate devices, with SNR enhanced thanks to a Josephson traveling-wave parametric amplifier (JTWPA). The broad, tunable 2GHz amplification bandwidth combined with more than 10dB ON/OFF SNR improvement of the JTWPA enables frequency and time division multiplexed readout of interdot transitions, and noise performance near the quantum limit. In addition, owing to a design without superconducting loops and with a metallic ground plane, the JTWPA is flux insensitive and shows stable performances up to a magnetic field of 1.2T at the quantum dot device, compatible with standard SiMOS spin qubit experiments.",
  "categories": [
    "cond-mat.mes-hall"
  ],
  "primary_category": "cond-mat.mes-hall",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14717",
  "pdf_url": "https://arxiv.org/pdf/2307.14717v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 7100743,
  "size_after_bytes": 118669
}