{
  "title": "IceCube search for neutrinos from GRB 221009A",
  "authors": [
    "Karlijn Kruiswijk",
    "Bennett Brinson",
    "Rachel Procter-Murphy",
    "Jessie Thwaites",
    "Nora Valtonen-Mattila"
  ],
  "submission_date": "2023-07-31T00:24:32+00:00",
  "revised_dates": [
    "2023-11-17T08:28:44+00:00",
    "2024-07-22T16:03:14+00:00"
  ],
  "abstract": "GRB 221009A is the brightest Gamma Ray Burst (GRB) ever observed. The observed extremely high flux of high and very-high-energy photons provide a unique opportunity to probe the predicted neutrino counterpart to the electromagnetic emission. We have used a variety of methods to search for neutrinos in coincidence with the GRB over several time windows during the precursor, prompt and afterglow phases of the GRB. MeV scale neutrinos are studied using photo-multiplier rate scalers which are normally used to search for galactic core-collapse supernovae neutrinos. GeV neutrinos are searched starting with DeepCore triggers. These events don't have directional localization, but instead can indicate an excess in the rate of events. 10 GeV - 1 TeV and >TeV neutrinos are searched using traditional neutrino point source methods which take into account the direction and time of events with DeepCore and the entire IceCube detector respectively. The >TeV results include both a fast-response analysis conducted by IceCube in real-time with time windows of T$_0 - 1$ to T$_0 + 2$ hours and T$_0 \\pm 1$ day around the time of GRB 221009A, as well as an offline analysis with 3 new time windows up to a time window of T$_0 - 1$ to T$_0 + 14$ days, the longest time period we consider. The combination of observations by IceCube covers 9 orders of magnitude in neutrino energy, from MeV to PeV, placing upper limits across the range for predicted neutrino emission.",
  "categories": [
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.HE",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16354",
  "pdf_url": "https://arxiv.org/pdf/2307.16354v3",
  "comment": "Presented at the 38th International Cosmic Ray Conference (ICRC2023). See arXiv:2307.13047 for all IceCube contributions",
  "num_versions": null,
  "size_before_bytes": 4867953,
  "size_after_bytes": 574275
}