{
  "title": "How to Train Your YouTube Recommender to Avoid Unwanted Videos",
  "authors": [
    "Alexander Liu",
    "Siqi Wu",
    "Paul Resnick"
  ],
  "submission_date": "2023-07-27T00:21:29+00:00",
  "revised_dates": [
    "2023-08-02T19:36:19+00:00",
    "2024-04-02T06:18:23+00:00"
  ],
  "abstract": "YouTube provides features for users to indicate disinterest when presented with unwanted recommendations, such as the \"Not interested\" and \"Don't recommend channel\" buttons. These buttons purportedly allow the user to correct \"mistakes\" made by the recommendation system. Yet, relatively little is known about the empirical efficacy of these buttons. Neither is much known about users' awareness of and confidence in them. To address these gaps, we simulated YouTube users with sock puppet agents. Each agent first executed a \"stain phase\", where it watched many videos of an assigned topic; it then executed a \"scrub phase\", where it tried to remove recommendations from the assigned topic. Each agent repeatedly applied a single scrubbing strategy, either indicating disinterest in one of the videos visited in the stain phase (disliking it or deleting it from the watch history), or indicating disinterest in a video recommended on the homepage (clicking the \"not interested\" or \"don't recommend channel\" button or opening the video and clicking the dislike button). We found that the stain phase significantly increased the fraction of the recommended videos dedicated to the assigned topic on the user's homepage. For the scrub phase, using the \"Not interested\" button worked best, significantly reducing such recommendations in all topics tested, on average removing 88% of them. Neither the stain phase nor the scrub phase, however, had much effect on videopage recommendations. We also ran a survey (N = 300) asking adult YouTube users in the US whether they were aware of and used these buttons before, as well as how effective they found these buttons to be. We found that 44% of participants were not aware that the \"Not interested\" button existed. Those who were aware of it often used it to remove unwanted recommendations (82.8%) and found it to be modestly effective (3.42 out of 5).",
  "categories": [
    "cs.CY",
    "cs.HC",
    "cs.SI"
  ],
  "primary_category": "cs.CY",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14551",
  "pdf_url": null,
  "comment": "Accepted into ICWSM 2024, the code is publicly available at https://github.com/avliu-um/youtube-disinterest",
  "num_versions": null,
  "size_before_bytes": 22998724,
  "size_after_bytes": 12870776
}