{
  "title": "High Dynamic Range Image Reconstruction via Deep Explicit Polynomial Curve Estimation",
  "authors": [
    "Jiaqi Tang",
    "Xiaogang Xu",
    "Sixing Hu",
    "Ying-Cong Chen"
  ],
  "submission_date": "2023-07-31T06:21:47+00:00",
  "revised_dates": [],
  "abstract": "Due to limited camera capacities, digital images usually have a narrower dynamic illumination range than real-world scene radiance. To resolve this problem, High Dynamic Range (HDR) reconstruction is proposed to recover the dynamic range to better represent real-world scenes. However, due to different physical imaging parameters, the tone-mapping functions between images and real radiance are highly diverse, which makes HDR reconstruction extremely challenging. Existing solutions can not explicitly clarify a corresponding relationship between the tone-mapping function and the generated HDR image, but this relationship is vital when guiding the reconstruction of HDR images. To address this problem, we propose a method to explicitly estimate the tone mapping function and its corresponding HDR image in one network. Firstly, based on the characteristics of the tone mapping function, we construct a model by a polynomial to describe the trend of the tone curve. To fit this curve, we use a learnable network to estimate the coefficients of the polynomial. This curve will be automatically adjusted according to the tone space of the Low Dynamic Range (LDR) image, and reconstruct the real HDR image. Besides, since all current datasets do not provide the corresponding relationship between the tone mapping function and the LDR image, we construct a new dataset with both synthetic and real images. Extensive experiments show that our method generalizes well under different tone-mapping functions and achieves SOTA performance.",
  "categories": [
    "eess.IV",
    "cs.AI",
    "cs.CV"
  ],
  "primary_category": "eess.IV",
  "doi": "10.3233/FAIA230533",
  "journal_ref": null,
  "arxiv_id": "2307.16426",
  "pdf_url": "https://arxiv.org/pdf/2307.16426v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 34772217,
  "size_after_bytes": 156914
}