{
  "title": "DESI Mock Challenge: Constructing DESI galaxy catalogues based on FastPM simulations",
  "authors": [
    "Andrei Variu",
    "Shadab Alam",
    "Cheng Zhao",
    "Chia-Hsun Chuang",
    "Yu Yu",
    "Daniel Forero-Sánchez",
    "Zhejie Ding",
    "Jean-Paul Kneib",
    "Jessica Nicole Aguilar",
    "Steven Ahlen",
    "David Brooks",
    "Todd Claybaugh",
    "Shaun Cole",
    "Kyle Dawson",
    "Axel de la Macorra",
    "Peter Doel",
    "Jaime E. Forero-Romero",
    "Satya Gontcho A Gontcho",
    "Klaus Honscheid",
    "Martin Landriau",
    "Marc Manera",
    "Ramon Miquel",
    "Jundan Nie",
    "Will Percival",
    "Claire Poppett",
    "Mehdi Rezaie",
    "Graziano Rossi",
    "Eusebio Sanchez",
    "Michael Schubnell",
    "Hee-Jong Seo",
    "Gregory Tarlé",
    "Mariana Vargas Magana",
    "Zhimin Zhou"
  ],
  "submission_date": "2023-07-26T13:50:26+00:00",
  "revised_dates": [
    "2023-12-05T01:43:50+00:00"
  ],
  "abstract": "Together with larger spectroscopic surveys such as the Dark Energy Spectroscopic Instrument (DESI), the precision of large scale structure studies and thus the constraints on the cosmological parameters are rapidly improving. Therefore, one must build realistic simulations and robust covariance matrices.\n  We build galaxy catalogues by applying a Halo Occupation Distribution (HOD) model upon the \\textsc{FastPM} simulations, such that the resulting galaxy clustering reproduces high resolution $N$-body simulations. While the resolution and halo finder are different from the reference simulations, we reproduce the reference galaxy two-point clustering measurements -- monopole and quadrupole -- to a precision required by the DESI Year 1 Emission Line Galaxy sample down to non-linear scales, i.e. $k<0.5\\,h\\mathrm{Mpc}$ or $s>10\\,\\mathrm{Mpc}/h$.\n  Furthermore, we compute covariance matrices based on the resulting \\textsc{FastPM} galaxy clustering -- monopole and quadrupole. We study for the first time the effect of fitting on Fourier conjugate [e.g. power spectrum] on the covariance matrix of the Fourier counterpart [e.g. correlation function]. We estimate the uncertainties of the two parameters of a simple clustering model and observe a maximum variation of 20 per cent for the different covariance matrices. Nevertheless, for most studied scales the scatter is between two to ten per cent\n  Consequently, using the current pipeline we can precisely reproduce the clustering of $N$-body simulations and the resulting covariance matrices provide robust uncertainty estimations against HOD fitting scenarios. We expect our methodology will be useful for the coming DESI data analyses and their extension for other studies.",
  "categories": [
    "astro-ph.CO"
  ],
  "primary_category": "astro-ph.CO",
  "doi": "10.1093/mnras/stad3742",
  "journal_ref": null,
  "arxiv_id": "2307.14197",
  "pdf_url": null,
  "comment": "21 pages, 18 figures, submitted to MNRAS, Zenodo link https://doi.org/10.5281/zenodo.8185822",
  "num_versions": null,
  "size_before_bytes": 2678689,
  "size_after_bytes": 904287
}