{
  "title": "The MUSE-Faint survey. III. Constraining scalar field dark matter with Antlia B",
  "authors": [
    "Mariana P. Júlio",
    "Jarle Brinchmann",
    "Sebastiaan L. Zoutendijk",
    "Justin I. Read",
    "Daniel Vaz",
    "Sebastian Kamann",
    "Davor Krajnović",
    "Leindert A. Boogaard",
    "Matthias Steinmetz",
    "Nicolas Bouché"
  ],
  "submission_date": "2023-07-24T18:00:04+00:00",
  "revised_dates": [
    "2023-10-11T00:30:32+00:00"
  ],
  "abstract": "Aims. We use the stellar line-of-sight velocities of Antlia B (Ant B), a faint dwarf galaxy in the NGC 3109 association, to derive constraints on the fundamental properties of scalar field dark matter (SFDM), which was originally proposed to solve the small-scale problems faced by cold dark matter models. Methods. We used the first spectroscopic observations of Ant B, a distant (d $\\sim$ 1.35 Mpc) faint dwarf ($M_\\text{V} = -9.7$, $M_\\star \\sim 8\\times10^5$M$_\\odot$), from MUSE-Faint, a survey of ultra-faint dwarfs conducted using the Multi Unit Spectroscopic Explorer. By measuring the line-of-sight velocities of stars in the $1'\\times 1'$ field of view, we identified 127 stars as members of Ant B, which enabled us to model its dark matter density profile with the Jeans modelling code GravSphere. We implemented a model for SFDM into GravSphere and used this to place constraints on the self-coupling strength of this model. Results. We find a virial mass of ${M_{200} \\approx 1.66^{+2.51}_{-0.92}\\times 10^9}$ $M_\\odot$ and a concentration parameter of ${c_{200}\\approx 17.38^{+6.06}_{-4.20}}$ for Ant B. These results are consistent with the mass-concentration relations in the literature. We constrain the characteristic length scale of the repulsive self-interaction $R_{\\text{TF}}$ of the SFDM model to $R_{\\text{TF}} \\lesssim 180$ pc ($68\\%$ confidence level), which translates to a self-coupling strength of $\\frac{g}{m^2c^4}\\lesssim 5.2 \\times 10^{-20}$ eV$^{-1}$cm$^3$. The constraint on the characteristic length scale of the repulsive self-interaction is inconsistent with the value required to match observations of the cores of dwarf galaxies in the Local Group, suggesting that the cored density profiles of those galaxies are not caused by SFDM.",
  "categories": [
    "astro-ph.GA",
    "astro-ph.CO"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.1051/0004-6361/202346987",
  "journal_ref": "A&A 678, A38 (2023)",
  "arxiv_id": "2307.13035",
  "pdf_url": null,
  "comment": "Accepted for publication in A&A on 21-07-2023. 17 pages, 22 figures, 4 tables",
  "num_versions": null,
  "size_before_bytes": 5655589,
  "size_after_bytes": 592809
}