{
  "title": "The Cosmic Microwave Background and $H_0$",
  "authors": [
    "Pablo Lemos",
    "Paul Shah"
  ],
  "submission_date": "2023-07-24T19:10:42+00:00",
  "revised_dates": [],
  "abstract": "The cosmic microwave background (CMB) offers a unique window into the early universe, providing insights into cosmological parameters like the Hubble constant. Recent precise measurements of the CMB by experiments like Planck seem to point to a lower value for the Hubble constant compared to some other measurements like those from Type Ia supernovae. This discrepancy, known as the Hubble tension, currently lacks a definitive explanation. In this chapter, we provide an overview of how the Hubble constant is determined from detailed measurements of the CMB power spectrum. We explain the physics underlying key features of the CMB spectrum and their connection to cosmological parameters. We then examine the consistency of Planck's Hubble constant determination, both internally within the data itself and externally with other astrophysical probes. While largely consistent, some anomalies like the lensing amplitude parameter $A_L$ remain unresolved. We also explore various theoretical extensions to the standard $Λ$CDM cosmological model and assess their potential to resolve the Hubble tension. No clear resolution emerges, indicating significant tensions remain between early and late universe probes within simple extensions to $Λ$CDM. Upcoming CMB experiments promise improved precision and should provide further insights into this cosmic conundrum. A coherent picture bridging measurements across cosmic time remains an open challenge at the forefront of modern cosmology.",
  "categories": [
    "astro-ph.CO"
  ],
  "primary_category": "astro-ph.CO",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13083",
  "pdf_url": null,
  "comment": "Invited chapter for the edited book \"Hubble Constant Tension\" (Eds. E. Di Valentino and D. Brout, Springer Singapore, expected in 2024)",
  "num_versions": null,
  "size_before_bytes": 3253029,
  "size_after_bytes": 760568
}