{
  "title": "Ancilla wavefunctions of Mott insulator and pseudogap metal through quantum teleportation",
  "authors": [
    "Boran Zhou",
    "Ya-Hui Zhang"
  ],
  "submission_date": "2023-07-29T18:00:54+00:00",
  "revised_dates": [],
  "abstract": "Weak Mott regime with finite U is a wonderful region to search for quantum spin liquid, but it is challenging to write down a wavefunction capturing both spin liquid and charge fluctuations. Conventional methods using complicated Jastrow factors have difficulties when the underlying spin liquid has a non-trivial projective symmetry group (PSG). To cure this problem, here we provide a new class wavefunction for Mott insulator through quantum teleportation using ancilla qubits. We primarily focus on half filling of the fermionic Hubbard model. We will prove that a single variation parameter $Φ$ in our wavefunction tunes the Mott charge gap continuously. On a generic lattice, we show that the wavefunction at $Φ=+\\infty$ recovers the familiar Gutzwiller projectived wavefunction at infinite U. The wavefunction at $Φ=\\frac{U}{2}$ is equivalent to applying the inverse Schrieffer Wolff transformation at linear order of $t/U$, as expected in large but finite U regime. From a gauge theory description we can show that the wavefunction has an electronic sector decoupled from a spinon sector describing localized spin moments. The charge gap $Δ_c$ can be shown to be $2Φ$ and we conjecture that the wavefunction works well down to the regime with small charge gap on a generic lattice. We represent the wavefunction using tensor network and numerically confirm this conjecture in one dimension. Beyond the numerical power, the ancilla wavefunction also provides a new conceptual picture to understand the bandwidth tuned metal insulator transition. In this new framework, there can in principle exist a narrow region of fractional Fermi liquid (FL*) phase between the usual Fermi liquid and the Mott insulator, a scenario which is not captured by the conventional slave rotor theory and thus was usually outlooked.",
  "categories": [
    "cond-mat.str-el",
    "quant-ph"
  ],
  "primary_category": "cond-mat.str-el",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16038",
  "pdf_url": "https://arxiv.org/pdf/2307.16038v1",
  "comment": "11 pages, 6 figures",
  "num_versions": null,
  "size_before_bytes": 2531571,
  "size_after_bytes": 851324
}