{
  "title": "Communicating uncertainty in Indigenous sea Country monitoring with Bayesian statistics: towards more informed decision-making",
  "authors": [
    "Katherine Cure",
    "Diego R Barneche",
    "Martial Depczynski",
    "Rebecca Fisher",
    "David J Warne",
    "James M McGree",
    "Jim Underwood",
    "Frank Weisenberger",
    "Elizabeth Evans-Illidge",
    "Daniel Oades",
    "Azton Howard",
    "Phillip McCarthy",
    "Damon Pyke",
    "Zac Edgar",
    "Rodney Maher",
    "Trevor Sampi",
    "Bardi Jawi Traditional Owners"
  ],
  "submission_date": "2023-07-31T01:03:51+00:00",
  "revised_dates": [],
  "abstract": "First Nations Australians have a cultural obligation to look after land and sea Country, and Indigenous-partnered science is beginning to drive socially inclusive initiatives in conservation. The Australian Institute of Marine Science has partnered with Indigenous communities in systematically collecting monitoring data to understand the natural variability of ecological communities and better inform sea Country management. Monitoring partnerships are centred around the 2-way sharing of Traditional Ecological Knowledge, training in science and technology, and developing communication products that can be accessed across the broader community. We present a case study with the Bardi Jawi Rangers in northwest Australia focusing on a 3-year co-developed and co-delivered monitoring dataset for culturally important fish in coral reef ecosystems. We show how uncertainty estimated by Bayesian statistics can be incorporated into monitoring indicators and facilitate fuller communication between scientists and First Nations partners about the limitations of monitoring to identify change.",
  "categories": [
    "stat.AP"
  ],
  "primary_category": "stat.AP",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16357",
  "pdf_url": "https://arxiv.org/pdf/2307.16357v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1017940,
  "size_after_bytes": 611277
}