{
  "title": "Tidal Disruption Events through the Lens of the Cooling Envelope Model",
  "authors": [
    "Nikhil Sarin",
    "Brian D. Metzger"
  ],
  "submission_date": "2023-07-27T18:00:05+00:00",
  "revised_dates": [
    "2024-01-19T10:24:25+00:00"
  ],
  "abstract": "The cooling envelope model for tidal disruption events (TDE) postulates that while the stellar debris streams rapidly dissipate their bulk kinetic energy (``circularize\"), this does not necessarily imply rapid feeding of the supermassive black hole (SMBH). The bound material instead forms a large pressure-supported envelope which powers optical/UV emission as it undergoes gradual Kelvin-Helmholtz contraction. We present results interpreting a sample of 15 optical TDE within the cooling envelope model in order to constrain the SMBH mass $M_{\\rm BH}$, stellar mass $M_{\\star}$, and orbital penetration factor $β$. The distributions of inferred properties from our sample broadly follow the theoretical expectations of loss-cone analysis assuming a standard stellar initial mass function. However, we find a deficit of events with $M_{\\rm BH} \\lesssim 5\\times 10^{5}M_{\\odot}$ and $M_{\\star} \\lesssim 0.5M_{\\odot}$, which could result in part from the reduced detectability of TDEs with these properties. Our model fits also illustrate the predicted long delay between the optical light curve peak and when the SMBH accretion rate reaches its maximum. The latter occurs only once the envelope contracts to the circularization radius on a timescale of months to years, consistent with delayed-rising X-ray and non-thermal radio flares seen in a growing number of TDE.",
  "categories": [
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.HE",
  "doi": "10.3847/2041-8213/ad16d8",
  "journal_ref": null,
  "arxiv_id": "2307.15121",
  "pdf_url": "https://arxiv.org/pdf/2307.15121v2",
  "comment": "Published in ApJL. 19 pages, 9 figures. Model and inference workflow implemented in Redback at https://github.com/nikhil-sarin/redback",
  "num_versions": null,
  "size_before_bytes": 17131574,
  "size_after_bytes": 577300
}