{
  "title": "Energy Correlators on Tracks: Resummation and Non-Perturbative Effects",
  "authors": [
    "Max Jaarsma",
    "Yibei Li",
    "Ian Moult",
    "Wouter J. Waalewijn",
    "Hua Xing Zhu"
  ],
  "submission_date": "2023-07-28T18:00:04+00:00",
  "revised_dates": [],
  "abstract": "Energy correlators measured inside high-energy jets at hadron colliders have recently been demonstrated to provide a new window into both perturbative and non-perturbative Quantum Chromodynamics. A number of the most interesting features of these correlators, namely their universal scaling behavior and the ability to image the confinement transition, require precise angular resolution, necessitating the use of tracking information in experimental measurements. Theoretically, tracking information can be incorporated into the energy correlators using track functions, which are non-perturbative functions describing the fragmentation of quarks and gluons into charged hadrons. In this paper, we apply our recently developed track function formalism to energy correlators, and study in detail the interplay of track functions with perturbative resummation and non-perturbative power corrections. We provide resummed results for the energy correlators at collinear next-to-leading-logarithmic accuracy and compare with parton shower Monte Carlo simulations. For the two-point correlator the use of tracking has a minimal effect throughout the entire distribution, but it has a significant effect for higher point correlators. Our results are crucial for the theoretical interpretation of recent experimental measurements of the energy-energy correlators.",
  "categories": [
    "hep-ph",
    "hep-ex",
    "nucl-ex",
    "nucl-th"
  ],
  "primary_category": "hep-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15739",
  "pdf_url": "https://arxiv.org/pdf/2307.15739v1",
  "comment": "26 pages, 10 figures",
  "num_versions": null,
  "size_before_bytes": 5450778,
  "size_after_bytes": 125290
}