{
  "title": "Auto-Tables: Synthesizing Multi-Step Transformations to Relationalize Tables without Using Examples",
  "authors": [
    "Peng Li",
    "Yeye He",
    "Cong Yan",
    "Yue Wang",
    "Surajit Chaudhuri"
  ],
  "submission_date": "2023-07-27T00:55:54+00:00",
  "revised_dates": [
    "2023-08-09T04:53:52+00:00"
  ],
  "abstract": "Relational tables, where each row corresponds to an entity and each column corresponds to an attribute, have been the standard for tables in relational databases. However, such a standard cannot be taken for granted when dealing with tables \"in the wild\". Our survey of real spreadsheet-tables and web-tables shows that over 30% of such tables do not conform to the relational standard, for which complex table-restructuring transformations are needed before these tables can be queried easily using SQL-based analytics tools. Unfortunately, the required transformations are non-trivial to program, which has become a substantial pain point for technical and non-technical users alike, as evidenced by large numbers of forum questions in places like StackOverflow and Excel/Power-BI/Tableau forums.\n  We develop an Auto-Tables system that can automatically synthesize pipelines with multi-step transformations (in Python or other languages), to transform non-relational tables into standard relational forms for downstream analytics, obviating the need for users to manually program transformations. We compile an extensive benchmark for this new task, by collecting 244 real test cases from user spreadsheets and online forums. Our evaluation suggests that Auto-Tables can successfully synthesize transformations for over 70% of test cases at interactive speeds, without requiring any input from users, making this an effective tool for both technical and non-technical users to prepare data for analytics.",
  "categories": [
    "cs.DB",
    "cs.LG"
  ],
  "primary_category": "cs.DB",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14565",
  "pdf_url": "https://arxiv.org/pdf/2307.14565v2",
  "comment": "full version of a paper accepted to VLDB 2023",
  "num_versions": null,
  "size_before_bytes": 30107995,
  "size_after_bytes": 837969
}