{
  "title": "Path-depending controlled mean-field coupled forward-backward SDEs. The associated stochastic maximum principle",
  "authors": [
    "Rainer Buckdahn",
    "Juan Li",
    "Junsong Li",
    "Chuanzhi Xing"
  ],
  "submission_date": "2023-07-26T12:26:27+00:00",
  "revised_dates": [],
  "abstract": "In the present paper we discuss a new type of mean-field coupled forward-backward stochastic differential equations (MFFBSDEs). The novelty consists in the fact that the coefficients of both the forward as well as the backward SDEs depend not only on the controlled solution processes $(X_t,Y_t,Z_t)$ at the current time $t$, but also on the law of the paths of $(X,Y,u)$ of the solution process and the control process. The existence of the solution for such a MFFBSDE which is fully coupled through the law of the paths of $(X,Y)$ in the coefficients of both the forward and the backward equations is proved under rather general assumptions. Concerning the law, we just suppose the continuity under the 2-Wasserstein distance of the coefficients with respect to the law of $(X,Y)$. The uniqueness is shown under Lipschitz assumptions and the non anticipativity of the law of $X$ in the forward equation. The main part of the work is devoted to the study of Pontryagin's maximal principle for such a MFFBSDE. The dependence of the coefficients on the law of the paths of the solution processes and their control makes that a completely new and interesting criterion for the optimality of a stochastic control for the MFFBSDE is obtained. In particular, also the Hamiltonian is novel and quite different from that in the existing literature. Last but not least, under the assumption of convexity of the Hamiltonian we show that our optimality condition is not only necessary but also sufficient.",
  "categories": [
    "math.PR",
    "math.OC"
  ],
  "primary_category": "math.PR",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14148",
  "pdf_url": null,
  "comment": "30 pages",
  "num_versions": null,
  "size_before_bytes": 164928,
  "size_after_bytes": 164882
}