{
  "title": "Structural Analysis of GRAFCET Control Specifications",
  "authors": [
    "Aron Schnakenbeck",
    "Robin Mroß",
    "Marcus Völker",
    "Stefan Kowalewski",
    "Alexander Fay"
  ],
  "submission_date": "2023-07-20T19:04:43+00:00",
  "revised_dates": [
    "2024-07-02T01:11:51+00:00"
  ],
  "abstract": "The graphical modeling language GRAFCET is used as a formal specification language in industrial control design. This paper proposes a structural analysis that approximates the variable values of GRAFCET to allow verification on specification level. GRAFCET has different elements resulting in concurrent behavior, which in general results in a large state space for analyses like model checking. The proposed analysis approach approximates that state space and takes into consideration the entire set of GRAFCET elements leading to concurrent behavior. The analysis consists of two parts: We present an algorithm analyzing concurrent steps to approximate the step variables and we adapt analysis means from the field of Petri nets to approximate internal and output variables. The proposed approach is evaluated using an industrial-sized example to demonstrate that the analysis is capable of verifying behavioral errors and is not limited by the specification size of practical plants.",
  "categories": [
    "cs.LO",
    "cs.PL"
  ],
  "primary_category": "cs.LO",
  "doi": "10.1109/ETFA54631.2023.10275713",
  "journal_ref": "2023 IEEE 28th International Conference on Emerging Technologies and Factory Automation (ETFA)",
  "arxiv_id": "2307.13703",
  "pdf_url": null,
  "comment": "\\c{opyright} 2023 IEEE. Personal use of this material is permitted. Permission from IEEE must be obtained for all other uses, in any current or future media, including reprinting/republishing this material for advertising or promotional purposes, creating new collective works, for resale or redistribution to servers or lists, or reuse of any copyrighted component of this work in other works",
  "num_versions": null,
  "size_before_bytes": 4060333,
  "size_after_bytes": 1473997
}