{
  "title": "Advancing Ad Auction Realism: Practical Insights & Modeling Implications",
  "authors": [
    "Ming Chen",
    "Sareh Nabi",
    "Marciano Siniscalchi"
  ],
  "submission_date": "2023-07-21T17:45:28+00:00",
  "revised_dates": [
    "2024-04-11T00:05:24+00:00"
  ],
  "abstract": "Contemporary real-world online ad auctions differ from canonical models [Edelman et al., 2007; Varian, 2009] in at least four ways: (1) values and click-through rates can depend upon users' search queries, but advertisers can only partially \"tune\" their bids to specific queries; (2) advertisers do not know the number, identity, and precise value distribution of competing bidders; (3) advertisers only receive partial, aggregated feedback, and (4) payment rules are only partially known to bidders. These features make it virtually impossible to fully characterize equilibrium bidding behavior. This paper shows that, nevertheless, one can still gain useful insight into modern ad auctions by modeling advertisers as agents governed by an adversarial bandit algorithm, independent of auction mechanism intricacies. To demonstrate our approach, we first simulate \"soft-floor\" auctions [Zeithammer, 2019], a complex, real-world pricing rule for which no complete equilibrium characterization is known. We find that (i) when values and click-through rates are query-dependent, soft floors can improve revenues relative to standard auction formats even if bidder types are drawn from the same distribution; and (ii) with distributional asymmetries that reflect relevant real-world scenario, we find that soft floors yield lower revenues than suitably chosen reserve prices, even restricting attention to a single query. We then demonstrate how to infer advertiser value distributions from observed bids for a variety of pricing rules, and illustrate our approach with aggregate data from an e-commerce website.",
  "categories": [
    "cs.LG",
    "cs.GT",
    "econ.GN"
  ],
  "primary_category": "cs.LG",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11732",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1950574,
  "size_after_bytes": 218686
}