{
  "title": "A Weakly Supervised Segmentation Network Embedding Cross-scale Attention Guidance and Noise-sensitive Constraint for Detecting Tertiary Lymphoid Structures of Pancreatic Tumors",
  "authors": [
    "Bingxue Wang",
    "Liwen Zou",
    "Jun Chen",
    "Yingying Cao",
    "Zhenghua Cai",
    "Yudong Qiu",
    "Liang Mao",
    "Zhongqiu Wang",
    "Jingya Chen",
    "Luying Gui",
    "Xiaoping Yang"
  ],
  "submission_date": "2023-07-27T03:25:09+00:00",
  "revised_dates": [],
  "abstract": "The presence of tertiary lymphoid structures (TLSs) on pancreatic pathological images is an important prognostic indicator of pancreatic tumors. Therefore, TLSs detection on pancreatic pathological images plays a crucial role in diagnosis and treatment for patients with pancreatic tumors. However, fully supervised detection algorithms based on deep learning usually require a large number of manual annotations, which is time-consuming and labor-intensive. In this paper, we aim to detect the TLSs in a manner of few-shot learning by proposing a weakly supervised segmentation network. We firstly obtain the lymphocyte density maps by combining a pretrained model for nuclei segmentation and a domain adversarial network for lymphocyte nuclei recognition. Then, we establish a cross-scale attention guidance mechanism by jointly learning the coarse-scale features from the original histopathology images and fine-scale features from our designed lymphocyte density attention. A noise-sensitive constraint is introduced by an embedding signed distance function loss in the training procedure to reduce tiny prediction errors. Experimental results on two collected datasets demonstrate that our proposed method significantly outperforms the state-of-the-art segmentation-based algorithms in terms of TLSs detection accuracy. Additionally, we apply our method to study the congruent relationship between the density of TLSs and peripancreatic vascular invasion and obtain some clinically statistical results.",
  "categories": [
    "eess.IV",
    "cs.CV"
  ],
  "primary_category": "eess.IV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14603",
  "pdf_url": "https://arxiv.org/pdf/2307.14603v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 4808631,
  "size_after_bytes": 64977
}