{
  "title": "Environmental effects on associations of dwarf galaxies",
  "authors": [
    "C. Yamila Yaryura",
    "Mario G. Abadi",
    "Stefan Gottlöber",
    "Noam I. Libeskind",
    "Sofía A. Cora",
    "Andrés N. Ruiz",
    "Cristian A. Vega-Martínez",
    "Gustavo Yepes"
  ],
  "submission_date": "2023-07-26T18:00:02+00:00",
  "revised_dates": [],
  "abstract": "We study the properties of associations of dwarf galaxies and their dependence on the environment. Associations of dwarf galaxies are extended systems composed exclusively of dwarf galaxies, considering as dwarf galaxies those galaxies less massive than $M_{\\star, \\rm max} = 10^{9.0}$ ${\\rm M}_{\\odot}\\,h^{-1}$. We identify these particular systems using a semi-analytical model of galaxy formation coupled to a dark matter only simulation in the $Λ$ Cold Dark Matter cosmological model. To classify the environment, we estimate eigenvalues from the tidal field of the dark matter particle distribution of the simulation. We find that the majority, two thirds, of associations are located in filaments ($ \\sim 67$ per cent), followed by walls ($ \\sim 26 $ per cent), while only a small fraction of them are in knots ($ \\sim 6 $ per cent) and voids ($ \\sim 1 $ per cent). Associations located in more dense environments present significantly higher velocity dispersion than those located in less dense environments, evidencing that the environment plays a fundamental role in their dynamical properties. However, this connection between velocity dispersion and the environment depends exclusively on whether the systems are gravitational bound or unbound, given that it disappears when we consider associations of dwarf galaxies that are gravitationally bound. Although less than a dozen observationally detected associations of dwarf galaxies are currently known, our results are predictions on the eve of forthcoming large surveys of galaxies, which will enable these very particular systems to be identified and studied.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.1093/mnras/stad2300",
  "journal_ref": null,
  "arxiv_id": "2307.14420",
  "pdf_url": null,
  "comment": "13 pages, 9 figures. Accepted for publication in MNRAS",
  "num_versions": null,
  "size_before_bytes": 4777938,
  "size_after_bytes": 659652
}