{
  "title": "String-inspired running-vacuum cosmology, quantum corrections and the current cosmological tensions",
  "authors": [
    "Nick E. Mavromatos",
    "Joan Solà Peracaula",
    "Adrià Gómez-Valent"
  ],
  "submission_date": "2023-07-24T21:12:37+00:00",
  "revised_dates": [
    "2023-07-28T00:03:54+00:00"
  ],
  "abstract": "In the context of a string-inspired running vacuum model (RVM) of cosmology with anomalies and torsion-induced axion-like fields, we discuss quantum corrections to the corresponding energy density, in approximately de Sitter eras, during which the Hubble parameter $H(t)$ varies very slowly with the cosmic time $t$. Such corrections arise either from graviton loops in the corresponding gravitational theory, or from path integration of massive quantum matter fields. They depend logarithmically on $H(t)$, in the form $H^n\\, {\\rm ln}(H^2)$, $n \\in 2Z^+$. In the modern eras, for which the $n=2$ terns are dominant, such corrections may contribute to an alleviation of the currently observed cosmological $H_0$ and structure-growth tensions. In particular, we argue that such an effect is accomplished for a (dynamically-broken) supergravity-based RVM cosmological model. In the current de-Sitter era, for this case, rather surprisingly, the quantum graviton corrections dominate those due to matter fields, provided the scale of the primordial (pre-RVM inflation) dynamical breaking of local supersymmetry lies near the reduced Planck scale, which is a natural assumption in the context of the model.",
  "categories": [
    "gr-qc",
    "hep-th"
  ],
  "primary_category": "gr-qc",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13130",
  "pdf_url": null,
  "comment": "12 pages, latex (uses special (Springer Proceedings) macros), one pdf figure incorporated; Invited plenary talk (NEM) at 40th Conference on Recent Developments in High Energy Physics and Cosmology (HEP2023, 5-7 April 2023, U. of Ioannina (Greece)),based partly on e-Print:2305.15774 [gr-qc]. arXiv admin note: text overlap with arXiv:2306.08064.Corrections in references, no effects on conclusions",
  "num_versions": null,
  "size_before_bytes": 681165,
  "size_after_bytes": 201081
}