{
  "title": "Light-Driven Nanoscale Vectorial Currents",
  "authors": [
    "Jacob Pettine",
    "Prashant Padmanabhan",
    "Teng Shi",
    "Lauren Gingras",
    "Luke McClintock",
    "Chun-Chieh Chang",
    "Kevin W. C. Kwock",
    "Long Yuan",
    "Yue Huang",
    "John Nogan",
    "Jon K. Baldwin",
    "Peter Adel",
    "Ronald Holzwarth",
    "Abul K. Azad",
    "Filip Ronning",
    "Antoinette J. Taylor",
    "Rohit P. Prasankumar",
    "Shi-Zeng Lin",
    "Hou-Tong Chen"
  ],
  "submission_date": "2023-07-21T22:24:08+00:00",
  "revised_dates": [],
  "abstract": "Controlled charge flows are fundamental to many areas of science and technology, serving as carriers of energy and information, as probes of material properties and dynamics, and as a means of revealing or even inducing broken symmetries. Emerging methods for light-based current control offer promising routes beyond the speed and adaptability limitations of conventional voltage-driven systems. However, optical generation and manipulation of currents at nanometer spatial scales remains a basic challenge and a crucial step towards scalable optoelectronic systems for microelectronics and information science. Here, we introduce vectorial optoelectronic metasurfaces in which ultrafast light pulses induce local directional charge flows around symmetry-broken plasmonic nanostructures, with tunable responses and arbitrary patterning down to sub-diffractive nanometer scales. Local symmetries and vectorial current distributions are revealed by polarization- and wavelength-sensitive electrical readout and terahertz (THz) emission, while spatially-tailored global currents are demonstrated in the direct generation of elusive broadband THz vector beams. We show that in graphene, a detailed interplay between electrodynamic, thermodynamic, and hydrodynamic degrees of freedom gives rise to rapidly-evolving nanoscale driving forces and charge flows under extreme temporal and spatial confinement. These results set the stage for versatile patterning and optical control over nanoscale currents in materials diagnostics, THz spectroscopies, nano-magnetism, and ultrafast information processing.",
  "categories": [
    "cond-mat.mes-hall",
    "physics.optics"
  ],
  "primary_category": "cond-mat.mes-hall",
  "doi": "10.1038/s41586-024-07037-4",
  "journal_ref": "Nature 626, 984-989 (2024)",
  "arxiv_id": "2307.11928",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}