{
  "title": "Sequence-Selection-Based Constellation Shaping for Nonlinear Channels",
  "authors": [
    "Stella Civelli",
    "Enrico Forestieri",
    "Marco Secondini"
  ],
  "submission_date": "2023-07-25T07:17:03+00:00",
  "revised_dates": [
    "2023-09-26T00:20:39+00:00",
    "2024-01-19T01:21:22+00:00"
  ],
  "abstract": "Probabilistic shaping is a pragmatic approach to improve the performance of coherent optical fiber communication systems. In the nonlinear regime, the advantages offered by probabilistic shaping might increase thanks to the opportunity to obtain an additional nonlinear shaping gain. Unfortunately, the optimization of conventional shaping techniques, such as probabilistic amplitude shaping (PAS), yields a relevant nonlinear shaping gain only in scenarios of limited practical interest. In this manuscript we use sequence selection to investigate the potential, opportunities, and challenges offered by probabilistic shaping for nonlinear channels. First, we show that ideal sequence selection is able to provide up to 0.13 bit/s/Hz gain with respect to PAS with an optimized blocklength. However, this additional gain is obtained only if the selection metric accounts for the signs of the symbols: they must be known to compute the selection metric, but there is no need to shape them. Furthermore, we show that the selection depends in a non-critical way on the symbol rate and link length: the sequences selected for a certain scenario still provide a relevant gain if these are modified. Then, we analyze and compare several practical implementations of sequence selection by taking into account interaction with forward error correction (FEC) and complexity. Overall, the single block and the multi block FEC-independent bit scrambling are the best options, with a gain up to 0.08 bit/s/Hz. The main challenge and limitation to their practical implementation remains the evaluation of the metric, whose complexity is currently too high. Finally, we show that the nonlinear shaping gain provided by sequence selection persists when carrier phase recovery is included.",
  "categories": [
    "cs.IT",
    "eess.SP"
  ],
  "primary_category": "cs.IT",
  "doi": "10.1109/JLT.2023.3332487",
  "journal_ref": "Journal of Lightwave Technology, 2023",
  "arxiv_id": "2307.13292",
  "pdf_url": null,
  "comment": "The manuscript is published on the Journal of Lightwave Technology",
  "num_versions": null,
  "size_before_bytes": 9238804,
  "size_after_bytes": 2225192
}