{
  "title": "Training-based Model Refinement and Representation Disagreement for Semi-Supervised Object Detection",
  "authors": [
    "Seyed Mojtaba Marvasti-Zadeh",
    "Nilanjan Ray",
    "Nadir Erbilgin"
  ],
  "submission_date": "2023-07-25T18:26:22+00:00",
  "revised_dates": [
    "2023-08-22T00:03:55+00:00",
    "2023-08-28T00:03:10+00:00",
    "2023-10-30T00:02:45+00:00"
  ],
  "abstract": "Semi-supervised object detection (SSOD) aims to improve the performance and generalization of existing object detectors by utilizing limited labeled data and extensive unlabeled data. Despite many advances, recent SSOD methods are still challenged by inadequate model refinement using the classical exponential moving average (EMA) strategy, the consensus of Teacher-Student models in the latter stages of training (i.e., losing their distinctiveness), and noisy/misleading pseudo-labels. This paper proposes a novel training-based model refinement (TMR) stage and a simple yet effective representation disagreement (RD) strategy to address the limitations of classical EMA and the consensus problem. The TMR stage of Teacher-Student models optimizes the lightweight scaling operation to refine the model's weights and prevent overfitting or forgetting learned patterns from unlabeled data. Meanwhile, the RD strategy helps keep these models diverged to encourage the student model to explore additional patterns in unlabeled data. Our approach can be integrated into established SSOD methods and is empirically validated using two baseline methods, with and without cascade regression, to generate more reliable pseudo-labels. Extensive experiments demonstrate the superior performance of our approach over state-of-the-art SSOD methods. Specifically, the proposed approach outperforms the baseline Unbiased-Teacher-v2 (& Unbiased-Teacher-v1) method by an average mAP margin of 2.23, 2.1, and 3.36 (& 2.07, 1.9, and 3.27) on COCO-standard, COCO-additional, and Pascal VOC datasets, respectively.",
  "categories": [
    "cs.CV",
    "cs.AI"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13755",
  "pdf_url": null,
  "comment": "Accepted in IEEE/CVF Winter Applications of Computer Vision (WACV) 2024",
  "num_versions": null,
  "size_before_bytes": 29726336,
  "size_after_bytes": 525120
}