{
  "title": "Unsupervised Decomposition Networks for Bias Field Correction in MR Image",
  "authors": [
    "Dong Liang",
    "Xingyu Qiu",
    "Kuanquan Wang",
    "Gongning Luo",
    "Wei Wang",
    "Yashu Liu"
  ],
  "submission_date": "2023-07-30T12:58:59+00:00",
  "revised_dates": [],
  "abstract": "Bias field, which is caused by imperfect MR devices or imaged objects, introduces intensity inhomogeneity into MR images and degrades the performance of MR image analysis methods. Many retrospective algorithms were developed to facilitate the bias correction, to which the deep learning-based methods outperformed. However, in the training phase, the supervised deep learning-based methods heavily rely on the synthesized bias field. As the formation of the bias field is extremely complex, it is difficult to mimic the true physical property of MR images by synthesized data. While bias field correction and image segmentation are strongly related, the segmentation map is precisely obtained by decoupling the bias field from the original MR image, and the bias value is indicated by the segmentation map in reverse. Thus, we proposed novel unsupervised decomposition networks that are trained only with biased data to obtain the bias-free MR images. Networks are made up of: a segmentation part to predict the probability of every pixel belonging to each class, and an estimation part to calculate the bias field, which are optimized alternately. Furthermore, loss functions based on the combination of fuzzy clustering and the multiplicative bias field are also devised. The proposed loss functions introduce the smoothness of bias field and construct the soft relationships among different classes under intra-consistency constraints. Extensive experiments demonstrate that the proposed method can accurately estimate bias fields and produce better bias correction results. The code is available on the link: https://github.com/LeongDong/Bias-Decomposition-Networks.",
  "categories": [
    "eess.IV",
    "cs.CV"
  ],
  "primary_category": "eess.IV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16219",
  "pdf_url": "https://arxiv.org/pdf/2307.16219v1",
  "comment": "Version 1.0",
  "num_versions": null,
  "size_before_bytes": 1979745,
  "size_after_bytes": 31356
}