{
  "title": "Quantum Approximate Bayesian Optimization Algorithms with Two Mixers and Uncertainty Quantification",
  "authors": [
    "Jungin E. Kim",
    "Yan Wang"
  ],
  "submission_date": "2023-07-30T22:58:04+00:00",
  "revised_dates": [
    "2023-10-23T20:59:12+00:00"
  ],
  "abstract": "The searching efficiency of the quantum approximate optimization algorithm is dependent on both the classical and quantum sides of the algorithm. Recently a quantum approximate Bayesian optimization algorithm (QABOA) that includes two mixers was developed, where surrogate-based Bayesian optimization is applied to improve the sampling efficiency of the classical optimizer. A continuous-time quantum walk mixer is used to enhance exploration, and the generalized Grover mixer is also applied to improve exploitation. In this paper, an extension of QABOA is proposed to further improve its searching efficiency. The searching efficiency is enhanced through two aspects. First, two mixers, including one for exploration and the other for exploitation, are applied in an alternating fashion. Second, uncertainty of the quantum circuit is quantified with a new quantum Matérn kernel based on the kurtosis of the basis state distribution, which increases the chance of obtaining the optimum. The proposed new two-mixer QABOA$'$s with and without uncertainty quantification are compared with three single-mixer QABOA$'$s on five discrete and four mixed-integer problems. The results show that the proposed two-mixer QABOA with uncertainty quantification has the best performance in efficiency and consistency for five out of the nine tested problems. The results also show that QABOA with the generalized Grover mixer performs the best among the single-mixer algorithms, thereby demonstrating the benefit of exploitation and the importance of dynamic exploration-exploitation balance in improving searching efficiency.",
  "categories": [
    "quant-ph",
    "cs.CE"
  ],
  "primary_category": "quant-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16335",
  "pdf_url": "https://arxiv.org/pdf/2307.16335v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 2771690,
  "size_after_bytes": 162083
}