{
  "title": "Impact of charge distribution of soft layers on transient electroosmotic flow of Maxwell fluids in soft nanochannels",
  "authors": [
    "Jun-Sik Sin",
    "Nam-Il Ri",
    "Hyon-Chol Kim",
    "Sin-Hyok Hyon"
  ],
  "submission_date": "2023-07-25T06:44:37+00:00",
  "revised_dates": [
    "2023-08-07T00:08:42+00:00",
    "2023-09-08T00:15:40+00:00"
  ],
  "abstract": "We theoretically study transient electroosmotic flow of general Maxwell fluids through polyelectrolyte grafted nanochannel with a layered distribution of charges.\n  By applying the method of Laplace transform, we semi-analytically obtain transient electroosmotic flow from Cauchy momentum equation and Maxwell constitutive equation.\n  For nanochannels grafted with polyelectrolyte layers having different layered distribution of charges, we study the influence of dimensionless relaxation time, dimensionless polyelectrolyte layer thickness and dimensionless drag coefficient on transient electroosmotic flow.\n  We present the results for some particular cases. Firstly, we unravel that for the case of polyzwitterionic brush that the sum of positive and negative structural charges is zero, total electroosmotic flow is non-zero. In particular, depending on charge distribution within end part of polyelectrolyte layers, the direction of electroosmotic flow can be reversed critically. Secondly, in order to quantitatively evaluate a reversal of electroosmotic flow for two polyelectrolyte layers of opposite signs, we introduce a critical number ks as the ratio between layered charge densities of two polyelectrolyte layers. Increasing ks allows electroosmotic flow to be reversed easily.\n  We verify that adjusting charge distributions of the layer can control intentionally the direction of the flows as well as strength of electroosmotic flow.",
  "categories": [
    "cond-mat.soft"
  ],
  "primary_category": "cond-mat.soft",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13283",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 6862396,
  "size_after_bytes": 142561
}