{
  "title": "Energy flow during relaxation in an electron-phonon system with multiple modes: A nonequilibrium Green's function study",
  "authors": [
    "Ken Inayoshi",
    "Akihisa Koga",
    "Yuta Murakami"
  ],
  "submission_date": "2023-07-24T06:13:49+00:00",
  "revised_dates": [],
  "abstract": "We investigate an energy flow in an extended Holstein model describing electron systems coupled to hot-phonons and heat-bath phonons. To analyze the relaxation process after the photo-excitation of electrons, we employ the nonequilibrium dynamical mean-field theory (DMFT). We find the backward energy flow during the relaxation, where the direction of energy transfer between electrons and hot-phonons is reversed. To clarify the microscopic mechanism of the backward energy flow, we introduce the approximated energy flows, which are calculated with the gradient and quasiparticle approximations and are related to the nonequilibrium distribution functions. We compare these approximated energy flows with the full energy flows calculated from the nonequilibrium DMFT. We find that, in the weak electron-hot-phonon coupling regime, the full and approximated energy flows are almost the same, meaning that the relaxation dynamics can be correctly understood in terms of the nonequilibrium distribution functions. As the strength of the electron-hot-phonon coupling increases, the approximated energy flow fails to qualitatively reproduce the full energy flow. This indicates that the microscopic origin of the energy flow cannot be solely explained by the nonequilibrium distribution functions. By comparing the energy flows with different levels of approximation, we reveal the role of the gradient and quasiparticle approximations.",
  "categories": [
    "cond-mat.str-el"
  ],
  "primary_category": "cond-mat.str-el",
  "doi": "10.7566/JPSJ.92.124001",
  "journal_ref": "J. Phys. Soc. Jpn. 92, 124001 (2023)",
  "arxiv_id": "2307.12543",
  "pdf_url": null,
  "comment": "20 pages, 12 figures",
  "num_versions": null,
  "size_before_bytes": 4555629,
  "size_after_bytes": 181848
}