{
  "title": "Preferential acceleration of heavy ions in magnetic reconnection: Hybrid-kinetic simulations with electron inertia",
  "authors": [
    "Neeraj Jain",
    "Jörg Büchner",
    "Miroslav Bárta",
    "Radoslav Bučík"
  ],
  "submission_date": "2023-07-25T05:37:06+00:00",
  "revised_dates": [
    "2025-07-18T00:14:51+00:00"
  ],
  "abstract": "Solar energetic particles (SEPs) in the energy range 10s KeV/nucleon-100s MeV/nucleon originate from Sun. Their high flux near Earth may damage the space borne electronics and generate secondary radiations harmful for the life on Earth and thus understanding their energization on Sun is important for space weather prediction. Impulsive (or ${}^{3}$He-rich) SEP events are associated with the acceleration of charge particles in solar flares by magnetic reconnection (MR) and related processes. The preferential acceleration of heavy ions and the extra-ordinary abundance enhancement of ${}^3$He in the impulsive SEPs are not understood yet. We study heavy-ion acceleration and their abundance enhancements by MR, an established acceleration source for impulsive SEPs in which heavy-ion enhancement is observed. We simulate MR using a 2-D hybrid-kinetic plasma model (kinetic ions and inertial electron fluid) with all the ions species treated self-consistently. We find that heavy ions are preferentially accelerated to energies many times larger than their initial thermal energies by a variety of acceleration mechanisms operating in MR. Most efficient acceleration takes place in the flux pileup regions of MR. Heavy ions with sufficiently small values of charge to mass ratio ($Q/M$) can be accelerated by pickup mechanism in outflow regions even before any magnetic flux is piled up. The energy spectra of heavy ions develop a shoulder like region, a non-thermal feature, as a result of the acceleration. The spectral index of the power law fit to the shoulder region of the spectra varies approximately as $(Q/M)^{-0.64}$. Abundance enhancement factor, defined as number of particles above a threshold energy normalized to total number of particles, scales as $(Q/M)^{-α}$ where $α$ increases with the energy threshold. We discuss our simulation results in the light of the SEP observations.",
  "categories": [
    "physics.plasm-ph",
    "physics.space-ph"
  ],
  "primary_category": "physics.plasm-ph",
  "doi": "10.1051/0004-6361/202348573",
  "journal_ref": "A&A 686, A28 (2024)",
  "arxiv_id": "2307.13268",
  "pdf_url": null,
  "comment": "Published in A&A",
  "num_versions": null,
  "size_before_bytes": 4618359,
  "size_after_bytes": 708984
}