{
  "title": "Static Posterior Inference of Bayesian Probabilistic Programming via Polynomial Solving",
  "authors": [
    "Peixin Wang",
    "Tengshun Yang",
    "Hongfei Fu",
    "Guanyan Li",
    "C. -H. Luke Ong"
  ],
  "submission_date": "2023-07-24T22:56:05+00:00",
  "revised_dates": [
    "2024-04-02T03:42:42+00:00",
    "2024-08-02T00:24:35+00:00"
  ],
  "abstract": "In Bayesian probabilistic programming, a central problem is to estimate the normalised posterior distribution (NPD) of a probabilistic program with conditioning via score (a.k.a. observe) statements. Most previous approaches address this problem by Markov Chain Monte Carlo and variational inference, and therefore could not generate guaranteed outcomes within a finite time limit. Moreover, existing methods for exact inference either impose syntactic restrictions or cannot guarantee successful inference in general.\n  In this work, we propose a novel automated approach to derive guaranteed bounds for NPD via polynomial solving. We first establish a fixed-point theorem for the wide class of score-at-end Bayesian probabilistic programs that terminate almost-surely and have a single bounded score statement at program termination. Then, we propose a multiplicative variant of Optional Stopping Theorem (OST) to address score-recursive Bayesian programs where score statements with weights greater than one could appear inside a loop. Finally, we use polynomial solving to implement our fixed-point theorem and OST variant. To improve the accuracy of the polynomial solving, we further propose a truncation operation and the synthesis of multiple bounds over various program inputs. Our approach can handle Bayesian probabilistic programs with unbounded while loops and continuous distributions with infinite supports. Experiments over a wide range of benchmarks show that compared with the most relevant approach (Beutner et al., PLDI 2022) for guaranteed NPD analysis via recursion unrolling, our approach is more time efficient and derives comparable or even tighter NPD bounds. Furthermore, our approach can handle score-recursive programs which previous approaches could not.",
  "categories": [
    "cs.PL"
  ],
  "primary_category": "cs.PL",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13160",
  "pdf_url": null,
  "comment": "This is a technical report for the paper with the same name published at PLDI 2024",
  "num_versions": null,
  "size_before_bytes": 2118031,
  "size_after_bytes": 1477725
}