{
  "title": "Origin of Hilbert space quantum scars in unconstrained models",
  "authors": [
    "Zexian Guo",
    "Bobo Liu",
    "Yu Gao",
    "Ang Yang",
    "Junlin Wang",
    "Jinlou Ma",
    "Lei Ying"
  ],
  "submission_date": "2023-07-25T07:25:14+00:00",
  "revised_dates": [],
  "abstract": "Quantum many-body scar is a recently discovered phenomenon weakly violating eigenstate thermalization hypothesis, and it has been extensively studied across various models. However, experimental realizations are mainly based on constrained models such as the $PXP$ model. Inspired by recent experimental observations on the superconducting platform in Refs.~[Nat. Phys. 19, 120 (2022)] and [arXiv:2211.05803], we study a distinct class of quantum many-body scars based on a half-filling hard-core Bose-Hubbard model, which is generic to describe in many experimental platforms. It is the so-called Hilbert space quantum scar as it originates from a subspace with a hypercube geometry weakly connecting to other thermalization regions in Hilbert space. Within the hypercube, a pair of collective Fock states do not directly connect to the thermalization region, resulting in slow thermalization dynamics with remarkable fidelity revivals with distinct differences from dynamics of other initial states. This mechanism is generic in various real-space lattice configurations, including one-dimensional Su-Schrieffer-Heeger chain, comb lattice, and even random dimer clusters consisting of dimers. In addition, we develop a toy model based on Hilbert hypercube decay approximation, to explain the spectrum overlap between the collective states and all eigenstates. Furthermore, we explore the Hilbert space quantum scar in two- and three-dimensional Su-Schrieffer-Heeger many-body systems, consisting of tetramers or octamers, respectively. This study makes quantum many-body scar state more realistic in applications such as quantum sensing and quantum metrology.",
  "categories": [
    "quant-ph",
    "cond-mat.quant-gas"
  ],
  "primary_category": "quant-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13297",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 12503789,
  "size_after_bytes": 98062
}