{
  "title": "A viable $f(R)$ gravity model without oscillations in the effective dark energy",
  "authors": [
    "A. Oliveros"
  ],
  "submission_date": "2023-07-21T20:44:02+00:00",
  "revised_dates": [
    "2023-09-18T00:02:13+00:00"
  ],
  "abstract": "In this study, we propose a reparameterization of a specific viable $f(R)$ gravity model to represent it as a perturbation of the $Λ$CDM model. The $f(R)$ gravity model under consideration includes two parameters, $b$ and $n$, which control how close the proposed model can be to $Λ$CDM, allowing for arbitrary proximity. Furthermore, it is shown that the Hu-Sawicki (HS) model is a limiting case of this reparameterized model. Following the existing literature, we also derive an analytical approximation for the expansion rate $H(z)$, which shows an excellent agreement between this analytical approximation and the numerical solution over a wide range of redshifts for realistic values of the deviation parameter $b$. By appropriately selecting values for the model parameters, we plot the cosmological parameters $w_{\\rm{DE}}$, $w_{\\rm{eff}}$, $Ω_{\\rm{DE}}$, and $H(z)$, as well as the statefinder quantities $q$, $j$, $s$, and $Om(z)$. We find that their present values (at $z=0$) are consistent with the observations from Planck 2018 and the values predicted by the $Λ$CDM model. It is important to note that the examined cosmological and statefinder parameters do not exhibit significant oscillations of effective dark energy, which could lead to singular and unphysical solutions at high redshifts. This anomalous behavior has been avoided here by utilizing the approximate analytical solution for $H(z)$. Additionally, we conduct a detailed analysis of the evolution of matter density perturbations within the introduced $f(R)$ gravity model. The results demonstrate that this viable $f(R)$ gravity model is practically indistinguishable from the $Λ$CDM model at the background level.",
  "categories": [
    "astro-ph.CO",
    "gr-qc",
    "hep-th"
  ],
  "primary_category": "astro-ph.CO",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11896",
  "pdf_url": null,
  "comment": "21 pages, 22 figures, 1 table. Typos corrected, minor changes; references added. Accepted for publication in Int. J. Mod. Phys. D",
  "num_versions": null,
  "size_before_bytes": 1937844,
  "size_after_bytes": 112332
}