{
  "title": "Bipartite Ranking Fairness through a Model Agnostic Ordering Adjustment",
  "authors": [
    "Sen Cui",
    "Weishen Pan",
    "Changshui Zhang",
    "Fei Wang"
  ],
  "submission_date": "2023-07-27T07:42:44+00:00",
  "revised_dates": [],
  "abstract": "Algorithmic fairness has been a serious concern and received lots of interest in machine learning community. In this paper, we focus on the bipartite ranking scenario, where the instances come from either the positive or negative class and the goal is to learn a ranking function that ranks positive instances higher than negative ones. While there could be a trade-off between fairness and performance, we propose a model agnostic post-processing framework xOrder for achieving fairness in bipartite ranking and maintaining the algorithm classification performance. In particular, we optimize a weighted sum of the utility as identifying an optimal warping path across different protected groups and solve it through a dynamic programming process. xOrder is compatible with various classification models and ranking fairness metrics, including supervised and unsupervised fairness metrics. In addition to binary groups, xOrder can be applied to multiple protected groups. We evaluate our proposed algorithm on four benchmark data sets and two real-world patient electronic health record repositories. xOrder consistently achieves a better balance between the algorithm utility and ranking fairness on a variety of datasets with different metrics. From the visualization of the calibrated ranking scores, xOrder mitigates the score distribution shifts of different groups compared with baselines. Moreover, additional analytical results verify that xOrder achieves a robust performance when faced with fewer samples and a bigger difference between training and testing ranking score distributions.",
  "categories": [
    "cs.LG",
    "cs.CY"
  ],
  "primary_category": "cs.LG",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14668",
  "pdf_url": "https://arxiv.org/pdf/2307.14668v1",
  "comment": "This paper is accepted by IEEE Transactions on Pattern Analysis and Machine Intelligence. arXiv admin note: substantial text overlap with arXiv:2006.08267",
  "num_versions": null,
  "size_before_bytes": 26788181,
  "size_after_bytes": 9724836
}