{
  "title": "Evolutionary Monte Carlo of QM properties in chemical space: Electrolyte design",
  "authors": [
    "Konstantin Karandashev",
    "Jan Weinreich",
    "Stefan Heinen",
    "Daniel Jose Arismendi Arrieta",
    "Guido Falk von Rudorff",
    "Kersti Hermansson",
    "O. Anatole von Lilienfeld"
  ],
  "submission_date": "2023-07-28T14:01:43+00:00",
  "revised_dates": [
    "2023-10-29T20:13:06+00:00",
    "2023-11-14T16:40:11+00:00"
  ],
  "abstract": "Optimizing a target function over the space of organic molecules is an important problem appearing in many fields of applied science, but also a very difficult one due to the vast number of possible molecular systems. We propose an Evolutionary Monte Carlo algorithm for solving such problems which is capable of straightforwardly tuning both exploration and exploitation characteristics of an optimization procedure while retaining favourable properties of genetic algorithms. The method, dubbed MOSAiCS (Metropolis Optimization by Sampling Adaptively in Chemical Space), is tested on problems related to optimizing components of battery electrolytes, namely minimizing solvation energy in water or maximizing dipole moment while enforcing a lower bound on the HOMO-LUMO gap; optimization was done over sets of molecular graphs inspired by QM9 and Electrolyte Genome Project (EGP) datasets. MOSAiCS reliably generated molecular candidates with good target quantity values, which were in most cases better than the ones found in QM9 or EGP. While the optimization results presented in this work sometimes required up to $10^{6}$ QM calculations and were thus only feasible thanks to computationally efficient ab initio approximations of properties of interest, we discuss possible strategies for accelerating MOSAiCS using machine learning approaches.",
  "categories": [
    "physics.chem-ph"
  ],
  "primary_category": "physics.chem-ph",
  "doi": "10.1021/acs.jctc.3c00822",
  "journal_ref": null,
  "arxiv_id": "2307.15563",
  "pdf_url": "https://arxiv.org/pdf/2307.15563v3",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 24026328,
  "size_after_bytes": 480311
}