{
  "title": "A Large-Scale Feasibility Study of Screen-based 3D Visualization and Augmented Reality Tools for Human Anatomy Education: Exploring Gender Perspectives in Learning Experience",
  "authors": [
    "Roghayeh Leila Barmaki",
    "Kangsoo Kim",
    "Zhang Guo",
    "Qile Wang",
    "Kevin Yu",
    "Rebecca Pearlman",
    "Nassir Navab"
  ],
  "submission_date": "2023-07-26T01:28:58+00:00",
  "revised_dates": [
    "2024-02-01T01:26:11+00:00"
  ],
  "abstract": "Anatomy education is an indispensable part of medical training, but traditional methods face challenges like limited resources for dissection in large classes and difficulties understanding 2D anatomy in textbooks. Advanced technologies, such as 3D visualization and augmented reality (AR), are transforming anatomy learning. This paper presents two in-house solutions that use handheld tablets or screen-based AR to visualize 3D anatomy models with informative labels and in-situ visualizations of the muscle anatomy. To assess these tools, a user study of muscle anatomy education involved 236 premedical students in dyadic teams, with results showing that the tablet-based 3D visualization and screen-based AR tools led to significantly higher learning experience scores than traditional textbook. While knowledge retention didn't differ significantly, ethnographic and gender analysis showed that male students generally reported more positive learning experiences than female students. This study discusses the implications for anatomy and medical education, highlighting the potential of these innovative learning tools considering gender and team dynamics in body painting anatomy learning interventions.",
  "categories": [
    "cs.HC",
    "cs.GR"
  ],
  "primary_category": "cs.HC",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14383",
  "pdf_url": null,
  "comment": "This work is accepted and presented at IEEE International Conference on Artificial Intelligence & extended and Virtual Reality (AIxVR 2024)",
  "num_versions": null,
  "size_before_bytes": 10218905,
  "size_after_bytes": 900609
}