{
  "title": "Evolution of the Lyman-α emitting fraction and UV properties of lensed star-forming galaxies between 2.9 < z < 6.7",
  "authors": [
    "Ilias Goovaerts",
    "Roser Pello",
    "Tran Thi Thai",
    "Pham Tuan-Anh",
    "Johan Richard",
    "Adélaïde Claeyssens",
    "Emile Carinos",
    "Geoffroy de la Vieuville",
    "Jorryt Matthee"
  ],
  "submission_date": "2023-07-28T13:55:39+00:00",
  "revised_dates": [],
  "abstract": "Faint galaxies are theorised to have played a major role in reionising the Universe. Their properties as well as the Lyman-α emitter fraction, could provide useful insight into this epoch. We use four galaxy clusters from the Lensed Lyman-alpha MUSE Arcs Sample (LLAMAS) which also have deep HST photometry to select a population of intrinsically faint Lyman Break Galaxies (LBGs) and Lyman-alpha Emitters (LAEs). We study the interrelation of these two populations, their properties, and the fraction of LBGs that display Lyman-alpha emission. The use of lensing clusters allows us to access an intrinsically faint population, the largest sample collected for this purpose: 263 LAEs and 972 LBGs between redshifts of 2.9 and 6.7, Lyman-alpha luminosities between 39.5 < log(L)(erg/s) < 42 and absolute UV magnitudes between -22 < M1500 < -12. We find a redshift evolution of the Lyman-alpha emitter fraction in line with past results, with diminished values above z = 6, taken to signify an increasingly neutral intervening IGM. Inspecting this redshift evolution with different limits on Lyman-alpha equivalent width (EW) and M1500 we find that the Lyman-alpha emitter fraction for the UV-brighter half of our sample is higher than the fraction for the UV-fainter half, a difference which increases at higher redshift. This is a surprising result and can be interpreted as a population of low Lyman-alpha EW, UV-bright galaxies situated in reionised bubbles. This result is especially interesting in the context of similar, UV-bright, low Lyman-alpha EW objects recently detected around the epoch of reionisation. We extend to intrinsically fainter objects the previously observed trends of LAEs among LBGs as galaxies with high star-formation rates and low dust content, as well as the strongest LAEs having in general fainter UV magnitudes and steeper UV slopes.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.1051/0004-6361/202347110",
  "journal_ref": "A&A 678, A174 (2023)",
  "arxiv_id": "2307.15559",
  "pdf_url": "https://arxiv.org/pdf/2307.15559v1",
  "comment": "14 pages, 10 figures, accepted in A&A",
  "num_versions": null,
  "size_before_bytes": 1552819,
  "size_after_bytes": 200384
}