{
  "title": "Near-ultraviolet photon-counting dual-comb spectroscopy",
  "authors": [
    "Bingxin Xu",
    "Zaijun Chen",
    "Theodor W. Hänsch",
    "Nathalie Picqué"
  ],
  "submission_date": "2023-07-24T15:07:22+00:00",
  "revised_dates": [],
  "abstract": "Ultraviolet spectroscopy provides unique insights into the structure of matter with applications ranging from fundamental tests to photochemistry in the earth's atmosphere and astronomical observations from space telescopes. At longer wavelengths, dual-comb spectroscopy with two interfering laser frequency combs has evolved into a powerful technique that can offer simultaneously a broad spectral range and very high resolution. Here we demonstrate a photon-counting approach that can extend the unique advantages of this method into ultraviolet regions where nonlinear frequency-conversion tends to be very inefficient. Our spectrometer, based on two frequency combs of slightly different repetition frequencies, provides broad span, high resolution, frequency calibration within the accuracy of an atomic clock, and overall consistency of the spectra. We demonstrate a signal-to-noise ratio at the quantum limit and optimal use of the measurement time, provided by the multiplex recording of all spectral data on a single photo-counter. Our initial experiments are performed in the near-ultraviolet and in the visible spectral ranges with alkali-atom vapor, with a power per comb line as low as a femtowatt. This crucial step towards precision broadband spectroscopy at short wavelengths clears the path to extreme-ultraviolet dual-comb spectroscopy and, more generally, generates a new realm of applications for diagnostics at photon level, as encountered e.g., when driving single atoms or molecules.",
  "categories": [
    "physics.optics",
    "physics.atom-ph",
    "physics.chem-ph",
    "physics.ins-det"
  ],
  "primary_category": "physics.optics",
  "doi": "10.1038/s41586-024-07094-9",
  "journal_ref": "Nature (2024)",
  "arxiv_id": "2307.12869",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}