{
  "title": "A Geometric Notion of Causal Probing",
  "authors": [
    "Clément Guerner",
    "Tianyu Liu",
    "Anej Svete",
    "Alexander Warstadt",
    "Ryan Cotterell"
  ],
  "submission_date": "2023-07-27T17:57:57+00:00",
  "revised_dates": [
    "2023-07-30T14:22:07+00:00",
    "2024-02-24T19:53:58+00:00",
    "2025-03-26T16:33:43+00:00"
  ],
  "abstract": "The linear subspace hypothesis (Bolukbasi et al., 2016) states that, in a language model's representation space, all information about a concept such as verbal number is encoded in a linear subspace. Prior work has relied on auxiliary classification tasks to identify and evaluate candidate subspaces that might give support for this hypothesis. We instead give a set of intrinsic criteria which characterize an ideal linear concept subspace and enable us to identify the subspace using only the language model distribution. Our information-theoretic framework accounts for spuriously correlated features in the representation space (Kumar et al., 2022) by reconciling the statistical notion of concept information and the geometric notion of how concepts are encoded in the representation space. As a byproduct of this analysis, we hypothesize a causal process for how a language model might leverage concepts during generation. Empirically, we find that linear concept erasure is successful in erasing most concept information under our framework for verbal number as well as some complex aspect-level sentiment concepts from a restaurant review dataset. Our causal intervention for controlled generation shows that, for at least one concept across two languages models, the concept subspace can be used to manipulate the concept value of the generated word with precision.",
  "categories": [
    "cs.CL"
  ],
  "primary_category": "cs.CL",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15054",
  "pdf_url": "https://arxiv.org/pdf/2307.15054v4",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1932906,
  "size_after_bytes": 1271801
}