{
  "title": "Emulating Expert Insight: A Robust Strategy for Optimal Experimental Design",
  "authors": [
    "Matthew R. Carbone",
    "Hyeong Jin Kim",
    "Chandima Fernando",
    "Shinjae Yoo",
    "Daniel Olds",
    "Howie Joress",
    "Brian DeCost",
    "Bruce Ravel",
    "Yugang Zhang",
    "Phillip M. Maffettone"
  ],
  "submission_date": "2023-07-26T00:18:23+00:00",
  "revised_dates": [],
  "abstract": "The challenge of optimal design of experiments (DOE) pervades materials science, physics, chemistry, and biology. Bayesian optimization has been used to address this challenge in vast sample spaces, although it requires framing experimental campaigns through the lens of maximizing some observable. This framing is insufficient for epistemic research goals that seek to comprehensively analyze a sample space, without an explicit scalar objective (e.g., the characterization of a wafer or sample library). In this work, we propose a flexible formulation of scientific value that recasts a dataset of input conditions and higher-dimensional observable data into a continuous, scalar metric. Intuitively, the scientific value function measures where observables change significantly, emulating the perspective of experts driving an experiment, and can be used in collaborative analysis tools or as an objective for optimization techniques. We demonstrate this technique by exploring simulated phase boundaries from different observables, autonomously driving a variable temperature measurement of a ferroelectric material, and providing feedback from a nanoparticle synthesis campaign. The method is seamlessly compatible with existing optimization tools, can be extended to multi-modal and multi-fidelity experiments, and can integrate existing models of an experimental system. Because of its flexibility, it can be deployed in a range of experimental settings for autonomous or accelerated experiments.",
  "categories": [
    "cond-mat.mtrl-sci",
    "physics.comp-ph"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13871",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 5825897,
  "size_after_bytes": 114490
}