{
  "title": "RIS-Enhanced Semantic Communications Adaptive to User Requirements",
  "authors": [
    "Peiwen Jiang",
    "Chao-Kai Wen",
    "Shi Jin",
    "Geoffrey Ye Li"
  ],
  "submission_date": "2023-07-30T01:05:09+00:00",
  "revised_dates": [
    "2023-08-05T08:44:43+00:00"
  ],
  "abstract": "Semantic communication significantly reduces required bandwidth by understanding semantic meaning of the transmitted. However, current deep learning-based semantic communication methods rely on joint source-channel coding design and end-to-end training, which limits their adaptability to new physical channels and user requirements. Reconfigurable intelligent surfaces (RIS) offer a solution by customizing channels in different environments. In this study, we propose the RIS-SC framework, which allocates semantic contents with varying levels of RIS assistance to satisfy the changing user requirements. It takes into account user movement and line-of-sight obstructions, enabling the RIS resource to protect important semantics in challenging channel conditions. The simulation results indicate reasonable task performance, but some semantic parts that have no effect on task performances are abandoned under severe channel conditions. To address this issue, a reconstruction method is also introduced to improve visual acceptance by inferring those missing semantic parts. Furthermore, the framework can adjust RIS resources in friendly channel conditions to save and allocate them efficiently among multiple users. Simulation results demonstrate the adaptability and efficiency of the RIS-SC framework across diverse channel conditions and user requirements.",
  "categories": [
    "eess.SP",
    "eess.IV"
  ],
  "primary_category": "eess.SP",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16100",
  "pdf_url": "https://arxiv.org/pdf/2307.16100v2",
  "comment": "This work has been submitted to the IEEE for possible publication.Copyright may be transferred without notice, after which this version may no longer be accessible",
  "num_versions": null,
  "size_before_bytes": 13296338,
  "size_after_bytes": 2448214
}