{
  "title": "Joint Batching and Scheduling for High-Throughput Multiuser Edge AI with Asynchronous Task Arrivals",
  "authors": [
    "Yihan Cang",
    "Ming Chen",
    "Kaibin Huang"
  ],
  "submission_date": "2023-07-15T06:59:42+00:00",
  "revised_dates": [],
  "abstract": "In this paper, we study joint batching and (task) scheduling to maximise the throughput (i.e., the number of completed tasks) under the practical assumptions of heterogeneous task arrivals and deadlines. The design aims to optimise the number of batches, their starting time instants, and the task-batch association that determines batch sizes. The joint optimisation problem is complex due to multiple coupled variables as mentioned and numerous constraints including heterogeneous tasks arrivals and deadlines, the causality requirements on multi-task execution, and limited radio resources. Underpinning the problem is a basic tradeoff between the size of batch and waiting time for tasks in the batch to be uploaded and executed. Our approach of solving the formulated mixed-integer problem is to transform it into a convex problem via integer relaxation method and $\\ell_0$-norm approximation. This results in an efficient alternating optimization algorithm for finding a close-to-optimal solution. In addition, we also design the optimal algorithm from leveraging spectrum holes, which are caused by fixed bandwidth allocation to devices and their asynchronized multi-batch task execution, to admit unscheduled tasks so as to further enhance throughput. Simulation results demonstrate that the proposed framework of joint batching and resource allocation can substantially enhance the throughput of multiuser edge-AI as opposed to a number of simpler benchmarking schemes, e.g., equal-bandwidth allocation, greedy batching and single-batch execution.",
  "categories": [
    "eess.SP",
    "math.OC"
  ],
  "primary_category": "eess.SP",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14350",
  "pdf_url": null,
  "comment": "Due to the limitation \"The abstract field cannot be longer than 1,920 characters\", the abstract here is shorter than that in the PDF file",
  "num_versions": null,
  "size_before_bytes": 1453775,
  "size_after_bytes": 256968
}