{
  "title": "DBGSA: A Novel Data Adaptive Bregman Clustering Algorithm",
  "authors": [
    "Ying Xiao",
    "Hou-biao Li",
    "Yu-pu Zhang"
  ],
  "submission_date": "2023-07-25T16:37:09+00:00",
  "revised_dates": [],
  "abstract": "With the development of Big data technology, data analysis has become increasingly important. Traditional clustering algorithms such as K-means are highly sensitive to the initial centroid selection and perform poorly on non-convex datasets. In this paper, we address these problems by proposing a data-driven Bregman divergence parameter optimization clustering algorithm (DBGSA), which combines the Universal Gravitational Algorithm to bring similar points closer in the dataset. We construct a gravitational coefficient equation with a special property that gradually reduces the influence factor as the iteration progresses. Furthermore, we introduce the Bregman divergence generalized power mean information loss minimization to identify cluster centers and build a hyperparameter identification optimization model, which effectively solves the problems of manual adjustment and uncertainty in the improved dataset. Extensive experiments are conducted on four simulated datasets and six real datasets. The results demonstrate that DBGSA significantly improves the accuracy of various clustering algorithms by an average of 63.8\\% compared to other similar approaches like enhanced clustering algorithms and improved datasets. Additionally, a three-dimensional grid search was established to compare the effects of different parameter values within threshold conditions, and it was discovered the parameter set provided by our model is optimal. This finding provides strong evidence of the high accuracy and robustness of the algorithm.",
  "categories": [
    "cs.LG",
    "math.NA"
  ],
  "primary_category": "cs.LG",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14375",
  "pdf_url": null,
  "comment": "21 pages, 10 figures",
  "num_versions": null,
  "size_before_bytes": 222828,
  "size_after_bytes": 63612
}