{
  "title": "Regular black holes from higher-derivative effective delta sources",
  "authors": [
    "Breno L. Giacchini",
    "Tibério de Paula Netto"
  ],
  "submission_date": "2023-07-23T15:43:35+00:00",
  "revised_dates": [],
  "abstract": "Certain approaches to quantum gravity and classical modified gravity theories result in effective field equations in which the original source is substituted by an effective one. In these cases, the occurrence of regular spacetime configurations may be related to the regularity of the effective source, regardless of the specific mechanism behind the regularization. In this chapter, we make an introduction to the effective source formalism applied to higher-derivative gravity. The results presented here, however, can be easily transposed to other frameworks that use similar sources. The generality obtained is also because we consider a general higher-derivative gravity model instead of restricting the analysis to some specific theories. In the first part, we discuss the model in the Newtonian limit, which offers a natural context for introducing effective sources. We show how the regularity properties of the effective sources depend on the behavior of the action's form factor in the ultraviolet regime, which leads to results valid for large families of models (or for families of modified delta sources). Subsequently, we use the general results on the effective sources to construct regular black hole metrics. One of our concerns is the higher-order regularity of the solutions, i.e., the possibility that not only the invariants built with curvature tensors but also the ones with covariant derivatives are regular. In this regard, we present some theorems relating the regularity of sets of curvature-derivative invariants with the regularity properties of the effective sources.",
  "categories": [
    "gr-qc",
    "hep-th"
  ],
  "primary_category": "gr-qc",
  "doi": "10.1007/978-981-99-1596-5_4",
  "journal_ref": null,
  "arxiv_id": "2307.12357",
  "pdf_url": null,
  "comment": "41 pages, 3 figures. Preprint of the invited chapter for the book \"Regular Black Holes: Towards a New Paradigm of the Gravitational Collapse\" (Ed. C. Bambi, Springer Singapore, 2023). The final authenticated version is available online at http://doi.org/10.1007/978-981-99-1596-5_4",
  "num_versions": null,
  "size_before_bytes": 355666,
  "size_after_bytes": 205830
}