{
  "title": "An Axiomatic Theory for Reversible Computation",
  "authors": [
    "Ivan Lanese",
    "Iain Phillips",
    "Irek Ulidowski"
  ],
  "submission_date": "2023-07-25T09:30:21+00:00",
  "revised_dates": [
    "2024-02-13T01:32:13+00:00"
  ],
  "abstract": "Undoing computations of a concurrent system is beneficial in many situations, e.g., in reversible debugging of multi-threaded programs and in recovery from errors due to optimistic execution in parallel discrete event simulation. A number of approaches have been proposed for how to reverse formal models of concurrent computation including process calculi such as CCS, languages like Erlang, and abstract models such as prime event structures and occurrence nets. However it has not been settled what properties a reversible system should enjoy, nor how the various properties that have been suggested, such as the parabolic lemma and the causal-consistency property, are related. We contribute to a solution to these issues by using a generic labelled transition system equipped with a relation capturing whether transitions are independent to explore the implications between various reversibility properties. In particular, we show how all properties we consider are derivable from a set of axioms. Our intention is that when establishing properties of some formalism it will be easier to verify the axioms rather than proving properties such as the parabolic lemma directly. We also introduce two new properties related to causal consistent reversibility, namely causal liveness and causal safety, stating, respectively, that an action can be undone if (causal liveness) and only if (causal safety) it is independent from all the following actions. These properties come in three flavours: defined in terms of independent transitions, independent events, or via an ordering on events. Both causal liveness and causal safety are derivable from our axioms.",
  "categories": [
    "cs.LO"
  ],
  "primary_category": "cs.LO",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13360",
  "pdf_url": null,
  "comment": "40 pages, 13 figures, 1 table; minor revisions (results unaffected), references added",
  "num_versions": null,
  "size_before_bytes": 765216,
  "size_after_bytes": 535047
}