{
  "title": "Optimisation and artifacts of photothermal excitation of microresonators",
  "authors": [
    "Liping Kevin Ge",
    "Alessandro Tuniz",
    "Martijn de Sterke",
    "James M. Zavislan",
    "Thomas G. Brown",
    "Sascha Martin",
    "David Martinez-Martin"
  ],
  "submission_date": "2023-07-31T13:16:56+00:00",
  "revised_dates": [],
  "abstract": "The excitation of microresonators using focused intensity modulated light, known as photothermal excitation, is gaining significant attention due to its capacity to accurately excite microresonators without distortions, even in liquid environments, which is driving key advancements in atomic force microscopy and related technologies. Despite progress in the development of coatings, the conversion of light into mechanical movement remains largely inefficient, limiting resonator movements to tens of nanometres even when milliwatts of optical power are used. Moreover, how photothermal efficiency depends on the relative position of a microresonator along the propagation axis of the photothermal beam remains poorly studied, hampering our understanding of the conversion of light into mechanical motion. Here, we perform photothermal measurements in air and water using cantilever microresonators and a custom-built picobalance, and determine how photothermal efficiency changes along the propagation beam axis. We identify that far out-of-band laser emission can lead to visual misidentification of the beam waist, resulting in a drop of photothermal efficiency of up to one order of magnitude. Our measurements also unveil that the beam waist is not always the position of highest photothermal efficiency, and can reduce the efficiency up to 20% for silicon cantilevers with trapezoidal cross section.",
  "categories": [
    "physics.app-ph",
    "physics.optics"
  ],
  "primary_category": "physics.app-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16636",
  "pdf_url": "https://arxiv.org/pdf/2307.16636v1",
  "comment": "30 pages, 4 figures, 1 table and supplementary information",
  "num_versions": null,
  "size_before_bytes": 2239358,
  "size_after_bytes": 1336562
}