{
  "title": "On the (De)centralization of FruitChains",
  "authors": [
    "Aikaterini-Panagiota Stouka",
    "Thomas Zacharias"
  ],
  "submission_date": "2023-07-23T20:31:24+00:00",
  "revised_dates": [],
  "abstract": "One of the most important features of blockchain protocols is decentralization, as their main contribution is that they formulate a distributed ledger that will be maintained and extended without the need of a trusted party. Bitcoin has been criticized for its tendency to centralization, as very few pools control the majority of the hashing power. Pass et al. proposed FruitChain [PODC 17] and claimed that this blockchain protocol mitigates the formation of pools by reducing the variance of the rewards in the same way as mining pools, but in a fully decentralized fashion. Many follow up papers consider that the problem of centralization in Proof-of-Work (PoW) blockchain systems can be solved via lower rewards' variance, and that in FruitChain the formation of pools is unnecessary.\n  Contrary to the common perception, in this work, we prove that lower variance of the rewards does not eliminate the tendency of the PoW blockchain protocols to centralization; miners have also other incentives to create large pools, and specifically to share the cost of creating the instance they need to solve the PoW puzzle.\n  We abstract the procedures of FruitChain as oracles and assign to each of them a cost. Then, we provide a formal definition of a pool in a blockchain system, and by utilizing the notion of equilibrium with virtual payoffs (EVP) [AFT 21], we prove that there is a completely centralized EVP, where all the parties form a single pool controlled by one party called the pool leader. The pool leader is responsible for creating the instance used for the PoW procedure. To the best of our knowledge, this is the first work that examines the construction of mining pools in the FruitChain system.",
  "categories": [
    "cs.CR",
    "cs.DC",
    "cs.GT"
  ],
  "primary_category": "cs.CR",
  "doi": "10.1109/CSF57540.2023.00020",
  "journal_ref": null,
  "arxiv_id": "2307.12422",
  "pdf_url": null,
  "comment": "Full version of the IEEE CSF 2023 camera-ready version",
  "num_versions": null,
  "size_before_bytes": 270604,
  "size_after_bytes": 216926
}