{
  "title": "Simulation-guided galaxy evolution inference: A case study with strong lensing galaxies",
  "authors": [
    "Andreas Filipp",
    "Yiping Shu",
    "Ruediger Pakmor",
    "Sherry H. Suyu",
    "Xiaosheng Huang"
  ],
  "submission_date": "2023-07-27T17:49:25+00:00",
  "revised_dates": [],
  "abstract": "Understanding the evolution of galaxies provides crucial insights into a broad range of aspects in astrophysics, including structure formation and growth, the nature of dark energy and dark matter, baryonic physics, and more. It is, however, infeasible to track the evolutionary processes of individual galaxies in real time given their long timescales. As a result, galaxy evolution analyses have been mostly based on ensembles of galaxies that are supposed to be from the same population according to usually basic and crude observational criteria. We propose a new strategy of evaluating the evolution of an individual galaxy by identifying its descendant galaxies as guided by cosmological simulations. As a proof of concept, we examined the evolution of the total mass distribution of a target strong lensing galaxy at $z=0.884$ using the proposed strategy. We selected 158 galaxies from the IllustrisTNG300 simulation that we identified as analogs of the target galaxy. We followed their descendants and found 11 observed strong lensing galaxies that match in stellar mass and size with the descendants at their redshifts. The observed and simulated results are discussed, although no conclusive assessment is made given the low statistical significance due to the small sample size. Nevertheless, the test confirms that our proposed strategy is already feasible with existing data and simulations. We expect it to play an even more important role in studying galaxy evolution as more strong lens systems and larger simulations become available with the advent of next-generation survey programs and cosmological simulations.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.1051/0004-6361/202346594",
  "journal_ref": "A&A 677, A113 (2023)",
  "arxiv_id": "2307.15044",
  "pdf_url": "https://arxiv.org/pdf/2307.15044v1",
  "comment": "11 pages",
  "num_versions": null,
  "size_before_bytes": 1673655,
  "size_after_bytes": 323796
}