{
  "title": "From non-metal to strange metal at the stripe-percolation transition in La$_{2-x}$Sr$_x$CuO$_4$",
  "authors": [
    "J. M. Tranquada",
    "P. M. Lozano",
    "Juntao Yao",
    "G. D. Gu",
    "Qiang Li"
  ],
  "submission_date": "2023-07-25T18:01:05+00:00",
  "revised_dates": [
    "2024-02-21T02:00:24+00:00",
    "2024-05-08T00:50:22+00:00"
  ],
  "abstract": "The nature of the normal state of cuprate superconductors continues to stimulate considerable speculation. Of particular interest has been the linear temperature dependence of the in-plane resistivity in the low-temperature limit, which violates the prediction for a Fermi liquid. We present measurements of anisotropic resistivity in La$_{2-x}$Sr$_x$CuO$_4$ that confirm the strange-metal behavior for crystals with doped-hole concentration $p=x > p^\\ast \\sim 0.19$ and contrast with the non-metallic behavior for $p<p^\\ast$. We propose that the changes at $p^\\ast$ are associated with a first-order transition from doped Mott insulator to conventional metal; the transition appears as a crossover due to intrinsic dopant disorder. We consider results from the literature that support this picture; in particular, we present a simulation of the impact of the disorder on the first-order transition and the doping dependence of stripe correlations. Below $p^\\ast$, the strong electronic interactions result in charge and spin stripe correlations that percolate across the CuO$_2$ planes; above $p^\\ast$, residual stripe correlations are restricted to isolated puddles. We suggest that the $T$-linear resistivity results from scattering of quasiparticles from antiferromagnetic spin fluctuations within the correlated puddles. This is a modest effect compared to the case at $p<p^\\ast$, where there data suggest that there are no coherent quasiparticles in the normal state.",
  "categories": [
    "cond-mat.supr-con"
  ],
  "primary_category": "cond-mat.supr-con",
  "doi": "10.1103/PhysRevB.109.184510",
  "journal_ref": "Phys. Rev. B 109, 184510 (2024)",
  "arxiv_id": "2307.13740",
  "pdf_url": null,
  "comment": "18 pages, 6 figures, Paper has been totally rewritten and expanded; includes new analysis. This is the version accepted by Phys. Rev. B",
  "num_versions": null,
  "size_before_bytes": 4193594,
  "size_after_bytes": 694722
}