{
  "title": "A preconditioned MINRES method for optimal control of wave equations and its asymptotic spectral distribution theory",
  "authors": [
    "Sean Hon",
    "Jiamei Dong",
    "Stefano Serra-Capizzano"
  ],
  "submission_date": "2023-07-24T14:51:23+00:00",
  "revised_dates": [],
  "abstract": "In this work, we propose a novel preconditioned Krylov subspace method for solving an optimal control problem of wave equations, after explicitly identifying the asymptotic spectral distribution of the involved sequence of linear coefficient matrices from the optimal control problem. Namely, we first show that the all-at-once system stemming from the wave control problem is associated to a structured coefficient matrix-sequence possessing an eigenvalue distribution. Then, based on such a spectral distribution of which the symbol is explicitly identified, we develop an ideal preconditioner and two parallel-in-time preconditioners for the saddle point system composed of two block Toeplitz matrices. For the ideal preconditioner, we show that the eigenvalues of the preconditioned matrix-sequence all belong to the set $\\left(-\\frac{3}{2},-\\frac{1}{2}\\right)\\bigcup \\left(\\frac{1}{2},\\frac{3}{2}\\right)$ well separated from zero, leading to mesh-independent convergence when the minimal residual method is employed. The proposed {parallel-in-time} preconditioners can be implemented efficiently using fast Fourier transforms or discrete sine transforms, and their effectiveness is theoretically shown in the sense that the eigenvalues of the preconditioned matrix-sequences are clustered around $\\pm 1$, which leads to rapid convergence. When these parallel-in-time preconditioners are not fast diagonalizable, we further propose modified versions which can be efficiently inverted. Several numerical examples are reported to verify our derived localization and spectral distribution result and to support the effectiveness of our proposed preconditioners and the related advantages with respect to the relevant literature.",
  "categories": [
    "math.NA"
  ],
  "primary_category": "math.NA",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12850",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 29124956,
  "size_after_bytes": 188329
}