{
  "title": "Fast Fabrication of WS2/Bi2Se3 Heterostructures for High Performance Photodetection",
  "authors": [
    "Fan Li",
    "Jialin Li",
    "Junsheng Zheng",
    "Yuanbiao Tong",
    "Huanfeng Zhu",
    "Pan Wang",
    "Linjun Li"
  ],
  "submission_date": "2023-07-25T22:56:30+00:00",
  "revised_dates": [],
  "abstract": "Two-dimensional (2D) material heterostructures have attracted considerable attention owing to their interesting and novel physical properties, which expand the possibilities for future optoelectronic, photovoltaic, and nanoelectronic applications. A portable, fast, and deterministic transfer technique is highly needed for the fabrication of heterostructures. Herein, we report a fast half wet poly(dimethylsiloxane) (PDMS) transfer process utilizing the change of adhesion energy with the help of micron-sized water droplets. Using this method, a vertical stacking of the WS2/Bi2Se3 heterostructure with a straddling band configuration is successfully assembled on a fluorophlogopite substrate. Thanks to the complementary band gaps and high efficiency of interfacial charge transfer, the photodetector based on the heterostructure exhibits a superior responsivity of 109.9 A/W for a visible incident light at 473 nm and 26.7 A/W for a 1064 nm near-infrared illumination. Such high photoresponsivity of the heterostructure demonstrates that our transfer method not only owns time efficiency but also ensures high quality of the heterointerface. Our study may open new pathways to the fast and massive fabrication of various vertical 2D heterostructures for applications in twistronics/valleytronics and other band engineering devices.",
  "categories": [
    "cond-mat.mes-hall",
    "physics.ins-det"
  ],
  "primary_category": "cond-mat.mes-hall",
  "doi": "10.1021/acsami.2c17513",
  "journal_ref": "ACS Appl Mater Interfaces 15, 10098(2023)",
  "arxiv_id": "2307.13852",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}