{
  "title": "Shell elasticity and viscosity of lipid-coated microbubbles are significantly altered in mediums of different ionic strength",
  "authors": [
    "Amin Jafari Sojahrood",
    "Celina Yang",
    "Claire Counil",
    "Pinunta Nittachayarn",
    "David. E. Goertz",
    "Agata. A Exner",
    "Michael . C. Kolios"
  ],
  "submission_date": "2023-07-25T21:40:26+00:00",
  "revised_dates": [],
  "abstract": "Correct measurement of the shell properties of coated microbubbles (MBs) is essential to understanding and optimizing their response to ultrasound (US) exposure parameters in diagnostic and therapeutic ultrasound. MBs are surrounded by blood; however, the influence of the surrounding medium charges on the MB properties is poorly understood. This study aims to measure the medium charge interactions with MB shells by measuring the frequency-dependent attenuation of the same size MBs in mediums of varying charge density. In-house lipid-coated MBs with C3F8 gas core were made and were isolated to a mean size of 2.35um. MBs were diluted to ~8*10^5 MBs/mL in distilled water (DW), and two different concentrations of phosphate-buffered saline solution (PBS-1x and PBS-10x). The frequency-dependent attenuation of the MBs solutions was measured using an aligned pair of PVDF transducers with a center frequency of 10MHz and 100% bandwidth. The MB shell properties were estimated by fitting the linear equation to experiments. Using a pendant drop tensiometer, the surface tension of mm-size drops was measured inside DW, PBS-1x and PBS-10x. The frequency of the peak attenuation changes at different salinity levels was 13, 7.5 and 6.25MHz in DW, PBS-1x and PBS-10x, respectively. The attenuation peak increased by ~140% with increasing ion density. MBs' estimated shell elasticity decreased by 64% between DW and PBS-1x and 36% between PBS-1x and PBS-10x. Reduction in the shell stiffness is in qualitative agreement with the drop surface tension measurements. The shell viscosity was reduced by ~40% between DW and PBS-1x and 42% between PBS-1x and PBS-10x. The reduction in the stiffness and viscosity is possibly due to the formation of a densely charged layer around the shell, further reducing the effective surface tension on the MBs.",
  "categories": [
    "physics.app-ph",
    "cond-mat.soft",
    "physics.flu-dyn"
  ],
  "primary_category": "physics.app-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13827",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}