{
  "title": "LaplaceConfidence: a Graph-based Approach for Learning with Noisy Labels",
  "authors": [
    "Mingcai Chen",
    "Yuntao Du",
    "Wei Tang",
    "Baoming Zhang",
    "Hao Cheng",
    "Shuwei Qian",
    "Chongjun Wang"
  ],
  "submission_date": "2023-07-31T12:44:30+00:00",
  "revised_dates": [],
  "abstract": "In real-world applications, perfect labels are rarely available, making it challenging to develop robust machine learning algorithms that can handle noisy labels. Recent methods have focused on filtering noise based on the discrepancy between model predictions and given noisy labels, assuming that samples with small classification losses are clean. This work takes a different approach by leveraging the consistency between the learned model and the entire noisy dataset using the rich representational and topological information in the data. We introduce LaplaceConfidence, a method that to obtain label confidence (i.e., clean probabilities) utilizing the Laplacian energy. Specifically, it first constructs graphs based on the feature representations of all noisy samples and minimizes the Laplacian energy to produce a low-energy graph. Clean labels should fit well into the low-energy graph while noisy ones should not, allowing our method to determine data's clean probabilities. Furthermore, LaplaceConfidence is embedded into a holistic method for robust training, where co-training technique generates unbiased label confidence and label refurbishment technique better utilizes it. We also explore the dimensionality reduction technique to accommodate our method on large-scale noisy datasets. Our experiments demonstrate that LaplaceConfidence outperforms state-of-the-art methods on benchmark datasets under both synthetic and real-world noise.",
  "categories": [
    "cs.LG"
  ],
  "primary_category": "cs.LG",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16614",
  "pdf_url": "https://arxiv.org/pdf/2307.16614v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 4440987,
  "size_after_bytes": 234728
}