{
  "title": "Simulated analogues II: a new methodology for non-parametric matching of models to observations",
  "authors": [
    "Rami Al-Belmpeisi",
    "Vito Tuhtan",
    "Mikkel Bregning Christensen",
    "Rajika L Kuruwita",
    "Troels Haugbølle"
  ],
  "submission_date": "2023-07-27T15:09:33+00:00",
  "revised_dates": [],
  "abstract": "Star formation is a multi-scale problem, and only global simulations that account for the connection from the molecular cloud scale gas flow to the accreting protostar can reflect the observed complexity of protostellar systems. Star-forming regions are characterised by supersonic turbulence and as a result, it is not possible to simultaneously design models that account for the larger environment and in detail reproduce observed stellar systems. Instead, the stellar inventories can be matched statistically, and best matches found that approximate specific observations. Observationally, a combination of single-dish telescopes and interferometers are now able to resolve the nearest protostellar objects on all scales from the protostellar core to the inner 10 AU. We present a new non-parametric methodology which uses high-resolution simulations and post-processing methods to match simulations and observations using deep learning. Our goal is to perform a down-selection from large data sets of synthetic images to a ranked list of best-matching candidates with respect to the observation. This is particularly useful for binary and multiple stellar systems that form in turbulent environments. The objective is to accelerate the rate at which we can do such comparisons, remove biases from hand-picking matches, and contribute to identifying the underlying physical processes that drive the creation and evolution of observed protostellar systems.",
  "categories": [
    "astro-ph.GA",
    "astro-ph.SR"
  ],
  "primary_category": "astro-ph.GA",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14924",
  "pdf_url": "https://arxiv.org/pdf/2307.14924v1",
  "comment": "13 pages, 8 figures, submitted to MNRAS",
  "num_versions": null,
  "size_before_bytes": 4394749,
  "size_after_bytes": 427310
}