{
  "title": "Correlation between the optical veiling and accretion properties: A case study of the classical T Tauri star DK Tau",
  "authors": [
    "M. Nelissen",
    "A. Natta",
    "P. McGinnis",
    "C. Pittman",
    "C. Delvaux",
    "T. Ray"
  ],
  "submission_date": "2023-07-31T10:41:57+00:00",
  "revised_dates": [],
  "abstract": "Classical T Tauri stars (cTTs) accrete from their circumstellar disk. The material falls onto the stellar surface, producing an accretion shock, which generates veiling in a star's spectra. In addition, the shock causes a localized accretion spot at the level of the chromosphere. Our goal is to investigate the accretion, particularly the mass accretion rates (Macc), for the cTTs DK Tau, over two periods of 17 and 29 days, using two different procedures for comparison purposes. The first method relies on the derivation of the accretion luminosity via accretion-powered emission lines. The second compares the variability of the optical veiling with accretion shock models to determine mass accretion rates. We used observations taken in 2010 and 2012 with the ESPaDOnS spectropolarimeter at the CFHT. We find peak values of the veiling (at 550 nm) ranging from 0.2 to 1.3, with a steeper trend across the wavelength range for higher peak values. When using the accretion-powered emission lines, we find mass accretion rate values ranging from log(Macc[Msol/yr]) = -8.20 to log(Macc[Msol/yr]) = -7.40. This agrees with the values found in the literature, as well as the values calculated using the accretion shock models and the veiling. In addition, we identify a power-law correlation between the values of the accretion luminosity and the optical veiling. For the 2010 observations, using the values of the filling factors (which represent the area of the star covered by an accretion spot) derived from the shock models, we infer that the accretion spot was located between +45 degrees and +75 degrees in latitude. We show that both methods of determining the mass accretion rate yield similar results. We also present a helpful means of confirming the accretion luminosity values by measuring the veiling at a single wavelength in the optical.",
  "categories": [
    "astro-ph.SR"
  ],
  "primary_category": "astro-ph.SR",
  "doi": "10.1051/0004-6361/202347231",
  "journal_ref": "A&A 677, A64 (2023)",
  "arxiv_id": "2307.16561",
  "pdf_url": "https://arxiv.org/pdf/2307.16561v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 5688015,
  "size_after_bytes": 225614
}