{
  "title": "Reliability of the g factor over time in Italian INVALSI data (2010-2022): What can achievement-g tell us about the Flynn effect?",
  "authors": [
    "Jakob Pietschnig",
    "Sandra Oberleiter",
    "Enrico Toffalini",
    "David Giofre"
  ],
  "submission_date": "2023-07-22T07:16:11+00:00",
  "revised_dates": [],
  "abstract": "Generational intelligence test score gains over large parts of the 20th century have been observed to be negatively associated with psychometric g. Recent reports about changes in the cross-temporal IQ trajectory suggest that ability differentiation may be responsible for both changes in g as well as increasingly (sub)domain specific and inconsistent trajectories. Schooling is considered to be a main candidate cause for the Flynn effect, which suggests that school achievement might be expected to show similar cross-temporal developments. In the present study, we investigated evidence for cross-temporal changes in achievement-based g in a formal large-scale student assessment in Italy (i.e., the INVALSI assessment; N = 1,900,000). Based on data of four school grades (i.e., grades 2, 5, 8, and 10) over 13 years (2010-2022), we observed little evidence for changes in achievement g in general. However, cross-temporal trajectories were differentiated according to school grade, indicating cross-temporal g decreases for lower grade students whilst changes for higher grade students were positive. These findings may be interpreted as tentative evidence for age-dependent achievement-g differentiation. The presently observed achievement g trajectory appears to be consistent with recently observed evidence for a potential stagnation or reversal of cognitive test score gains.",
  "categories": [
    "stat.AP"
  ],
  "primary_category": "stat.AP",
  "doi": "10.1016/j.paid.2023.112345",
  "journal_ref": "Personality and Individual Differences, 2023, 214, 112345",
  "arxiv_id": "2307.12003",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}