{
  "title": "Gaussian Graph with Prototypical Contrastive Learning in E-Commerce Bundle Recommendation",
  "authors": [
    "Zhao-Yang Liu",
    "Liucheng Sun",
    "Chenwei Weng",
    "Qijin Chen",
    "Chengfu Huo"
  ],
  "submission_date": "2023-07-25T12:56:41+00:00",
  "revised_dates": [],
  "abstract": "Bundle recommendation aims to provide a bundle of items to satisfy the user preference on e-commerce platform. Existing successful solutions are based on the contrastive graph learning paradigm where graph neural networks (GNNs) are employed to learn representations from user-level and bundle-level graph views with a contrastive learning module to enhance the cooperative association between different views. Nevertheless, they ignore the uncertainty issue which has a significant impact in real bundle recommendation scenarios due to the lack of discriminative information caused by highly sparsity or diversity. We further suggest that their instancewise contrastive learning fails to distinguish the semantically similar negatives (i.e., sampling bias issue), resulting in performance degradation. In this paper, we propose a novel Gaussian Graph with Prototypical Contrastive Learning (GPCL) framework to overcome these challenges. In particular, GPCL embeds each user/bundle/item as a Gaussian distribution rather than a fixed vector. We further design a prototypical contrastive learning module to capture the contextual information and mitigate the sampling bias issue. Extensive experiments demonstrate that benefiting from the proposed components, we achieve new state-of-the-art performance compared to previous methods on several public datasets. Moreover, GPCL has been deployed on real-world e-commerce platform and achieved substantial improvements.",
  "categories": [
    "cs.IR",
    "cs.LG"
  ],
  "primary_category": "cs.IR",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13468",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1674385,
  "size_after_bytes": 1259760
}