{
  "title": "Earth-based Stellar Occultation Predictions for Jupiter, Saturn, Uranus, Neptune, Titan, and Triton: 2023-2050",
  "authors": [
    "Richard G. French",
    "Damya Souami"
  ],
  "submission_date": "2023-07-25T14:24:56+00:00",
  "revised_dates": [],
  "abstract": "In support of studies of decadal-timescale evolution of outer solar system atmospheres and ring systems, we present detailed Earth-based stellar occultation predictions for Jupiter, Saturn, Uranus, Neptune, Titan, and Triton for 2023-2050, based on the Gaia DR3 star catalog and near-IR K-band photometry from the 2MASS catalog. We tabulate the number of observable events by year and magnitude interval, reflecting the highly variable frequency of high-SNR events depending on the target's path relative to the star-rich regions of the Milky Way. We identify regions on Earth where each event is potentially observable, and for atmospheric occultations, we determine the latitude of the ingress and egress events. For Saturn, Uranus, and Neptune, we also compute the predicted ring occultation event times. We present representative subsets of the predicted events and highlights particularly promising events. Jupiter occultations with K $\\leq$7 occur at a cadence of about one per year, with bright events at higher frequency in 2031 and 2043. Saturn occultations are much rarer, with only two predicted events with K $\\leq$5 in 2032 and 2047. Ten Uranus ring occultations are predicted with K$\\leq$10 for the period 2023 to 2050. Neptune traverses star-poor regions of the sky until 2068, resulting in only 13 predicted occultations for K$\\leq$12 between 2023 and 2050. Titan has several high-SNR events between 2029--2031, whereas Triton is limited to a total of 22 occultations with K$\\leq$15 between 2023 and 2050. Details of all predicted events are included in the Supplementary Online Material.",
  "categories": [
    "astro-ph.EP"
  ],
  "primary_category": "astro-ph.EP",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13530",
  "pdf_url": null,
  "comment": "Planetary Science Journal (in press)",
  "num_versions": null,
  "size_before_bytes": 74149210,
  "size_after_bytes": 74139482
}