{
  "title": "On the Child-Langmuir Law in One, Two, and Three Dimensions",
  "authors": [
    "Y. Y. Lau",
    "Dion Li",
    "David P. Chernin"
  ],
  "submission_date": "2023-07-27T00:21:39+00:00",
  "revised_dates": [
    "2023-08-08T17:53:14+00:00",
    "2023-09-27T15:17:28+00:00"
  ],
  "abstract": "We consider the limiting current from an emitting patch whose size is much smaller than the anode-cathode spacing. The limiting current is formulated in terms of an integral equation. It is solved iteratively, first to numerically recover the classical one-dimensional Child-Langmuir law, including Jaffe's extension to a constant, nonzero electron emission velocity. We extend to 2-dimensions in which electron emission is restricted to an infinitely long stripe with infinitesimally narrow stripe width, so that the emitted electrons form an electron sheet. We next extend to 3-dimensions in which electron emission is restricted to a square tile (or a circular patch) with an infinitesimally small tile size (or patch radius), so that the emitted electrons form a needle-like line charge. Surprisingly, for the electron needle problem, we only find the null solution for the total line charge current, regardless of the assumed initial electron velocity. For the electron sheet problem, we also find only the null solution for the total sheet current if the electron emission velocity is assumed to be zero, and the total maximum sheet current becomes a finite, nonzero value if the electron emission velocity is assumed to be nonzero. These seemingly paradoxical results are shown to be consistent with the earlier works of the Child-Langmuir law of higher dimensions. They are also consistent with, or perhaps even anticipated by, the more recent theories and simulations on thermionic cathodes that used realistic work function distributions to account for patchy, nonuniform electron emission. The mathematical subtleties are discussed.",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph",
  "doi": "10.1063/5.0169276",
  "journal_ref": null,
  "arxiv_id": "2307.14552",
  "pdf_url": "https://arxiv.org/pdf/2307.14552v3",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 2267354,
  "size_after_bytes": 1321749
}