{
  "title": "Compact & Capable: Harnessing Graph Neural Networks and Edge Convolution for Medical Image Classification",
  "authors": [
    "Aryan Singh",
    "Pepijn Van de Ven",
    "Ciarán Eising",
    "Patrick Denny"
  ],
  "submission_date": "2023-07-24T13:39:21+00:00",
  "revised_dates": [],
  "abstract": "Graph-based neural network models are gaining traction in the field of representation learning due to their ability to uncover latent topological relationships between entities that are otherwise challenging to identify. These models have been employed across a diverse range of domains, encompassing drug discovery, protein interactions, semantic segmentation, and fluid dynamics research. In this study, we investigate the potential of Graph Neural Networks (GNNs) for medical image classification. We introduce a novel model that combines GNNs and edge convolution, leveraging the interconnectedness of RGB channel feature values to strongly represent connections between crucial graph nodes. Our proposed model not only performs on par with state-of-the-art Deep Neural Networks (DNNs) but does so with 1000 times fewer parameters, resulting in reduced training time and data requirements. We compare our Graph Convolutional Neural Network (GCNN) to pre-trained DNNs for classifying MedMNIST dataset classes, revealing promising prospects for GNNs in medical image analysis. Our results also encourage further exploration of advanced graph-based models such as Graph Attention Networks (GAT) and Graph Auto-Encoders in the medical imaging domain. The proposed model yields more reliable, interpretable, and accurate outcomes for tasks like semantic segmentation and image classification compared to simpler GCNNs",
  "categories": [
    "eess.IV",
    "cs.CV",
    "cs.LG"
  ],
  "primary_category": "eess.IV",
  "doi": null,
  "journal_ref": "Proceedings of the Irish Machine Vision and Image Processing Conference 2023",
  "arxiv_id": "2307.12790",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 49468446,
  "size_after_bytes": 56271
}