{
  "title": "Colossal magnetoresistance in Ti lightly-doped Cr2Se3 single crystals with layered structure",
  "authors": [
    "Shu-Juan Zhang",
    "Jian-Min Yan",
    "F. Tang",
    "Jin Wu",
    "Wei-Qi Dong",
    "Dan-Wen Zhang",
    "Fu-Sheng Luo",
    "Lei Chen",
    "Y. Fang",
    "Tao Zhang",
    "Yang Chai",
    "Weiyao Zhao",
    "Xiaolin Wang",
    "Ren-Kui Zheng"
  ],
  "submission_date": "2023-07-25T22:37:25+00:00",
  "revised_dates": [],
  "abstract": "Stoichiometric Cr2Se3 single crystals are particular layer-structured antiferromagnets which possess noncolinear spin configuration, weak ferromagnetic moments, moderate magnetoresistance (MR ~ 14.3%), and bad metallic conductivity below the antiferromagnetic phase transition temperature. Here, we report an interesting >16000% colossal magnetoresistance (CMR) effect in Ti (1.5 atomic percent) lightly-doped Cr2Se3 single crystals. Such a CMR is approximately 1143 times larger than that of the stoichiometric Cr2Se3 crystals and is rarely observed in layered antiferromagnets and is attributed to the frustrated spin configuration. Moreover, the Ti doping not only dramatically changes the electronic conductivity of the Cr2Se3 crystal from a bad metal to a semiconductor with a gap of ~ 15 meV, but also induces a change of the magnetic anisotropy of the Cr2Se3 crystal from strong out-of-plane to weak in plane. Further, magnetotransport measurements reveal that the low-field MR scales with the square of the reduced magnetization, which is a signature of CMR materials. The layered Ti:Cr2Se3 with CMR effect could be used as 2D heterostructure building blocks to provide colossal negative MR in spintronic devices.",
  "categories": [
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": "10.1021/acsami.1c18848",
  "journal_ref": "ACS Applied Materials & Interfaces 13.49 (2021): 58949-58955",
  "arxiv_id": "2307.13843",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}