{
  "title": "Multiparameter estimation with two qubit probes in noisy channels",
  "authors": [
    "Lorcan. O. Conlon",
    "Ping Koy Lam",
    "Syed. M. Assad"
  ],
  "submission_date": "2023-07-26T03:20:48+00:00",
  "revised_dates": [],
  "abstract": "This work compares the performance of single and two qubit probes for estimating several phase rotations simultaneously under the action of different noisy channels. We compute the quantum limits for this simultaneous estimation using collective and individual measurements by evaluating the Holevo and Nagaoka-Hayashi Cramér-Rao bounds respectively. Several quantum noise channels are considered, namely the decohering channel, the amplitude damping channel and the phase damping channel. For each channel we find the optimal single and two qubit probes. Where possible we demonstrate an explicit measurement strategy which saturates the appropriate bound and we investigate how closely the Holevo bound can be approached through collective measurements on multiple copies of the same probe. We find that under the action of the considered channels, two qubit probes show enhanced parameter estimation capabilities over single qubit probes for almost all non-identity channels, i.e. the achievable precision with a single qubit probe degrades faster with increasing exposure to the noisy environment than that of the two qubit probe. However, in sufficiently noisy channels, we show that it is possible for single qubit probes to outperform maximally entangled two qubit probes. This work shows that, in order to reach the ultimate precision limits allowed by quantum mechanics, entanglement is required in both the state preparation and state measurement stages. It is hoped the tutorial-style nature of this paper will make it easily accessible.",
  "categories": [
    "quant-ph"
  ],
  "primary_category": "quant-ph",
  "doi": "10.3390/e25081122",
  "journal_ref": "Entropy 2023, 25(8), 1122",
  "arxiv_id": "2307.13936",
  "pdf_url": null,
  "comment": "Tutorial-type case study for multiparameter estimation,27 pages and 10 pages supplementary",
  "num_versions": null,
  "size_before_bytes": 44987516,
  "size_after_bytes": 242431
}