{
  "title": "The semiclassical limit of quantum gravity and the problem of time",
  "authors": [
    "R. I. Ayala Oña",
    "M. B. Kalmykov",
    "D. P. Kislyakova",
    "T. P. Shestakova"
  ],
  "submission_date": "2023-07-22T15:23:31+00:00",
  "revised_dates": [],
  "abstract": "The question about the appearance of time in the semiclassical limit of quantum gravity continues to be discussed in the literature. It is believed that a temporal Schrodinger equation for matter fields on the background of a classical gravitational field must be true. To obtain this equation, the Born - Oppenheimer approximation for gravity is used. However, the origin of time in this equation is different in works of various authors. For example, in the papers of Kiefer and his collaborators, time is a parameter along a classical trajectory of gravitational field; in the works of Montani and his collaborators the origin of time is introducing the Kuchar - Torre reference fluid; in the extended phase space approach the origin of time is the consequence of existing of the observer in a fixed reference frame. We discuss and compare these approaches. To make the calculations transparent, we illustrate them with a model of a closed isotropic universe. In each approach, one obtains some Schrodinger equation for matter fields with quantum gravitational corrections, but the form of the equation and the corrections depend on additional assumptions which are rather arbitrary. None of the approaches can explain how time had appeared in the Early Universe, since it is supposed that classical gravity and, therefore, classical spacetime had already come into being.",
  "categories": [
    "gr-qc"
  ],
  "primary_category": "gr-qc",
  "doi": "10.1142/S0218271823400035",
  "journal_ref": "Int. J. Mod. Phys. D33 (2024) 2340003",
  "arxiv_id": "2307.12102",
  "pdf_url": null,
  "comment": "18 pages, no figure, to be published in Int. J. Mod. Phys. D",
  "num_versions": null,
  "size_before_bytes": 65424,
  "size_after_bytes": 65424
}