{
  "title": "$\\ell_p$-sphere covering and approximating nuclear $p$-norm",
  "authors": [
    "Jiewen Guan",
    "Simai He",
    "Bo Jiang",
    "Zhening Li"
  ],
  "submission_date": "2023-07-28T15:26:31+00:00",
  "revised_dates": [
    "2024-07-11T06:46:46+00:00"
  ],
  "abstract": "The spectral $p$-norm and nuclear $p$-norm of matrices and tensors appear in various applications albeit both are NP-hard to compute. The former sets a foundation of $\\ell_p$-sphere constrained polynomial optimization problems and the latter has been found in many rank minimization problems in machine learning. We study approximation algorithms of the tensor nuclear $p$-norm with an aim to establish the approximation bound matching the best one of its dual norm, the tensor spectral $p$-norm. Driven by the application of sphere covering to approximate both tensor spectral and nuclear norms ($p=2$), we propose several types of hitting sets that approximately represent $\\ell_p$-sphere with adjustable parameters for different levels of approximations and cardinalities, providing an independent toolbox for decision making on $\\ell_p$-spheres. Using the idea in robust optimization and second-order cone programming, we obtain the first polynomial-time algorithm with an $Ω(1)$-approximation bound for the computation of the matrix nuclear $p$-norm when $p\\in(2,\\infty)$ is a rational, paving a way for applications in modeling with the matrix nuclear $p$-norm. These two new results enable us to propose various polynomial-time approximation algorithms for the computation of the tensor nuclear $p$-norm using tensor partitions, convex optimization and duality theory, attaining the same approximation bound to the best one of the tensor spectral $p$-norm. We believe the ideas of $\\ell_p$-sphere covering with its applications in approximating nuclear $p$-norm would be useful to tackle optimization problems on other sets such as the binary hypercube with its applications in graph theory and neural networks, the nonnegative sphere with its applications in copositive programming and nonnegative matrix factorization.",
  "categories": [
    "math.OC"
  ],
  "primary_category": "math.OC",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15616",
  "pdf_url": "https://arxiv.org/pdf/2307.15616v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1873029,
  "size_after_bytes": 643218
}