{
  "title": "Inclusive photon multiplicity at forward pseudorapidities in pp and p$-$Pb collisions at $\\sqrt{s_{\\rm NN}}$ = 5.02 TeV with ALICE",
  "authors": [
    "Abhi Modak"
  ],
  "submission_date": "2023-07-25T07:46:11+00:00",
  "revised_dates": [
    "2023-12-15T01:17:31+00:00"
  ],
  "abstract": "Global observables such as the pseudorapidity distributions of particle multiplicities in the final state are crucial to shed light into the physics processes involved in hadronic collisions. In proton$-$lead (p$-$Pb) collisions at Large Hadron Collider (LHC) energies, such measurements provide an important baseline to understand lead$-$lead (Pb$-$Pb) results by disentangling hot nuclear matter effects from the ones due to the cold nuclear matter. Multiplicity measurements can also put constraints on theoretical models describing the initial stages of the collision, e.g., to what degree the nucleon and the nuclei interact as dilute (partons) or dense (CGC-like) fields. The study of inclusive photon multiplicity aims to provide complementary measurements to those obtained with charged particles.\n  In these proceedings, the pseudorapidity distributions of inclusive photons at forward pseudorapidity ($2.3 < η_{\\rm lab} < 3.9$) in pp and p$-$Pb collisions at $\\sqrt{s_{\\rm NN}}$ = 5.02 TeV are presented. The data samples were collected using the Photon Multiplicity Detector (PMD) of ALICE. The multiplicity dependence of photon production in p$-$Pb collisions is presented and a comparison with charged-particle distributions measured at mid-pseudorapidity is shown. The results are also compared with predictions from Monte Carlo event generators.",
  "categories": [
    "nucl-ex"
  ],
  "primary_category": "nucl-ex",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13305",
  "pdf_url": null,
  "comment": "5 pages and 3 figures, submitted as conference proceeding to \"XXV DAE-BRNS High Energy Physics Symposium\"",
  "num_versions": null,
  "size_before_bytes": 256676,
  "size_after_bytes": 67472
}