{
  "title": "Polymorphic Reachability Types: Tracking Freshness, Aliasing, and Separation in Higher-Order Generic Programs",
  "authors": [
    "Guannan Wei",
    "Oliver Bračevac",
    "Songlin Jia",
    "Yuyan Bao",
    "Tiark Rompf"
  ],
  "submission_date": "2023-07-25T22:40:17+00:00",
  "revised_dates": [],
  "abstract": "Reachability types are a recent proposal that has shown promise in scaling to higher-order but monomorphic settings, tracking aliasing and separation on top of a substrate inspired by separation logic. The prior $λ^*$ reachability type system qualifies types with sets of reachable variables and guarantees separation if two terms have disjoint qualifiers. However, naive extensions with type polymorphism and/or precise reachability polymorphism are unsound, making $λ^*$ unsuitable for adoption in real languages. Combining reachability and type polymorphism that is precise, sound, and parametric remains an open challenge.\n  This paper presents a rethinking of the design of reachability tracking and proposes a solution to the key challenge of reachability polymorphism. Instead of always tracking the transitive closure of reachable variables as in the original design, we only track variables reachable in a single step and compute transitive closures only when necessary, thus preserving chains of reachability over known variables that can be refined using substitution. To enable this property, we introduce a new freshness qualifier, which indicates variables whose reachability sets may grow during evaluation steps. These ideas yield the simply-typed $λ^\\diamond$-calculus with precise lightweight, i.e., quantifier-free, reachability polymorphism, and the $\\mathsf{F}_{<:}^\\diamond$-calculus with bounded parametric polymorphism over types and reachability qualifiers. We prove type soundness and a preservation of separation property in Coq.",
  "categories": [
    "cs.PL"
  ],
  "primary_category": "cs.PL",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13844",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 531910,
  "size_after_bytes": 400799
}