{
  "title": "Graph Neural Networks-based Hybrid Framework For Predicting Particle Crushing Strength",
  "authors": [
    "Tongya Zheng",
    "Tianli Zhang",
    "Qingzheng Guan",
    "Wenjie Huang",
    "Zunlei Feng",
    "Mingli Song",
    "Chun Chen"
  ],
  "submission_date": "2023-07-26T02:18:04+00:00",
  "revised_dates": [],
  "abstract": "Graph Neural Networks have emerged as an effective machine learning tool for multi-disciplinary tasks such as pharmaceutical molecule classification and chemical reaction prediction, because they can model non-euclidean relationships between different entities. Particle crushing, as a significant field of civil engineering, describes the breakage of granular materials caused by the breakage of particle fragment bonds under the modeling of numerical simulations, which motivates us to characterize the mechanical behaviors of particle crushing through the connectivity of particle fragments with Graph Neural Networks (GNNs). However, there lacks an open-source large-scale particle crushing dataset for research due to the expensive costs of laboratory tests or numerical simulations. Therefore, we firstly generate a dataset with 45,000 numerical simulations and 900 particle types to facilitate the research progress of machine learning for particle crushing. Secondly, we devise a hybrid framework based on GNNs to predict particle crushing strength in a particle fragment view with the advances of state of the art GNNs. Finally, we compare our hybrid framework against traditional machine learning methods and the plain MLP to verify its effectiveness. The usefulness of different features is further discussed through the gradient attribution explanation w.r.t the predictions. Our data and code are released at https://github.com/doujiang-zheng/GNN-For-Particle-Crushing.",
  "categories": [
    "cs.LG",
    "cs.CE"
  ],
  "primary_category": "cs.LG",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13909",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 10566873,
  "size_after_bytes": 414572
}