{
  "title": "The Critical Coronal Transition Region: A Physics-framed Strategy to Uncover the Genesis of the Solar Wind and Solar Eruptions",
  "authors": [
    "Angelos Vourlidas",
    "Amir Caspi",
    "Yuan-Kuen Ko",
    "J. Martin Laming",
    "James P. Mason",
    "Mari Paz Miralles",
    "Nour-Eddine Raouafi",
    "John C. Raymond",
    "Daniel B. Seaton",
    "Leonard Strachan",
    "Nicholeen Viall",
    "Juliana Vievering",
    "Matthew J. West"
  ],
  "submission_date": "2023-07-25T15:55:37+00:00",
  "revised_dates": [],
  "abstract": "Our current theoretical and observational understanding suggests that critical properties of the solar wind and Coronal Mass Ejections (CMEs) are imparted within 10 Rs, particularly below 4 Rs. This seemingly narrow spatial region encompasses the transition of coronal plasma processes through the entire range of physical regimes from fluid to kinetic, and from primarily closed to open magnetic field structures. From a physics perspective, therefore, it is more appropriate to refer to this region as the Critical Coronal Transition Region (CCTR) to emphasize its physical, rather than spatial, importance to key Heliophysics science.\n  This white paper argues that the comprehensive exploration of the CCTR will answer two of the most central Heliophysics questions, \"How and where does the solar wind form?\" and \"How do eruptions form?\", by unifying hardware/software/modeling development and seemingly disparate research communities and frameworks. We describe the outlines of decadal-scale plan to achieve that by 2050.",
  "categories": [
    "astro-ph.IM",
    "astro-ph.HE",
    "astro-ph.SR",
    "physics.plasm-ph",
    "physics.space-ph"
  ],
  "primary_category": "astro-ph.IM",
  "doi": "10.3847/25c2cfeb.178340a9",
  "journal_ref": "Bulletin of the AAS, Vol. 55, Issue 3, Whitepaper #423 (6pp); 2023 July 31",
  "arxiv_id": "2307.13595",
  "pdf_url": null,
  "comment": "White paper submitted to the Decadal Survey for Solar and Space Physics (Heliophysics) 2024-2033; 6 pages, 1 figure, 2 tables",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}