{
  "title": "Final results of Borexino on CNO solar neutrinos",
  "authors": [
    "D. Basilico",
    "G. Bellini",
    "J. Benziger",
    "R. Biondi",
    "B. Caccianiga",
    "F. Calaprice",
    "A. Caminata",
    "A. Chepurnov",
    "D. D'Angelo",
    "A. Derbin",
    "A. Di Giacinto",
    "V. Di Marcello",
    "X. F. Ding",
    "A. Di Ludovico",
    "L. Di Noto",
    "I. Drachnev",
    "D. Franco",
    "C. Galbiati",
    "C. Ghiano",
    "M. Giammarchi",
    "A. Goretti",
    "M. Gromov",
    "D. Guffanti",
    "Aldo Ianni",
    "Andrea Ianni",
    "A. Jany",
    "V. Kobychev",
    "G. Korga",
    "S. Kumaran",
    "M. Laubenstein",
    "E. Litvinovich",
    "P. Lombardi",
    "I. Lomskaya",
    "L. Ludhova",
    "I. Machulin",
    "J. Martyn",
    "E. Meroni",
    "L. Miramonti",
    "M. Misiaszek",
    "V. Muratova",
    "R. Nugmanov",
    "L. Oberauer",
    "V. Orekhov",
    "F. Ortica",
    "M. Pallavicini",
    "L. Pelicci",
    "Ö. Penek",
    "L. Pietrofaccia",
    "N. Pilipenko",
    "A. Pocar",
    "G. Raikov",
    "M. T. Ranalli",
    "G. Ranucci",
    "A. Razeto",
    "A. Re",
    "N. Rossi",
    "S. Schönert",
    "D. Semenov",
    "G. Settanta",
    "M. Skorokhvatov",
    "A. Singhal",
    "O. Smirnov",
    "A. Sotnikov",
    "R. Tartaglia",
    "G. Testera",
    "E. Unzhakov",
    "F. L. Villante",
    "A. Vishneva",
    "R. B. Vogelaar",
    "F. von Feilitzsch",
    "M. Wojcik",
    "M. Wurm",
    "S. Zavatarelli",
    "K. Zuber",
    "G. Zuzel"
  ],
  "submission_date": "2023-07-27T05:56:32+00:00",
  "revised_dates": [],
  "abstract": "We report the first measurement of CNO solar neutrinos by Borexino that uses the Correlated Integrated Directionality (CID) method, exploiting the sub-dominant Cherenkov light in the liquid scintillator detector. The directional information of the solar origin of the neutrinos is preserved by the fast Cherenkov photons from the neutrino scattered electrons, and is used to discriminate between signal and background. The directional information is independent from the spectral information on which the previous CNO solar neutrino measurements by Borexino were based. While the CNO spectral analysis could only be applied on the Phase-III dataset, the directional analysis can use the complete Borexino data taking period from 2007 to 2021. The absence of CNO neutrinos has been rejected with >5σ credible level using the Bayesian statistics. The directional CNO measurement is obtained without an external constraint on the $^{210}$Bi contamination of the liquid scintillator, which was applied in the spectral analysis approach. The final and the most precise CNO measurement of Borexino is then obtained by combining the new CID-based CNO result with an improved spectral fit of the Phase-III dataset. Including the statistical and the systematic errors, the extracted CNO interaction rate is $R(\\mathrm{CNO})=6.7^{+1.2}_{-0.8} \\, \\mathrm{cpd/100 \\, tonnes}$. Taking into account the neutrino flavor conversion, the resulting CNO neutrino flux at Earth is $Φ_\\mathrm{CNO}=6.7 ^{+1.2}_{-0.8} \\times 10^8 \\, \\mathrm{cm^{-2} s^{-1}}$, in agreement with the high metallicity Standard Solar Models. The results described in this work reinforce the role of the event directional information in large-scale liquid scintillator detectors and open up new avenues for the next-generation liquid scintillator or hybrid neutrino experiments.",
  "categories": [
    "hep-ex",
    "physics.ins-det"
  ],
  "primary_category": "hep-ex",
  "doi": "10.1103/PhysRevD.108.102005",
  "journal_ref": null,
  "arxiv_id": "2307.14636",
  "pdf_url": "https://arxiv.org/pdf/2307.14636v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 843095,
  "size_after_bytes": 109855
}