{
  "title": "ResWCAE: Biometric Pattern Image Denoising Using Residual Wavelet-Conditioned Autoencoder",
  "authors": [
    "Youzhi Liang",
    "Wen Liang"
  ],
  "submission_date": "2023-07-23T08:02:27+00:00",
  "revised_dates": [
    "2025-09-16T00:42:59+00:00"
  ],
  "abstract": "The utilization of biometric authentication with pattern images is increasingly popular in compact Internet of Things (IoT) devices. However, the reliability of such systems can be compromised by image quality issues, particularly in the presence of high levels of noise. While state-of-the-art deep learning algorithms designed for generic image denoising have shown promise, their large number of parameters and lack of optimization for unique biometric pattern retrieval make them unsuitable for these devices and scenarios. In response to these challenges, this paper proposes a lightweight and robust deep learning architecture, the Residual Wavelet-Conditioned Convolutional Autoencoder (Res-WCAE) with a Kullback-Leibler divergence (KLD) regularization, designed specifically for fingerprint image denoising. Res-WCAE comprises two encoders - an image encoder and a wavelet encoder - and one decoder. Residual connections between the image encoder and decoder are leveraged to preserve fine-grained spatial features, where the bottleneck layer conditioned on the compressed representation of features obtained from the wavelet encoder using approximation and detail subimages in the wavelet-transform domain. The effectiveness of Res-WCAE is evaluated against several state-of-the-art denoising methods, and the experimental results demonstrate that Res-WCAE outperforms these methods, particularly for heavily degraded fingerprint images in the presence of high levels of noise. Overall, Res-WCAE shows promise as a solution to the challenges faced by biometric authentication systems in compact IoT devices.",
  "categories": [
    "eess.IV",
    "cs.CV",
    "cs.LG"
  ],
  "primary_category": "eess.IV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12255",
  "pdf_url": null,
  "comment": "8 pages, 2 figures",
  "num_versions": null,
  "size_before_bytes": 1786195,
  "size_after_bytes": 217631
}