{
  "title": "Diversity and Language Technology: How Techno-Linguistic Bias Can Cause Epistemic Injustice",
  "authors": [
    "Paula Helm",
    "Gábor Bella",
    "Gertraud Koch",
    "Fausto Giunchiglia"
  ],
  "submission_date": "2023-07-25T16:08:27+00:00",
  "revised_dates": [],
  "abstract": "It is well known that AI-based language technology -- large language models, machine translation systems, multilingual dictionaries, and corpora -- is currently limited to 2 to 3 percent of the world's most widely spoken and/or financially and politically best supported languages. In response, recent research efforts have sought to extend the reach of AI technology to ``underserved languages.'' In this paper, we show that many of these attempts produce flawed solutions that adhere to a hard-wired representational preference for certain languages, which we call techno-linguistic bias. Techno-linguistic bias is distinct from the well-established phenomenon of linguistic bias as it does not concern the languages represented but rather the design of the technologies. As we show through the paper, techno-linguistic bias can result in systems that can only express concepts that are part of the language and culture of dominant powers, unable to correctly represent concepts from other communities. We argue that at the root of this problem lies a systematic tendency of technology developer communities to apply a simplistic understanding of diversity which does not do justice to the more profound differences that languages, and ultimately the communities that speak them, embody. Drawing on the concept of epistemic injustice, we point to the broader sociopolitical consequences of the bias we identify and show how it can lead not only to a disregard for valuable aspects of diversity but also to an under-representation of the needs and diverse worldviews of marginalized language communities.",
  "categories": [
    "cs.CY",
    "cs.CL"
  ],
  "primary_category": "cs.CY",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13714",
  "pdf_url": null,
  "comment": "arXiv admin note: text overlap with arXiv:2307.13405",
  "num_versions": null,
  "size_before_bytes": 611234,
  "size_after_bytes": 371478
}