{
  "title": "Multi-representations Space Separation based Graph-level Anomaly-aware Detection",
  "authors": [
    "Fu Lin",
    "Haonan Gong",
    "Mingkang Li",
    "Zitong Wang",
    "Yue Zhang",
    "Xuexiong Luo"
  ],
  "submission_date": "2023-07-22T01:57:08+00:00",
  "revised_dates": [],
  "abstract": "Graph structure patterns are widely used to model different area data recently. How to detect anomalous graph information on these graph data has become a popular research problem. The objective of this research is centered on the particular issue that how to detect abnormal graphs within a graph set. The previous works have observed that abnormal graphs mainly show node-level and graph-level anomalies, but these methods equally treat two anomaly forms above in the evaluation of abnormal graphs, which is contrary to the fact that different types of abnormal graph data have different degrees in terms of node-level and graph-level anomalies. Furthermore, abnormal graphs that have subtle differences from normal graphs are easily escaped detection by the existing methods. Thus, we propose a multi-representations space separation based graph-level anomaly-aware detection framework in this paper. To consider the different importance of node-level and graph-level anomalies, we design an anomaly-aware module to learn the specific weight between them in the abnormal graph evaluation process. In addition, we learn strictly separate normal and abnormal graph representation spaces by four types of weighted graph representations against each other including anchor normal graphs, anchor abnormal graphs, training normal graphs, and training abnormal graphs. Based on the distance error between the graph representations of the test graph and both normal and abnormal graph representation spaces, we can accurately determine whether the test graph is anomalous. Our approach has been extensively evaluated against baseline methods using ten public graph datasets, and the results demonstrate its effectiveness.",
  "categories": [
    "cs.LG",
    "cs.AI"
  ],
  "primary_category": "cs.LG",
  "doi": "10.1145/3603719.3603739",
  "journal_ref": "35th International Conference on Scientific and Statistical Database Management (SSDBM 2023), July 10--12, 2023, Los Angeles, CA, USA",
  "arxiv_id": "2307.12994",
  "pdf_url": null,
  "comment": "11 pages, 12 figures",
  "num_versions": null,
  "size_before_bytes": 1728336,
  "size_after_bytes": 192149
}