{
  "title": "Quantum symmetrization transition in superconducting sulfur hydride from quantum Monte Carlo and path integral molecular dynamics",
  "authors": [
    "Romain Taureau",
    "Marco Cherubini",
    "Tommaso Morresi",
    "Michele Casula"
  ],
  "submission_date": "2023-07-28T17:18:53+00:00",
  "revised_dates": [
    "2023-12-23T20:43:02+00:00"
  ],
  "abstract": "We study the structural phase transition, originally associated with the highest superconducting critical temperature $T_c$ measured in high-pressure sulfur hydride. A quantitative description of its pressure dependence has been elusive for any \\emph{ab initio} theory attempted so far, raising questions on the actual mechanism leading to the maximum of $T_c$. Here, we estimate the critical pressure of the hydrogen bond symmetrization in the Im$\\bar{3}$m structure, by combining density functional theory and quantum Monte Carlo simulations for electrons with path integral molecular dynamics for quantum nuclei. We find that the $T_c$ maximum corresponds to pressures where local dipole moments dynamically form on the hydrogen sites, as precursors of the ferroelectric Im$\\bar{3}$m-R3m transition, happening at lower pressures. For comparison, we also apply the self-consistent harmonic approximation, whose ferroelectric critical pressure lies in between the ferroelectric transition estimated by path integral molecular dynamics and the local dipole formation. Nuclear quantum effects play a major role in a significant reduction ($\\approx$ 50 GPa) of the classical ferroelectric transition pressure at 200K and in a large isotope shift ($\\approx$ 25 GPa) upon hydrogen-to-deuterium substitution of the local dipole formation pressure, in agreement with the corresponding change in the $T_c$ maximum location.",
  "categories": [
    "cond-mat.str-el"
  ],
  "primary_category": "cond-mat.str-el",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15684",
  "pdf_url": "https://arxiv.org/pdf/2307.15684v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 45254087,
  "size_after_bytes": 746597
}