{
  "title": "Quantum Transitions, Detailed Balance, Black Holes and Nothingness",
  "authors": [
    "Sebastian Cespedes",
    "Senarath de Alwis",
    "Francesco Muia",
    "Fernando Quevedo"
  ],
  "submission_date": "2023-07-25T16:20:10+00:00",
  "revised_dates": [
    "2023-08-25T00:22:12+00:00"
  ],
  "abstract": "We consider vacuum transitions by bubble nucleation among 4D vacua with different values and signs of the cosmological constant $Λ$, including both up and down tunnelings. Following the Hamiltonian formalism, we explicitly compute the decay rates for all possible combinations of initial and final values of $Λ$ and find that up-tunneling is allowed starting not only from dS spacetime but also from AdS and Minkowski spacetimes. We trace the difference with the Euclidean approach, where these transitions are found to be forbidden, to the difference of treating the latter spacetimes as pure (vacuum) states rather than mixed states with correspondingly vanishing or infinite entropy. We point out that these transitions are best understood as limits of the corresponding transitions with black holes in the zero mass limit $M\\rightarrow 0$. We find that detailed balance is satisfied provided we use the Hartle-Hawking sign of the wave function for nucleating space-times. In the formal limit $Λ\\rightarrow -\\infty $, the transition rates for AdS to dS agree with both the Hartle-Hawking and Vilenkin amplitudes for the creation of dS from nothing. This is consistent with a proposal of Brown and Dahlen to define `nothing' as AdS in this limit. For $M\\neq 0$ detailed balance is satisfied only in a range of mass values. We compute the bubble trajectory after nucleation and find that, contrary to the $M=0$ case, the trajectory does not correspond to the open universe slicing of dS. We briefly discuss the relevance of our results to the string landscape.",
  "categories": [
    "hep-th",
    "gr-qc"
  ],
  "primary_category": "hep-th",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13614",
  "pdf_url": null,
  "comment": "29 pages + appendices, 8 figures. References added. Typos fixed",
  "num_versions": null,
  "size_before_bytes": 3183269,
  "size_after_bytes": 383608
}