{
  "title": "Differential approximation of the Gaussian by short cosine sums with exponential error decay",
  "authors": [
    "Nadiia Derevianko",
    "Gerlind Plonka"
  ],
  "submission_date": "2023-07-25T15:43:55+00:00",
  "revised_dates": [
    "2025-05-23T00:44:11+00:00"
  ],
  "abstract": "In this paper, we propose a method to approximate the Gaussian function on ${\\mathbb R}$ by a short cosine sum. We generalise and extend the differential approximation method proposed in [4, 40] to approximate $\\mathrm{e}^{-t^{2}/2σ}$ in the weighted space $L^{2}({\\mathbb R}, \\mathrm{e}^{-t^{2}/2ρ})$ where $σ, \\, ρ>0$. We prove that the optimal frequency parameters $λ_1, \\ldots , λ_{N}$ for this method in the approximation problem $ \\min\\limits_{λ_{1},\\ldots, λ_{N}, γ_{1}, \\ldots, γ_{N}}\\|\\mathrm{e}^{-\\cdot^{2}/2σ} - \\sum_{j=1}^{N} γ_{j} \\, {\\mathrm e}^{λ_{j} \\cdot}\\|_{L^{2}({\\mathbb R}, \\mathrm{e}^{-t^{2}/2ρ})}$, are zeros of a scaled Hermite polynomial. This observation leads us to a numerically stable approximation method with low computational cost of ${\\mathcal O}(N^{3})$ operations. We derive a direct algorithm to solve this approximation problem based on a matrix pencil method for a special structured matrix. The entries of this matrix are determined by hypergeometric functions. For the weighted $L^{2}$-norm, we prove that the approximation error decays exponentially with respect to the length $N$ of the sum. An exponentially decaying error in the (unweighted) $L^{2}$-norm is achieved using a truncated cosine sum. Our new convergence result for approximation of Gaussian functions by exponential sums of length $N$ shows that exponential error decay rates $e^{-cN}$ are not only achievable for complete monotone functions.",
  "categories": [
    "math.NA"
  ],
  "primary_category": "math.NA",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13587",
  "pdf_url": null,
  "comment": "26 pages, 4 figures",
  "num_versions": null,
  "size_before_bytes": 3324818,
  "size_after_bytes": 250730
}