{
  "title": "Fortaleza: The emergence of a network hub",
  "authors": [
    "Eric Bragion",
    "Habiba Akter",
    "Mohit Kumar",
    "Minxian Xu",
    "Ahmed M. Abdelmoniem",
    "Sukhpal Singh Gill"
  ],
  "submission_date": "2023-06-28T14:55:38+00:00",
  "revised_dates": [],
  "abstract": "Digitalisation, accelerated by the pandemic, has brought the opportunity for companies to expand their businesses beyond their geographic location and has considerably affected networks around the world. Cloud services have a better acceptance nowadays, and it is foreseen that this industry will grow exponentially in the following years. With more distributed networks that need to support customers in different locations, the model of one-single server in big financial centres has become outdated and companies tend to look for alternatives that will meet their needs, and this seems to be the case with Fortaleza, in Brazil. With several submarine cables connections available, the city has stood out as a possible hub to different regions, and this is what this paper explores. Making use of real traffic data through looking glasses, we established a latency classification that ranges from exceptionally low to high and analysed 800 latencies from Roubaix, Fortaleza and Sao Paulo to Miami, Mexico City, Frankfurt, Paris, Milan, Prague, Sao Paulo, Santiago, Buenos Aires and Luanda. We found that non-developed countries have a big dependence on the United States to route Internet traffic. Despite this, Fortaleza proves to be an alternative for serving different regions with relatively low latencies.",
  "categories": [
    "physics.soc-ph",
    "cs.DC"
  ],
  "primary_category": "physics.soc-ph",
  "doi": "10.1016/j.iotcps.2023.05.001",
  "journal_ref": "Published in Internet of Things and Cyber-Physical Systems, Volume 3, 2023, Pages 272-279",
  "arxiv_id": "2307.13602",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}