{
  "title": "Symbol-Level Precoding for MU-MIMO System with RIRC Receiver",
  "authors": [
    "Xiao Tong",
    "Ang Li",
    "Lei Lei",
    "Fan Liu",
    "Fuwang Dong"
  ],
  "submission_date": "2023-07-27T12:01:04+00:00",
  "revised_dates": [],
  "abstract": "Consider a multiuser multiple-input multiple-output (MU-MIMO) downlink system in which the base station (BS) sends multiple data streams to multi-antenna users via symbol-level precoding (SLP), where the optimization of receive combining matrix becomes crucial, unlike in the single-antenna user scenario. We begin by introducing a joint optimization problem on the symbol-level transmit precoder and receive combiner. The problem is solved using the alternating optimization (AO) method, and the optimal solution structures for transmit precoding and receive combining matrices are derived by using Lagrangian and Karush-Kuhn-Tucker (KKT) conditions, based on which, the original problem is transformed into an equivalent quadratic programming problem, enabling more efficient solutions. To address the challenge that the above joint design is difficult to implement, we propose a more practical scheme where the receive combining optimization is replaced by the interference rejection combiner (IRC), which is however difficult to directly use because of the rank-one transmit precoding matrix. Therefore, we introduce a new regularized IRC (RIRC) receiver to circumvent the above issue. Numerical results demonstrate that the practical SLP-RIRC method enjoys only a slight communication performance loss compared to the joint transmit precoding and receive combining design, both offering substantial performance gains over the conventional BD-based approaches.",
  "categories": [
    "eess.SP"
  ],
  "primary_category": "eess.SP",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14797",
  "pdf_url": "https://arxiv.org/pdf/2307.14797v1",
  "comment": "13 pages, 10 figures",
  "num_versions": null,
  "size_before_bytes": 2417017,
  "size_after_bytes": 1604577
}