{
  "title": "Mining Reddit Data to Elicit Students' Requirements During COVID-19 Pandemic",
  "authors": [
    "Shadikur Rahman",
    "Faiz Ahmed",
    "Maleknaz Nayebi"
  ],
  "submission_date": "2023-07-26T14:26:16+00:00",
  "revised_dates": [],
  "abstract": "Data-driven requirements engineering leverages the abundance of openly accessible and crowdsourced information on the web. By incorporating user feedback provided about a software product, such as reviews in mobile app stores, these approaches facilitate the identification of issues, bug fixes, and implementation of change requests. However, relying solely on user feedback about a software product limits the possibility of eliciting all requirements, as users may not always have a clear understanding of their exact needs from the software, despite their wealth of experience with the problem, event, or challenges they encounter and use the software to assist them. In this study, we propose a shift in requirements elicitation, focusing on gathering feedback related to the problem itself rather than relying solely on feedback about the software product. We conducted a case study on student requirements during the COVID-19 pandemic in a higher education institution. We gathered their communications from Reddit during the pandemic and employed multiple machine-learning and natural language processing techniques to identify requirement sentences. We achieved the F-score of 0.79 using Naive Bayes with TF-IDF when benchmarking multiple techniques. The results lead us to believe that mining requirements from communication about a problem are feasible. While we present the preliminary results, we envision a future where these requirements complement conventionally elicited requirements and help to close the requirements gap.",
  "categories": [
    "cs.SE"
  ],
  "primary_category": "cs.SE",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14212",
  "pdf_url": null,
  "comment": "Preprint",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}