{
  "title": "Eliminating Media Noise While Preserving Storage Capacity: Reconfigurable Constrained Codes for Two-Dimensional Magnetic Recording",
  "authors": [
    "Iven Guzel",
    "Doğukan Özbayrak",
    "Robert Calderbank",
    "Ahmed Hareedy"
  ],
  "submission_date": "2023-07-24T12:02:53+00:00",
  "revised_dates": [
    "2024-03-19T01:03:53+00:00"
  ],
  "abstract": "Magnetic recording devices are still competitive in the storage density race thanks to new technologies such as two-dimensional magnetic recording (TDMR). Error-prone patterns where a bit is surrounded by complementary bits at the four positions with Manhattan distance $1$ on the TDMR grid are called plus isolation (PIS) patterns. Recently, we introduced optimal plus LOCO (OP-LOCO) codes that prevent these patterns from being written. However, as the device ages, error-prone patterns where a bit is surrounded by complementary bits at only three positions with Manhattan distance $1$ emerge, and we call these incomplete PIS (IPIS) patterns. In this paper, we present capacity-achieving codes that forbid both PIS and IPIS patterns in TDMR systems with wide read heads. We collectively call these patterns rotated T isolation (RTIS) patterns, and we call the new codes optimal T LOCO (OT-LOCO) codes. We analyze OT-LOCO codes and derive their encoding-decoding rule. Simulation results demonstrate that OT-LOCO codes entirely eliminate media noise at practical TD densities. We suggest using OP-LOCO codes early in the device lifetime, then reconfiguring to OT-LOCO codes later on. Moreover, we introduce another coding scheme to remove RTIS patterns which offers lower complexity, lower error propagation, and track separation.",
  "categories": [
    "cs.IT",
    "eess.SP"
  ],
  "primary_category": "cs.IT",
  "doi": "10.1109/TIT.2024.3375979",
  "journal_ref": null,
  "arxiv_id": "2307.12720",
  "pdf_url": null,
  "comment": "27 pages (single column), 12 figures, submitted to the IEEE Transactions on Information Theory (TIT)",
  "num_versions": null,
  "size_before_bytes": 2354126,
  "size_after_bytes": 264663
}