{
  "title": "Constraining the FRB mechanism from scintillation in the host galaxy",
  "authors": [
    "Pawan Kumar",
    "Paz Beniamini",
    "Om Gupta",
    "James M. Cordes"
  ],
  "submission_date": "2023-07-28T04:17:56+00:00",
  "revised_dates": [
    "2023-09-29T20:27:32+00:00"
  ],
  "abstract": "Most FRB models can be divided into two groups based on the distance of the radio emission region from the central engine. The first group of models, the so-called `nearby' or magnetospheric models, invoke FRB emission at distances of 10$^9$ cm or less from the central engine, while the second `far-away' models involve emission from distances of 10$^{11}$ cm or greater. The lateral size for the emission region for the former class of models ($\\lesssim$ 10$^7$ cm) is much smaller than the second class of models ($\\gtrsim 10^9$ cm). We propose that an interstellar scattering screen in the host galaxy is well-suited to differentiate between the two classes of models, particularly based on the level of modulations in the observed intensity with frequency, in the regime of strong diffractive scintillation. This is because the diffractive length scale for the host galaxy's ISM scattering screen is expected to lie between the transverse emission-region sizes for the `nearby' and the `far-away' class of models. Determining the strength of flux modulation caused by scintillation (scintillation modulation index) across the scintillation bandwidth ($\\sim 1/2πδt_s$) would provide a strong constraint on the FRB radiation mechanism when the scatter broadening ($δt_s$) is shown to be from the FRB host galaxy. The scaling of the scintillation bandwidth as $\\sim ν^{4.4}$ may make it easier to determine the modulation index at $\\gtrsim$ 1 GHz.",
  "categories": [
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.HE",
  "doi": "10.1093/mnras/stad3010",
  "journal_ref": null,
  "arxiv_id": "2307.15294",
  "pdf_url": "https://arxiv.org/pdf/2307.15294v2",
  "comment": "Paper accepted for publication in MNRAS",
  "num_versions": null,
  "size_before_bytes": 6363422,
  "size_after_bytes": 891411
}