{
  "title": "Tuning Pythia8 for future $e^+e^-$ colliders",
  "authors": [
    "Zhijie Zhao",
    "Mikael Berggren",
    "Jenny List"
  ],
  "submission_date": "2023-07-28T13:01:20+00:00",
  "revised_dates": [
    "2023-08-18T09:13:43+00:00",
    "2023-08-31T09:13:23+00:00"
  ],
  "abstract": "The majority of Monte-Carlo (MC) simulation campaigns for future $e^+e^-$ colliders has so far been based on the leading-order (LO) matrix elements provided by Whizard 1.95, followed by parton shower and hadronization in Pythia6, using the tune of the OPAL experiment at LEP. In this contribution, we test and develop the interface between Whizard3 and Pythia8. As a first step, we simulate the $e^+e^-\\to q\\bar{q}$ process with LO matrix elements, and compare three tunes in Pythia8: the standard Pythia8 tune, the OPAL tune and the ALEPH tune. At stable-hadron level, predictions of charged and neutral hadron multiplicities of these tunes are compared to LEP data, since they are strongly relevant to the performance of particle flow algorithms.\n  The events are used to perform a full detector simulation and reconstruction of the International Large Detector concept (ILD) as an example for a particle-flow-optimised detector. At reconstruction level, a comparison of the jet energy resolution in these tunes is presented. We found good agreement with previous results that were simulated by Whizard1+Pythia6. In addition, the preliminary next-to-leading order (NLO) results are also presented. This modern MC simulation chain, with matched NLO matrix elements in the future, should be introduced to ILC or other future $e^+e^-$ colliders.",
  "categories": [
    "hep-ph"
  ],
  "primary_category": "hep-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15537",
  "pdf_url": "https://arxiv.org/pdf/2307.15537v3",
  "comment": "8 pages, 7 figures, 1 table. Talk presented at the International Workshop on Future Linear Colliders (LCWS 2023), 15-19 May 2023. C23-05-15.3",
  "num_versions": null,
  "size_before_bytes": 8208158,
  "size_after_bytes": 410741
}