{
  "title": "Vulnerability Detection Approaches on Application Behaviors in Mobile Environment",
  "authors": [
    "Abdellah Ouaguid",
    "Mohamed Ouzzif",
    "Noreddine Abghour"
  ],
  "submission_date": "2023-07-29T19:59:14+00:00",
  "revised_dates": [],
  "abstract": "Several solutions ensuring the dynamic detection of malicious activities on Android ecosystem have been proposed. These are represented by generic rules and models that identify any purported malicious behavior. However, the approaches adopted are far from being effective in detecting malware (listed or not) and whose form and behavior are likely to be different depending on the execution environment or the design of the malware itself (polymorphic for example). An additional difficulty is added when these approaches are unable to capture, analyze, and classify all the execution paths incorporated in the analyzed application earlier. This suggests that the functionality of the analyzed application can constitute a potential risk but never explored or revealed. We have studied some malware detection techniques based on behavioral analysis of applications. The description, characteristics, and results obtained from each technique are presented in this article wherein we have also highlighted some open problems, challenges as well as the different possible future directions of research concerning behavioral analysis of malware.",
  "categories": [
    "cs.CR",
    "cs.ET"
  ],
  "primary_category": "cs.CR",
  "doi": null,
  "journal_ref": "Education Excellence and Innovation Management: A 2025 Vision to Sustain Economic Development during Global Challenges, pp.16830-16839, ISBN 978-0-9998551-4-0",
  "arxiv_id": "2307.16064",
  "pdf_url": "https://arxiv.org/pdf/2307.16064v1",
  "comment": "10 pages, 2 figures, 1 table, Accepted Paper at the 35th International Business Information Management Association Conference, which is held in Seville, Spain on 1-2 April 2020",
  "num_versions": null,
  "size_before_bytes": 246928,
  "size_after_bytes": 153402
}