{
  "title": "Charge transfer-induced Lifshitz transition and magnetic symmetry breaking in ultrathin CrSBr crystals",
  "authors": [
    "Marco Bianchi",
    "Kimberly Hsieh",
    "Esben Juel Porat",
    "Florian Dirnberger",
    "Julian Klein",
    "Kseniia Mosina",
    "Zdenek Sofer",
    "Alexander N. Rudenko",
    "Mikhail I. Katsnelson",
    "Yong P. Chen",
    "Malte Rösner",
    "Philip Hofmann"
  ],
  "submission_date": "2023-07-24T10:29:42+00:00",
  "revised_dates": [],
  "abstract": "Ultrathin CrSBr flakes are exfoliated \\emph{in situ} on Au(111) and Ag(111) and their electronic structure is studied by angle-resolved photoemission spectroscopy. The thin flakes' electronic properties are drastically different from those of the bulk material and also substrate-dependent. For both substrates, a strong charge transfer to the flakes is observed, partly populating the conduction band and giving rise to a highly anisotropic Fermi contour with an Ohmic contact to the substrate. The fundamental CrSBr band gap is strongly renormalized compared to the bulk. The charge transfer to the CrSBr flake is substantially larger for Ag(111) than for Au(111), but a rigid energy shift of the chemical potential is insufficient to describe the observed band structure modifications. In particular, the Fermi contour shows a Lifshitz transition, the fundamental band gap undergoes a transition from direct on Au(111) to indirect on Ag(111) and a doping-induced symmetry breaking between the intra-layer Cr magnetic moments further modifies the band structure. Electronic structure calculations can account for non-rigid Lifshitz-type band structure changes in thin CrSBr as a function of doping and strain. In contrast to undoped bulk band structure calculations that require self-consistent $GW$ theory, the doped thin film properties are well-approximated by density functional theory if local Coulomb interactions are taken into account on the mean-field level and the charge transfer is considered.",
  "categories": [
    "cond-mat.str-el",
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.str-el",
  "doi": "10.1103/PhysRevB.108.195410",
  "journal_ref": "Physical Review B 108, 195410 (2023)",
  "arxiv_id": "2307.12675",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 14198118,
  "size_after_bytes": 59552
}