{
  "title": "Searching for the Role of Mergers in Fast and Early SMBH Growth: Morphological Decomposition of Quasars and Their Hosts at $z \\sim 4.8$",
  "authors": [
    "Marcus O. Thomas",
    "Ohad Shemmer",
    "Benny Trakhtenbrot",
    "Paulina Lira",
    "Hagai Netzer",
    "Brooke D. Simmons",
    "Neta Ilan"
  ],
  "submission_date": "2023-07-28T00:43:24+00:00",
  "revised_dates": [],
  "abstract": "We present rest-frame ultraviolet (UV) images of six luminous quasars at $z \\sim 4.8$ obtained with the Hubble Space Telescope (HST). These quasars exhibit a wide range of star formation rates (SFRs) and lie in a wide range of environments. We carefully model and subtract the point-like quasar emission and investigate the morphology of the underlying host galaxies at kpc scales. The residual images allowed identification of potential companion sources, which enabled us to explore the role of galaxy merger scenarios in the co-evolution of the quasars and their hosts. We also search for the mechanism driving extreme SFRs in three of the quasars. We find that the rate of detection of potential companions to the host galaxies does not follow trends between high- and low-SFR sources; i.e., the HST imaging suggests that both high- and low-SFR sources are found in both dense and sparse galactic environments. The suggested role of major mergers driving extreme SFRs cannot be supported by the multiwavelength data in hand. Three of four companion sources, previously revealed by sub-millimeter observations, are not detected in the HST images of three of our quasars. An adapted high-resolution imaging strategy focused on high-SFR sources and extended to a larger quasar sample is required to determine the role of mergers in the processes of star formation and supermassive black hole growth at high redshift.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15241",
  "pdf_url": "https://arxiv.org/pdf/2307.15241v1",
  "comment": "22 pages, 10 figures; accepted for publication in ApJ",
  "num_versions": null,
  "size_before_bytes": 5203960,
  "size_after_bytes": 477661
}