{
  "title": "Microstrata",
  "authors": [
    "Bogdan Ganchev",
    "Stefano Giusto",
    "Anthony Houppe",
    "Rodolfo Russo",
    "Nicholas P. Warner"
  ],
  "submission_date": "2023-07-24T18:00:00+00:00",
  "revised_dates": [
    "2023-09-04T00:25:51+00:00",
    "2023-10-11T00:21:43+00:00"
  ],
  "abstract": "Microstrata are the non-extremal analogues of superstrata: they are smooth, non-extremal (non-BPS) solitonic solutions to IIB supergravity whose deep-throat limits approximate black holes. Using perturbation theory and numerical methods, we construct families of solutions using a consistent truncation to three-dimensional supergravity. The most general families presented here involve two continuous parameters, or amplitudes, and four quantized parameters that set the angular momenta and energy levels. Our solutions are asymptotic to the vacuum of the D1-D5 system: AdS$_3 \\times S^3 \\times T^4$. Using holography, we show that the they are dual to multi-particle states in the D1-D5 CFT involving a large number of mutually non-BPS supergravitons and we determine the anomalous dimensions of these states from the binding energies in supergravity. These binding energies are uniformly negative and depend non-linearly on the amplitudes of the states. In one family of solutions, smoothness restricts some of the fields to lie on a special locus of the parameter space. Using precision holography we show that this special locus can be identified with the multi-particle states constructed via the standard OPE of the single-particle constituents. Our numerical analysis shows that microstrata are robust at large amplitudes and the solutions can be obtained to very high precision.",
  "categories": [
    "hep-th"
  ],
  "primary_category": "hep-th",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13021",
  "pdf_url": null,
  "comment": "83 pages, 14 figures; reworked figure 3, added precisions in the introduction and in section 4, fixed typos",
  "num_versions": null,
  "size_before_bytes": 7415761,
  "size_after_bytes": 1477080
}