{
  "title": "Deep Unrolling Networks with Recurrent Momentum Acceleration for Nonlinear Inverse Problems",
  "authors": [
    "Qingping Zhou",
    "Jiayu Qian",
    "Junqi Tang",
    "Jinglai Li"
  ],
  "submission_date": "2023-07-30T03:59:47+00:00",
  "revised_dates": [
    "2023-08-16T13:58:20+00:00",
    "2024-02-07T13:19:29+00:00",
    "2024-03-31T08:40:15+00:00"
  ],
  "abstract": "Combining the strengths of model-based iterative algorithms and data-driven deep learning solutions, deep unrolling networks (DuNets) have become a popular tool to solve inverse imaging problems. While DuNets have been successfully applied to many linear inverse problems, nonlinear problems tend to impair the performance of the method. Inspired by momentum acceleration techniques that are often used in optimization algorithms, we propose a recurrent momentum acceleration (RMA) framework that uses a long short-term memory recurrent neural network (LSTM-RNN) to simulate the momentum acceleration process. The RMA module leverages the ability of the LSTM-RNN to learn and retain knowledge from the previous gradients. We apply RMA to two popular DuNets -- the learned proximal gradient descent (LPGD) and the learned primal-dual (LPD) methods, resulting in LPGD-RMA and LPD-RMA respectively. We provide experimental results on two nonlinear inverse problems: a nonlinear deconvolution problem, and an electrical impedance tomography problem with limited boundary measurements. In the first experiment we have observed that the improvement due to RMA largely increases with respect to the nonlinearity of the problem. The results of the second example further demonstrate that the RMA schemes can significantly improve the performance of DuNets in strongly ill-posed problems.",
  "categories": [
    "cs.LG"
  ],
  "primary_category": "cs.LG",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16120",
  "pdf_url": "https://arxiv.org/pdf/2307.16120v4",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 30547724,
  "size_after_bytes": 3438423
}