{
  "title": "A JWST/MIRI and NIRCam Analysis of the Young Stellar Object Population in the Spitzer I region of NGC 6822",
  "authors": [
    "Laura Lenkić",
    "Conor Nally",
    "Olivia C. Jones",
    "Martha L. Boyer",
    "Patrick J. Kavanagh",
    "Nolan Habel",
    "Omnayarani Nayak",
    "Alec S. Hirschauer",
    "Margaret Meixner",
    "B. A. Sargent",
    "Tea Temim"
  ],
  "submission_date": "2023-07-28T17:51:43+00:00",
  "revised_dates": [
    "2024-06-13T19:14:27+00:00"
  ],
  "abstract": "We present an imaging survey of the Spitzer I star-forming region in NGC 6822 conducted with the NIRCam and MIRI instruments onboard JWST. Located at a distance of 490 kpc, NGC 6822 is the nearest non-interacting low-metallicity ($\\sim$0.2 $Z_{\\odot}$) dwarf galaxy. It hosts some of the brightest known HII regions in the local universe, including recently discovered sites of highly-embedded active star formation. Of these, Spitzer I is the youngest and most active, and houses 90 color-selected candidate young stellar objects (YSOs) identified from Spitzer Space Telescope observations. We revisit the YSO population of Spitzer I with these new JWST observations. By analyzing color-magnitude diagrams (CMDs) constructed with NIRCam and MIRI data, we establish color selection criteria and construct spectral energy distributions (SEDs) to identify candidate YSOs and characterize the full population of young stars, from the most embedded phase to the more evolved stages. In this way, we have identified 140 YSOs in Spitzer I. Comparing to previous Spitzer studies of the NGC 6822 YSO population, we find that the YSOs we identify are fainter and less massive, indicating that the improved resolution of JWST allows us to resolve previously blended sources into multiple objects.",
  "categories": [
    "astro-ph.SR",
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.SR",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15704",
  "pdf_url": "https://arxiv.org/pdf/2307.15704v2",
  "comment": "17 pages, 9 figures, 2 tables, ApJ accepted",
  "num_versions": null,
  "size_before_bytes": 28047446,
  "size_after_bytes": 1064146
}