{
  "title": "Kaon Theory: 50 Years Later",
  "authors": [
    "Andrzej J. Buras"
  ],
  "submission_date": "2023-07-28T18:00:02+00:00",
  "revised_dates": [
    "2023-09-16T08:32:36+00:00"
  ],
  "abstract": "We summarize the status of the Kaon Theory 50 years after the seminal paper of Kobayashi and Maskawa who pointed out that six quarks are necessary to have CP violation in the Standard Model (SM) and presented a parametrization of a $3\\times 3$ unitary matrix that after the discovery of the charm quark in 1974 and the $b$ quark in 1977 dominated the field of flavour changing processes. One of the main goals of flavour physics since then was the determination of the four parameters of this matrix, which we will choose here to be $|V_{us}|$, $|V_{cb}|$ and the two angles of the unitarity triangle, $β$ and $γ$ with $|V_{us}|$ introduced by Cabibbo in 1963. I will summarize recent strategy for determination of these parameters without new physics (NP) infection. It is based on the conjecture of the absence of relevant NP contributions to $ΔF=2$ processes that indeed can be demonstrated by a negative rapid test: the $|V_{cb}|-γ$ plot. This in turn allows to obtain SM predictions for rare $K$ and $B$ decays that are most precise to date. We present strategies for the explanation of the anticipated anomaly in the ratio $\\varepsilon'/\\varepsilon$ and the observed anomalies in $b\\to sμ^+μ^-$ transitions that are consistent with our $ΔF=2$ conjecture. In particular, the absence of NP in the parameter $\\varepsilon_K$, still allows for significant NP effects in $\\varepsilon'/\\varepsilon$ and in rare Kaon decays, moreover in a correlated manner. Similar the absence of NP in $ΔM_s$ combined with anomalies in $b\\to sμ^+μ^-$ transitions hints for the presence of right-handed quark currents. We also discuss how the nature of neutrinos, Dirac vs. Majorana one, can be probed in $K\\toπν\\barν$ and $B\\to K(K^*)ν\\barν$ decays. The present status of the $ΔI=1/2$ rule and of $\\varepsilon'/\\varepsilon$ is summarized.",
  "categories": [
    "hep-ph",
    "hep-ex",
    "hep-lat"
  ],
  "primary_category": "hep-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15737",
  "pdf_url": "https://arxiv.org/pdf/2307.15737v2",
  "comment": "52 pages, 8 Figures, Talk given at the KM50 Symposium, KEK, Tsukuba, February 11th, 2023. Several misprints removed, references added. Text below equation (38) modified in view of recent Belle II data",
  "num_versions": null,
  "size_before_bytes": 9614022,
  "size_after_bytes": 418350
}