{
  "title": "Quantum geometry quadrupole-induced third-order nonlinear transport in antiferromagnetic topological insulator MnBi2Te4",
  "authors": [
    "Hui Li",
    "Chengping Zhang",
    "Chengjie Zhou",
    "Chen Ma",
    "Xiao Lei",
    "Zijing Jin",
    "Hongtao He",
    "Baikui Li",
    "Kam Tuen Law",
    "Jiannong Wang"
  ],
  "submission_date": "2023-07-23T12:54:16+00:00",
  "revised_dates": [],
  "abstract": "The study of quantum geometry effects in materials has been one of the most important research directions in recent decades. The quantum geometry of a material is characterized by the quantum geometry tensor of the Bloch states. The imaginary part of the quantum geometry tensor gives rise to the Berry curvature while the real part gives rise to the quantum metric. While Berry curvature has been well studied in the past decades, the experimental investigation on the quantum metric effects is only at its infancy stage. In this work, we measure the nonlinear transport of bulk MnBi${_2}$Te${_4}$, which is a topological anti-ferromagnet. We found that the second order nonlinear responses are negligible as required by inversion symmetry, the third-order nonlinear responses are finite. The measured third-harmonic longitudinal ($V_{xx}^{3ω}$) and transverse ($V_{xy}^{3ω}$) voltages with frequency 3w, driven by an a.c. current with frequency w, show an intimate connection with magnetic transitions of MnBi${_2}$Te${_4}$ flakes. Their magnitudes change abruptly as MnBi${_2}$Te${_4}$ flakes go through magnetic transitions from an AFM state to a canted AFM state and to a FM state. In addition, the measured $V_{xx}^{3ω}$ is an even function of the applied magnetic field B while $V_{xy}^{3ω}$ is odd in B. Amazingly, the field dependence of the third-order responses as a function of the magnetic field suggests that $V_{xx}^{3ω}$ is induced by quantum metric quadrupole and $V_{xy}^{3ω}$ is induced by Berry curvature quadrupole. Therefore, the quadrupoles of both the real and the imaginary part of the quantum geometry tensor of bulk MnBi${_2}$Te${_4}$ are revealed through the third order nonlinear transport measurements. This work greatly advanced our understanding on the connections between the higher order moments of quantum geometry and nonlinear transport.",
  "categories": [
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": "10.1038/s41467-024-52206-8",
  "journal_ref": "Nat Commun 15, 7779 (2024)",
  "arxiv_id": "2307.12313",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}