{
  "title": "A Spectral Approach for the Dynamic Bradley-Terry Model",
  "authors": [
    "Xin-Yu Tian",
    "Jian Shi",
    "Xiaotong Shen",
    "Kai Song"
  ],
  "submission_date": "2023-07-31T13:25:18+00:00",
  "revised_dates": [
    "2023-08-05T00:51:00+00:00"
  ],
  "abstract": "The dynamic ranking, due to its increasing importance in many applications, is becoming crucial, especially with the collection of voluminous time-dependent data. One such application is sports statistics, where dynamic ranking aids in forecasting the performance of competitive teams, drawing on historical and current data. Despite its usefulness, predicting and inferring rankings pose challenges in environments necessitating time-dependent modeling. This paper introduces a spectral ranker called Kernel Rank Centrality, designed to rank items based on pairwise comparisons over time. The ranker operates via kernel smoothing in the Bradley-Terry model, utilizing a Markov chain model. Unlike the maximum likelihood approach, the spectral ranker is nonparametric, demands fewer model assumptions and computations, and allows for real-time ranking. We establish the asymptotic distribution of the ranker by applying an innovative group inverse technique, resulting in a uniform and precise entrywise expansion. This result allows us to devise a new inferential method for predictive inference, previously unavailable in existing approaches. Our numerical examples showcase the ranker's utility in predictive accuracy and constructing an uncertainty measure for prediction, leveraging data from the National Basketball Association (NBA). The results underscore our method's potential compared to the gold standard in sports, the Arpad Elo rating system.",
  "categories": [
    "stat.ME"
  ],
  "primary_category": "stat.ME",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16642",
  "pdf_url": "https://arxiv.org/pdf/2307.16642v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 12298934,
  "size_after_bytes": 794446
}