{
  "title": "Evidence of Charge-Phonon coupling in Van der Waals materials Ni1-xZnxPS3",
  "authors": [
    "Nashra Pistawala",
    "Ankit Kumar",
    "Devesh Negi",
    "Dibyata Rout",
    "Luminita Harnagea",
    "Surajit Saha",
    "Surjeet Singh"
  ],
  "submission_date": "2023-07-24T12:24:21+00:00",
  "revised_dates": [],
  "abstract": "NiPS3 is a Van der Waals antiferromagnet that has been found to display spin-charge and spin-phonon coupling in its antiferromagnetically ordered state below TN = 155 K. Here, we study high-quality crystals of site-diluted Ni1-xZnxPS3 (0 < x < 0.2) using temperature-dependent specific heat and Raman spectroscopy probes. The site dilution suppresses the antiferromagnetic ordering in accordance with the mean-field prediction. In NiPS3, we show that the phonon mode P2 (176 cm-1) associated with Ni vibrations show a distinct asymmetry due to the Fano resonance, which persists only in the paramagnetic phase, disappearing below T_N = 155 K. This was further supported by temperature-dependent Raman data on an 8% Zn-doped crystal (T_N = 135 K) where Fano resonance similarly van in the magnetically ordered phase. This is contrary to the behaviour of the Raman mode P9 (570 cm-1), which shows a Fano resonance at low temperatures below T_N due to its coupling with the two-magnon continuum. We show that the Fano resonance of P2 arises from its coupling with an electronic continuum that weakens considerably upon cooling to low temperatures. In the doped crystals, the Fano coupling is found to enhance with Zn-doping. These observations suggest the presence of strong electron-phonon coupling in the paramagnetic phase of NiPS3 due to charge density fluctuations associated with the negative charge transfer state of Ni.",
  "categories": [
    "cond-mat.str-el"
  ],
  "primary_category": "cond-mat.str-el",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12733",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}