{
  "title": "Quantum dynamics of molecular ensembles coupled with quantum light: Counter-rotating interactions as an essential component",
  "authors": [
    "Yi-Ting Chuang",
    "Liang-Yan Hsu"
  ],
  "submission_date": "2023-07-27T06:38:44+00:00",
  "revised_dates": [],
  "abstract": "The rotating-wave approximation to light-matter interactions is widely used in the quantum electrodynamics Hamiltonian; however, its validity has long been a matter of debate. In this article, we explore the impact of the rotating-wave approximation on the quantum dynamics of multiple molecules in complex dielectric environments within the framework of macroscopic quantum electrodynamics. In general, we find that the energy shifts of the molecules and the inter-molecule dipole-dipole interaction obtained in the weak coupling regime are correct only when the counter-rotating interactions are considered. Moreover, under the rotating-wave approximation, the energy shifts of the ground-state molecules and a portion of the inter-molecule interaction are discarded. Notably, in the near-field zone (short inter-molecular distance), the reduction of inter-molecule interaction can reach up to 50 percent. We also conduct a case study on the population dynamics of a pair of identical molecules above a plasmonic surface. Through analytical and numerical analysis, it is revealed that the rotating-wave approximation can profoundly affect the dynamics of the molecules in both strong and weak coupling regimes, emphasizing the need for careful consideration when making the rotating-wave approximation in a multiple-molecule system coupled with quantum light.",
  "categories": [
    "quant-ph"
  ],
  "primary_category": "quant-ph",
  "doi": "10.1103/PhysRevA.109.013717",
  "journal_ref": "Phys. Rev. A 109, 013717 (2024)",
  "arxiv_id": "2307.14645",
  "pdf_url": "https://arxiv.org/pdf/2307.14645v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 909891,
  "size_after_bytes": 139864
}