{
  "title": "Gender Inclusive Methods in Studies of STEM Practitioners",
  "authors": [
    "Kaitlin Rasmussen",
    "Jocelyne Chen",
    "Rebecca L. Colquhoun",
    "Sophia Frentz",
    "Laurel Hiatt",
    "Aiden James Kosciesza",
    "Charlotte Olsen",
    "Theo J. O'Neill",
    "Vic Zamloot",
    "Beckett E. Strauss"
  ],
  "submission_date": "2023-07-28T20:48:59+00:00",
  "revised_dates": [],
  "abstract": "Gender inequity is one of the biggest challenges facing the STEM workforce. While there are many studies that look into gender disparities within STEM and academia, the majority of these have been designed and executed by those unfamiliar with research in sociology and gender studies. They adopt a normative view of gender as a binary choice of 'male' or 'female,' leaving individuals whose genders do not fit within that model out of such research entirely. This especially impacts those experiencing multiple axes of marginalization, such as race, disability, and socioeconomic status. For STEM fields to recruit and retain members of historically excluded groups, a new paradigm must be developed. Here, we collate a new dataset of the methods used in 119 past studies of gender equity, and recommend better survey practices and institutional policies based on a more complex and accurate approach to gender. We find that problematic approaches to gender in surveys can be classified into 5 main themes - treating gender as white, observable, discrete, as a statistic, and as inconsequential. We recommend allowing self-reporting of gender and never automating gender assignment within research. This work identifies the key areas of development for studies of gender-based inclusion within STEM, and provides recommended solutions to support the methodological uplift required for this work to be both scientifically sound and fully inclusive.",
  "categories": [
    "stat.AP"
  ],
  "primary_category": "stat.AP",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15802",
  "pdf_url": "https://arxiv.org/pdf/2307.15802v1",
  "comment": "33 pages (15 pages plus references), 1 table. Follows work of arXiv:1907.04893 and arXiv:1907.04893",
  "num_versions": null,
  "size_before_bytes": 207336,
  "size_after_bytes": 207656
}