{
  "title": "Mapping gravity in stellar nurseries -- establishing the effectiveness of 2D acceleration maps",
  "authors": [
    "Zhen-Zhen He",
    "Guang-Xing Li",
    "Andreas Burkert"
  ],
  "submission_date": "2023-07-25T11:07:47+00:00",
  "revised_dates": [],
  "abstract": "Gravity is the driving force of star formation. Although gravity is caused by the presence of matter, its role in complex regions is still unsettled. One effective way to study the pattern of gravity is to compute the accretion it exerts on the gas by providing gravitational acceleration maps. A practical way to study acceleration is by computing it using 2D surface density maps, yet whether these maps are accurate remains uncertain. Using numerical simulations, we confirm that the accuracy of the acceleration maps $\\mathbf a_{\\rm 2D}(x,y)$ computed from 2D surface density are good representations for the mean acceleration weighted by mass. Due to the under-estimations of the distances from projected maps, the magnitudes of accelerations will be over-estimated $|\\mathbf a_{\\rm 2D}(x,y)| \\approx 2.3 \\pm 1.8 \\; |\\mathbf a_{\\rm 3D}^{\\rm proj}(x,y)|$, where $\\mathbf a_{\\rm 3D}^{\\rm proj}(x,y)$ is mass-weighted projected gravitational acceleration, yet $\\mathbf a_{\\rm 2D}(x,y)$ and $ \\mathbf a_{\\rm 3D}^{\\rm proj}(x,y)$ stay aligned within 20$^{\\circ}$. Significant deviations only occur in regions where multiple structures are present along the line of sight. The acceleration maps estimated from surface density provide good descriptions of the projection of 3D acceleration fields. We expect this technique useful in establishing the link between cloud morphology and star formation, and in understanding the link between gravity and other processes such as the magnetic field. A version of the code for calculating surface density gravitational potential is available at \\url{https://github.com/zhenzhen-research/phi_2d}.",
  "categories": [
    "astro-ph.GA",
    "astro-ph.IM"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.1093/mnrasl/slad104",
  "journal_ref": null,
  "arxiv_id": "2307.13409",
  "pdf_url": null,
  "comment": "Accepted by MNRAS",
  "num_versions": null,
  "size_before_bytes": 10358402,
  "size_after_bytes": 450027
}