{
  "title": "The accretion/ejection link in the neutron star X-ray binary 4U 1820-30 I: A boundary layer-jet coupling?",
  "authors": [
    "A. Marino",
    "T. D. Russell",
    "M. Del Santo",
    "A. Beri",
    "A. Sanna",
    "F. Coti Zelati",
    "N. Degenaar",
    "D. Altamirano",
    "E. Ambrosi",
    "A. Anitra",
    "F. Carotenuto",
    "A. D'Ai",
    "T. Di Salvo",
    "A. Manca",
    "S. E. Motta",
    "C. Pinto",
    "F. Pintore",
    "N. Rea",
    "J. Van den Eijnden"
  ],
  "submission_date": "2023-07-31T10:57:53+00:00",
  "revised_dates": [],
  "abstract": "The accretion flow / jet correlation in neutron star (NS) low-mass X-ray binaries (LMXBs) is far less understood when compared to black hole (BH) LMXBs. In this paper we will present the results of a dense multi-wavelength observational campaign on the NS LMXB 4U 1820-30, including X-ray (Nicer, NuSTAR and AstroSAT) and quasi-simultaneous radio (ATCA) observations in 2022. 4U 1820-30 shows a peculiar 170 day super-orbital accretion modulation, during which the system evolves between \"modes\" of high and low X-ray flux. During our monitoring, the source did not show any transition to a full hard state. X-ray spectra were well described using a disc blackbody, a Comptonisation spectrum along with a Fe K emission line at 6.6 keV. Our results show that the observed X-ray flux modulation is almost entirely produced by changes in the size of the region providing seed photons for the Comptonisation spectrum. This region is large (about 15 km) in the high mode and likely coincides with the whole boundary layer, while it shrinks significantly (<10 km) in low mode. The electron temperature of the corona and the observed RMS variability in the hard X-rays also exhibit a slight increase in low mode. As the source moves from high to low mode, the radio emission due to the jet becomes about 5 fainter. These radio changes appear not to be strongly connected to the hard-to-soft transitions as in BH systems, while they seem to be connected mostly to variations observed in the boundary layer.",
  "categories": [
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.HE",
  "doi": "10.1093/mnras/stad2386",
  "journal_ref": null,
  "arxiv_id": "2307.16566",
  "pdf_url": "https://arxiv.org/pdf/2307.16566v1",
  "comment": "12 pages, 6 figures. Accepted for publication by MNRAS",
  "num_versions": null,
  "size_before_bytes": 7485578,
  "size_after_bytes": 1540837
}