{
  "title": "Physics-Informed Scaling Laws for the Performance of Pitching Foils in Schooling Configurations",
  "authors": [
    "Ahmet Gungor",
    "Muhammad Saif Ullah Khalid",
    "Arman Hemmati"
  ],
  "submission_date": "2023-07-24T19:28:05+00:00",
  "revised_dates": [],
  "abstract": "This study introduces novel physics-based scaling laws to estimate the propulsive performance of synchronously pitching foils in various schooling configurations at Re=4000. These relations are derived from quasi-steady lift-based and added mass forces. Hydrodynamic interactions among the schooling foils are considered through vortex-induced velocities imposed on them, constituting the ground effect. Generalized scaling equations are formulated for cycle-averaged coefficients of thrust and power. These equations encompass both the pure-pitching and induced velocity terms, capturing their combined effects. The equations are compared to computational results obtained from two-foils systems, exhibiting foil arrangements over a wide range of parameter space, including Strouhal number (0.15 \\leq St \\leq 0.4), pitching amplitude (5 deg \\leq θ_0 \\leq 14 deg), and phase difference (0 deg \\leq φ\\leq 180 deg). The individual contributions of pure-pitching and induced velocity terms to propulsive performance elucidate that solely relying on the pure-pitching terms leads to inadequate estimation, emphasizing the significance of the induced velocity terms. Validity of the approach is further assessed by testing it with a three-foil configuration, which displays a collapse. This indicates that the scaling laws are not only applicable to two-foils systems but also extend their effectiveness to multi-foil arrangements.",
  "categories": [
    "physics.flu-dyn"
  ],
  "primary_category": "physics.flu-dyn",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13093",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1029443,
  "size_after_bytes": 118225
}