{
  "title": "Investigation of Multi-Stage Evaporation and Wave Multiplicity of Two-Phase Rotating Detonation Waves Fueled by Ethanol",
  "authors": [
    "Jianghong Li",
    "Ying Lei",
    "Songbai Yao",
    "Jingtian Yu",
    "Jingzhe Li",
    "Wenwu Zhang"
  ],
  "submission_date": "2023-07-30T06:45:59+00:00",
  "revised_dates": [
    "2023-08-28T12:05:06+00:00",
    "2023-09-20T04:50:49+00:00"
  ],
  "abstract": "In this study, a numerical investigation based on the Eulerian-Lagrangian model is conducted to explore a rotating detonation engine (RDE) fueled by liquid ethanol. The focus is on examining the characteristic phenomena of the two-phase rotating detonation wave (RDW) caused by droplet evaporation and varying inlet conditions. To enhance the evaporation of liquid fuel, pre-heated air is used, and both liquid and pre-vaporized ethanol are simultaneously injected. The distribution of ethanol droplets reveals an initial concentration near the injection surface and accumulation in the fuel-refill zone. Here, liquid droplets gradually evaporate after absorbing latent heat from the surrounding gas. The subsequent interactions between the evaporating droplets and the RDW vary with the droplet size. For droplets with diameters of $d_0$ = 5-15 $μ$m, after being swept by the RDW, a secondary evaporation process occurs, leading to an enlargement of the width of the reaction zone. However, the chemical reactions still predominantly take place in close proximity to the detonation front. As further increases, droplet evaporation persists in the post-detonation expansion zone over a long distance until the remaining droplets are fully evaporated and eventually burned in this region. The study also analyzes the extinction of rotating detonations and the emergence of new detonation waves resulting from local explosions and consequent shock collisions. It is demonstrated that variations in the diameter of injected droplets and inlet temperature can lead to different operating modes with varying numbers of RDWs.",
  "categories": [
    "physics.flu-dyn"
  ],
  "primary_category": "physics.flu-dyn",
  "doi": "10.1016/j.actaastro.2023.08.037",
  "journal_ref": null,
  "arxiv_id": "2307.16145",
  "pdf_url": "https://arxiv.org/pdf/2307.16145v3",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 31620730,
  "size_after_bytes": 17988041
}