{
  "title": "Blueprinting quantum computing systems",
  "authors": [
    "Simon J. Devitt"
  ],
  "submission_date": "2023-07-29T04:03:05+00:00",
  "revised_dates": [],
  "abstract": "The development of quantum computing systems has been a staple of academic research since the mid-1990s when the first proposal for physical platforms were proposed using Nuclear Magnetic Resonance and Ion-Trap hardware. These first proposals were very basic, essentially consisting of identifying a physical qubit (two-level quantum system) that could be isolated and controlled to achieve universal quantum computation. Over the past thirty years, the nature of quantum architecture design has changed significantly and the scale of investment, groups and companies involved in building quantum computers has increased exponentially. Architectural design for quantum computers examines systems at scale: fully error-corrected machines, potentially consisting of millions if not billions of physical qubits. These designs increasingly act as blueprints for academic groups and companies and are becoming increasingly more detailed, taking into account both the nature and operation of the physical qubits themselves and also peripheral environmental and control infrastructure that is required for each physical system. In this paper, several architectural structures that I have worked on will be reviewed, each of which has been adopted by either a national quantum computing program or a quantum startup.",
  "categories": [
    "quant-ph"
  ],
  "primary_category": "quant-ph",
  "doi": null,
  "journal_ref": "Journal and Proceedings of the Royal Society of New South Wales, vol. 155, part 1, 2022, pp. 5-39",
  "arxiv_id": "2307.15883",
  "pdf_url": "https://arxiv.org/pdf/2307.15883v1",
  "comment": "39 Pages. This paper was written in the context of an award with the Royal Society of New South Wales, focused on my personal contributions and impact to quantum computing development, and should be read with that in mind",
  "num_versions": null,
  "size_before_bytes": 2105239,
  "size_after_bytes": 1302349
}