{
  "title": "Effect of Dust Evaporation and Thermal Instability on Temperature Distribution in a Protoplanetary Disk",
  "authors": [
    "Ya. N. Pavlyuchenkov",
    "V. V. Akimkin",
    "A. P. Topchieva",
    "E. I. Vorobyov"
  ],
  "submission_date": "2023-07-28T13:17:57+00:00",
  "revised_dates": [],
  "abstract": "The thermal instability of accretion disks is widely used to explain the activity of cataclysmic variables, but its development in protoplanetary disks has been studied in less detail. We present a semi-analytical stationary model for calculating the midplane temperature of a gas and dust disk around a young star. The model takes into account gas and dust opacities, as well as the evaporation of dust at temperatures above 1000 K. Using this model, we calculate the midplane temperature distributions of the disk under various assumptions about the source of opacity and the presence of dust. We show that when all considered processes are taken into account, the heat balance equation in the region r<1 au has multiple temperature solutions. Thus, the conditions for thermal instability are met in this region. To illustrate the possible influence of instability on the accretion state in a protoplanetary disk, we consider a viscous disk model with alpha parameterization of turbulent viscosity. We show that in such a model the disk evolution is non-stationary, with alternating phases of accumulation of matter in the inner disk and its rapid accretion onto the star, leading to an episodic accretion pattern. These results indicate that this instability needs to be taken into account in evolutionary models of protoplanetary disks.",
  "categories": [
    "astro-ph.EP",
    "astro-ph.SR"
  ],
  "primary_category": "astro-ph.EP",
  "doi": "10.1134/S1063772923050086",
  "journal_ref": null,
  "arxiv_id": "2307.15544",
  "pdf_url": "https://arxiv.org/pdf/2307.15544v1",
  "comment": "Published in Astronomy Reports Vol. 67, No. 5, pp. 470-482 (2023)",
  "num_versions": null,
  "size_before_bytes": 1775153,
  "size_after_bytes": 157291
}