{
  "title": "Effects of Coulomb blockade on the charge transport through the topological states of finite armchair graphene nanoribbons and heterostructures",
  "authors": [
    "David M T Kuo"
  ],
  "submission_date": "2023-07-23T00:45:44+00:00",
  "revised_dates": [],
  "abstract": "In this study, we investigate the charge transport properties of semiconducting armchair graphene nanoribbons (AGNRs) and heterostructures through their topological states (TSs), with a specific focus on the Coulomb blockade region. Our approach employs a two-site Hubbard model that takes into account both intra- and inter-site Coulomb interactions. Using this model, we calculate the electron thermoelectric coefficients and tunneling currents of serially coupled TSs (SCTSs). In the linear response regime, we analyze the electrical conductance ($G_e$), Seebeck coefficient ($S$), and electron thermal conductance ($κ_e$) of finite AGNRs. Our results reveal that at low temperatures, the Seebeck coefficient is more sensitive to many-body spectra than the electrical conductance. Furthermore, we observe that the optimized $S$ at high temperature is less sensitive to electron Coulomb interactions than $G_e$ and $κ_e$. In the nonlinear response regime, we observe a tunneling current with negative differential conductance through the SCTSs of finite AGNRs. This current is generated by electron inter-site Coulomb interactions rather than intra-site Coulomb interactions. Additionally, we observe current rectification behavior in asymmetrical junction systems of SCTSs of AGNRs. Notably, we also uncover the remarkable current rectification behavior of SCTSs of 9-7-9 AGNR heterostructure in the Pauli spin blockade configuration. Overall, our study provides valuable insights into the charge transport properties of TSs in finite AGNRs and heterostructures. We emphasize the importance of considering electron-electron interactions in understanding the behavior of these materials.",
  "categories": [
    "cond-mat.mes-hall"
  ],
  "primary_category": "cond-mat.mes-hall",
  "doi": null,
  "journal_ref": "Nanomaterials 2023, 13(11), 1757",
  "arxiv_id": "2307.12192",
  "pdf_url": null,
  "comment": "corrected some typos",
  "num_versions": null,
  "size_before_bytes": 3921729,
  "size_after_bytes": 71287
}