{
  "title": "Improving Primary Healthcare Workflow Using Extreme Summarization of Scientific Literature Based on Generative AI",
  "authors": [
    "Gregor Stiglic",
    "Leon Kopitar",
    "Lucija Gosak",
    "Primoz Kocbek",
    "Zhe He",
    "Prithwish Chakraborty",
    "Pablo Meyer",
    "Jiang Bian"
  ],
  "submission_date": "2023-07-24T21:42:27+00:00",
  "revised_dates": [],
  "abstract": "Primary care professionals struggle to keep up to date with the latest scientific literature critical in guiding evidence-based practice related to their daily work. To help solve the above-mentioned problem, we employed generative artificial intelligence techniques based on large-scale language models to summarize abstracts of scientific papers. Our objective is to investigate the potential of generative artificial intelligence in diminishing the cognitive load experienced by practitioners, thus exploring its ability to alleviate mental effort and burden. The study participants were provided with two use cases related to preventive care and behavior change, simulating a search for new scientific literature. The study included 113 university students from Slovenia and the United States randomized into three distinct study groups. The first group was assigned to the full abstracts. The second group was assigned to the short abstracts generated by AI. The third group had the option to select a full abstract in addition to the AI-generated short summary. Each use case study included ten retrieved abstracts. Our research demonstrates that the use of generative AI for literature review is efficient and effective. The time needed to answer questions related to the content of abstracts was significantly lower in groups two and three compared to the first group using full abstracts. The results, however, also show significantly lower accuracy in extracted knowledge in cases where full abstract was not available. Such a disruptive technology could significantly reduce the time required for healthcare professionals to keep up with the most recent scientific literature; nevertheless, further developments are needed to help them comprehend the knowledge accurately.",
  "categories": [
    "cs.CL",
    "cs.AI"
  ],
  "primary_category": "cs.CL",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15715",
  "pdf_url": "https://arxiv.org/pdf/2307.15715v1",
  "comment": "5 pages, 5 figures",
  "num_versions": null,
  "size_before_bytes": 2601497,
  "size_after_bytes": 1521824
}