{
  "title": "Topology of light rings for extremal and non-extremal Kerr-Newman Taub-NUT black holes without $\\mathbb{Z}_2$ symmetry",
  "authors": [
    "Shan-Ping Wu",
    "Shao-Wen Wei"
  ],
  "submission_date": "2023-07-26T07:32:12+00:00",
  "revised_dates": [],
  "abstract": "Understanding the light ring, one kind fundamental orbit, shall provide us with novel insight into the astronomical phenomena, such as the ringdown of binary merger and shadow of black holes. Recently, topological approach has preliminarily demonstrated its potential advantages on the properties of the light rings. However, for the black holes without $\\mathbb{Z}_2$ symmetry and extremal spinning black holes are remained to be tested. In this paper, we aim at these two issues. Due to the NUT charge, the Kerr-Newman Taub-NUT solution has no $\\mathbb{Z}_2$ symmetry. By constructing the corresponding topology for the non-extremal spinning black holes, we find the topological number keeps unchanged. This indicates that $\\mathbb{Z}_2$ symmetry has no influence on the topological number, while it indeed affects the locations of the light rings and deviates them off the equatorial plane. For the extremal spinning black holes, we find its topology is critically dependent of the leading term of the vector's radial component at the zero point of its angular component on the black hole horizon. The findings state that there exists a topological phase transition, where the topological number changes, for the prograde light rings. While no phase transition occurs for the retrograde light rings. Our study uncovers some universal topological properties for the extremal and non-extremal spinning black holes with or without $\\mathbb{Z}_2$ symmetry. It also has enlightening significance on understanding the light rings in a more general black hole background.",
  "categories": [
    "gr-qc",
    "hep-th"
  ],
  "primary_category": "gr-qc",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14003",
  "pdf_url": null,
  "comment": "22 pages, 10 figures, 2 tables",
  "num_versions": null,
  "size_before_bytes": 1088954,
  "size_after_bytes": 72107
}