{
  "title": "Alignment of dense molecular core morphology and velocity gradients with ambient magnetic fields",
  "authors": [
    "A. Pandhi",
    "R. K. Friesen",
    "L. Fissel",
    "J. E. Pineda",
    "P. Caselli",
    "M. C-Y. Chen",
    "J. Di Francesco",
    "A. Ginsburg",
    "H. Kirk",
    "P. C. Myers",
    "S. S. R. Offner",
    "A. Punanova",
    "F. Quan",
    "E. Redaelli",
    "E. Rosolowsky",
    "S. Scibelli",
    "Y. M. Seo",
    "Y. Shirley"
  ],
  "submission_date": "2023-07-24T18:00:00+00:00",
  "revised_dates": [],
  "abstract": "Studies of dense core morphologies and their orientations with respect to gas flows and the local magnetic field have been limited to only a small sample of cores with spectroscopic data. Leveraging the Green Bank Ammonia Survey alongside existing sub-millimeter continuum observations and Planck dust polarization, we produce a cross-matched catalogue of 399 dense cores with estimates of core morphology, size, mass, specific angular momentum, and magnetic field orientation. Of the 399 cores, 329 exhibit 2D $\\mathrm{v}_\\mathrm{LSR}$ maps that are well fit with a linear gradient, consistent with rotation projected on the sky. We find a best-fit specific angular momentum and core size relationship of $J/M \\propto R^{1.82 \\pm 0.10}$, suggesting that core velocity gradients originate from a combination of solid body rotation and turbulent motions. Most cores have no preferred orientation between the axis of core elongation, velocity gradient direction, and the ambient magnetic field orientation, favouring a triaxial and weakly magnetized origin. We find, however, strong evidence for a preferred anti-alignment between the core elongation axis and magnetic field for protostellar cores, revealing a change in orientation from starless and prestellar populations that may result from gravitational contraction in a magnetically-regulated (but not dominant) environment. We also find marginal evidence for anti-alignment between the core velocity gradient and magnetic field orientation in the L1228 and L1251 regions of Cepheus, suggesting a preferred orientation with respect to magnetic fields may be more prevalent in regions with locally ordered fields.",
  "categories": [
    "astro-ph.GA",
    "astro-ph.SR"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.1093/mnras/stad2283",
  "journal_ref": null,
  "arxiv_id": "2307.13022",
  "pdf_url": null,
  "comment": "33 pages, 28 figures, accepted to MNRAS",
  "num_versions": null,
  "size_before_bytes": 10039496,
  "size_after_bytes": 674816
}