{
  "title": "Pathloss-based non-Line-of-Sight Identification in an Indoor Environment: An Experimental Study",
  "authors": [
    "Muhammad Asim",
    "Muhammad Ozair Iqbal",
    "Waqas Aman",
    "Muhammad Mahboob Ur Rahman",
    "Qammer H. Abbasi"
  ],
  "submission_date": "2023-07-29T14:40:27+00:00",
  "revised_dates": [],
  "abstract": "This paper reports the findings of an experimental study on the problem of line-of-sight (LOS)/non-line-of-sight (NLOS) classification in an indoor environment. Specifically, we deploy a pair of NI 2901 USRP software-defined radios (SDR) in a large hall. The transmit SDR emits an unmodulated tone of frequency 10 KHz, on a center frequency of 2.4 GHz, using three different signal-to-noise ratios (SNR). The receive SDR constructs a dataset of pathloss measurements from the received signal as it moves across 15 equi-spaced positions on a 1D grid (for both LOS and NLOS scenarios). We utilize our custom dataset to estimate the pathloss parameters (i.e., pathloss exponent) using the least-squares method, and later, utilize the parameterized pathloss model to construct a binary hypothesis test for NLOS identification. Further, noting that the pathloss measurements slightly deviate from Gaussian distribution, we feed our custom dataset to four machine learning (ML) algorithms, i.e., linear support vector machine (SVM) and radial basis function SVM (RBF-SVM), linear discriminant analysis (LDA), quadratic discriminant analysis (QDA), and logistic regression (LR). It turns out that the performance of the ML algorithms is only slightly superior to the Neyman-Pearson-based binary hypothesis test (BHT). That is, the RBF-SVM classifier (the best performing ML classifier) and the BHT achieve a maximum accuracy of 88.24% and 87.46% for low SNR, 83.91% and 81.21% for medium SNR, and 87.38% and 86.65% for high SNR.",
  "categories": [
    "eess.SP",
    "cs.IT"
  ],
  "primary_category": "eess.SP",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15995",
  "pdf_url": "https://arxiv.org/pdf/2307.15995v1",
  "comment": "5 pages, 4 figures, submitted to an IEEE conference",
  "num_versions": null,
  "size_before_bytes": 3520863,
  "size_after_bytes": 35902
}