{
  "title": "The diverse chemistry of protoplanetary disks as revealed by JWST",
  "authors": [
    "Ewine F. van Dishoeck",
    "S. Grant",
    "B. Tabone",
    "M. van Gelder",
    "L. Francis",
    "L. Tychoniec",
    "G. Bettoni",
    "A. M. Arabhavi",
    "D. Gasman",
    "P. Nazari",
    "M. Vlasblom",
    "P. Kavanagh",
    "V. Christiaens",
    "P. Klaassen",
    "H. Beuther",
    "Th. Henning",
    "I. Kamp"
  ],
  "submission_date": "2023-07-21T18:00:04+00:00",
  "revised_dates": [],
  "abstract": "Early results from the JWST-MIRI guaranteed time programs on protostars (JOYS) and disks (MINDS) are presented. Thanks to the increased sensitivity, spectral and spatial resolution of the MIRI spectrometer, the chemical inventory of the planet-forming zones in disks can be investigated with unprecedented detail across stellar mass range and age. Here data are presented for five disks, four around low-mass stars and one around a very young high-mass star. The mid-infrared spectra show some similarities but also significant diversity: some sources are rich in CO2, others in H2O or C2H2. In one disk around a very low-mass star, booming C2H2 emission provides evidence for a ``soot'' line at which carbon grains are eroded and sublimated, leading to a rich hydrocarbon chemistry in which even di-acetylene (C4H2) and benzene (C6H6) are detected (Tabone et al. 2023). Together, the data point to an active inner disk gas-phase chemistry that is closely linked to the physical structure (temperature, snowlines, presence of cavities and dust traps) of the entire disk and which may result in varying CO2/H2O abundances and high C/O ratios >1 in some cases. Ultimately, this diversity in disk chemistry will also be reflected in the diversity of the chemical composition of exoplanets.",
  "categories": [
    "astro-ph.GA",
    "astro-ph.EP",
    "astro-ph.SR"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.1039/d3fd00010a",
  "journal_ref": "Faraday Discussion \"Astrochemistry at high resolution\", 2023",
  "arxiv_id": "2307.11817",
  "pdf_url": null,
  "comment": "17 pages, 8 figures. Author's version of paper submitted to Faraday Discussions January 18 2023, Accepted March 16 2023",
  "num_versions": null,
  "size_before_bytes": 2877378,
  "size_after_bytes": 181609
}