{
  "title": "Simulated Analogues I: apparent and physical evolution of young binary protostellar systems",
  "authors": [
    "Vito Tuhtan",
    "Rami Al-Belmpeisi",
    "Mikkel Bregning Christensen",
    "Rajika L Kuruwita",
    "Troels Haugbølle"
  ],
  "submission_date": "2023-07-27T15:09:08+00:00",
  "revised_dates": [],
  "abstract": "Protostellar binaries harbour complex environment morphologies. Observations represent a snapshot in time, and projection and optical depth effects impair our ability to interpret them. Careful comparison with high-resolution models that include the larger star-forming region can help isolate the driving physical processes and give observations context in the time domain. We carry out zoom-in simulations with AU-scale resolution, and for the first time ever we follow the evolution until a circumbinary disk is formed. We investigate the gas dynamics around the young stars and extract disk sizes. Using radiative transfer, we obtain evolutionary tracers of the binary systems. We find that the centrifugal radius in prestellar cores is a poor estimator of the resulting disk size due to angular momentum transport at all scales. For binaries, the disk sizes are regulated periodically by the binary orbit, having larger radii close to the apastron. The bolometric temperature differs systematically between edge-on and face-on views and shows a high frequency time dependence correlated with the binary orbit and a low frequency time dependence with larger episodic accretion events. These oscillations can bring the system appearance to change rapidly from class 0 to class I and for short time periods even bring it to class II. The highly complex structure in early stages, as well as the binary orbit itself, affects the classical interpretation of protostellar classes and direct translation to evolutionary stages has to be done with caution and include other evolutionary indicators such as the extent of envelope material.",
  "categories": [
    "astro-ph.SR",
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.SR",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14923",
  "pdf_url": "https://arxiv.org/pdf/2307.14923v1",
  "comment": "15 pages, 13 figures, submitted to MNRAS",
  "num_versions": null,
  "size_before_bytes": 6250374,
  "size_after_bytes": 442177
}