{
  "title": "Chemical Abundances of a Sample of Oxygen-dominated Galaxies",
  "authors": [
    "B. E. Miranda-Pérez",
    "A. M. Hidalgo-Gámez"
  ],
  "submission_date": "2023-07-26T22:19:04+00:00",
  "revised_dates": [],
  "abstract": "We spectroscopically analyzed a sample of 85 Sloan Digital Sky Survey compact, oxygen-dominated galaxies located at redshift $z\\sim0.001-0.350$, selected because of their large equivalent width of [O III]$λ$5007 (larger than 200Å). These galaxies might be considered as extreme emission-line galaxies due to their strong [O III]$λ$5007 emission line. We detected high-ionization lines, even those related to the presence of Wolf-Rayet stars, in almost all the galaxies studied. We obtained physical properties (electron density and temperature) as well as chemical abundances by using the direct method based on the electron temperature. In this analysis, we obtained three different measurements of T(high): the usual one, T([O III]), but also that of T([S III]) and T([Ar III]) for five and three of the galaxies, respectively. Further, we established a new calibration for T([S III]). We determined oxygen, nitrogen, sulfur, neon, argon, iron, and chlorine abundances when possible, and we compared to the results of other late-type, low-metallicity galaxies, such as blue compact dwarfs, Ims, and green peas. From such a detailed study, we can conclude that the majority of the galaxies in this sample have similar metallicities to the SMC (about $12+\\log(O/H)\\approx8$dex), and that only 12% of the galaxies are extremely metal-poor, with abundances lower than $7.7$dex. Also, a comparison with some chemical evolution models as well as a brief discussion on the chemical evolution with time is considered.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.3847/1538-4357/acdb4b",
  "journal_ref": "2023ApJ 952-76",
  "arxiv_id": "2307.14529",
  "pdf_url": "https://arxiv.org/pdf/2307.14529v1",
  "comment": "30 pages, 14 figures, 13 tables",
  "num_versions": null,
  "size_before_bytes": 1222555,
  "size_after_bytes": 982728
}