{
  "title": "Deep learning forecasts of cosmic acceleration parameters from DECi-hertz Interferometer Gravitational-wave Observatory",
  "authors": [
    "Meng-Fei Sun",
    "Jin Li",
    "Shuo Cao",
    "Xiaolin Liu"
  ],
  "submission_date": "2023-07-31T06:45:44+00:00",
  "revised_dates": [
    "2023-12-13T02:48:54+00:00"
  ],
  "abstract": "Validating the accelerating expansion of the universe is an important issue for understanding the evolution of the universe. By constraining the cosmic acceleration parameter $X_H$, we can discriminate between the $Λ\\mathrm{CDM}$ (cosmological constant plus cold dark matter) model and LTB (the Lemaître-Tolman-Bondi) model. In this paper, we explore the possibility of constraining the cosmic acceleration parameter with the inspiral gravitational waveform of neutron star binaries (NSBs) in the frequency range of 0.1Hz-10Hz, which can be detected by the second-generation space-based gravitational wave detector DECIGO. We use a convolutional neural network (CNN), a long short-term memory (LSTM) network combined with a gated recurrent unit (GRU), and Fisher information matrix to derive constraints on the cosmic acceleration parameter $X_H$. Based on the simulated gravitational wave data with a time duration of 1 month, we conclude that CNN can limit the relative error to 14.09%, while LSTM network combined with GRU can limit the relative error to 13.53%. Additionally, using Fisher information matrix for gravitational wave data with a 5-year observation can limit the relative error to 32.94%. Compared with the Fisher information matrix method, deep learning techniques will significantly improve the constraints on the cosmic acceleration parameters at different redshifts. Therefore, DECIGO is expected to provide direct measurements of the acceleration of the universe, by observing the chirp signals of coalescing binary neutron stars.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16437",
  "pdf_url": "https://arxiv.org/pdf/2307.16437v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 4891957,
  "size_after_bytes": 885889
}