{
  "title": "Gaussian decomposition of magic states for matchgate computations",
  "authors": [
    "Joshua Cudby",
    "Sergii Strelchuk"
  ],
  "submission_date": "2023-07-24T09:52:53+00:00",
  "revised_dates": [
    "2023-07-26T00:36:57+00:00",
    "2024-04-09T01:27:10+00:00",
    "2025-09-09T01:33:16+00:00"
  ],
  "abstract": "Magic states, pivotal for universal quantum computation via classically simulable Clifford gates, often undergo decomposition into resourceless stabilizer states, facilitating simulation through classical means. This approach yields three operationally significant metrics: stabilizer rank, fidelity, and extent. We extend these simulation methods to encompass matchgate circuits (MGCs), and define equivalent metrics for this setting. We begin with an investigation into the algebraic constraints defining Gaussian states, marking the first explicit characterisation of these states. The explicit description of Gaussian states is pivotal to our methods for tackling all the simulation tasks. Central to our inquiry is the concept of Gaussian rank -- a pivotal metric defining the minimum terms required for decomposing a quantum state into Gaussian constituents. This metric holds paramount significance in determining the runtime of rank-based simulations for MGCs featuring magic state inputs. The absence of low-rank decompositions presents a computational hurdle, thereby prompting a deeper examination of fermionic magic states. We find that the Gaussian rank of 2 instances of our canonical magic state is 4 under symmetry-restricted decompositions. Additionally, our numerical analysis suggests the absence of low-rank decompositions for 2 or 3 copies of this magic state. Further, we explore the Gaussian extent, a convex metric offering an upper bound on the rank. We prove the Gaussian extent's multiplicative behaviour on 4-qubit systems, along with initial strides towards proving its sub-multiplicative nature in general settings. One important result in that direction we present is an upper bound on the Gaussian fidelity of generic states.",
  "categories": [
    "quant-ph"
  ],
  "primary_category": "quant-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12654",
  "pdf_url": null,
  "comment": "See also related works by Dias and Koenig and by Reardon-Smith et al. appearing in the same arXiv listing",
  "num_versions": null,
  "size_before_bytes": 386999,
  "size_after_bytes": 392898
}