{
  "title": "Competition between fractional quantum Hall liquid and electron solid phases in the Landau levels of multilayer graphene",
  "authors": [
    "Rakesh K. Dora",
    "Ajit C. Balram"
  ],
  "submission_date": "2023-07-26T21:38:29+00:00",
  "revised_dates": [
    "2023-12-21T01:02:45+00:00"
  ],
  "abstract": "We study the competition between the electron liquid and solid phases, such as Wigner crystal and bubbles, in partially filled Landau levels (LLs) of multilayer graphene. Graphene systems offer a versatile platform for controlling band dispersion by varying the number of its stacked layers. The band dispersion determines the LL wave functions, and consequently, the LL-projected Coulomb interaction in graphene and its multilayers is different from that in conventional semiconductors like GaAs. As a result, the energies of the liquid and solid phases are different in the different LLs of multilayer graphene, leading to an alternative phase diagram for the stability of these phases, which we work out. The phase diagram of competing solid and liquid phases in the LLs of monolayer graphene has been studied previously. Here, we primarily consider $AB{-}$ or Bernal$-$stacked bilayer graphene (BLG) and $ABC{-}$stacked trilayer graphene (TLG) and focus on the Laughlin fractions. We determine the cohesive energy of the solid phase using the Hartree-Fock approximation, and the energy of the Laughlin liquid is computed analytically via the plasma sum rules. We find that at the Laughlin fillings, the electron liquid phase has the lowest energy among the phases considered in the $\\mathcal{N}{=}0, 1, 2$ LLs of BLG, as well as in the $\\mathcal{N}{=}3, 4$ LLs of TLG, while in the $\\mathcal{N}{>}2$ LLs of BLG and $\\mathcal{N}{>}4$ LLs of TLG, the solid phases are more favorable. We also discuss the effect of impurities on the above-mentioned phase diagram.",
  "categories": [
    "cond-mat.mes-hall",
    "cond-mat.str-el"
  ],
  "primary_category": "cond-mat.mes-hall",
  "doi": "10.1103/PhysRevB.108.235153",
  "journal_ref": "Phys. Rev. B 108, 235153 (2023)",
  "arxiv_id": "2307.14519",
  "pdf_url": null,
  "comment": "27 pages, 37 figures",
  "num_versions": null,
  "size_before_bytes": 8383897,
  "size_after_bytes": 2306131
}