{
  "title": "Thermal one-point functions: CFT's with fermions, large $d$ and large spin",
  "authors": [
    "Justin R. David",
    "Srijan Kumar"
  ],
  "submission_date": "2023-07-27T13:24:50+00:00",
  "revised_dates": [
    "2023-08-21T12:27:42+00:00",
    "2023-10-23T13:46:40+00:00"
  ],
  "abstract": "We apply the OPE inversion formula on thermal two-point functions of fermions to obtain thermal one-point function of fermion bi-linears appearing in the corresponding OPE. We primarily focus on the OPE channel which contains the stress tensor of the theory. We apply our formalism to the mean field theory of fermions and verify that the inversion formula reproduces the spectrum as well as their corresponding thermal one-point functions. We then examine the large $N$ critical Gross-Neveu model in $d=2k+1$ dimensions with $k$ even and at finite temperature. We show that stress tensor evaluated from the inversion formula agrees with that evaluated from the partition function at the critical point. We demonstrate the expectation values of 3 different classes of higher spin currents are all related to each other by numerical constants, spin and the thermal mass. We evaluate the ratio of the thermal expectation values of higher spin currents at the critical point to the Gaussian fixed point or the Stefan-Boltzmann result, both for the large $N$ critical $O(N)$ model and the Gross-Neveu model in odd dimensions. This ratio is always less than one and it approaches unity on increasing the spin with the dimension $d$ held fixed. The ratio however approaches zero when the dimension $d$ is increased with the spin held fixed.",
  "categories": [
    "hep-th",
    "cond-mat.stat-mech",
    "cond-mat.str-el"
  ],
  "primary_category": "hep-th",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14847",
  "pdf_url": "https://arxiv.org/pdf/2307.14847v3",
  "comment": "46 pages, 8 figures, some more typos corrected",
  "num_versions": null,
  "size_before_bytes": 1200392,
  "size_after_bytes": 574879
}