{
  "title": "Integrated turbulence parameters' estimation from NAOMI adaptive optics telemetry data",
  "authors": [
    "Nuno Morujão",
    "Carlos Correia",
    "Paulo Andrade",
    "Julien Woillez",
    "Paulo Garcia"
  ],
  "submission_date": "2023-07-27T20:16:40+00:00",
  "revised_dates": [
    "2023-10-05T15:13:34+00:00"
  ],
  "abstract": "Monitoring turbulence parameters is crucial in high-angular resolution astronomy for various purposes, such as optimising adaptive optics systems or fringe trackers. The former are present at most modern observatories and will remain significant in the future. This makes them a valuable complementary tool for the estimation of turbulence parameters.\n  The feasibility of estimating turbulence parameters from low-resolution sensors remains untested. We perform seeing estimates for both simulated and on-sky telemetry data sourced from the new adaptive optics module installed on the four Auxiliary Telescopes of the Very Large Telescope Interferometer.\n  The seeing estimates are obtained from a modified and optimised algorithm that employs a chi-squared modal fitting approach to the theoretical von Kármán model variances. The algorithm is built to retrieve turbulence parameters while simultaneously estimating and accounting for the remaining and measurement error. A Monte Carlo method is proposed for the estimation of the statistical uncertainty of the algorithm.\n  The algorithm is shown to be able to achieve per cent accuracy in the estimation of the seeing with a temporal horizon of 20s on simulated data. A 0.76\" +/- 1.2%$|_\\mathrm{stat}$ +/- 1.2%$|_\\mathrm{sys}$ median seeing was estimated from on-sky data collected from 2018 and 2020. The spatial distribution of the Auxiliary Telescopes across the Paranal Observatory was found to not play a role in the value of the seeing.",
  "categories": [
    "astro-ph.IM"
  ],
  "primary_category": "astro-ph.IM",
  "doi": "10.1051/0004-6361/202346952",
  "journal_ref": "A&A 678, A193 (2023)",
  "arxiv_id": "2307.15178",
  "pdf_url": "https://arxiv.org/pdf/2307.15178v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 4517768,
  "size_after_bytes": 1282834
}