{
  "title": "Scalable Imaginary Time Evolution with Neural Network Quantum States",
  "authors": [
    "Eimantas Ledinauskas",
    "Egidijus Anisimovas"
  ],
  "submission_date": "2023-07-28T12:26:43+00:00",
  "revised_dates": [
    "2023-08-01T10:05:43+00:00",
    "2023-10-16T11:03:21+00:00",
    "2023-11-16T10:08:56+00:00"
  ],
  "abstract": "The representation of a quantum wave function as a neural network quantum state (NQS) provides a powerful variational ansatz for finding the ground states of many-body quantum systems. Nevertheless, due to the complex variational landscape, traditional methods often employ the computation of quantum geometric tensor, consequently complicating optimization techniques. Contributing to efforts aiming to formulate alternative methods, we introduce an approach that bypasses the computation of the metric tensor and instead relies exclusively on first-order gradient descent with Euclidean metric. This allows for the application of larger neural networks and the use of more standard optimization methods from other machine learning domains. Our approach leverages the principle of imaginary time evolution by constructing a target wave function derived from the Schrödinger equation, and then training the neural network to approximate this target. We make this method adaptive and stable by determining the optimal time step and keeping the target fixed until the energy of the NQS decreases. We demonstrate the benefits of our scheme via numerical experiments with 2D J1-J2 Heisenberg model, which showcase enhanced stability and energy accuracy in comparison to direct energy loss minimization. Importantly, our approach displays competitiveness with the well-established density matrix renormalization group method and NQS optimization with stochastic reconfiguration.",
  "categories": [
    "quant-ph"
  ],
  "primary_category": "quant-ph",
  "doi": "10.21468/SciPostPhys.15.6.229",
  "journal_ref": "SciPost Phys. 15, 229 (2023)",
  "arxiv_id": "2307.15521",
  "pdf_url": "https://arxiv.org/pdf/2307.15521v4",
  "comment": "Submission to SciPost",
  "num_versions": null,
  "size_before_bytes": 3489977,
  "size_after_bytes": 621469
}