{
  "title": "The influence of a static planetary atmosphere on spin transfer during pebble accretion",
  "authors": [
    "M. J. Yzer",
    "R. G. Visser",
    "C. Dominik"
  ],
  "submission_date": "2023-07-21T18:31:24+00:00",
  "revised_dates": [],
  "abstract": "We study the effect an atmosphere has on pebble orbits and spin build-up on a planet's surface during pebble accretion in the extreme case of a static atmosphere. We numerically integrate the equations of motion of pebbles in a planar, global frame with a planet, a central star and gas from a protoplanetary disc. An adiabatic atmosphere is then placed around the planet, and the spin deposited onto the planet's surface is measured. These simulations are evaluated for different distances to the star, Stokes numbers, and planet masses. Pebble feedback to the gas is not taken into account. We find that a static atmosphere dampens the spin the planet's surface receives by absorbing part of the angular momentum of the pebbles and circularising their orbits. This could prevent the excessive spin values predicted in some 3D pebble accretion simulations without an atmosphere. For planets larger than 0.5 Earth masses, a stationary atmosphere absorbs all angular momentum, leaving no spin for the surface. Significant quantities of angular momentum are stored in the inner and intermediate atmosphere ($<0.3$ Bondi radii). Depending on the atmospheric and disc model, this spin could be transported either to the disc through atmospheric recycling or to the planet through drag between the surface and the atmosphere. Further research is required to quantify the spin transfer within the atmosphere.",
  "categories": [
    "astro-ph.EP"
  ],
  "primary_category": "astro-ph.EP",
  "doi": "10.1051/0004-6361/202346229",
  "journal_ref": "A&A 678, A37 (2023)",
  "arxiv_id": "2307.11847",
  "pdf_url": null,
  "comment": "18 pages, 14 figures, Accepted for publication in Astronomy and Astrophysics (A&A)",
  "num_versions": null,
  "size_before_bytes": 4635642,
  "size_after_bytes": 1597716
}