{
  "title": "Panoptic Scene Graph Generation with Semantics-Prototype Learning",
  "authors": [
    "Li Li",
    "Wei Ji",
    "Yiming Wu",
    "Mengze Li",
    "You Qin",
    "Lina Wei",
    "Roger Zimmermann"
  ],
  "submission_date": "2023-07-28T14:04:06+00:00",
  "revised_dates": [
    "2023-09-28T07:58:01+00:00",
    "2024-01-22T13:17:21+00:00"
  ],
  "abstract": "Panoptic Scene Graph Generation (PSG) parses objects and predicts their relationships (predicate) to connect human language and visual scenes. However, different language preferences of annotators and semantic overlaps between predicates lead to biased predicate annotations in the dataset, i.e. different predicates for same object pairs. Biased predicate annotations make PSG models struggle in constructing a clear decision plane among predicates, which greatly hinders the real application of PSG models. To address the intrinsic bias above, we propose a novel framework named ADTrans to adaptively transfer biased predicate annotations to informative and unified ones. To promise consistency and accuracy during the transfer process, we propose to measure the invariance of representations in each predicate class, and learn unbiased prototypes of predicates with different intensities. Meanwhile, we continuously measure the distribution changes between each presentation and its prototype, and constantly screen potential biased data. Finally, with the unbiased predicate-prototype representation embedding space, biased annotations are easily identified. Experiments show that ADTrans significantly improves the performance of benchmark models, achieving a new state-of-the-art performance, and shows great generalization and effectiveness on multiple datasets.",
  "categories": [
    "cs.CV"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15567",
  "pdf_url": "https://arxiv.org/pdf/2307.15567v3",
  "comment": "AAAI 2024",
  "num_versions": null,
  "size_before_bytes": 9022481,
  "size_after_bytes": 395588
}