{
  "title": "Full-field in vivo experimental study of the strains of a breathing human abdominal wall with intra-abdominal pressure variation",
  "authors": [
    "Katarzyna Szepietowska",
    "Mateusz Troka",
    "Monika Lichodziejewska-Niemierko",
    "Michał Chmielewski",
    "Izabela Lubowiecka"
  ],
  "submission_date": "2023-07-29T21:03:33+00:00",
  "revised_dates": [
    "2023-12-22T00:11:14+00:00"
  ],
  "abstract": "The presented study aims to assess the mechanical behaviour of the anterior abdominal wall based on an in vivo experiment on humans. Full-field measurement of abdominal wall displacement during changes of intra-abdominal pressure is performed using a digital image correlation (DIC) system. Continuous measurement in time enables the observation of changes in the strain field during breathing. The understanding of the mechanical behaviour of a living human abdominal wall is important for the proper design of surgical meshes used for ventral hernia repair, which was also a motivation for the research presented below.\n  The research refers to the strain field of a loaded abdominal wall and presents the evolution of principal strains and their directions in the case of 12 subjects, 8 male and 4 female. Peritoneal dialysis procedure allows for the measurement of intra-abdominal pressure after fluid introduction.\n  High variability among patients is observed, also in terms of principal strain direction. Subjects exhibit intra-abdominal pressure of values from 11 to 21cmH2O. However, the strain values are not strongly correlated with the pressure value, indicated variability of material properties.",
  "categories": [
    "physics.med-ph",
    "q-bio.TO"
  ],
  "primary_category": "physics.med-ph",
  "doi": "10.1016/j.jmbbm.2023.106148",
  "journal_ref": "Journal of the Mechanical Behavior of Biomedical Materials, Volume 147, November 2023, 106148",
  "arxiv_id": "2307.16077",
  "pdf_url": "https://arxiv.org/pdf/2307.16077v2",
  "comment": "56 pages, 59 figures Published in Journal of the Mechanical Behavior of Biomedical Materials; Received 28 July 2023; Revised 13 September 2023; Accepted 23 September 2023",
  "num_versions": null,
  "size_before_bytes": 65002825,
  "size_after_bytes": 469194
}