{
  "title": "Graph Theoretical Analysis of local ultraluminous infrared galaxies and quasars",
  "authors": [
    "Orestis Pavlou",
    "Ioannis Michos",
    "Vicky Papadopoulou Lesta",
    "Michalis Papadopoulos",
    "Evangelos S. Papaefthymiou",
    "Andreas Efstathiou"
  ],
  "submission_date": "2023-07-27T10:05:21+00:00",
  "revised_dates": [],
  "abstract": "We present a methodological framework for studying galaxy evolution by utilizing Graph Theory and network analysis tools. We study the evolutionary processes of local ultraluminous infrared galaxies (ULIRGs) and quasars and the underlying physical processes, such as star formation and active galactic nucleus (AGN) activity, through the application of Graph Theoretical analysis tools. We extract, process and analyse mid-infrared spectra of local (z < 0.4) ULIRGs and quasars between 5-38 microns through internally developed Python routines, in order to generate similarity graphs, with the nodes representing ULIRGs being grouped together based on the similarity of their spectra. Additionally, we extract and compare physical features from the mid-IR spectra, such as the polycyclic aromatic hydrocarbons (PAHs) emission and silicate depth absorption features, as indicators of the presence of star-forming regions and obscuring dust, in order to understand the underlying physical mechanisms of each evolutionary stage of ULIRGs. Our analysis identifies five groups of local ULIRGs based on their mid-IR spectra, which is quite consistent with the well established fork classification diagram by providing a higher level classification. We demonstrate how graph clustering algorithms and network analysis tools can be utilized as unsupervised learning techniques for revealing direct or indirect relations between various galaxy properties and evolutionary stages, which provides an alternative methodology to previous works for classification in galaxy evolution. Additionally, our methodology compares the output of several graph clustering algorithms in order to demonstrate the best-performing Graph Theoretical tools for studying galaxy evolution.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.1016/j.ascom.2023.100742",
  "journal_ref": "Astronomy and Computing 45C (2023) 100742",
  "arxiv_id": "2307.14746",
  "pdf_url": "https://arxiv.org/pdf/2307.14746v1",
  "comment": "Accepted for publication in Astronomy and Computing",
  "num_versions": null,
  "size_before_bytes": 5928932,
  "size_after_bytes": 519996
}