{
  "title": "Search for heavy Higgs bosons with flavour-violating couplings in multi-lepton plus $b$-jets final states in $pp$ collisions at 13 TeV with the ATLAS detector",
  "authors": [
    "ATLAS Collaboration"
  ],
  "submission_date": "2023-07-27T10:38:23+00:00",
  "revised_dates": [
    "2024-01-19T15:24:30+00:00"
  ],
  "abstract": "A search for new heavy scalars with flavour-violating decays in final states with multiple leptons and $b$-tagged jets is presented. The results are interpreted in terms of a general two-Higgs-doublet model involving an additional scalar with couplings to the top-quark and the three up-type quarks ($ρ_{tt}$, $ρ_{tc}$, and $ρ_{tu}$). The targeted signals lead to final states with either a same-sign top-quark pair, three top-quarks, or four top-quarks. The search is based on a data sample of proton-proton collisions at $\\sqrt{s}=13$ TeV recorded with the ATLAS detector during Run 2 of the Large Hadron Collider, corresponding to an integrated luminosity of 139f b$^{-1}$. Events are categorised depending on the multiplicity of light charged leptons (electrons or muons), total lepton charge, and a deep-neural-network-based categorisation to enhance the purity of each of the signals. Masses of an additional scalar boson $m_{H}$ between $200-630$ GeV with couplings $ρ_{tt}=0.4$, $ρ_{tc}=0.2$, and $ρ_{tu}=0.2$ are excluded at 95% confidence level. Additional interpretations are provided in models of $R$-parity violating supersymmetry, motivated by the recent flavour and $(g-2)_μ$ anomalies.",
  "categories": [
    "hep-ex"
  ],
  "primary_category": "hep-ex",
  "doi": "10.1007/JHEP12(2023)081",
  "journal_ref": "JHEP 12 (2023) 081",
  "arxiv_id": "2307.14759",
  "pdf_url": "https://arxiv.org/pdf/2307.14759v2",
  "comment": "66 pages in total, author list starting page 49, 17 figures, 9 tables, published by JHEP. All figures including auxiliary figures are available at http://atlas.web.cern.ch/Atlas/GROUPS/PHYSICS/PAPERS/HDBS-2020-03/",
  "num_versions": null,
  "size_before_bytes": 20210090,
  "size_after_bytes": 11099369
}