{
  "title": "Trends and Topics: Characterizing Echo Chambers' Topological Stability and In-group Attitudes",
  "authors": [
    "Erica Cau",
    "Virginia Morini",
    "Giulio Rossetti"
  ],
  "submission_date": "2023-07-28T15:13:09+00:00",
  "revised_dates": [
    "2024-01-19T13:05:52+00:00"
  ],
  "abstract": "Social Network sites are fertile ground for several polluting phenomena affecting online and offline spaces. Among these phenomena are included echo chambers, closed systems in which the opinions expressed by the people inside are exacerbated for the effect of the repetition, while opposite views are actively excluded. This paper offers a framework to explore, in a platform-independent manner, the topological changes through time of echo chambers, while considering the content posted by users and the attitude conveyed in discussing specific controversial issues.\n  The proposed framework consists of four steps: (i) data collection and annotation of users' ideology regarding a controversial topic, (ii) construction of a dynamic network of interactions, (iii) ECs extraction and analysis of their dynamics, and (iv) topic extraction and valence analysis. The paper then enhances the formalization of the framework by conducting a case study on Reddit threads about sociopolitical issues (gun control, American politics, and minorities discrimination) during the first two years and a half of Donald Trump's presidency.\n  The results unveil that users often stay inside echo chambers over time. Furthermore, in the analyzed discussions, the focus is on controversies related to right-wing parties and specific events in American and Canadian politics. The analysis of the attitude conveyed in the discussions shows a slight inclination toward a more negative or neutral attitude when discussing particularly sensitive issues, such as fascism, school shootings, or police violence.",
  "categories": [
    "cs.SI"
  ],
  "primary_category": "cs.SI",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15610",
  "pdf_url": "https://arxiv.org/pdf/2307.15610v2",
  "comment": "25 pages",
  "num_versions": null,
  "size_before_bytes": 7768398,
  "size_after_bytes": 259444
}