{
  "title": "Memory-Efficient Graph Convolutional Networks for Object Classification and Detection with Event Cameras",
  "authors": [
    "Kamil Jeziorek",
    "Andrea Pinna",
    "Tomasz Kryjak"
  ],
  "submission_date": "2023-07-26T11:44:44+00:00",
  "revised_dates": [],
  "abstract": "Recent advances in event camera research emphasize processing data in its original sparse form, which allows the use of its unique features such as high temporal resolution, high dynamic range, low latency, and resistance to image blur. One promising approach for analyzing event data is through graph convolutional networks (GCNs). However, current research in this domain primarily focuses on optimizing computational costs, neglecting the associated memory costs. In this paper, we consider both factors together in order to achieve satisfying results and relatively low model complexity. For this purpose, we performed a comparative analysis of different graph convolution operations, considering factors such as execution time, the number of trainable model parameters, data format requirements, and training outcomes. Our results show a 450-fold reduction in the number of parameters for the feature extraction module and a 4.5-fold reduction in the size of the data representation while maintaining a classification accuracy of 52.3%, which is 6.3% higher compared to the operation used in state-of-the-art approaches. To further evaluate performance, we implemented the object detection architecture and evaluated its performance on the N-Caltech101 dataset. The results showed an accuracy of 53.7 % mAP@0.5 and reached an execution rate of 82 graphs per second.",
  "categories": [
    "cs.CV",
    "eess.IV"
  ],
  "primary_category": "cs.CV",
  "doi": "10.23919/SPA59660.2023.10274464",
  "journal_ref": "2023 Signal Processing: Algorithms, Architectures, Arrangements, and Applications (SPA), IEEE",
  "arxiv_id": "2307.14124",
  "pdf_url": null,
  "comment": "Accepted for the SPA 2023 conference",
  "num_versions": null,
  "size_before_bytes": 3289063,
  "size_after_bytes": 367271
}