{
  "title": "Renormalisation group analysis of scalar Leptoquark couplings addressing flavour anomalies: emergence of lepton-flavour universality",
  "authors": [
    "Marco Fedele",
    "Felix Wuest",
    "Ulrich Nierste"
  ],
  "submission_date": "2023-07-27T18:00:02+00:00",
  "revised_dates": [
    "2023-11-24T17:55:14+00:00"
  ],
  "abstract": "Leptoquarks with masses between 2 TeV and 50 TeV are commonly invoked to explain deviations between data and Standard-Model (SM) predictions of several observables in the decays $b\\to cτ\\barν$ and $b\\to s \\ell^+\\ell^-$ with $\\ell=e,μ$. While Leptoquarks appear in theories unifying quarks and leptons, the corresponding unification scale $M_{QLU}$ is typically many orders of magnitude above this mass range. We study the case that the mass gap between the electroweak scale and $M_{QLU}$ is only populated by scalar Leptoquarks and SM particles, restricting ourselves to scenarios addressing the mentioned flavour anomalies, and determine the renormalisation-group evolution of Leptoquark couplings to fermions below $M_{QLU}$. In the most general case, we consider three SU(2) triplet Leptoquarks $S_3^\\ell$, $\\ell=e,μ,τ$, which couple quark doublets to the lepton doublet $(ν_\\ell,\\ell^-)$ to address the $b\\to s \\ell^+\\ell^-$ anomalies. In this case, we find a scenario in which the Leptoquark couplings to electrons and muons are driven to the same infrared fixed point, so that lepton flavour universality emerges dynamically. However, the corresponding fixed point for the couplings to taus is necessarily opposite in sign, leading to a unique signature in $b \\to sτ^+τ^-$. For $b\\to cτ\\barν$ we complement these with either an SU(2) singlet $S_1^τ$ or doublet $R_2^τ$ and study further the cases that also these Leptoquarks come in three replicas. The fixed point solutions for the $S_3^\\ell$ couplings explain the $b\\to s \\ell^+\\ell^-$ data for $S_3^{e,μ}$ masses around 10 TeV. $b\\to cτ\\barν$ data can only be fully explained by couplings exceeding their fixed-point values and evolving into Landau poles at high energies, so that one can place an upper bound on $M_{QLU}$ between $10^{8}$ and $10^{11}$ GeV.",
  "categories": [
    "hep-ph",
    "hep-ex"
  ],
  "primary_category": "hep-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15117",
  "pdf_url": "https://arxiv.org/pdf/2307.15117v2",
  "comment": "30 pages, 4 figures. References added, matching journal version",
  "num_versions": null,
  "size_before_bytes": 441372,
  "size_after_bytes": 297227
}