{
  "title": "High-temperature superconductivity with zero-resistance and strange metal behavior in La$_{3}$Ni$_{2}$O$_{7-δ}$",
  "authors": [
    "Yanan Zhang",
    "Dajun Su",
    "Yanen Huang",
    "Zhaoyang Shan",
    "Hualei Sun",
    "Mengwu Huo",
    "Kaixin Ye",
    "Jiawen Zhang",
    "Zihan Yang",
    "Yongkang Xu",
    "Yi Su",
    "Rui Li",
    "Michael Smidman",
    "Meng Wang",
    "Lin Jiao",
    "Huiqiu Yuan"
  ],
  "submission_date": "2023-07-27T12:54:40+00:00",
  "revised_dates": [
    "2024-04-18T10:30:43+00:00"
  ],
  "abstract": "Recently signatures of superconductivity were observed close to 80 K in \\LN\\ under pressure. This discovery positions \\LN\\ as the first bulk nickelate with high-temperature superconductivity, but the lack of zero resistance presents a significant drawback for validating the findings. Here we report pressure measurements up to over 30 GPa using a liquid pressure medium and show that single crystals of \\LNO\\ do exhibit zero resistance. We find that \\LNO\\ remains metallic under applied pressures, suggesting the absence of a metal-insulator transition proximate to the superconductivity. Analysis of the normal state $T$-linear resistance suggests an intricate link between this strange metal behaviour and superconductivity, whereby at high pressures both the linear resistance coefficient and superconducting transition are slowly suppressed by pressure, while at intermediate pressures both the superconductivity and strange metal behaviour appear disrupted, possibly due to a nearby structural instability. The association between strange metal behaviour and high-temperature superconductivity is very much in line with diverse classes of unconventional superconductors, including the cuprates and Fe-based superconductors. Understanding the superconductivity of \\LNO\\ evidently requires further revealing the interplay of strange metal behaviour, superconductivity, as well as possible competing electronic or structural phases.",
  "categories": [
    "cond-mat.supr-con"
  ],
  "primary_category": "cond-mat.supr-con",
  "doi": "10.1038/s41567-024-02515-y",
  "journal_ref": "Nature Physics 20, 1269-1273 (2024)",
  "arxiv_id": "2307.14819",
  "pdf_url": "https://arxiv.org/pdf/2307.14819v2",
  "comment": "28 pages, 4+8 figures, including Extended Data Files",
  "num_versions": null,
  "size_before_bytes": 7507345,
  "size_after_bytes": 90932
}