{
  "title": "Recent astrophysical observations reproduced by a short-range correlated van der Waals-type model?",
  "authors": [
    "E. H. Rodrigues",
    "M. Dutra",
    "O. Lourenço"
  ],
  "submission_date": "2023-07-24T14:14:21+00:00",
  "revised_dates": [],
  "abstract": "We perform an improvement in a van der Waals-type model by including it effects of short-range correlations (SRC). Attractive and repulsive parts of the nucleon-nucleon interaction are assumed to be density-dependent functions, more specifically, we adopt the Carnahan-Starling (CS) method for the latter, and a suitable expression for the former in order to reproduce the structure of the Clausius (C) real gas model. The parametrizations of the resulting model, named as CCS-SRC model, are shown to be capable of reproducing the flow constraint at the high-density regime of symmetric nuclear matter for incompressibility values inside the range of $K_0=(240\\pm 20)$ MeV. In the context of stellar matter, our findings point out a good agreement of the CCS-SRC model with recent astrophysical observational data, namely, mass-radius contours and dimensionless tidal deformability regions and values, coming from gravitational waves data related to the GW170817 and GW190425 events, and from the NASA's Neutron star Interior Composition Explorer (NICER) mission. Furthermore, the values for the symmetry energy slope of the model ($L_0$) are in agreement with a recent range found for this quantity, claimed to be consistent with results reported by the updated lead radius experiment (PREX-2) collaboration. In this case, higher values of $L_0$ are favored, while the opposite scenario does not allow simultaneous compatibility between the model and the astrophysical data.",
  "categories": [
    "nucl-th",
    "astro-ph.HE"
  ],
  "primary_category": "nucl-th",
  "doi": "10.1093/mnras/stad1783",
  "journal_ref": "MNRAS 523, 4859 (2023)",
  "arxiv_id": "2307.12817",
  "pdf_url": null,
  "comment": "9 pages, 11 figures",
  "num_versions": null,
  "size_before_bytes": 1302187,
  "size_after_bytes": 133018
}