{
  "title": "Simulating the spread of COVID-19 with cellular automata: A new approach",
  "authors": [
    "Sourav Chowdhury",
    "Suparna Roychowdhury",
    "Indranath Chaudhuri"
  ],
  "submission_date": "2023-07-27T01:49:27+00:00",
  "revised_dates": [],
  "abstract": "Between the years 2020 to 2022, the world was hit by the pandemic of COVID-19 giving rise to an extremely grave situation. The global economy was badly hurt due to the consequences of various intervention strategies (like social distancing, lockdown) which were applied by different countries to control this pandemic. There are multiple speculations that humanity will again face such pandemics in the future. Thus it is very important to learn and gain knowledge about the spread of such infectious diseases and the various factors which are responsible for it. In this study, we have extended our previous work (Chowdhury et.al., 2022) on the probabilistic cellular automata (CA) model to reproduce the spread of COVID-19 in several countries by modifying its earlier used neighbourhood criteria. This modification gives us the liberty to adopt the effect of different restrictions like lockdown and social distancing in our model. We have done some theoretical analysis for initial infection and simulations to gain insights into our model. We have also studied the data from eight countries for COVID-19 in a window of 876 days and compared it with our model. We have developed a proper framework to fit our model on the data for confirmed cases of COVID-19 and have also re-checked the goodness of the fit with the data of the deceased cases for this pandemic. This model fits well with different peaks of COVID-19 data for all the eight countries and can be possibly generalized for a global prediction.",
  "categories": [
    "physics.soc-ph",
    "nlin.CG",
    "physics.bio-ph"
  ],
  "primary_category": "physics.soc-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14576",
  "pdf_url": "https://arxiv.org/pdf/2307.14576v1",
  "comment": "22 pages, 57 figures",
  "num_versions": null,
  "size_before_bytes": 10813812,
  "size_after_bytes": 1232653
}