{
  "title": "Reliable Synthesis of Large-Area Monolayer WS2 Single Crystals, Films, and Heterostructures with Extraordinary Photoluminescence Induced by Water Intercalation",
  "authors": [
    "Qianhui Zhang",
    "Jianfeng Lu",
    "Ziyu Wang",
    "Zhigao Dai",
    "Yupeng Zhang",
    "Fuzhi Huang",
    "Qiaoliang Bao",
    "Wenhui Duan",
    "Michael S. Fuhrer",
    "Changxi Zheng"
  ],
  "submission_date": "2023-07-31T13:07:52+00:00",
  "revised_dates": [],
  "abstract": "Two-dimensional (2D) transition metal dichalcogenides (TMDs) hold great potential for future low-energy optoelectronics owing to their unique electronic, optical, and mechanical properties. Chemical vapor deposition (CVD) is the technique widely used for the synthesis of large-area TMDs. However, due to high sensitivity to the growth environment, reliable synthesis of monolayer TMDs via CVD remains challenging. Here we develop a controllable CVD process for large-area synthesis of monolayer WS2 crystals, films, and in-plane graphene-WS2 heterostructures by cleaning the reaction tube with hydrochloric acid, sulfuric acid and aqua regia. The concise cleaning process can remove the residual contaminates attached to the CVD reaction tube and crucibles, reducing the nucleation density but enhancing the diffusion length of WS2 species. The photoluminescence (PL) mappings of a WS2 single crystal and film reveal that the extraordinary PL around the edges of a triangular single crystal is induced by ambient water intercalation at the WS2-sapphire interface. The extraordinary PL can be controlled by the choice of substrates with different wettabilities.",
  "categories": [
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": null,
  "journal_ref": "Advanced Optical Materials, 6(12), p.1701347 (2018)",
  "arxiv_id": "2307.16629",
  "pdf_url": "https://arxiv.org/pdf/2307.16629v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 678966,
  "size_after_bytes": 398083
}