{
  "title": "BovineTalk: Machine Learning for Vocalization Analysis of Dairy Cattle under Negative Affective States",
  "authors": [
    "Dinu Gavojdian",
    "Teddy Lazebnik",
    "Madalina Mincu",
    "Ariel Oren",
    "Ioana Nicolae",
    "Anna Zamansky"
  ],
  "submission_date": "2023-07-26T07:07:03+00:00",
  "revised_dates": [],
  "abstract": "There is a critical need to develop and validate non-invasive animal-based indicators of affective states in livestock species, in order to integrate them into on-farm assessment protocols, potentially via the use of precision livestock farming (PLF) tools. One such promising approach is the use of vocal indicators. The acoustic structure of vocalizations and their functions were extensively studied in important livestock species, such as pigs, horses, poultry and goats, yet cattle remain understudied in this context to date. Cows were shown to produce two types vocalizations: low-frequency calls (LF), produced with the mouth closed, or partially closed, for close distance contacts and open mouth emitted high-frequency calls (HF), produced for long distance communication, with the latter considered to be largely associated with negative affective states. Moreover, cattle vocalizations were shown to contain information on individuality across a wide range of contexts, both negative and positive. Nowadays, dairy cows are facing a series of negative challenges and stressors in a typical production cycle, making vocalizations during negative affective states of special interest for research. One contribution of this study is providing the largest to date pre-processed (clean from noises) dataset of lactating adult multiparous dairy cows during negative affective states induced by visual isolation challenges. Here we present two computational frameworks - deep learning based and explainable machine learning based, to classify high and low-frequency cattle calls, and individual cow voice recognition. Our models in these two frameworks reached 87.2% and 89.4% accuracy for LF and HF classification, with 68.9% and 72.5% accuracy rates for the cow individual identification, respectively.",
  "categories": [
    "cs.SD",
    "cs.LG",
    "eess.AS"
  ],
  "primary_category": "cs.SD",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13994",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1366556,
  "size_after_bytes": 450550
}