{
  "title": "Interface Modification for Energy Levels Alignment and Charge Extraction in CsPbI$_3$ Perovskite Solar Cells",
  "authors": [
    "Zafar Iqbal",
    "Fengshuo Zu",
    "Artem Musiienko",
    "Emilio Gutierrez Partida",
    "Hans Kobler",
    "Thomas W. Gries",
    "Gennaro V. Sannino",
    "Laura Canil",
    "Norbert Koch",
    "Martin Stolterfoht",
    "Dieter Neher",
    "Michele Pavone",
    "Ana Belen Munoz-Garcia",
    "Antonio Abate",
    "Qiong Wang"
  ],
  "submission_date": "2023-07-24T23:46:58+00:00",
  "revised_dates": [],
  "abstract": "In perovskite solar cells (PSCs) energy levels alignment and charge extraction at the interfaces are the essential factors directly affecting the device performance. In this work, we present a modified interface between all-inorganic CsPbI$_3$ perovskite and its hole selective contact (Spiro-OMeTAD), realized by a dipole molecule trioctylphosphine oxide (TOPO), to align the energy levels. On a passivated perovskite film, by n-Octyl ammonium Iodide (OAI), we created an upward surface band-bending at the interface by TOPO treatment. This improved interface by the dipole molecule induces a better energy level alignment and enhances the charge extraction of holes from the perovskite layer to the hole transport material. Consequently, a Voc of 1.2 V and high-power conversion efficiency (PCE) of over 19% were achieved for inorganic CsPbI$_3$ perovskite solar cells. Further, to demonstrate the effect of the TOPO dipole molecule, we present a layer-by-layer charge extraction study by transient surface photovoltage technique (trSPV) accomplished by charge transport simulation.",
  "categories": [
    "cond-mat.mtrl-sci",
    "physics.chem-ph"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": "10.1021/acsenergylett.3c01522",
  "journal_ref": "ACS Energy Lett. 2023, 8, 4304",
  "arxiv_id": "2307.13174",
  "pdf_url": null,
  "comment": "20 pages, 4 Figures",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}