{
  "title": "On the mathematics of the circular flow of economic activity with applications to the topic of caring for the vulnerable during pandemics",
  "authors": [
    "Aziz Guergachi",
    "Javid Hakim"
  ],
  "submission_date": "2023-07-27T21:01:52+00:00",
  "revised_dates": [],
  "abstract": "We investigate, at the fundamental level, the questions of `why', `when' and `how' one could or should reach out to poor and vulnerable people to support them in the absence of governmental institutions. We provide a simple and new approach that is rooted in linear algebra and basic graph theory to capture the dynamics of income circulation among economic agents. A new linear algebraic model for income circulation is introduced, based on which we are able to categorize societies as fragmented or cohesive. We show that, in the case of fragmented societies, convincing wealthy agents at the top of the social hierarchy to support the poor and vulnerable will be very difficult. We also highlight how linear-algebraic and simple graph-theoretic methods help explain, from a fundamental point of view, some of the mechanics of class struggle in fragmented societies. Then, we explain intuitively and prove mathematically why, in cohesive societies, wealthy agents at the top of the social hierarchy tend to benefit by supporting the vulnerable in their society. A number of new concepts emerge naturally from our mathematical analysis to describe the level of cohesiveness of the society, the number of degrees of separation in business (as opposed to social) networks, and the level of generosity of the overall economy, which all tend to affect the rate at which the top wealthy class recovers its support money back. In the discussion on future perspectives, the connections between the proposed matrix model and statistical physics concepts are highlighted.",
  "categories": [
    "econ.GN"
  ],
  "primary_category": "econ.GN",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15197",
  "pdf_url": "https://arxiv.org/pdf/2307.15197v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 112375,
  "size_after_bytes": 113159
}