{
  "title": "Fast and Stable Diffusion Inverse Solver with History Gradient Update",
  "authors": [
    "Linchao He",
    "Hongyu Yan",
    "Mengting Luo",
    "Hongjie Wu",
    "Kunming Luo",
    "Wang Wang",
    "Wenchao Du",
    "Hu Chen",
    "Hongyu Yang",
    "Yi Zhang",
    "Jiancheng Lv"
  ],
  "submission_date": "2023-07-22T12:37:34+00:00",
  "revised_dates": [
    "2024-03-12T01:17:44+00:00"
  ],
  "abstract": "Diffusion models have recently been recognised as efficient inverse problem solvers due to their ability to produce high-quality reconstruction results without relying on pairwise data training. Existing diffusion-based solvers utilize Gradient Descent strategy to get a optimal sample solution. However, these solvers only calculate the current gradient and have not utilized any history information of sampling process, thus resulting in unstable optimization progresses and suboptimal solutions. To address this issue, we propose to utilize the history information of the diffusion-based inverse solvers. In this paper, we first prove that, in previous work, using the gradient descent method to optimize the data fidelity term is convergent. Building on this, we introduce the incorporation of historical gradients into this optimization process, termed History Gradient Update (HGU). We also provide theoretical evidence that HGU ensures the convergence of the entire algorithm. It's worth noting that HGU is applicable to both pixel-based and latent-based diffusion model solvers. Experimental results demonstrate that, compared to previous sampling algorithms, sampling algorithms with HGU achieves state-of-the-art results in medical image reconstruction, surpassing even supervised learning methods. Additionally, it achieves competitive results on natural images.",
  "categories": [
    "cs.CV"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12070",
  "pdf_url": null,
  "comment": "17 pages, 7 figures. Provision of theoretical proofs to demonstrate the convergence of the methods",
  "num_versions": null,
  "size_before_bytes": 55177237,
  "size_after_bytes": 272302
}