{
  "title": "Shear viscosity coefficient of magnetized QCD medium with anomalous magnetic moments near chiral phase transition",
  "authors": [
    "Yi-Wei Qiu",
    "Sheng-Qin Feng",
    "Xue-Qiang Zhu"
  ],
  "submission_date": "2023-07-25T01:18:08+00:00",
  "revised_dates": [
    "2023-12-29T01:41:02+00:00"
  ],
  "abstract": "We study the properties of the shear viscosity coefficient of quark matter near the chiral phase transition at finite temperature and chemical potential, and the kinds of high temperature, high density and strong magnetic field background. The strong magnetic field induces anisotropy, that is, the quantization of Landau energy levels in phase space. If the magnetic field is strong enough, it will interfere with significant QCD phenomena, such as the generation of dynamic quark mass, which may affect the transport properties of quark matter. The inclusion of the anomalous magnetic moments of the quarks at finite density into the Nambu-Jona-Lasinio model gives rise to additional spin polarization magnetic effects. It is found that both the ratio $η/s$ of shear viscosity coefficient to entropy and the collision relaxation time $τ$ show similar trend with temperature, both of which reach minima around the critical temperature. The shear viscosity coefficient of the dissipative fluid system can be decomposed into five different components as the strong magnetic field exists. The influences of the order of chiral phase transition and the critical end point on dissipative phenomena in such a magnetized medium are quantitatively investigated. It is found that $η_{1}$, $η_{2}$, $η_{3}$, and $η_{4}$ all increase with temperature. For first-order phase transitions, $η_{1}$, $η_{2}$, $η_{3}$, and $η_{4}$ exhibit discontinuous characteristics.",
  "categories": [
    "hep-ph"
  ],
  "primary_category": "hep-ph",
  "doi": null,
  "journal_ref": "Physical Review D 108, 116022 (2023)",
  "arxiv_id": "2307.13193",
  "pdf_url": null,
  "comment": "23 pages, 10 figures",
  "num_versions": null,
  "size_before_bytes": 565946891,
  "size_after_bytes": 293649
}