{
  "title": "HiHGNN: Accelerating HGNNs through Parallelism and Data Reusability Exploitation",
  "authors": [
    "Runzhen Xue",
    "Dengke Han",
    "Mingyu Yan",
    "Mo Zou",
    "Xiaocheng Yang",
    "Duo Wang",
    "Wenming Li",
    "Zhimin Tang",
    "John Kim",
    "Xiaochun Ye",
    "Dongrui Fan"
  ],
  "submission_date": "2023-07-24T13:07:22+00:00",
  "revised_dates": [
    "2024-04-29T00:17:58+00:00"
  ],
  "abstract": "Heterogeneous graph neural networks (HGNNs) have emerged as powerful algorithms for processing heterogeneous graphs (HetGs), widely used in many critical fields. To capture both structural and semantic information in HetGs, HGNNs first aggregate the neighboring feature vectors for each vertex in each semantic graph and then fuse the aggregated results across all semantic graphs for each vertex. Unfortunately, existing graph neural network accelerators are ill-suited to accelerate HGNNs. This is because they fail to efficiently tackle the specific execution patterns and exploit the high-degree parallelism as well as data reusability inside and across the processing of semantic graphs in HGNNs.\n  In this work, we first quantitatively characterize a set of representative HGNN models on GPU to disclose the execution bound of each stage, inter-semantic-graph parallelism, and inter-semantic-graph data reusability in HGNNs. Guided by our findings, we propose a high-performance HGNN accelerator, HiHGNN, to alleviate the execution bound and exploit the newfound parallelism and data reusability in HGNNs. Specifically, we first propose a bound-aware stage-fusion methodology that tailors to HGNN acceleration, to fuse and pipeline the execution stages being aware of their execution bounds. Second, we design an independency-aware parallel execution design to exploit the inter-semantic-graph parallelism. Finally, we present a similarity-aware execution scheduling to exploit the inter-semantic-graph data reusability. Compared to the state-of-the-art software framework running on NVIDIA GPU T4 and GPU A100, HiHGNN respectively achieves an average 41.5$\\times$ and 8.6$\\times$ speedup as well as 106$\\times$ and 73$\\times$ energy efficiency with quarter the memory bandwidth of GPU A100.",
  "categories": [
    "cs.AR"
  ],
  "primary_category": "cs.AR",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12765",
  "pdf_url": null,
  "comment": "16 pages, 17 figures; To appear in IEEE TPDS 2024",
  "num_versions": null,
  "size_before_bytes": 18396076,
  "size_after_bytes": 1032433
}