{
  "title": "Hamiltonian formalism for Bose excitations in a plasma with a non-Abelian interaction I: plasmon -- hard particle scattering",
  "authors": [
    "Yu. A. Markov",
    "M. A. Markova",
    "N. Yu. Markov"
  ],
  "submission_date": "2023-07-28T08:37:31+00:00",
  "revised_dates": [
    "2024-07-15T09:32:14+00:00"
  ],
  "abstract": "Hamiltonian theory for collective longitudinally polarized gluon excitations (plasmons) interacting with classical high-energy test color-charged particle propagating through a high-temperature gluon plasma is developed. A generalization of the Lie-Poisson bracket to the case of a continuous medium involving bosonic normal field variable $a^{\\hspace{0.03cm}a}_{\\bf k}$ and a non-Abelian color charge $Q^{\\hspace{0.03cm}a}$ is performed and the corresponding Hamilton equations are presented. The canonical transformations including simultaneously both bosonic degrees of freedom of the soft collective excitations and degree of freedom of hard test particle connecting with its color charge in the hot gluon plasma are written out. A complete system of the canonicity conditions for these transformations is derived. The notion of the plasmon number density ${\\mathcal N}^{\\hspace{0.03cm}aa^{\\prime}_{\\phantom{1}}\\!}_{\\bf k}$, which is a nontrivial matrix in the color space, is introduced. An explicit form of the effective fourth-order Hamiltonian describing the elastic scattering of a plasmon off a hard color particle is found and the self-consistent system of Boltzmann-type kinetic equations taking into account the time evolution of the mean value of the color charge of the hard particle is obtained. On the basis of these equations, a model problem of the interaction of two infinitely narrow wave packets is considered. A system of nonlinear first-order ordinary differential equations defining the dynamics of the interaction of the colorless $N^{\\hspace{0.01cm}l}_{\\bf k}$ and color $W^{\\hspace{0.01cm}l}_{\\bf k}$ components of the plasmon number density is derived. The problem of determining the third- and fourth-order coefficient functions entering into the canonical transformations of the original bosonic variable $a^{\\hspace{0.03cm}a}_{\\bf k}$ and color charge $Q^{a}$ is discussed.",
  "categories": [
    "hep-th",
    "hep-ph"
  ],
  "primary_category": "hep-th",
  "doi": "10.1016/j.nuclphysa.2024.122903",
  "journal_ref": "Nucl. Phys. A 1048 (2024) 122903(38)",
  "arxiv_id": "2307.15390",
  "pdf_url": "https://arxiv.org/pdf/2307.15390v2",
  "comment": "60 pages, 5 figures, the original text is substantially revised, references added, the version published in Nucl.Phys.A",
  "num_versions": null,
  "size_before_bytes": 809836,
  "size_after_bytes": 687508
}