{
  "title": "Position as an independent variable and the emergence of the $1/2$-time fractional derivative in quantum mechanics",
  "authors": [
    "Marcus W Beims",
    "Arlans JS Lara"
  ],
  "submission_date": "2023-07-25T19:57:23+00:00",
  "revised_dates": [],
  "abstract": "Using the position as an independent variable, and time as the dependent variable, we derive the function ${\\cal P}^{(\\pm)}$, which generates the space evolution under the potential ${\\cal V}(q)$ and Hamiltonian ${\\cal H}$. Canonically conjugated variables are the time and minus the Hamiltonian. While the classical dynamics do not change, the corresponding quantum operator naturally leads to a $1/2-$fractional time evolution, consistent with a recently proposed spacetime symmetric formalism of quantum mechanics. Using Dirac's procedure, separation of variables is possible, and while the coupled position-independent Dirac equations depend on the $1/2$-fractional derivative, the coupled time-independent Dirac equations (TIDE) lead to positive and negative shifts in the potential, proportional to the force. Both equations couple the ($\\pm$) solutions of ${\\cal \\hat P}^{(\\pm)}$ and the kinetic energy ${\\cal K}_0$ is the coupling strength. We obtain a pair of coupled states for systems with finite forces. The potential shifts for the harmonic oscillator (HO) are $\\pm\\hbarω/2$, and the corresponding pair of states are coupled for ${\\cal K}_0\\ne 0$. No time evolution is present for ${\\cal K}_0=0$, and the ground state with energy $\\hbarω/2$ is stable. For ${\\cal K}_0>0$, the ground state becomes coupled to the state with energy $-\\hbarω/2$, and \\textit{this coupling} allows to describe higher excited states. Energy quantization of the HO leads to quantization of ${\\cal K}_0=k\\hbarω$ ($k=1,2,\\ldots$). For the one-dimensional Hydrogen atom, the potential shifts become imaginary and position-dependent. Decoupled case ${\\cal K}_0=0$ leads to plane-waves-like solutions at the threshold. Above the threshold, we obtain a plane-wave-like solution, and for the bounded states the wave-function becomes similar to the exact solutions but squeezed closer to the nucleus.",
  "categories": [
    "quant-ph"
  ],
  "primary_category": "quant-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15081",
  "pdf_url": "https://arxiv.org/pdf/2307.15081v1",
  "comment": "11 pages, 6 figures",
  "num_versions": null,
  "size_before_bytes": 398357,
  "size_after_bytes": 83825
}