{
  "title": "Contributions to the optical linewidth of shallow donor-bound excitonic transition in ZnO",
  "authors": [
    "Vasileios Niaouris",
    "Samuel H. D'Ambrosia",
    "Christian Zimmermann",
    "Xingyi Wang",
    "Ethan R. Hansen",
    "Michael Titze",
    "Edward S. Bielejec",
    "Kai-Mei C. Fu"
  ],
  "submission_date": "2023-07-24T07:21:35+00:00",
  "revised_dates": [
    "2024-01-19T01:15:29+00:00"
  ],
  "abstract": "Neutral shallow donors in zinc oxide (ZnO) are spin qubits with optical access via the donor-bound exciton. This spin-photon interface enables applications in quantum networking, memories and transduction. Essential optical parameters which impact the spin-photon interface include radiative lifetime, optical inhomogeneous and homogeneous linewidth and optical depth. We study the donor-bound exciton optical linewidth properties of Al, Ga, and In donors in single-crystal ZnO. The ensemble photoluminescence linewidth ranges from 4-11 GHz, less than two orders of magnitude larger than the expected lifetime-limited linewidth. The ensemble linewidth remains narrow in absorption through samples with an estimated optical depth up to several hundred. The primary thermal relaxation mechanism is identified and found to have a negligible contribution to the total linewidth at 2 K. We find that inhomogeneous broadening due to the disordered isotopic environment in natural ZnO is significant, contributing 2 GHz. Two-laser spectral hole burning measurements, indicate the dominant mechanism, however, is homogeneous. Despite this broadening, the high homogeneity, large optical depth and potential for isotope purification indicate that the optical properties of the ZnO donor-bound exciton are promising for a wide range of quantum technologies and motivate a need to improve the isotope and chemical purity of ZnO for quantum technologies.",
  "categories": [
    "quant-ph",
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "quant-ph",
  "doi": "10.1364/OPTICAQ.501568",
  "journal_ref": "Optica Quantum 2, 7-13 (2024)",
  "arxiv_id": "2307.12566",
  "pdf_url": null,
  "comment": "V. Niaouris and S. H. D'Ambrosia contributed equally to this work, 24 pages, 12 figures",
  "num_versions": null,
  "size_before_bytes": 5159336,
  "size_after_bytes": 1648453
}