{
  "title": "A model of failed solar eruption initiated and destructed by magnetic reconnection",
  "authors": [
    "Chaowei Jiang",
    "Aiying Duan",
    "Peng Zou",
    "Zhenjun Zhou",
    "Xinkai Bian",
    "Xueshang Feng",
    "Pingbing Zuo",
    "Yi Wang"
  ],
  "submission_date": "2023-07-29T00:34:30+00:00",
  "revised_dates": [],
  "abstract": "Solar eruptions are explosive disruption of coronal magnetic fields, and often launch coronal mass ejections into the interplanetary space. Intriguingly, many solar eruptions fail to escape from the Sun, and the prevailing theory for such failed eruption is based on ideal MHD instabilities of magnetic flux rope (MFR); that is, a MFR runs into kink instability and erupts but cannot reach the height for torus instability. Here, based on numerical MHD simulation, we present a new model of failed eruption in which magnetic reconnection plays a leading role in the initiation and failure of the eruption. Initially, a core bipolar potential field is embedded in a background bipolar field, and by applying shearing and converging motions to the core field, a current sheet is formed within the core field. Then, tether-cutting reconnection is triggered at the current sheet, first slow for a while and becoming fast, driving an erupting MFR. Eventually, the rise of MFR is halted by the downward magnetic tension force of the overlying field, although the MFR apex has well exceeded the critical height of torus instability. More importantly, during the rise of the MFR, it experiences a significant rotation around the vertical axis (with a direction contrary to that predicted by kink instability), rendering the field direction at the rope apex almost inverse to the overlying field. As a result, a strong current sheet is formed between the MFR and the overlying flux, and reconnection occurring in this current sheet ruins completely the MFR.",
  "categories": [
    "astro-ph.SR",
    "physics.plasm-ph",
    "physics.space-ph"
  ],
  "primary_category": "astro-ph.SR",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15847",
  "pdf_url": "https://arxiv.org/pdf/2307.15847v1",
  "comment": "Submitted to MNRAS",
  "num_versions": null,
  "size_before_bytes": 4180720,
  "size_after_bytes": 152851
}