{
  "title": "Causal Localizations of the Massive Scalar Boson",
  "authors": [
    "Domenico P. L. Castrigiano"
  ],
  "submission_date": "2023-07-24T15:31:42+00:00",
  "revised_dates": [
    "2024-01-10T01:43:44+00:00"
  ],
  "abstract": "The positive operator valued localizations (POL) of a massive scalar boson are constructed and a characterization and structural analyses of their kernels are obtained. In the focus of this article are the causal features of the POL. There is the well-known causal time evolution (CT). Recently a POL by Terno and Moretti, which is a kinematical deformation of the Newton-Wigner localization (NWL) and belongs to the here fully analyzed class of finite POL, is shown by V.Moretti to comply with CT. A further POL with CT treated here, which is in the same class, is the only one being the trace of a projection valued localization (like NWL) with CT. - Causality imposes a condition CC, which implies CT but is more restrictive than CT. Extending Moretti's method it is shown rigorously that the POL of the class introduced by Petzold et al. satisfy CC. Their kernels are called causal kernels, of which a rather detailed description is achieved. One the way there the case of one spatial dimension is solved completely. This case is instructive. In particular it directed Petzold et al. and subsequently Henning, Wolf to find their basic one-parameter family $K_r$ of causal kernels. The causal kernels are, up to a fixed energy factor, normalized positive definite Lorentz invariant kernels. A full characterization of the latter is attained due to their close relation to the zonal spherical functions on the Lorentz group. Finally these considerations discharge into the main result that $K_{3/2}$ is the absolute maximum, viz. $|K|\\le K_{3/2}$ for all causal kernels $K$.",
  "categories": [
    "math-ph"
  ],
  "primary_category": "math-ph",
  "doi": "10.1007/s11005-023-01746-z",
  "journal_ref": "Lett. Math. Phys. 114, 2 (2024)",
  "arxiv_id": "2307.12887",
  "pdf_url": null,
  "comment": "Keywords: Positive operator-valued localization - Causality - Causal kernel - Conserved covariant probability current",
  "num_versions": null,
  "size_before_bytes": 324359,
  "size_after_bytes": 328504
}