{
  "title": "Properties of binary systems in a one-dimensional approximation",
  "authors": [
    "Ali Pourmand",
    "Natalia Ivanova"
  ],
  "submission_date": "2023-07-25T15:47:29+00:00",
  "revised_dates": [],
  "abstract": "Evolutionary calculations for stars in close binary systems are in high demand to obtain better constraints on gravitational wave source progenitors, understand transient events from stellar interactions, and more. Modern one-dimensional stellar codes make use of the Roche lobe radius $R_{\\rm L}$ concept in order to treat stars in binary systems. If the stellar companion is approaching its $R_{\\rm L}$, mass transfer treatment is initiated. However, the effective acceleration also affects the evolution of a star in a close binary system. This is different from the gravity inside a single star, whether that single star is rotating or not. Here, we present numerically obtained tables of properties of stars in a binary system as a function of the effective potential: volume-equivalent radii of the equipotential surfaces, effective accelerations and the inverse effective accelerations averaged over the same equipotential surfaces, and the properties of the L1 plane cross-sections. The tables are obtained for binaries where the ratios of the primary star mass to the companion star mass are from $10^{-6}$ to $10^5$ and include equipotential surfaces up to the star's outer Lagrangian point. We describe the numerical methods used to obtain these quantities and report how we verified the numerical results. We also describe and verify the method to obtain the effective acceleration for non-point mass distributions. We supply a sample code showing how to use our tables to get the average effective accelerations in one-dimensional stellar codes.",
  "categories": [
    "astro-ph.SR"
  ],
  "primary_category": "astro-ph.SR",
  "doi": "10.3847/1538-4357/acd4c1",
  "journal_ref": "ApJ 2023, 952, 126",
  "arxiv_id": "2307.13589",
  "pdf_url": null,
  "comment": "18 pages. Published in ApJ 2023,952, 126. Data and code are available at https://zenodo.org/record/7576785",
  "num_versions": null,
  "size_before_bytes": 10836914,
  "size_after_bytes": 355317
}