{
  "title": "Staging E-Commerce Products for Online Advertising using Retrieval Assisted Image Generation",
  "authors": [
    "Yueh-Ning Ku",
    "Mikhail Kuznetsov",
    "Shaunak Mishra",
    "Paloma de Juan"
  ],
  "submission_date": "2023-07-28T06:04:46+00:00",
  "revised_dates": [],
  "abstract": "Online ads showing e-commerce products typically rely on the product images in a catalog sent to the advertising platform by an e-commerce platform. In the broader ads industry such ads are called dynamic product ads (DPA). It is common for DPA catalogs to be in the scale of millions (corresponding to the scale of products which can be bought from the e-commerce platform). However, not all product images in the catalog may be appealing when directly re-purposed as an ad image, and this may lead to lower click-through rates (CTRs). In particular, products just placed against a solid background may not be as enticing and realistic as a product staged in a natural environment. To address such shortcomings of DPA images at scale, we propose a generative adversarial network (GAN) based approach to generate staged backgrounds for un-staged product images. Generating the entire staged background is a challenging task susceptible to hallucinations. To get around this, we introduce a simpler approach called copy-paste staging using retrieval assisted GANs. In copy paste staging, we first retrieve (from the catalog) staged products similar to the un-staged input product, and then copy-paste the background of the retrieved product in the input image. A GAN based in-painting model is used to fill the holes left after this copy-paste operation. We show the efficacy of our copy-paste staging method via offline metrics, and human evaluation. In addition, we show how our staging approach can enable animations of moving products leading to a video ad from a product image.",
  "categories": [
    "cs.CV",
    "cs.IR",
    "cs.LG"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15326",
  "pdf_url": "https://arxiv.org/pdf/2307.15326v1",
  "comment": "Accepted for publication in AdKDD 2023",
  "num_versions": null,
  "size_before_bytes": 30354019,
  "size_after_bytes": 414945
}