{
  "title": "The Impact of Genomic Variation on Function (IGVF) Consortium",
  "authors": [
    "IGVF Consortium"
  ],
  "submission_date": "2023-07-24T20:51:25+00:00",
  "revised_dates": [],
  "abstract": "Our genomes influence nearly every aspect of human biology from molecular and cellular functions to phenotypes in health and disease. Human genetics studies have now associated hundreds of thousands of differences in our DNA sequence (\"genomic variation\") with disease risk and other phenotypes, many of which could reveal novel mechanisms of human biology and uncover the basis of genetic predispositions to diseases, thereby guiding the development of new diagnostics and therapeutics. Yet, understanding how genomic variation alters genome function to influence phenotype has proven challenging. To unlock these insights, we need a systematic and comprehensive catalog of genome function and the molecular and cellular effects of genomic variants. Toward this goal, the Impact of Genomic Variation on Function (IGVF) Consortium will combine approaches in single-cell mapping, genomic perturbations, and predictive modeling to investigate the relationships among genomic variation, genome function, and phenotypes. Through systematic comparisons and benchmarking of experimental and computational methods, we aim to create maps across hundreds of cell types and states describing how coding variants alter protein activity, how noncoding variants change the regulation of gene expression, and how both coding and noncoding variants may connect through gene regulatory and protein interaction networks. These experimental data, computational predictions, and accompanying standards and pipelines will be integrated into an open resource that will catalyze community efforts to explore genome function and the impact of genetic variation on human biology and disease across populations.",
  "categories": [
    "q-bio.OT"
  ],
  "primary_category": "q-bio.OT",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13708",
  "pdf_url": null,
  "comment": "Draft Marker Paper for the Impact of Genomic Variation on Function (IGVF) Consortium (https://www.igvf.org). Detailed author list (members of the IGVF Consortium) is included in the manuscript",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}