{
  "title": "Improving frequency response with synthetic damping available from fleets of distributed energy resources",
  "authors": [
    "Hani Mavalizadeh",
    "Luis A. Duffaut Espinosa",
    "Mads R. Almassalkhi"
  ],
  "submission_date": "2023-07-26T20:58:10+00:00",
  "revised_dates": [],
  "abstract": "With the increasing use of renewable generation in power systems, responsive resources will be necessary to support primary frequency control in future low-inertia/under-damped power systems. Flexible loads can provide fast-frequency response services if coordinated effectively. However, practical implementations of such synthetic damping services require both effective local sensing and control at the device level and an ability to accurately estimate online and predict the available synthetic damping from a fleet. In addition, the inherent trade-off between a fleet being available for fast frequency response while providing other ancillary services needs to be characterized. In this context, the manuscript presents a novel, fully decentralized, packet-based controller for diverse flexible loads that dynamically prioritizes and interrupts loads to engender synthetic damping suitable for primary frequency control. Moreover, the packet-based control methodology is shown to accurately characterize the available synthetic damping in real-time, which is useful to aggregators and system operators. Furthermore, spectral analysis of historical frequency regulation data is used to produce a probabilistic bound on the expected available synthetic damping for primary frequency control from a fleet and the trade-off from concurrently providing secondary frequency control services. Finally, numerical simulation on IEEE test networks demonstrates the effectiveness of the proposed methodology.",
  "categories": [
    "eess.SY"
  ],
  "primary_category": "eess.SY",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14498",
  "pdf_url": null,
  "comment": "Submitted to IEEE Transactions on Power systems",
  "num_versions": null,
  "size_before_bytes": 1949368,
  "size_after_bytes": 471789
}