{
  "title": "Quantitative multiscale operator-type approximations for asymptotically degenerating spectral problems",
  "authors": [
    "Shane Cooper",
    "Ilia Kamotski",
    "Valery P. Smyshlyaev"
  ],
  "submission_date": "2023-07-24T22:36:41+00:00",
  "revised_dates": [
    "2023-10-03T00:59:18+00:00",
    "2025-01-22T01:08:13+00:00",
    "2025-08-27T00:57:18+00:00"
  ],
  "abstract": "We study an abstract family of asymptotically degenerating variational problems. Those are natural generalisations of families of problems emerging upon application of a rescaled Floquet-Bloch-Gelfand transform to resolvent problems for high-contrast elliptic PDEs with highly oscillatory periodic coefficients. An asymptotic analysis of these models leads us to a hierarchy of approximation results with uniform operator-type error estimates under various assumptions, satisfied by specific examples. We provide approximations for the resolvents in terms of a certain `bivariate' operator which appears an abstract generalisation of the two-scale limit operators for highly oscillatory high-contrast PDEs. The resulting approximating self-adjoint operator, providing tight operator error estimates, is the bivariate operator sandwiched by a connecting operator which for a broad class of periodic problems specialises to a new two-scale version of the classical Whittaker-Shannon interpolation. An explicit description of the limit spectrum in the abstract setting is provided, and new tight error estimates on the distance between the original and limit spectra are established. Our generic approach allows us to readily consider a wide class of asymptotically degenerating problems including but also going beyond high-contrast highly oscillatory PDEs. The obtained results are illustrated by various examples.",
  "categories": [
    "math.AP",
    "math.SP"
  ],
  "primary_category": "math.AP",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13151",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 2484014,
  "size_after_bytes": 2521325
}