{
  "title": "Relaxations and Exact Solutions to Quantum Max Cut via the Algebraic Structure of Swap Operators",
  "authors": [
    "Adam Bene Watts",
    "Anirban Chowdhury",
    "Aidan Epperly",
    "J. William Helton",
    "Igor Klep"
  ],
  "submission_date": "2023-07-28T16:45:16+00:00",
  "revised_dates": [
    "2023-08-08T23:34:01+00:00",
    "2024-04-24T23:12:22+00:00"
  ],
  "abstract": "The Quantum Max Cut (QMC) problem has emerged as a test-problem for designing approximation algorithms for local Hamiltonian problems. In this paper we attack this problem using the algebraic structure of QMC, in particular the relationship between the quantum max cut Hamiltonian and the representation theory of the symmetric group.\n  The first major contribution of this paper is an extension of non-commutative Sum of Squares (ncSoS) optimization techniques to give a new hierarchy of relaxations to Quantum Max Cut. The hierarchy we present is based on optimizations over polynomials in the qubit swap operators. This is in contrast to the \"standard\" quantum Lasserre Hierarchy, which is based on polynomials expressed in terms of the Pauli matrices. To prove correctness of this hierarchy, we exploit a finite presentation of the algebra generated by the qubit swap operators. This presentation allows for the use of computer algebraic techniques to manipulate and simplify polynomials written in terms of the swap operators, and may be of independent interest. Surprisingly, we find that level-2 of this new hierarchy is numerically exact (up to tolerance 10^(-7)) on all QMC instances with uniform edge weights on graphs with at most 8 vertices.\n  The second major contribution of this paper is a polynomial-time algorithm that computes (in exact arithmetic) the maximum eigenvalue of the QMC Hamiltonian for certain graphs, including graphs that can be \"decomposed\" as a signed combination of cliques. A special case of the latter are complete bipartite graphs with uniform edge-weights, for which exact solutions are known from the work of Lieb and Mattis. Our methods, which use representation theory of the symmetric group, can be seen as a generalization of the Lieb-Mattis result.",
  "categories": [
    "quant-ph",
    "math-ph"
  ],
  "primary_category": "quant-ph",
  "doi": "10.22331/q-2024-05-22-1352",
  "journal_ref": "Quantum 8, 1352 (2024)",
  "arxiv_id": "2307.15661",
  "pdf_url": "https://arxiv.org/pdf/2307.15661v3",
  "comment": "88 pages, 6 figures",
  "num_versions": null,
  "size_before_bytes": 3258631,
  "size_after_bytes": 1131374
}