{
  "title": "Emergent magnetism with continuous control in the ultrahigh conductivity layered oxide PdCoO2",
  "authors": [
    "Matthew Brahlek",
    "Alessandro R. Mazza",
    "Abdulgani Annaberdiyev",
    "Michael Chilcote",
    "Gaurab Rimal",
    "Gábor B. Halász",
    "Anh Pham",
    "Yun-Yi Pai",
    "Jaron T. Krogel",
    "Jason Lapano",
    "Benjamin J. Lawrie",
    "Gyula Eres",
    "Jessica McChesney",
    "Thomas Prokscha",
    "Andreas Suter",
    "Seongshik Oh",
    "John W. Freeland",
    "Yue Cao",
    "Jason S. Gardner",
    "Zaher Salman",
    "Robert G. Moore",
    "Panchapakesan Ganesh",
    "T. Zac Ward"
  ],
  "submission_date": "2023-07-25T13:32:26+00:00",
  "revised_dates": [],
  "abstract": "The current challenge to realizing continuously tunable magnetism lies in our inability to systematically change properties such as valence, spin, and orbital degrees of freedom as well as crystallographic geometry. Here, we demonstrate that ferromagnetism can be externally turned on with the application of low-energy helium implantation and subsequently erased and returned to the pristine state via annealing. This high level of continuous control is made possible by targeting magnetic metastability in the ultra-high conductivity, non-magnetic layered oxide PdCoO2 where local lattice distortions generated by helium implantation induce emergence of a net moment on the surrounding transition metal octahedral sites. These highly-localized moments communicate through the itinerant metal states which triggers the onset of percolated long-range ferromagnetism. The ability to continuously tune competing interactions enables tailoring precise magnetic and magnetotransport responses in an ultra-high conductivity film and will be critical to applications across spintronics.",
  "categories": [
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": "10.1021/acs.nanolett.3c01065",
  "journal_ref": "Nano Letters 23, 16, 7279-7287 (2023)",
  "arxiv_id": "2307.13490",
  "pdf_url": null,
  "comment": "https://pubs.acs.org/doi/abs/10.1021/acs.nanolett.3c01065",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}