{
  "title": "Maximal intrinsic randomness of a quantum state",
  "authors": [
    "Shuyang Meng",
    "Fionnuala Curran",
    "Gabriel Senno",
    "Victoria J. Wright",
    "Máté Farkas",
    "Valerio Scarani",
    "Antonio Acín"
  ],
  "submission_date": "2023-07-28T17:58:13+00:00",
  "revised_dates": [
    "2024-07-11T17:16:35+00:00"
  ],
  "abstract": "One of the most counterintuitive aspects of quantum theory is its claim that there is 'intrinsic' randomness in the physical world. Quantum information science has greatly progressed in the study of intrinsic, or secret, quantum randomness in the past decade. With much emphasis on device-independent and semi-device-independent bounds, one of the most basic questions has escaped attention: how much intrinsic randomness can be extracted from a given state $ρ$, and what measurements achieve this bound? We answer this question for three different randomness quantifiers: the conditional min-entropy, the conditional von Neumann entropy and the conditional max-entropy. For the first, we solve the min-max problem of finding the projective measurement that minimises the maximal guessing probability of an eavesdropper. The result is that one can guarantee an amount of conditional min-entropy $H^*_{\\textrm{min}}=-\\log_2 P_{\\textrm{guess}}^{*}(ρ)$ with $P_{\\textrm{guess}}^{*}(ρ)=\\frac{1}{d}(\\textrm{tr} \\sqrtρ)^2$ by performing suitable projective measurements. For the conditional von Neumann entropy, we find that the maximal value is $H^{*}= \\log_{2}d-S(ρ)$, with $S(ρ)$ the von Neumann entropy of $ρ$, while for the conditional max-entropy, we find the maximal value $H^{*}_\\textrm{max}=\\log_{2}d + \\log_{2}λ_{\\textrm{max}}(ρ)$, where $λ_{\\textrm{max}}(ρ)$ is the largest eigenvalue of $ρ$. Optimal values for $H^{*}_{\\textrm{min}}$, $H^{*}$ and $H^{*}_\\textrm{max}$ are achieved by measuring in any basis that is unbiased to the eigenbasis of $ρ$, as well as by other, less intuitive, measurements.",
  "categories": [
    "quant-ph"
  ],
  "primary_category": "quant-ph",
  "doi": "10.1103/PhysRevA.110.L010403",
  "journal_ref": "PhysRevA. 110 L010403 (2024)",
  "arxiv_id": "2307.15708",
  "pdf_url": "https://arxiv.org/pdf/2307.15708v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 174072,
  "size_after_bytes": 175970
}