{
  "title": "Star Cluster Classification using Deep Transfer Learning with PHANGS-HST",
  "authors": [
    "Stephen Hannon",
    "Bradley C. Whitmore",
    "Janice C. Lee",
    "David A. Thilker",
    "Sinan Deger",
    "E. A. Huerta",
    "Wei Wei",
    "Bahram Mobasher",
    "Ralf Klessen",
    "Mederic Boquien",
    "Daniel A. Dale",
    "Melanie Chevance",
    "Kathryn Grasha",
    "Patricia Sanchez-Blazquez",
    "Thomas Williams",
    "Fabian Scheuermann",
    "Brent Groves",
    "Hwihyun Kim",
    "J. M. Diederick Kruijssen",
    "the PHANGS-HST Team"
  ],
  "submission_date": "2023-07-27T18:11:46+00:00",
  "revised_dates": [],
  "abstract": "Currently available star cluster catalogues from HST imaging of nearby galaxies heavily rely on visual inspection and classification of candidate clusters. The time-consuming nature of this process has limited the production of reliable catalogues and thus also post-observation analysis. To address this problem, deep transfer learning has recently been used to create neural network models which accurately classify star cluster morphologies at production scale for nearby spiral galaxies (D < 20 Mpc). Here, we use HST UV-optical imaging of over 20,000 sources in 23 galaxies from the Physics at High Angular Resolution in Nearby GalaxieS (PHANGS) survey to train and evaluate two new sets of models: i) distance-dependent models, based on cluster candidates binned by galaxy distance (9-12 Mpc, 14-18 Mpc, 18-24 Mpc), and ii) distance-independent models, based on the combined sample of candidates from all galaxies. We find that the overall accuracy of both sets of models is comparable to previous automated star cluster classification studies (~60-80 per cent) and show improvement by a factor of two in classifying asymmetric and multi-peaked clusters from PHANGS-HST. Somewhat surprisingly, while we observe a weak negative correlation between model accuracy and galactic distance, we find that training separate models for the three distance bins does not significantly improve classification accuracy. We also evaluate model accuracy as a function of cluster properties such as brightness, colour, and SED-fit age. Based on the success of these experiments, our models will provide classifications for the full set of PHANGS-HST candidate clusters (N ~ 200,000) for public release.",
  "categories": [
    "astro-ph.GA",
    "astro-ph.SR"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.1093/mnras/stad2238",
  "journal_ref": null,
  "arxiv_id": "2307.15133",
  "pdf_url": "https://arxiv.org/pdf/2307.15133v1",
  "comment": "16 pages, 10 figures",
  "num_versions": null,
  "size_before_bytes": 8700907,
  "size_after_bytes": 461095
}