{
  "title": "External Reasoning: Towards Multi-Large-Language-Models Interchangeable Assistance with Human Feedback",
  "authors": [
    "Akide Liu"
  ],
  "submission_date": "2023-07-05T17:05:32+00:00",
  "revised_dates": [
    "2023-08-29T00:19:23+00:00"
  ],
  "abstract": "Memory is identified as a crucial human faculty that allows for the retention of visual and linguistic information within the hippocampus and neurons in the brain, which can subsequently be retrieved to address real-world challenges that arise through a lifetime of learning. The resolution of complex AI tasks through the application of acquired knowledge represents a stride toward the realization of artificial general intelligence. However, despite the prevalence of Large Language Models (LLMs) like GPT-3.5 and GPT-4 \\cite{brown2020language, leiter2023chatgpt, zaitsu2023distinguishing, OpenAI2023GPT4TR} , which have displayed remarkable capabilities in language comprehension, generation, interaction, and reasoning, they are inhibited by constraints on context length that preclude the processing of extensive, continually evolving knowledge bases. This paper proposes that LLMs could be augmented through the selective integration of knowledge from external repositories, and in doing so, introduces a novel methodology for External Reasoning, exemplified by ChatPDF. Central to this approach is the establishment of a tiered policy for \\textbf{External Reasoning based on Multiple LLM Interchange Assistance} in \\cref{fig:overall}, where the level of support rendered is modulated across entry, intermediate, and advanced tiers based on the complexity of the query, with adjustments made in response to human feedback. A comprehensive evaluation of this methodology is conducted using multiple LLMs and the results indicate state-of-the-art performance in \\cref{comparison} , surpassing existing solutions including ChatPDF.com. Moreover, the paper emphasizes that this approach is more efficient compared to the direct processing of full text by LLMs. The source code is publicly available at: \\url{https://github.com/AkideLiu/ANLP}.",
  "categories": [
    "cs.CL",
    "cs.AI",
    "cs.LG"
  ],
  "primary_category": "cs.CL",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12057",
  "pdf_url": null,
  "comment": "technical report, add code link. arXiv admin note: text overlap with arXiv:2305.11206 by other authors",
  "num_versions": null,
  "size_before_bytes": 3045381,
  "size_after_bytes": 362624
}