{
  "title": "Stability of particle trajectories of scalar conservation laws and applications in Bayesian inverse problems",
  "authors": [
    "Masoumeh Dashti",
    "Duc-Lam Duong"
  ],
  "submission_date": "2023-07-26T22:55:32+00:00",
  "revised_dates": [],
  "abstract": "We consider the scalar conservation law in one space dimension with a genuinely nonlinear flux. We assume that an appropriate velocity function depending on the entropy solution of the conservation law is given for the comprising particles, and study their corresponding trajectories under the flow. The differential equation that each of these trajectories satisfies depends on the entropy solution of the conservation law which is typically discontinuous in both time and space variables. The existence and uniqueness of these trajectories are guaranteed by the Filippov theory of differential equations. We show that such a Filippov solution is compatible with the front tracking and vanishing viscosity approximations in the sense that the approximate trajectories given by either of these methods converge uniformly to the trajectories corresponding to the entropy solution of the scalar conservation law. For certain classes of flux functions, illustrated by traffic flow, we prove the Hölder continuity of the particle trajectories with respect to the initial field or the flux function. We then consider the inverse problem of recovering the initial field or the flux function of the scalar conservation law from discrete pointwise measurements of the particle trajectories. We show that the above continuity properties translate to the stability of the Bayesian regularised solutions of these inverse problems with respect to appropriate approximations of the forward map. We also discuss the limitations of the situation where the same inverse problems are considered with pointwise observations made from the entropy solution itself.",
  "categories": [
    "math.AP",
    "math.ST"
  ],
  "primary_category": "math.AP",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14536",
  "pdf_url": "https://arxiv.org/pdf/2307.14536v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 167619,
  "size_after_bytes": 169255
}