{
  "title": "Stimulated Brillouin scattering in tellurite-covered silicon nitride waveguides",
  "authors": [
    "Roel A. Botter",
    "Yvan Klaver",
    "Randy te Morsche",
    "Bruno L. Segat Frare",
    "Batoul Hashemi",
    "Kaixuan Ye",
    "Akhileshwar Mishra",
    "Redlef B. G. Braamhaar",
    "Jonathan D. B. Bradley",
    "David Marpaung"
  ],
  "submission_date": "2023-07-24T14:10:03+00:00",
  "revised_dates": [],
  "abstract": "Stimulated Brillouin scattering (SBS), a coherent nonlinear effect coupling acoustics and optics, can be used in a wide range of applications such as Brillouin lasers and tunable narrowband RF filtering. Wide adoption of such technologies however, would need a balance of strong Brillouin interaction and low optical loss in a structure compatible with large scale fabrication. Achieving these characteristics in scalable platforms such as silicon and silicon nitride remains a challenge. Here, we investigate a scalable Brillouin platform combining low loss Si$_3$N$_4$ and tellurium oxide (TeO$_2$) exhibiting strong Brillouin response and enhanced acoustic confinement. In this platform we measure a Brillouin gain coefficient of 8.5~m$^{-1}$W$^{-1}$, exhibiting a twenty fold improvement over the largest previously reported Brillouin gain in a Si$_3$N$_4$ platform. Further, we demonstrate cladding engineering to control the strength of the Brillouin interaction. We utilized the Brillouin gain and loss resonances in this waveguide for an RF photonic filter with more than 15 dB rejection and 250 MHz linewidth. Finally, we present a pathway by geometric optimization and cladding engineering to a further enhancement of the gain coefficient to 155~m$^{-1}$W$^{-1}$, a potential 400 times increase in the Brillouin gain coefficient.",
  "categories": [
    "physics.optics",
    "physics.app-ph"
  ],
  "primary_category": "physics.optics",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12814",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 17244037,
  "size_after_bytes": 422977
}