{
  "title": "The Importance of Heat Flux in Quasi-Parallel Collisionless Shocks",
  "authors": [
    "Colby C. Haggerty",
    "Damiano Caprioli",
    "Paul A. Cassak",
    "M. Hasan Barbhuiya",
    "Lynn Wilson",
    "Drew Turner"
  ],
  "submission_date": "2023-07-23T20:32:19+00:00",
  "revised_dates": [],
  "abstract": "Collisionless plasma shocks are a common feature of many space and astrophysical systems and are sources of high-energy particles and non-thermal emission, channeling as much as 20\\% of the shock's energy into non-thermal particles. The generation and acceleration of these non-thermal particles have been extensively studied, however, how these particles feed back on the shock hydrodynamics has not been fully treated. This work presents the results of self-consistent hybrid particle-in-cell simulations that show the effect of self-generated non-thermal particle populations on the nature of collisionless, quasi-parallel shocks. They contribute to a significant heat flux density upstream of the shock. Non-thermal particles downstream of the shock leak into the upstream region, taking energy away from the shock. This increases the compression ratio, slows the shock down, and flattens the non-thermal population's spectral index for lower Mach number shocks. We incorporate this into a revised theory for the Rankine-Hugoniot jump conditions that include this effect and it shows excellent agreement with simulations. The results have the potential to explain discrepancies between predictions and observations in a wide range of systems, such as inaccuracies of predictions of arrival times of coronal mass ejections and the conflicting radio and x-ray observations of intracluster shocks.\n  These effects will likely need to be included in fluid modeling to accurately predict shock evolution.",
  "categories": [
    "physics.plasm-ph",
    "astro-ph.HE",
    "physics.space-ph"
  ],
  "primary_category": "physics.plasm-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12423",
  "pdf_url": null,
  "comment": "7 pages, 3 figures, a lot of appendix",
  "num_versions": null,
  "size_before_bytes": 3692494,
  "size_after_bytes": 298251
}