{
  "title": "An Antithetic Multilevel Monte Carlo-Milstein Scheme for Stochastic Partial Differential Equations with non-commutative noise",
  "authors": [
    "Abdul-Lateef Haji-Ali",
    "Andreas Stein"
  ],
  "submission_date": "2023-07-26T12:50:36+00:00",
  "revised_dates": [
    "2025-04-15T01:58:53+00:00"
  ],
  "abstract": "We present a novel multilevel Monte Carlo approach for estimating quantities of interest for stochastic partial differential equations (SPDEs). Drawing inspiration from [Giles and Szpruch: Antithetic multilevel Monte Carlo estimation for multi-dimensional SDEs without Lévy area simulation, Annals of Appl. Prob., 2014], we extend the antithetic Milstein scheme for finite-dimensional stochastic differential equations to Hilbert space-valued SPDEs. Our method has the advantages of both Euler and Milstein discretizations, as it is easy to implement and does not involve intractable Lévy area terms. Moreover, the antithetic correction in our method leads to the same variance decay in a MLMC algorithm as the standard Milstein method, resulting in significantly lower computational complexity than a corresponding MLMC Euler scheme. Our approach is applicable to a broader range of non-linear diffusion coefficients and does not require any commutative properties. The key component of our MLMC algorithm is a truncated Milstein-type time stepping scheme for SPDEs, which accelerates the rate of variance decay in the MLMC method when combined with an antithetic coupling on the fine scales. We combine the truncated Milstein scheme with appropriate spatial discretizations and noise approximations on all scales to obtain a fully discrete scheme and show that the antithetic coupling does not introduce an additional bias.",
  "categories": [
    "math.NA",
    "math.PR"
  ],
  "primary_category": "math.NA",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14169",
  "pdf_url": null,
  "comment": "36 pages",
  "num_versions": null,
  "size_before_bytes": 323086,
  "size_after_bytes": 309803
}