{
  "title": "SwIPE: Efficient and Robust Medical Image Segmentation with Implicit Patch Embeddings",
  "authors": [
    "Yejia Zhang",
    "Pengfei Gu",
    "Nishchal Sapkota",
    "Danny Z. Chen"
  ],
  "submission_date": "2023-07-23T20:55:11+00:00",
  "revised_dates": [
    "2024-03-22T00:46:29+00:00"
  ],
  "abstract": "Modern medical image segmentation methods primarily use discrete representations in the form of rasterized masks to learn features and generate predictions. Although effective, this paradigm is spatially inflexible, scales poorly to higher-resolution images, and lacks direct understanding of object shapes. To address these limitations, some recent works utilized implicit neural representations (INRs) to learn continuous representations for segmentation. However, these methods often directly adopted components designed for 3D shape reconstruction. More importantly, these formulations were also constrained to either point-based or global contexts, lacking contextual understanding or local fine-grained details, respectively--both critical for accurate segmentation. To remedy this, we propose a novel approach, SwIPE (Segmentation with Implicit Patch Embeddings), that leverages the advantages of INRs and predicts shapes at the patch level--rather than at the point level or image level--to enable both accurate local boundary delineation and global shape coherence. Extensive evaluations on two tasks (2D polyp segmentation and 3D abdominal organ segmentation) show that SwIPE significantly improves over recent implicit approaches and outperforms state-of-the-art discrete methods with over 10x fewer parameters. Our method also demonstrates superior data efficiency and improved robustness to data shifts across image resolutions and datasets. Code is available on Github (https://github.com/charzharr/miccai23-swipe-implicit-segmentation).",
  "categories": [
    "cs.CV"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12429",
  "pdf_url": null,
  "comment": "Accepted to the 2023 International Conference on Medical Image Computing and Computer Assisted Intervention (MICCAI'23)",
  "num_versions": null,
  "size_before_bytes": 8598320,
  "size_after_bytes": 366414
}