{
  "title": "Automated Mapping of Adaptive App GUIs from Phones to TVs",
  "authors": [
    "Han Hu",
    "Ruiqi Dong",
    "John Grundy",
    "Thai Minh Nguyen",
    "Huaxiao Liu",
    "Chunyang Chen"
  ],
  "submission_date": "2023-07-24T04:35:51+00:00",
  "revised_dates": [
    "2023-11-07T01:23:59+00:00"
  ],
  "abstract": "With the increasing interconnection of smart devices, users often desire to adopt the same app on quite different devices for identical tasks, such as watching the same movies on both their smartphones and TVs. However, the significant differences in screen size, aspect ratio, and interaction styles make it challenging to adapt Graphical User Interfaces (GUIs) across these devices. Although there are millions of apps available on Google Play, only a few thousand are designed to support smart TV displays. Existing techniques to map a mobile app GUI to a TV either adopt a responsive design, which struggles to bridge the substantial gap between phone and TV or use mirror apps for improved video display, which requires hardware support and extra engineering efforts. Instead of developing another app for supporting TVs, we propose a semi-automated approach to generate corresponding adaptive TV GUIs, given the phone GUIs as the input. Based on our empirical study of GUI pairs for TVs and phones in existing apps, we synthesize a list of rules for grouping and classifying phone GUIs, converting them to TV GUIs, and generating dynamic TV layouts and source code for the TV display. Our tool is not only beneficial to developers but also to GUI designers, who can further customize the generated GUIs for their TV app development. An evaluation and user study demonstrate the accuracy of our generated GUIs and the usefulness of our tool.",
  "categories": [
    "cs.SE",
    "cs.HC"
  ],
  "primary_category": "cs.SE",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12522",
  "pdf_url": null,
  "comment": "30 pages, 15 figures",
  "num_versions": null,
  "size_before_bytes": 22643373,
  "size_after_bytes": 13717111
}