{
  "title": "Communication-Sensing Region for Cell-Free Massive MIMO ISAC Systems",
  "authors": [
    "Weihao Mao",
    "Yang Lu",
    "Chong-Yung Chi",
    "Bo Ai",
    "Zhangdui Zhong",
    "Zhiguo Ding"
  ],
  "submission_date": "2023-07-30T15:43:32+00:00",
  "revised_dates": [],
  "abstract": "This paper investigates the system model and the transmit beamforming design for the Cell-Free massive multi-input multi-output (MIMO) integrated sensing and communication (ISAC) system. The impact of the uncertainty of the target locations on the propagation of wireless signals is considered during both uplink and downlink phases, and especially, the main statistics of the MIMO channel estimation error are theoretically derived in the closed-form fashion. A fundamental performance metric, termed communication-sensing (C-S) region, is defined for the considered system via three cases, i.e., the sensing-only case, the communication-only case and the ISAC case. The transmit beamforming design problems for the three cases are respectively carried out through different reformulations, e.g., the Lagrangian dual transform and the quadratic fractional transform, and some combinations of the block coordinate descent method and the successive convex approximation method. Numerical results present a 3-dimensional C-S region with a dynamic number of access points to illustrate the trade-off between communication and radar sensing. The advantage for radar sensing of the Cell-Free massive MIMO system is also studied via a comparison with the traditional cellular system. Finally, the efficacy of the proposed beamforming scheme is validated in comparison with zero-forcing and maximum ratio transmission schemes.",
  "categories": [
    "cs.IT",
    "cs.NI",
    "eess.SP"
  ],
  "primary_category": "cs.IT",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16259",
  "pdf_url": "https://arxiv.org/pdf/2307.16259v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 11840447,
  "size_after_bytes": 93305
}