{
  "title": "METAVerse: Meta-Learning Traversability Cost Map for Off-Road Navigation",
  "authors": [
    "Junwon Seo",
    "Taekyung Kim",
    "Seongyong Ahn",
    "Kiho Kwak"
  ],
  "submission_date": "2023-07-26T06:58:19+00:00",
  "revised_dates": [
    "2024-03-06T01:16:03+00:00"
  ],
  "abstract": "Autonomous navigation in off-road conditions requires an accurate estimation of terrain traversability. However, traversability estimation in unstructured environments is subject to high uncertainty due to the variability of numerous factors that influence vehicle-terrain interaction. Consequently, it is challenging to obtain a generalizable model that can accurately predict traversability in a variety of environments. This paper presents METAVerse, a meta-learning framework for learning a global model that accurately and reliably predicts terrain traversability across diverse environments. We train the traversability prediction network to generate a dense and continuous-valued cost map from a sparse LiDAR point cloud, leveraging vehicle-terrain interaction feedback in a self-supervised manner. Meta-learning is utilized to train a global model with driving data collected from multiple environments, effectively minimizing estimation uncertainty. During deployment, online adaptation is performed to rapidly adapt the network to the local environment by exploiting recent interaction experiences. To conduct a comprehensive evaluation, we collect driving data from various terrains and demonstrate that our method can obtain a global model that minimizes uncertainty. Moreover, by integrating our model with a model predictive controller, we demonstrate that the reduced uncertainty results in safe and stable navigation in unstructured and unknown terrains.",
  "categories": [
    "cs.RO",
    "cs.CV",
    "cs.LG"
  ],
  "primary_category": "cs.RO",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13991",
  "pdf_url": null,
  "comment": "Our video can be found at https://youtu.be/4rIAMM1ZKMo",
  "num_versions": null,
  "size_before_bytes": 11996024,
  "size_after_bytes": 560807
}