{
  "title": "A Comprehensive Review of Recent Research Trends on UAVs",
  "authors": [
    "Kaled Telli",
    "Okba Kraa",
    "Yassine Himeur",
    "Abdelmalik Ouamane",
    "Mohamed Boumehraz",
    "Shadi Atalla",
    "Wathiq Mansoor"
  ],
  "submission_date": "2023-07-25T17:55:17+00:00",
  "revised_dates": [],
  "abstract": "The growing interest in unmanned aerial vehicles (UAVs) from both scientific and industrial sectors has attracted a wave of new researchers and substantial investments in this expansive field. However, due to the wide range of topics and subdomains within UAV research, newcomers may find themselves overwhelmed by the numerous options available. It is therefore crucial for those involved in UAV research to recognize its interdisciplinary nature and its connections with other disciplines. This paper presents a comprehensive overview of the UAV field, highlighting recent trends and advancements. Drawing on recent literature reviews and surveys, the review begins by classifying UAVs based on their flight characteristics. It then provides an overview of current research trends in UAVs, utilizing data from the Scopus database to quantify the number of scientific documents associated with each research direction and their interconnections. The paper also explores potential areas for further development in UAVs, including communication, artificial intelligence, remote sensing, miniaturization, swarming and cooperative control, and transformability. Additionally, it discusses the development of aircraft control, commonly used control techniques, and appropriate control algorithms in UAV research. Furthermore, the paper addresses the general hardware and software architecture of UAVs, their applications, and the key issues associated with them. It also provides an overview of current open-source software and hardware projects in the UAV field. By presenting a comprehensive view of the UAV field, this paper aims to enhance understanding of this rapidly evolving and highly interdisciplinary area of research.",
  "categories": [
    "cs.RO",
    "eess.SY"
  ],
  "primary_category": "cs.RO",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13691",
  "pdf_url": null,
  "comment": "32 pages, 4 figures, and 5 tables",
  "num_versions": null,
  "size_before_bytes": 1270802,
  "size_after_bytes": 240189
}