{
  "title": "Variability in the local and global composition of human T-cell receptor repertoires during thymic development across cell types and individuals",
  "authors": [
    "Giulio Isacchini",
    "Valentin Quiniou",
    "Hélène Vantomme",
    "Paul Stys",
    "Encarnita Mariotti-Ferandiz",
    "David Klatzmann",
    "Aleksandra M. Walczak",
    "Thierry Mora",
    "Armita Nourmohammad"
  ],
  "submission_date": "2023-07-25T17:17:47+00:00",
  "revised_dates": [],
  "abstract": "The adaptive immune response relies on T cells that combine phenotypic specialization with diversity of T cell receptors (TCRs) to recognize a wide range of pathogens. TCRs are acquired and selected during T cell maturation in the thymus. Characterizing TCR repertoires across individuals and T cell maturation stages is important for better understanding adaptive immune responses and for developing new diagnostics and therapies. Analyzing a dataset of human TCR repertoires from thymocyte subsets, we find that the variability between individuals generated during the TCR V(D)J recombination is maintained through all stages of T cell maturation and differentiation. The inter-individual variability of repertoires of the same cell type is of comparable magnitude to the variability across cell types within the same individual. To zoom in on smaller scales than whole repertoires, we defined a distance measuring the relative overlap of locally similar sequences in repertoires. We find that the whole repertoire models correctly predict local similarity networks, suggesting a lack of forbidden T cell receptor sequences. The local measure correlates well with distances calculated using whole repertoire traits and carries information about cell types.",
  "categories": [
    "q-bio.QM",
    "q-bio.MN"
  ],
  "primary_category": "q-bio.QM",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14376",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 2241845,
  "size_after_bytes": 83116
}