{
  "title": "Extreme mass-ratio inspirals into black holes surrounded by scalar clouds",
  "authors": [
    "Richard Brito",
    "Shreya Shah"
  ],
  "submission_date": "2023-07-29T23:32:26+00:00",
  "revised_dates": [
    "2023-08-02T12:36:07+00:00",
    "2023-10-02T17:40:05+00:00",
    "2024-11-25T19:56:00+00:00"
  ],
  "abstract": "We study extreme mass-ratio binary systems in which a stellar mass compact object spirals into a supermassive black hole surrounded by a scalar cloud. Scalar clouds can form through superradiant instabilities of massive scalar fields around spinning black holes and can also serve as a proxy for dark matter halos. Our framework is fully relativistic and assumes that the impact of the cloud on the geometry can be treated perturbatively. As a proof of concept, here we consider a point particle in circular, equatorial motion around a non-spinning black hole surrounded either by a spherically symmetric or a dipolar non-axisymmetric scalar cloud, but the framework can in principle be generalized to generic black hole spins and scalar cloud geometries. We compute the leading-order power lost by the point particle due to scalar radiation and show that, in some regimes, it can dominate over gravitational-wave emission. We confirm the presence of striking signatures due to the presence of a scalar cloud that had been predicted using Newtonian approximations, such as resonances that can give rise to sinking and floating orbits, as well as \"sharp features\" in the power lost by the particle at given orbital radii. Finally, for a spherically symmetric scalar cloud, we also compute the leading-order corrections to the black-hole geometry and to the gravitational-wave energy flux, focusing only on axial metric perturbations for the latter. We find that, for non-compact clouds, the corrections to the (axial) gravitational-wave fluxes at high frequencies can be understood in terms of a gravitational-redshift effect, in agreement with previous works.",
  "categories": [
    "gr-qc",
    "astro-ph.CO",
    "astro-ph.HE",
    "hep-ph",
    "hep-th"
  ],
  "primary_category": "gr-qc",
  "doi": "10.1103/PhysRevD.108.084019",
  "journal_ref": "Phys. Rev. D 108, 084019 (2023)",
  "arxiv_id": "2307.16093",
  "pdf_url": "https://arxiv.org/pdf/2307.16093v4",
  "comment": "42 pages, 11 figures; v4: corrected a factor 2 error in the flux formulas of Sec. IIIB, see Erratum available at https://journals.aps.org/prd/abstract/10.1103/PhysRevD.110.109902. Published in Physical Review D",
  "num_versions": null,
  "size_before_bytes": 3888358,
  "size_after_bytes": 1306627
}