{
  "title": "Axion Clouds around Neutron Stars",
  "authors": [
    "Dion Noordhuis",
    "Anirudh Prabhu",
    "Christoph Weniger",
    "Samuel J. Witte"
  ],
  "submission_date": "2023-07-21T18:00:01+00:00",
  "revised_dates": [
    "2024-10-08T01:36:15+00:00"
  ],
  "abstract": "Recent work has shown that axions can be efficiently produced via non-stationary pair plasma discharges in the polar cap region of pulsars. Here, we point out that for axion masses $10^{-9} \\, {\\rm eV} \\lesssim m_a \\lesssim 10^{-4} \\, \\rm eV$, a sizable fraction of the sourced axion population will be gravitationally confined to the neutron star. These axions accumulate over astrophysical timescales, thereby forming a dense `axion cloud' around the star. We argue that the existence of such a cloud, with densities reaching and potentially exceeding $\\mathcal{O}(10^{22}) \\, {\\rm GeV \\, cm^{-3}}$, is a generic expectation across a wide range of parameter space. For axion masses $m_a \\gtrsim 10^{-7} \\, \\rm eV$, energy is primarily radiated from the axion cloud via resonant axion-photon mixing, generating a number of distinctive signatures that include: a sharp line in the radio spectrum of each pulsar (located at the axion mass, and with an order percent-level width), and transient events arising from the reconfiguration of charge densities in the magnetosphere. While a deeper understanding of the systematic uncertainties in these systems is required, our current estimates suggest that existing radio telescopes could improve sensitivity to the axion-photon coupling by more than an order of magnitude.",
  "categories": [
    "hep-ph",
    "astro-ph.CO"
  ],
  "primary_category": "hep-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11811",
  "pdf_url": null,
  "comment": "v2: 21 pages, 14 figures. Updated to match published version. Added new subsection on uncertainties, updated plots, and corrected minor bugs and typos. v1: 17 pages, 14 figures",
  "num_versions": null,
  "size_before_bytes": 14608053,
  "size_after_bytes": 376354
}