{
  "title": "Inference in Experiments with Matched Pairs and Imperfect Compliance",
  "authors": [
    "Yuehao Bai",
    "Hongchang Guo",
    "Azeem M. Shaikh",
    "Max Tabord-Meehan"
  ],
  "submission_date": "2023-07-24T19:28:31+00:00",
  "revised_dates": [
    "2024-06-28T00:08:02+00:00"
  ],
  "abstract": "This paper studies inference for the local average treatment effect in randomized controlled trials with imperfect compliance where treatment status is determined according to \"matched pairs.\" By \"matched pairs,\" we mean that units are sampled i.i.d. from the population of interest, paired according to observed, baseline covariates and finally, within each pair, one unit is selected at random for treatment. Under weak assumptions governing the quality of the pairings, we first derive the limit distribution of the usual Wald (i.e., two-stage least squares) estimator of the local average treatment effect. We show further that conventional heteroskedasticity-robust estimators of the Wald estimator's limiting variance are generally conservative, in that their probability limits are (typically strictly) larger than the limiting variance. We therefore provide an alternative estimator of the limiting variance that is consistent. Finally, we consider the use of additional observed, baseline covariates not used in pairing units to increase the precision with which we can estimate the local average treatment effect. To this end, we derive the limiting behavior of a two-stage least squares estimator of the local average treatment effect which includes both the additional covariates in addition to pair fixed effects, and show that its limiting variance is always less than or equal to that of the Wald estimator. To complete our analysis, we provide a consistent estimator of this limiting variance. A simulation study confirms the practical relevance of our theoretical results. Finally, we apply our results to revisit a prominent experiment studying the effect of macroinsurance on microenterprise in Egypt.",
  "categories": [
    "econ.EM",
    "math.ST"
  ],
  "primary_category": "econ.EM",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13094",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 479333,
  "size_after_bytes": 362293
}