{
  "title": "Spin Hall conductivity in the Kane-Mele-Hubbard model at finite temperature",
  "authors": [
    "D. Lessnich",
    "C. Gauvin-Ndiaye",
    "Roser Valentí",
    "A. -M. S. Tremblay"
  ],
  "submission_date": "2023-07-28T16:28:56+00:00",
  "revised_dates": [
    "2024-02-20T19:56:01+00:00"
  ],
  "abstract": "The Kane-Mele model is known to show a quantized spin Hall conductivity at zero temperature. Including Hubbard interactions at each site leads to a quantum phase transition to an XY antiferromagnet at sufficiently high interaction strength. Here, we use the two-particle self-consistent approach (TPSC), which we extend to include spin-orbit coupling, to investigate the Kane-Mele-Hubbard model at finite temperature and half-filling. TPSC is a weak to intermediate coupling approach capable of calculating a frequency- and momentum-dependent self-energy from spin and charge fluctuations. We present results for the spin Hall conductivity and correlation lengths for antiferromagnetic spin fluctuations for different values of temperature, spin-orbit coupling and Hubbard interaction. The vertex corrections, which here are analogues of Maki-Thompson contributions, show a strong momentum dependence and give a large contribution in the vicinity of the phase transition at all temperatures. Their inclusion is necessary to observe the quantization of the spin Hall conductivity for the interacting system in the zero temperature limit. At finite temperature, increasing the Hubbard interaction leads to a decrease of the spin Hall conductivity. This decrease can be explained by band-gap renormalization from scattering of electrons on antiferromagnetic spin fluctuations.",
  "categories": [
    "cond-mat.str-el"
  ],
  "primary_category": "cond-mat.str-el",
  "doi": "10.1103/PhysRevB.109.075143",
  "journal_ref": "Phys. Rev. B 109, 075143 (2024)",
  "arxiv_id": "2307.15652",
  "pdf_url": "https://arxiv.org/pdf/2307.15652v2",
  "comment": "11 pages, 8 figures",
  "num_versions": null,
  "size_before_bytes": 643693,
  "size_after_bytes": 378704
}