{
  "title": "State preparation by shallow circuits using feed forward",
  "authors": [
    "Harry Buhrman",
    "Marten Folkertsma",
    "Bruno Loff",
    "Niels M. P. Neumann"
  ],
  "submission_date": "2023-07-27T13:20:21+00:00",
  "revised_dates": [
    "2024-07-01T12:31:40+00:00",
    "2024-11-05T10:29:32+00:00",
    "2024-11-07T09:02:47+00:00",
    "2024-12-04T11:16:26+00:00"
  ],
  "abstract": "In order to achieve fault-tolerant quantum computation, we need to repeat the following sequence of four steps: First, perform 1 or 2 qubit quantum gates (in parallel if possible). Second, do a syndrome measurement on a subset of the qubits. Third, perform a fast classical computation to establish which errors have occurred (if any). Fourth, depending on the errors, we apply a correction step. Then the procedure repeats with the next sequence of gates. In order for these four steps to succeed, we need the error rate of the gates to be below a certain threshold. Unfortunately, the error rates of current quantum hardware are still too high. On the other hand, current quantum hardware platforms are designed with these four steps in mind. In this work we make use of this four-step scheme not to carry out fault-tolerant computations, but to enhance short, constant-depth, quantum circuits that perform 1 qubit gates and nearest-neighbor 2 qubit gates. To explore how this can be useful, we study a computational model which we call Local Alternating Quantum Classical Computations (LAQCC). In this model, qubits are placed in a grid allowing nearest neighbor interactions; the quantum circuits are of constant depth with intermediate measurements; a classical controller can perform log-depth computations on these intermediate measurement outcomes to control future quantum operations. This model fits naturally between quantum algorithms in the NISQ era and full fledged fault-tolerant quantum computation. We show that LAQCC circuits can create long-ranged interactions, which constant-depth quantum circuits cannot achieve, and use it to construct a range of useful multi-qubit gates. With these gates, we create three new state preparation protocols for a uniform superposition over an arbitrary number of states, W-states, Dicke states and may-body scar states.",
  "categories": [
    "quant-ph"
  ],
  "primary_category": "quant-ph",
  "doi": "10.22331/q-2024-12-09-1552",
  "journal_ref": "Quantum 8, 1552 (2024)",
  "arxiv_id": "2307.14840",
  "pdf_url": "https://arxiv.org/pdf/2307.14840v5",
  "comment": "32 pages, 3 pages appendix, 9 figures",
  "num_versions": null,
  "size_before_bytes": 7884438,
  "size_after_bytes": 1641579
}