{
  "title": "Axion-Photon Conversion in 3D Media and Astrophysical Plasmas",
  "authors": [
    "J. I. McDonald",
    "B. Garbrecht",
    "P. Millington"
  ],
  "submission_date": "2023-07-21T18:00:01+00:00",
  "revised_dates": [
    "2023-12-21T01:38:08+00:00"
  ],
  "abstract": "With axions now a primary candidate for dark matter, understanding their indirect astrophysical signatures is of paramount importance. Key to this is the production of photons from axions in magnetised astrophysical plasmas. While simple formulae for axion-photon mixing in 1D have been sketched several decades ago, there has recently been renewed interest in robust calculations for this process in arbitrary 3D plasmas. These calculations are vital for understanding, amongst other things, the radio production from axion dark matter conversion in neutron stars, which may lead to indirect axion dark matter detection with current telescopes or future searches, e.g., by the SKA. In this paper, we derive the relevant transport equations in magnetised plasmas. These equations describe both the production and propagation of photons in an arbitrary 3D medium due to the resonant conversion of axions into photons. They also fully incorporate the refraction of photons, and we find no evidence for a conjectured phenomenon of dephasing. Our result is free of divergences that plagued previous calculations, and our kinetic theory description provides a direct link between ray tracing and the production mechanism. These results mark an important step toward solving one of the major open questions concerning indirect searches of axions in recent years, namely how to compute the photon production rate from axions in arbitrary 3D plasmas.",
  "categories": [
    "hep-ph",
    "astro-ph.CO",
    "gr-qc"
  ],
  "primary_category": "hep-ph",
  "doi": "10.1088/1475-7516/2023/12/031",
  "journal_ref": "JCAP12(2023)031",
  "arxiv_id": "2307.11812",
  "pdf_url": null,
  "comment": "46 Pages, 5 figures. Journal Version. New summary of main results added to introduction. Various typos corrected throughout",
  "num_versions": null,
  "size_before_bytes": 1117431,
  "size_after_bytes": 383210
}