{
  "title": "Interactions between flow fields induced by surface dielectric barrier discharge arrays",
  "authors": [
    "Alexander Böddecker",
    "Maximilian Passmann",
    "Sebastian Wilczek",
    "Lars Schücke",
    "Ihor Korolov",
    "Romuald Skoda",
    "Thomas Mussenbrock",
    "Andrew R. Gibson",
    "Peter Awakowicz"
  ],
  "submission_date": "2023-07-28T13:21:00+00:00",
  "revised_dates": [],
  "abstract": "This study investigates the flow field induced by a surface dielectric barrier discharge (SDBD) system, known for its efficient pollution remediation of volatile organic compounds (VOCs). We aim to understand the flow dynamics that contribute to the high conversion observed in similar systems. Experimental techniques, including schlieren imaging and particle image velocimetry (PIV), applied with high temporal resolution, were used to analyse the flow field. Complementary, fluid simulations are employed to investigate the coupling between streamer and gas dynamics. Results show distinct fluid field behaviours for different electrode configurations, which differ in geometric complexity. The fluid field analysis of the most basic electrode design revealed behaviours commonly observed in actuator studies. The simulation results indicate the local information about the electron density as well as different temporal phases of the fluid flow. The electrode design with mostly parallel grid line structures exhibits confined vortices near the surface. In contrast, an electrode design also used in previous studies, is shown to promote strong gas transport through extended vortex structures, enhancing gas mixing and potentially explaining the high conversion observed.",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15545",
  "pdf_url": "https://arxiv.org/pdf/2307.15545v1",
  "comment": "submitted to Plasma Chemistry and Plasma Processing by Springer Nature",
  "num_versions": null,
  "size_before_bytes": 7771279,
  "size_after_bytes": 1645017
}