{
  "title": "Extremal Dependence of Moving Average Processes Driven by Exponential-Tailed Lévy Noise",
  "authors": [
    "Zhongwei Zhang",
    "David Bolin",
    "Sebastian Engelke",
    "Raphaël Huser"
  ],
  "submission_date": "2023-07-28T20:29:15+00:00",
  "revised_dates": [],
  "abstract": "Moving average processes driven by exponential-tailed Lévy noise are important extensions of their Gaussian counterparts in order to capture deviations from Gaussianity, more flexible dependence structures, and sample paths with jumps. Popular examples include non-Gaussian Ornstein--Uhlenbeck processes and type G Matérn stochastic partial differential equation random fields. This paper is concerned with the open problem of determining their extremal dependence structure. We leverage the fact that such processes admit approximations on grids or triangulations that are used in practice for efficient simulations and inference. These approximations can be expressed as special cases of a class of linear transformations of independent, exponential-tailed random variables, that bridge asymptotic dependence and independence in a novel, tractable way. This result is of independent interest since models that can capture both extremal dependence regimes are scarce and the construction of such flexible models is an active area of research. This new fundamental result allows us to show that the integral approximation of general moving average processes with exponential-tailed Lévy noise is asymptotically independent when the mesh is fine enough. Under mild assumptions on the kernel function we also derive the limiting residual tail dependence function. For the popular exponential-tailed Ornstein--Uhlenbeck process we prove that it is asymptotically independent, but with a different residual tail dependence function than its Gaussian counterpart. Our results are illustrated through simulation studies.",
  "categories": [
    "math.ST"
  ],
  "primary_category": "math.ST",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15796",
  "pdf_url": "https://arxiv.org/pdf/2307.15796v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 3414926,
  "size_after_bytes": 267842
}