{
  "title": "Diffusive Limit of the Vlasov-Poisson-Boltzmann System for the Full Range of Cutoff Potentials",
  "authors": [
    "Weijun Wu",
    "Fujun Zhou",
    "Yongsheng Li"
  ],
  "submission_date": "2023-07-26T10:26:11+00:00",
  "revised_dates": [],
  "abstract": "Diffusive limit of the Vlasov-Poisson-Boltzmann system with cutoff soft potentials $-3<γ<0$ in the perturbative framework around global Maxwellian still remains open. By introducing a new weighted $H_{x,v}^2$-$W_{x,v}^{2, \\infty}$ approach with time decay, we solve this problem for the full range of cutoff potentials $-3<γ\\leq 1$. The core of this approach lies in the interplay between the velocity weighted $H_{x,v}^2$ energy estimate with time decay and the time-velocity weighted $W_{x,v}^{2,\\infty}$ estimate with time decay for the Vlasov-Poisson-Boltzmann system, which leads to the uniform estimate with respect to the Knudsen number $\\varepsilon\\in (0,1]$ globally in time. As a result, global strong solution is constructed and incompressible Navier-Stokes-Fourier-Poisson limit is rigorously justified for both hard and soft potentials. Meanwhile, this uniform estimate with respect to $\\varepsilon\\in (0,1]$ also yields optimal $L^2$ time decay rate and $L^\\infty$ time decay rate for the Vlasov-Poisson-Boltzmann system and its incompressible Navier-Stokes-Fourier-Poisson limit. This newly introduced weighted $H_{x,v}^2$-$W_{x,v}^{2, \\infty}$ approach with time decay is flexible and robust, as it can deal with both optimal time decay problems and hydrodynamic limit problems in a unified framework for the Boltzmann equation as well as the Vlasov-Poisson-Boltzmann system for the full range of cutoff potentials. It is also expected to shed some light on the more challenging hydrodynamic limit of the Landau equation and the Vlasov-Poisson-Landau system.",
  "categories": [
    "math.AP"
  ],
  "primary_category": "math.AP",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14088",
  "pdf_url": null,
  "comment": "59 pages",
  "num_versions": null,
  "size_before_bytes": 320510,
  "size_after_bytes": 326318
}