{
  "title": "Calculations of Particle Bombardment due to Dust and Charged Particles in the ISM on the Project Starshot Gram-Scale Interstellar Probe",
  "authors": [
    "Kelvin F Long"
  ],
  "submission_date": "2023-07-22T20:16:52+00:00",
  "revised_dates": [],
  "abstract": "The Breakthrough Initiatives Project Starshot proposes to send a gram-scale laser driven spacecraft to the Alpha Centauri system in a 20 year mission travelling at v=0.2c. One of the challenges of this mission as the spacecraft moves through the interstellar medium is the presence of dust and gas (mostly hydrogen). The dust has a typical matter-density of 2.57*10^-27 g/cm3 with typical particle mass being 3*10^-13 g although some of the largest particles may be 5*10^-9 g in mass. These dust particle will deposit 10^12-10^16 MeV onto the spacecraft with an energy flux of order 0.3 J/sm2. We consider the erosion of the spacecraft frontal area due to dust and also heating effects. We attempt to characterise the likely environment for the starshot mission and estimate the particle bombardment shielding requirements in terms of mass and thickness of material. Current analysis estimates that the likely erosion rates are of order 10^-11-10^-8 g/s and that the frontal area temperature for the models examined in this paper will be 135.2 K depending on the ratio of frontal area to radiating area. For an assumed shielding material with atomic number range 3-13 (Lithium to Aluminium), and for spacecraft geometries with radii ~1 mm and cylindrical length 5 mm, over a 21.5 year mission duration, this would suggest a shielding thickness of 1.4 - 3 mm. This would also suggest a shielding mass in the range 0.01 - 0.05 g; depending on the material choice, spacecraft size and chosen geometry. This would represent between 1 - 5% of the total mass, assuming a spacecraft mass of 1g (driven by a 100 GW laser power). We also examine the additional effects of charged particles and estimate the stopping power and penetration range for different materials.",
  "categories": [
    "physics.space-ph"
  ],
  "primary_category": "physics.space-ph",
  "doi": null,
  "journal_ref": "Journal of the British Interplanetary Society, May 2023",
  "arxiv_id": "2307.12160",
  "pdf_url": null,
  "comment": "14 pages, 3 figures, presented FISW, New York, June 2017, presented 60th Cospar, Pasadena, July 2018, presented NASA JSC, Houston, February 2017",
  "num_versions": null,
  "size_before_bytes": 182263,
  "size_after_bytes": 64903
}