{
  "title": "Recognizing Unseen States of Unknown Objects by Leveraging Knowledge Graphs",
  "authors": [
    "Filipos Gouidis",
    "Konstantinos Papoutsakis",
    "Theodore Patkos",
    "Antonis Argyros",
    "Dimitris Plexousakis"
  ],
  "submission_date": "2023-07-22T22:19:11+00:00",
  "revised_dates": [
    "2025-05-27T02:00:23+00:00",
    "2025-06-17T01:21:56+00:00"
  ],
  "abstract": "We investigate the problem of Object State Classification (OSC) as a zero-shot learning problem. Specifically, we propose the first Object-agnostic State Classification (OaSC) method that infers the state of a certain object without relying on the knowledge or the estimation of the object class. In that direction, we capitalize on Knowledge Graphs (KGs) for structuring and organizing knowledge, which, in combination with visual information, enable the inference of the states of objects in object/state pairs that have not been encountered in the method's training set. A series of experiments investigate the performance of the proposed method in various settings, against several hypotheses and in comparison with state of the art approaches for object attribute classification. The experimental results demonstrate that the knowledge of an object class is not decisive for the prediction of its state. Moreover, the proposed OaSC method outperforms existing methods in all datasets and benchmarks by a great margin.",
  "categories": [
    "cs.CV"
  ],
  "primary_category": "cs.CV",
  "doi": "10.1109/WACV61041.2025.00838",
  "journal_ref": "2025 IEEE/CVF Winter Conference on Applications of Computer Vision (WACV), pp. 8637-8648",
  "arxiv_id": "2307.12179",
  "pdf_url": null,
  "comment": "This is the authors' version of the paper published at IEEE/CVF Winter Conference on Applications of Computer Vision (WACV) 2025. The definitive version is available at: https://openaccess.thecvf.com/content/WACV2025/html/Gouidis_Recognizing_Unseen_States_of_Unknown_Objects_by_Leveraging_Knowledge_Graphs_WACV_2025_paper.html",
  "num_versions": null,
  "size_before_bytes": 32802278,
  "size_after_bytes": 886626
}