{
  "title": "z-GAL -- A NOEMA spectroscopic redshift survey of bright Herschel galaxies: [II] Dust properties",
  "authors": [
    "D. Ismail",
    "A. Beelen",
    "V. Buat",
    "S. Berta",
    "P. Cox",
    "F. Stanley",
    "A. Young",
    "S. Jin",
    "R. Neri",
    "T. Bakx",
    "H. Dannerbauer",
    "K. Butler",
    "A. Cooray",
    "A. Nanni",
    "A. Omont",
    "S. Serjeant",
    "P. van der Werf",
    "C. Vlahakis",
    "A. Weiss",
    "C. Yang",
    "A. J. Baker",
    "G. Bendo",
    "E. Borsato",
    "N. Chartab",
    "S. Dye",
    "S. Eales",
    "R. Gavazzi",
    "D. Hughes",
    "R. Ivison",
    "B. M. Jones M. Krips",
    "M. Lehnert",
    "L. Marchetti",
    "H. Messias",
    "M. Negrello",
    "I. Perez-Fournon",
    "D. A. Riechers",
    "S. Urquhart"
  ],
  "submission_date": "2023-07-28T18:04:03+00:00",
  "revised_dates": [],
  "abstract": "(Abridged) We present the dust properties of 125 bright Herschel galaxies selected from the z-GAL survey. The large instantaneous bandwidth of NOEMA provides an exquisite sampling of the underlying dust continuum emission at 2 and 3 mm in the observed frame, with flux densities in at least four side bands for each source. Together with the available Herschel 250, 350, and 500 micron and SCUBA-2 850 micron flux densities, the spectral energy distribution of each source can be analyzed from the far-infrared to the millimeter, with a fine sampling of the Rayleigh-Jeans tail. This wealth of data provides a solid basis to derive robust dust properties, in particular the dust emissivity index, beta, and the dust temperature, T(dust). In order to demonstrate our ability to constrain the dust properties, we used a flux-generated mock catalog and analyzed the results under the assumption of an optically thin and optically thick modified black body emission. For the z-GAL sources, we report a range of dust emissivities with beta ~ 1.5 - 3 estimated up to high precision with relative uncertainties that vary in the range 7% - 15%, and an average of 2.2 +/- 0.3. We find dust temperatures varying from 20 to 50 K with an average of T(dust) ~ 30 K for the optically thin case and ~38 K in the optically thick case. For all the sources, we estimate the dust masses and apparent infrared luminosities (based on the optically thin approach). An inverse correlation is found between T(dust) and beta, which is similar to what is seen in the local Universe. Finally, we report an increasing trend in the dust temperature as a function of redshift at a rate of 6.5 +/- 0.5 K/z for this 500 micron-selected sample. Based on this study, future prospects are outlined to further explore the evolution of dust temperature across cosmic time.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.1051/0004-6361/202346804",
  "journal_ref": "A&A 678, A27 (2023)",
  "arxiv_id": "2307.15747",
  "pdf_url": "https://arxiv.org/pdf/2307.15747v1",
  "comment": "Accepted for publication on A&A; 32 pages; 26 figures",
  "num_versions": null,
  "size_before_bytes": 6022569,
  "size_after_bytes": 285235
}