{
  "title": "Tailoring Stateless Model Checking for Event-Driven Multi-Threaded Programs",
  "authors": [
    "Parosh Aziz Abdulla",
    "Mohamed Faouzi Atig",
    "Frederik Meyer Bønneland",
    "Sarbojit Das",
    "Bengt Jonsson",
    "Magnus Lång",
    "Konstantinos Sagonas"
  ],
  "submission_date": "2023-07-29T08:43:49+00:00",
  "revised_dates": [],
  "abstract": "Event-driven multi-threaded programming is an important idiom for structuring concurrent computations. Stateless Model Checking (SMC) is an effective verification technique for multi-threaded programs, especially when coupled with Dynamic Partial Order Reduction (DPOR). Existing SMC techniques are often ineffective in handling event-driven programs, since they will typically explore all possible orderings of event processing, even when events do not conflict. We present Event-DPOR , a DPOR algorithm tailored to event-driven multi-threaded programs. It is based on Optimal-DPOR, an optimal DPOR algorithm for multi-threaded programs; we show how it can be extended for event-driven programs. We prove correctness of Event-DPOR for all programs, and optimality for a large subclass. One complication is that an operation in Event-DPOR, which checks for redundancy of new executions, is NP-hard, as we show in this paper; we address this by a sequence of inexpensive (but incomplete) tests which check for redundancy efficiently. Our implementation and experimental evaluation show that, in comparison with other tools in which handler threads are simulated using locks, Event-DPOR can be exponentially faster than other state-of-the-art DPOR algorithms on a variety of programs and manages to completely avoid unnecessary exploration of executions.",
  "categories": [
    "cs.PL",
    "cs.SE"
  ],
  "primary_category": "cs.PL",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15930",
  "pdf_url": "https://arxiv.org/pdf/2307.15930v1",
  "comment": "Published at ATVA23",
  "num_versions": null,
  "size_before_bytes": 3776894,
  "size_after_bytes": 3738041
}