{
  "title": "How Does Naming Affect LLMs on Code Analysis Tasks?",
  "authors": [
    "Zhilong Wang",
    "Lan Zhang",
    "Chen Cao",
    "Nanqing Luo",
    "Xinzhi Luo",
    "Peng Liu"
  ],
  "submission_date": "2023-07-24T02:38:24+00:00",
  "revised_dates": [
    "2023-08-14T00:02:49+00:00",
    "2023-08-30T00:11:26+00:00",
    "2024-05-03T00:04:17+00:00",
    "2024-11-14T01:19:37+00:00"
  ],
  "abstract": "The Large Language Models (LLMs), such as GPT and BERT, were proposed for natural language processing (NLP) and have shown promising results as general-purpose language models. An increasing number of industry professionals and researchers are adopting LLMs for program analysis tasks. However, one significant difference between programming languages and natural languages is that a programmer has the flexibility to assign any names to variables, methods, and functions in the program, whereas a natural language writer does not. Intuitively, the quality of naming in a program affects the performance of LLMs in program analysis tasks. This paper investigates how naming affects LLMs on code analysis tasks. Specifically, we create a set of datasets with code containing nonsense or misleading names for variables, methods, and functions, respectively. We then use well-trained models (CodeBERT) to perform code analysis tasks on these datasets. The experimental results show that naming has a significant impact on the performance of code analysis tasks based on LLMs, indicating that code representation learning based on LLMs heavily relies on well-defined names in code. Additionally, we conduct a case study on some special code analysis tasks using GPT, providing further insights.",
  "categories": [
    "cs.CR",
    "cs.AI"
  ],
  "primary_category": "cs.CR",
  "doi": "10.4236/jsea.2024.1711044",
  "journal_ref": "Journal of Software Engineering and Applications. Vol.17 No.11, November 2024",
  "arxiv_id": "2307.12488",
  "pdf_url": null,
  "comment": "3 Table, 8 figures",
  "num_versions": null,
  "size_before_bytes": 5653241,
  "size_after_bytes": 5527872
}