{
  "title": "Simultaneous temperature estimation and nonuniformity correction from multiple frames",
  "authors": [
    "Navot Oz",
    "Omri Berman",
    "Nir Sochen",
    "David Mendelovich",
    "Iftach Klapp"
  ],
  "submission_date": "2023-07-23T11:28:25+00:00",
  "revised_dates": [
    "2024-09-11T00:58:30+00:00"
  ],
  "abstract": "IR cameras are widely used for temperature measurements in various applications, including agriculture, medicine, and security. Low-cost IR cameras have the immense potential to replace expensive radiometric cameras in these applications; however, low-cost microbolometer-based IR cameras are prone to spatially variant nonuniformity and to drift in temperature measurements, which limit their usability in practical scenarios.\n  To address these limitations, we propose a novel approach for simultaneous temperature estimation and nonuniformity correction (NUC) from multiple frames captured by low-cost microbolometer-based IR cameras. We leverage the camera's physical image-acquisition model and incorporate it into a deep-learning architecture termed kernel prediction network (KPN), which enables us to combine multiple frames despite imperfect registration between them. We also propose a novel offset block that incorporates the ambient temperature into the model and enables us to estimate the offset of the camera, which is a key factor in temperature estimation.\n  Our findings demonstrate that the number of frames has a significant impact on the accuracy of the temperature estimation and NUC. Moreover, introduction of the offset block results in significantly improved performance compared to vanilla KPN. The method was tested on real data collected by a low-cost IR camera mounted on an unmanned aerial vehicle, showing only a small average error of $0.27-0.54^\\circ C$ relative to costly scientific-grade radiometric cameras.\n  Our method provides an accurate and efficient solution for simultaneous temperature estimation and NUC, which has important implications for a wide range of practical applications.",
  "categories": [
    "cs.CV",
    "eess.IV"
  ],
  "primary_category": "cs.CV",
  "doi": "10.1109/TIP.2024.3458861",
  "journal_ref": null,
  "arxiv_id": "2307.12297",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 57248008,
  "size_after_bytes": 2221218
}