{
  "title": "Microbial Engineering to Mitigate Methane Emissions in Ruminant Livestock -- A Review",
  "authors": [
    "Rehema Iddi Mrutu",
    "Kabir Mustapha Umar",
    "Adnan Abdulhamid",
    "Morris Agaba",
    "Abdussamad Muhammad Abdussamad"
  ],
  "submission_date": "2023-07-25T14:09:26+00:00",
  "revised_dates": [],
  "abstract": "The most recent and promising strategies for mitigating methane emissions in ruminants are reviewed highlighting the potential of reductive acetogenesis as a viable alternative to methanogenesis. The emergence of Clustered Regularly Interspaced Short Palindromic Repeats (CRISPR) technology, and its exceptional precision in genome editing, further enhances the prospects of exploring this avenue. Indeed, research in ruminant methane mitigation has been extensive, and over the years has resulted in the development of a wide variety of mitigation strategies. There is no doubt that the concepts of meat alternatives like lab-meat, microbial proteins and plant proteins may produce equivalent emissions. Reducing methane intensity through breeding and diet has been limited by our inability to phenotype ruminants in a high-throughput manner and the intensification of feed-food competition. Although chemical inhibitors have demonstrated effectiveness in manipulating the rumen microbiota to reduce net emissions, their success is constrained in terms of duration and feasibility in grazing system. Progress in making acetogenesis the dominant hydrogen sink in the rumen has been hampered by the thermodynamic cost of the reaction and the limited hydrogen levels in the rumen environment. We believe that CRISPR may allow the dominance of acetogenesis by converting methanogens into acetogens. We propose Methanobrevibacter ruminantium to be targeted because it is the dominant methane producer in the rumen.",
  "categories": [
    "q-bio.QM"
  ],
  "primary_category": "q-bio.QM",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14372",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}