{
  "title": "Investigating the Robustness of Sequential Recommender Systems Against Training Data Perturbations",
  "authors": [
    "Filippo Betello",
    "Federico Siciliano",
    "Pushkar Mishra",
    "Fabrizio Silvestri"
  ],
  "submission_date": "2023-07-24T23:26:46+00:00",
  "revised_dates": [
    "2024-05-03T00:27:00+00:00"
  ],
  "abstract": "Sequential Recommender Systems (SRSs) are widely employed to model user behavior over time. However, their robustness in the face of perturbations in training data remains a largely understudied yet critical issue. A fundamental challenge emerges in previous studies aimed at assessing the robustness of SRSs: the Rank-Biased Overlap (RBO) similarity is not particularly suited for this task as it is designed for infinite rankings of items and thus shows limitations in real-world scenarios. For instance, it fails to achieve a perfect score of 1 for two identical finite-length rankings. To address this challenge, we introduce a novel contribution: Finite Rank-Biased Overlap (FRBO), an enhanced similarity tailored explicitly for finite rankings. This innovation facilitates a more intuitive evaluation in practical settings. In pursuit of our goal, we empirically investigate the impact of removing items at different positions within a temporally ordered sequence. We evaluate two distinct SRS models across multiple datasets, measuring their performance using metrics such as Normalized Discounted Cumulative Gain (NDCG) and Rank List Sensitivity. Our results demonstrate that removing items at the end of the sequence has a statistically significant impact on performance, with NDCG decreasing up to 60%. Conversely, removing items from the beginning or middle has no significant effect. These findings underscore the criticality of the position of perturbed items in the training data. As we spotlight the vulnerabilities inherent in current SRSs, we fervently advocate for intensified research efforts to fortify their robustness against adversarial perturbations.",
  "categories": [
    "cs.IR",
    "cs.AI"
  ],
  "primary_category": "cs.IR",
  "doi": "10.1007/978-3-031-56060-6_14",
  "journal_ref": "Advances in Information Retrieval. ECIR 2024. Lecture Notes in Computer Science, vol 14609",
  "arxiv_id": "2307.13165",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 4339281,
  "size_after_bytes": 2502181
}