{
  "title": "Neural Representation-Based Method for Metal-induced Artifact Reduction in Dental CBCT Imaging",
  "authors": [
    "Hyoung Suk Park",
    "Kiwan Jeon",
    "Jin Keun Seo"
  ],
  "submission_date": "2023-07-27T01:57:06+00:00",
  "revised_dates": [],
  "abstract": "This study introduces a novel reconstruction method for dental cone-beam computed tomography (CBCT), focusing on effectively reducing metal-induced artifacts commonly encountered in the presence of prevalent metallic implants. Despite significant progress in metal artifact reduction techniques, challenges persist owing to the intricate physical interactions between polychromatic X-ray beams and metal objects, which are further compounded by the additional effects associated with metal-tooth interactions and factors specific to the dental CBCT data environment. To overcome these limitations, we propose an implicit neural network that generates two distinct and informative tomographic images. One image represents the monochromatic attenuation distribution at a specific energy level, whereas the other captures the nonlinear beam-hardening factor resulting from the polychromatic nature of X-ray beams. In contrast to existing CT reconstruction techniques, the proposed method relies exclusively on the Beer--Lambert law, effectively preventing the generation of metal-induced artifacts during the backprojection process commonly implemented in conventional methods. Extensive experimental evaluations demonstrate that the proposed method effectively reduces metal artifacts while providing high-quality image reconstructions, thus emphasizing the significance of the second image in capturing the nonlinear beam-hardening factor.",
  "categories": [
    "cs.CV"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14579",
  "pdf_url": "https://arxiv.org/pdf/2307.14579v1",
  "comment": "10 pages, 5 figures",
  "num_versions": null,
  "size_before_bytes": 1275826,
  "size_after_bytes": 71198
}