{
  "title": "Crossing the Rubicon of Reionization with z~5 QSOs",
  "authors": [
    "A. Grazian",
    "K. Boutsia",
    "E. Giallongo",
    "S. Cristiani",
    "F. Fontanot",
    "M. Bischetti",
    "A. Bongiorno",
    "G. Calderone",
    "G. Cupani",
    "V. D'Odorico",
    "C. Feruglio",
    "F. Fiore",
    "F. Guarneri",
    "M. Porru",
    "I. Saccheo"
  ],
  "submission_date": "2023-07-23T20:22:01+00:00",
  "revised_dates": [
    "2023-08-07T00:03:17+00:00"
  ],
  "abstract": "One of the key open questions in Cosmology is the nature of the sources that completed the cosmological hydrogen Reionization at z~5.2. High-z primeval galaxies have been long considered the main drivers for Reionization, with a minor role played by high-z AGN. However, in order to confirm this scenario, it is fundamental to measure the photo-ionization rate produced by active SMBHs close to the epoch of Reionization. Given the pivotal role played by spectroscopically complete observations of high-z QSOs, in this paper we present the first results of the RUBICON (Reionizing the Universe with BrIght COsmological Nuclei) survey. It consists of a color selected sample of bona-fide z~5 QSO candidates from the Hyper Suprime-Cam Subaru Strategic Survey. Our QSO candidates have been validated both by photometric redshifts based on SED fitting and by spectroscopic redshifts, confirming that they lie at 4.5<z_spec<5.2. A relatively large space density of QSOs (Phi~1.4x10^-8 cMpc^-3) is thus confirmed at z~5 and M1450~-27, consistent with a pure density evolution of the AGN luminosity function from z=4 to z=5, with a mild density evolution rate of 0.25 dex. This indicates that AGN could play a non-negligible role in the cosmic Reionization. The Rubicon of Reionization has been crossed.",
  "categories": [
    "astro-ph.GA",
    "astro-ph.CO"
  ],
  "primary_category": "astro-ph.GA",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12421",
  "pdf_url": null,
  "comment": "Accepted for publication in ApJ, 25 pages, 11 figures, 3 tables, figures 1, 3, 5, and 6 resized",
  "num_versions": null,
  "size_before_bytes": 15609839,
  "size_after_bytes": 226366
}