{
  "title": "Challenges for Monocular 6D Object Pose Estimation in Robotics",
  "authors": [
    "Stefan Thalhammer",
    "Dominik Bauer",
    "Peter Hönig",
    "Jean-Baptiste Weibel",
    "José García-Rodríguez",
    "Markus Vincze"
  ],
  "submission_date": "2023-07-22T21:36:57+00:00",
  "revised_dates": [
    "2024-07-30T00:25:28+00:00"
  ],
  "abstract": "Object pose estimation is a core perception task that enables, for example, object grasping and scene understanding. The widely available, inexpensive and high-resolution RGB sensors and CNNs that allow for fast inference based on this modality make monocular approaches especially well suited for robotics applications. We observe that previous surveys on object pose estimation establish the state of the art for varying modalities, single- and multi-view settings, and datasets and metrics that consider a multitude of applications. We argue, however, that those works' broad scope hinders the identification of open challenges that are specific to monocular approaches and the derivation of promising future challenges for their application in robotics. By providing a unified view on recent publications from both robotics and computer vision, we find that occlusion handling, novel pose representations, and formalizing and improving category-level pose estimation are still fundamental challenges that are highly relevant for robotics. Moreover, to further improve robotic performance, large object sets, novel objects, refractive materials, and uncertainty estimates are central, largely unsolved open challenges. In order to address them, ontological reasoning, deformability handling, scene-level reasoning, realistic datasets, and the ecological footprint of algorithms need to be improved.",
  "categories": [
    "cs.RO",
    "cs.CV"
  ],
  "primary_category": "cs.RO",
  "doi": "10.1109/TRO.2024.3433870",
  "journal_ref": null,
  "arxiv_id": "2307.12172",
  "pdf_url": null,
  "comment": "Accepted for publication in Transactions on Robotics: https://ieeexplore.ieee.org/document/10609560 arXiv admin note: substantial text overlap with arXiv:2302.11827",
  "num_versions": null,
  "size_before_bytes": 27761455,
  "size_after_bytes": 951992
}