{
  "title": "Spin dynamics in ordered phases of anisotropic triangular-lattice antiferromagnet Cs2CoBr4",
  "authors": [
    "T. A. Soldatov",
    "A. I. Smirnov",
    "A. V. Syromyatnikov"
  ],
  "submission_date": "2023-07-30T15:04:46+00:00",
  "revised_dates": [],
  "abstract": "We study spin dynamics of ordered phases of Cs2CoBr4 in a magnetic field using electron spin resonance (ESR) technique and theoretical analysis. This material hosts weakly interacting distorted-triangular-lattice planes of spin-3/2 Co(2+) ions which can be viewed as spin chains coupled by frustrating interactions. Strong single-ion anisotropy allows to describe the low-energy spin dynamics of this system by an effective strongly anisotropic pseudospin-1/2 model. Our ESR data show up to seven branches of magnetic resonance in four magnetic phases arising due to subtle interplay of frustration, low dimensionality and strong anisotropy. In particular, in the low-field collinear stripe phase, the field evolution of modes lying below 200 GHz is described reasonably good by spectra of spin-1 and spin-0 quasiparticles which we obtain using the bond-operator technique. These well-defined excitations can be treated as conventional magnons and bound states of two magnons, respectively. In contrast, numerous excitations lying above 200 GHz are not captured by our theory due to pronounced one-dimensional correlations inside spin chains which govern the spin dynamics at high enough energies. As it was shown before, these modes can be most naturally interpreted as bound states of domain walls in individual chains and their sequence resembles the so-called \"Zeeman ladder\" in anisotropic Ising-like spin chains. Thus, Cs2CoBr4 is a system showing spin-dynamics in ordered state characteristic of both two-dimensional and one-dimensional magnets.",
  "categories": [
    "cond-mat.str-el"
  ],
  "primary_category": "cond-mat.str-el",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16251",
  "pdf_url": "https://arxiv.org/pdf/2307.16251v1",
  "comment": "15 pages, 11 figures",
  "num_versions": null,
  "size_before_bytes": 2873825,
  "size_after_bytes": 91370
}