{
  "title": "Eilenberg-Moore categories and quiver representations of monads and comonads",
  "authors": [
    "Divya Ahuja",
    "Abhishek Banerjee",
    "Surjeet Kour",
    "Samarpita Ray"
  ],
  "submission_date": "2023-07-25T01:40:05+00:00",
  "revised_dates": [
    "2024-03-13T00:55:32+00:00",
    "2024-10-29T00:57:45+00:00",
    "2025-08-15T00:16:56+00:00"
  ],
  "abstract": "We consider representations of quivers taking values in monads or comonads over a Grothendieck category $\\mathcal C$. We treat these as scheme like objects whose ``structure sheaf'' consists of monads or comonads. By using systems of adjoint functors between Eilenberg-Moore categories, we obtain a categorical framework of modules over monad quivers, and of comodules over comonad quivers. Our main objective is to give conditions for these to be Grothendieck categories, which play the role of noncommutative spaces. As with usual ringed spaces, we have to study two kinds of module categories over a monad quiver. The first behaves like a sheaf of modules over a ringed space. The second consists of modules that are cartesian, which resemble quasi-coherent sheaves. We also obtain an extension of the classical quasi-coherator construction to modules over a monad quiver with values in Eilenberg-Moore categories. We establish similar results for comodules over a comonad quiver. One of our key steps is finding a modulus like bound for an endofunctor $U:\\mathcal C\\longrightarrow \\mathcal C$ in terms of $κ(G)$, where $G$ is a generator for $\\mathcal C$ and $κ(G)$ is a cardinal such that $G$ is $κ(G)$-presentable. Another feature of our paper is that we study modules over a monad quiver in two different orientations, which we refer to as ``cis-modules'' and ``trans-modules.'' We conclude with rational pairings of a monad quiver with a comonad quiver, which relate comodules over a comonad quiver to coreflective subcategories of modules over monad quivers.",
  "categories": [
    "math.CT",
    "math.AG",
    "math.RT"
  ],
  "primary_category": "math.CT",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13201",
  "pdf_url": null,
  "comment": "Some updates, several references added",
  "num_versions": null,
  "size_before_bytes": 661383,
  "size_after_bytes": 669478
}