{
  "title": "Emergence of power-law distributions in self-segregation reaction-diffusion processes",
  "authors": [
    "Jean-François de Kemmeter",
    "Adam Byrne",
    "Amy Dunne",
    "Timoteo Carletti",
    "Malbor Asllani"
  ],
  "submission_date": "2023-07-26T10:11:28+00:00",
  "revised_dates": [
    "2023-12-19T04:03:29+00:00",
    "2024-07-08T01:14:40+00:00"
  ],
  "abstract": "Many natural or human-made systems encompassing local reactions and diffusion processes exhibit spatially distributed patterns of some relevant dynamical variable. These interactions, through self-organization and critical phenomena, give rise to power-law distributions, where emergent patterns and structures become visible across vastly different scales. Recent observations reveal power-law distributions in the spatial organization of, e.g., tree clusters and forest patch sizes. Crucially, these patterns do not follow a spatially periodic order but rather a statistical one. Unlike the spatially periodic patterns elucidated by the Turing mechanism, the statistical order of these particular vegetation patterns suggests an incomplete understanding of the underlying mechanisms. Here, we present a novel self-segregation mechanism, driving the emergence of power-law scalings in pattern-forming systems. The model incorporates an Allee-logistic reaction term, responsible for the local growth, and a nonlinear diffusion process accounting for positive interactions and limited resources. According to a self-organized criticality (SOC) principle, after an initial decrease, the system mass reaches an analytically predictable threshold, beyond which it self-segregates into distinct clusters, due to local positive interactions that promote cooperation. Numerical investigations show that the distribution of cluster sizes obeys a power-law with an exponential cutoff.",
  "categories": [
    "nlin.PS",
    "cond-mat.stat-mech",
    "nlin.AO"
  ],
  "primary_category": "nlin.PS",
  "doi": "10.1103/PhysRevE.110.L012201",
  "journal_ref": "Phys. Rev. E, 110(1), L012201 (2024)",
  "arxiv_id": "2307.14083",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 4112347,
  "size_after_bytes": 1065114
}