{
  "title": "Two-dimensional Dyck words",
  "authors": [
    "Stefano Crespi Reghizzi",
    "Antonio Restivo",
    "Pierluigi San Pietro"
  ],
  "submission_date": "2023-07-31T09:39:33+00:00",
  "revised_dates": [
    "2023-09-21T14:06:24+00:00"
  ],
  "abstract": "We propose different ways of lifting the notion of Dyck language from words to 2-dimensional (2D) pictures, by means of new definitions of increasing comprehensiveness. Two of the proposals are based on alternative definitions of a Dyck language, which are equivalent over words but not on pictures. First, the property that any two pairs of matching parentheses are well-nested or disjoint is rephrased for rectangular boxes and leads to the well-nested Dyck, $DW_k$. This is a generalization of the known Chinese box language, but, unlike the Chinese boxes, $DW_k$ is not recognizable by a tiling system. Second, the Dyck cancellation rule is rephrased as a neutralization rule, mapping a quadruple of symbols representing the corners of a subpicture onto neutral symbols.The neutralizable Dyck language $DN_k$ is obtained by iterating neutralizations, starting from 2-by-2 subpictures, until the picture is wholly neutralized. Third, we define the Dyck crossword $DC_k$ as the row-column combination of Dyck word languages, which prescribes that each column and row is a Dyck word. The relation between matching parentheses is represented in $DC_k$ by an edge of a graph situated on the picture grid. Such edges form a circuit, of path length multiple of four, of alternating row and column matches. Length-four circuits have rectangular shape, while longer ones exhibit a large variety of forms. A proper subset of $DC_k$, called quaternate, is also introduced by excluding all circuits of length greater than 4. We prove that $DN_k$ properly includes $DW_k$, and that it coincides with the quaternate $DC_k$ such that the neutralizability relation between subpictures induces a partial order. The 2D languages well-nested, neutralizable, quaternate and Dyck crossword are ordered by strict inclusions. This work can be also seen as a first step towards the definition of context-free picture languages.",
  "categories": [
    "cs.FL"
  ],
  "primary_category": "cs.FL",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16522",
  "pdf_url": "https://arxiv.org/pdf/2307.16522v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 193318,
  "size_after_bytes": 129070
}