{
  "title": "UnIVAL: Unified Model for Image, Video, Audio and Language Tasks",
  "authors": [
    "Mustafa Shukor",
    "Corentin Dancette",
    "Alexandre Rame",
    "Matthieu Cord"
  ],
  "submission_date": "2023-07-30T09:48:36+00:00",
  "revised_dates": [
    "2023-12-22T18:07:41+00:00"
  ],
  "abstract": "Large Language Models (LLMs) have made the ambitious quest for generalist agents significantly far from being a fantasy. A key hurdle for building such general models is the diversity and heterogeneity of tasks and modalities. A promising solution is unification, allowing the support of a myriad of tasks and modalities within one unified framework. While few large models (e.g., Flamingo (Alayrac et al., 2022), trained on massive datasets, can support more than two modalities, current small to mid-scale unified models are still limited to 2 modalities, usually image-text or video-text. The question that we ask is: is it possible to build efficiently a unified model that can support all modalities? To answer this, we propose UnIVAL, a step further towards this ambitious goal. Without relying on fancy datasets sizes or models with billions of parameters, the ~ 0.25B parameter UnIVAL model goes beyond two modalities and unifies text, images, video, and audio into a single model. Our model is efficiently pretrained on many tasks, based on task balancing and multimodal curriculum learning. UnIVAL shows competitive performance to existing state-of-the-art approaches, across image and video-text tasks. The feature representations learned from image and video-text modalities, allows the model to achieve competitive performance when finetuned on audio-text tasks, despite not being pretrained on audio. Thanks to the unified model, we propose a novel study on multimodal model merging via weight interpolation of models trained on different multimodal tasks, showing their benefits in particular for out-of-distribution generalization. Finally, we motivate unification by showing the synergy between tasks. The model weights and code are released here: https://github.com/mshukor/UnIVAL.",
  "categories": [
    "cs.CV",
    "cs.LG",
    "cs.MM",
    "cs.SD",
    "eess.AS"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16184",
  "pdf_url": "https://arxiv.org/pdf/2307.16184v2",
  "comment": "Accepted at TMLR 2023. 40 pages. Project page: https://unival-model.github.io/",
  "num_versions": null,
  "size_before_bytes": 14499530,
  "size_after_bytes": 458495
}