{
  "title": "Characterization of relativistic electron bunch duration and travelling wave structure phase velocity based on momentum spectra measurements on the ARES linac at DESY",
  "authors": [
    "T. Vinatier",
    "R. W. Assmann",
    "C. Bruni",
    "F. Burkart",
    "H. Dinter",
    "S. M. Jaster-Merz",
    "M. Kellermeier",
    "W. Kuropka",
    "F. Mayet",
    "B. Stacey"
  ],
  "submission_date": "2023-07-23T18:04:15+00:00",
  "revised_dates": [],
  "abstract": "The ARES linac at DESY aims to generate and characterize ultrashort electron bunches (fs to sub-fs duration) with high momentum and arrival time stability for the purpose of applications related to accelerator R&D, e.g. development of advanced and compact diagnostics and accelerating structures, test of new accelerator components, medical applications studies, machine learning, etc. During its commissioning phase, the bunch duration characterization of the electron bunches generated at ARES has been performed with an RF-phasing technique relying on momentum spectra measurements, using only common accelerator elements (RF accelerating structures and magnetic spectrometers). The sensitivity of the method allowed highlighting different response times for Mo and Cs2Te cathodes. The measured electron bunch duration in a wide range of machine parameters shows excellent agreement overall with the simulation predictions, thus demonstrating a very good understanding of the ARES operation on the bunch duration aspect. The importance of a precise in-situ experimental determination of the phase velocity of the first travelling wave accelerating structure after the electron source, for which we propose a simple new beam-based method precise down to sub-permille variation respective to the speed of light in vacuum, is emphasized for this purpose. A minimum bunch duration of 20 fs rms, resolution-limited by the space charge forces, is reported. This is, to the best of our knowledge, around 4 times shorter than what has been previously experimentally demonstrated based on RF-phasing techniques with a single RF structure. The present study constitutes a strong basis for future time characterization down to the sub-fs level at ARES, using dedicated X-band transverse deflecting structures.",
  "categories": [
    "physics.acc-ph",
    "physics.ins-det"
  ],
  "primary_category": "physics.acc-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12394",
  "pdf_url": null,
  "comment": "17 pages, 11 figures. To be submitted to Physical Review Accelerators and Beams",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}