{
  "title": "Structural restrictions in local causal discovery: identifying direct causes of a target variable",
  "authors": [
    "Juraj Bodik",
    "Valérie Chavez-Demoulin"
  ],
  "submission_date": "2023-07-29T18:31:35+00:00",
  "revised_dates": [
    "2024-07-29T15:05:43+00:00",
    "2025-05-18T15:41:20+00:00",
    "2025-06-21T17:16:22+00:00"
  ],
  "abstract": "We consider the problem of learning a set of direct causes of a target variable from an observational joint distribution. Learning directed acyclic graphs (DAGs) that represent the causal structure is a fundamental problem in science. Several results are known when the full DAG is identifiable from the distribution, such as assuming a nonlinear Gaussian data-generating process. Here, we are only interested in identifying the direct causes of one target variable (local causal structure), not the full DAG. This allows us to relax the identifiability assumptions and develop possibly faster and more robust algorithms. In contrast to the Invariance Causal Prediction framework, we only assume that we observe one environment without any interventions. We discuss different assumptions for the data-generating process of the target variable under which the set of direct causes is identifiable from the distribution. While doing so, we put essentially no assumptions on the variables other than the target variable. In addition to the novel identifiability results, we provide two practical algorithms for estimating the direct causes from a finite random sample and demonstrate their effectiveness on several benchmark and real datasets.",
  "categories": [
    "stat.ME",
    "math.ST",
    "stat.ML",
    "stat.OT"
  ],
  "primary_category": "stat.ME",
  "doi": "10.1093/biomet/asaf042",
  "journal_ref": "Biometrika (2025)",
  "arxiv_id": "2307.16048",
  "pdf_url": "https://arxiv.org/pdf/2307.16048v4",
  "comment": "Published in Biometrika (2025). 34 pages, 4 figures",
  "num_versions": null,
  "size_before_bytes": 5299130,
  "size_after_bytes": 954420
}