{
  "title": "Thermal form-factor expansion of the dynamical two-point functions of local operators in integrable quantum chains",
  "authors": [
    "Frank Göhmann",
    "Karol K. Kozlowski",
    "Mikhail D. Minin"
  ],
  "submission_date": "2023-07-25T19:48:11+00:00",
  "revised_dates": [
    "2023-11-03T00:19:33+00:00"
  ],
  "abstract": "Evaluating a lattice path integral in terms of spectral data and matrix elements pertaining to a suitably defined quantum transfer matrix, we derive form-factor series expansions for the dynamical two-point functions of arbitrary local operators in fundamental Yang-Baxter integrable lattice models at finite temperature. The summands in the series are parameterised by solutions of the Bethe Ansatz equations associated with the eigenvalue problem of the quantum transfer matrix. We elaborate on the example of the XXZ chain for which the solutions of the Bethe Ansatz equations are sufficiently well understood in certain limiting cases. We work out in detail the case of the spin-zero operators in the antiferromagnetic massive regime at zero temperature. In this case the thermal form-factor series turn into series of multiple integrals with fully explicit integrands. These integrands factorize into an operator-dependent part, determined by the so-called Fermionic basis, and a part which we call the universal weight as it is the same for all spin-zero operators. The universal weight can be inferred from our previous work. The operator-dependent part is rather simple for the most interesting short-range operators. It is determined by two functions $ρ$ and $ω$ for which we obtain explicit expressions in the considered case. As an application we rederive the known explicit form-factor series for the two-point function of the magnetization operator and obtain analogous expressions for the magnetic current and the energy operators.",
  "categories": [
    "cond-mat.stat-mech",
    "hep-th",
    "math-ph"
  ],
  "primary_category": "cond-mat.stat-mech",
  "doi": "10.1088/1751-8121/ad058a",
  "journal_ref": "J. Phys. A: Math. Theor. 56 (2023) 475003",
  "arxiv_id": "2307.13789",
  "pdf_url": null,
  "comment": "37 pages, v2: typos corrected, published version",
  "num_versions": null,
  "size_before_bytes": 455212,
  "size_after_bytes": 281834
}