{
  "title": "Beating Backdoor Attack at Its Own Game",
  "authors": [
    "Min Liu",
    "Alberto Sangiovanni-Vincentelli",
    "Xiangyu Yue"
  ],
  "submission_date": "2023-07-28T13:07:42+00:00",
  "revised_dates": [
    "2023-08-01T13:18:18+00:00",
    "2023-08-04T16:16:28+00:00",
    "2025-04-05T06:43:03+00:00"
  ],
  "abstract": "Deep neural networks (DNNs) are vulnerable to backdoor attack, which does not affect the network's performance on clean data but would manipulate the network behavior once a trigger pattern is added. Existing defense methods have greatly reduced attack success rate, but their prediction accuracy on clean data still lags behind a clean model by a large margin. Inspired by the stealthiness and effectiveness of backdoor attack, we propose a simple but highly effective defense framework which injects non-adversarial backdoors targeting poisoned samples. Following the general steps in backdoor attack, we detect a small set of suspected samples and then apply a poisoning strategy to them. The non-adversarial backdoor, once triggered, suppresses the attacker's backdoor on poisoned data, but has limited influence on clean data. The defense can be carried out during data preprocessing, without any modification to the standard end-to-end training pipeline. We conduct extensive experiments on multiple benchmarks with different architectures and representative attacks. Results demonstrate that our method achieves state-of-the-art defense effectiveness with by far the lowest performance drop on clean data. Considering the surprising defense ability displayed by our framework, we call for more attention to utilizing backdoor for backdoor defense. Code is available at https://github.com/minliu01/non-adversarial_backdoor.",
  "categories": [
    "cs.LG",
    "cs.CR",
    "cs.CV"
  ],
  "primary_category": "cs.LG",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15539",
  "pdf_url": "https://arxiv.org/pdf/2307.15539v4",
  "comment": "Accepted to ICCV 2023",
  "num_versions": null,
  "size_before_bytes": 32654601,
  "size_after_bytes": 547178
}