{
  "title": "Local multiplicity fluctuations in Pb$-$Pb collisions at $\\sqrt{s_{\\rm{NN}}}$ = 2.76 TeV with ALICE at the LHC",
  "authors": [
    "Sheetal Sharma",
    "Ramni Gupta"
  ],
  "submission_date": "2023-07-26T17:53:03+00:00",
  "revised_dates": [],
  "abstract": "Local multiplicity fluctuations are an useful tool to understand the dynamics of the particle production and the phase-space changes from quarks to hadrons in ultrarelativistic heavy-ion collisions. The study of scaling behavior of multiplicity fluctuations in geometrical configurations in multiparticle production can be performed using the factorial moments and recognized in terms of a phenomenon referred to as intermittency. In this contribution, the analysis of the factorial moment is presented for the multiplicity distributions of charged particles produced in Pb$-$Pb collisions at $\\sqrt{s_{\\rm{NN}}}$ = 2.76 TeV, recorded with the ALICE detector at the LHC. The normalized factorial moments (NFM), $F_{q}$ of the spatial configurations of charged particles in two-dimensional angular ($η,\\varphi$) phase space are calculated. For a system with dynamic fluctuations due to the characteristic critical behavior near the phase transition, $F_{q}$ exhibits power-law growth with increasing bin number or decreasing bin size which indicates self-similar fluctuations. Relating the $q^{\\rm{th}}$ order NFM ($F_{q}$) to the second-order NFM ($F_{2}$), the value of the scaling exponent ($ν$) is extracted, which indicates the order of the phase transition within the framework of Ginzburg-Landau theory. The dependence of scaling exponent on the $p_{\\rm{T}}$ bin width will be presented. The measurements are also compared with the corresponding results from the AMPT model and a Toy Monte Carlo (MC) simulation.",
  "categories": [
    "nucl-ex",
    "hep-ex"
  ],
  "primary_category": "nucl-ex",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14407",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 51361,
  "size_after_bytes": 10192
}