{
  "title": "Discrete-phase-space method for driven-dissipative dynamics of strongly interacting bosons in optical lattices",
  "authors": [
    "Kazuma Nagao",
    "Ippei Danshita",
    "Seiji Yunoki"
  ],
  "submission_date": "2023-07-30T08:39:06+00:00",
  "revised_dates": [
    "2024-06-13T10:56:53+00:00",
    "2024-12-16T06:44:40+00:00"
  ],
  "abstract": "We develop a discrete truncated Wigner method to analyze the real-time evolution of dissipative SU(${\\cal N}$) spin systems coupled with a Markovian environment. This semiclassical approach is not only numerically efficient but also particularly capable of accurately capturing local loss processes due to its local linearity in the dynamical equations. We apply the method to a state-of-the-art experiment involving an analog quantum simulator of a three-dimensional dissipative Bose-Hubbard model in a strongly interacting regime. Our numerical results show good agreement with experimental data, specifically capturing the continuous quantum Zeno effect in the dynamics subjected to a gradual change of the ratio between the hopping amplitude and the onsite interaction across the superfluid-Mott insulator crossover. Furthermore, we present comparative analyses with the continuous truncated Wigner method, derived as an effective Fokker-Planck equation for SU(${\\cal N}$) classical spin variables, showing that the discrete method outperforms the continuous one in simulating the long-time dynamics of SU(2) and SU(3) spin models. The discrete phase space framework offers a versatile and powerful tool for exploring a wide range of open quantum many-body systems in dimensions higher than one dimension, where numerically exact methods are impractical due to the exponential growth of the Hilbert space dimension.",
  "categories": [
    "cond-mat.quant-gas",
    "cond-mat.stat-mech",
    "quant-ph"
  ],
  "primary_category": "cond-mat.quant-gas",
  "doi": "10.1103/PhysRevA.110.063310",
  "journal_ref": "Phys. Rev. A 110, 063310 (2024)",
  "arxiv_id": "2307.16170",
  "pdf_url": "https://arxiv.org/pdf/2307.16170v3",
  "comment": "21 pages, 12 figures",
  "num_versions": null,
  "size_before_bytes": 7552672,
  "size_after_bytes": 458133
}