{
  "title": "High Sensitivity Beamformed Observations of the Crab Pulsar's Radio Emission",
  "authors": [
    "Rebecca Lin",
    "Marten H. van Kerkwijk"
  ],
  "submission_date": "2023-07-31T01:36:55+00:00",
  "revised_dates": [
    "2023-09-14T20:23:08+00:00"
  ],
  "abstract": "We analyzed four epochs of beamformed EVN data of the Crab Pulsar at 1658.49 MHz. With the high sensitivity resulting from resolving out the Crab Nebula, we are able to detect even the faint high-frequency components in the folded profile. We also detect a total of 65951 giant pulses, which we use to investigate the rates, fluence, phase, and arrival time distributions. We find that for the main pulse component, our giant pulses represent about 80% of the total flux. This suggests we have a nearly complete giant pulse energy distribution, although it is not obvious how the observed distribution could be extended to cover the remaining 20% of the flux without invoking large numbers of faint bursts for every rotation. Looking at the difference in arrival time between subsequent bursts in single rotations, we confirm that the likelihood of finding giant pulses close to each other is increased beyond that expected for randomly occurring bursts - some giant pulses consist of causally related microbursts, with typical separations of $\\sim\\!30{\\rm\\;μs}$ - but also find evidence that at separations $\\gtrsim\\!100{\\rm\\;μs}$ the likelihood of finding another giant pulse is suppressed. In addition, our high sensitivity enabled us to detect weak echo features in the brightest pulses (at $\\sim\\!0.4\\%$ of the peak giant pulse flux), which are delayed by up to $\\sim\\!300{\\rm\\;μs}$.",
  "categories": [
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.HE",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16362",
  "pdf_url": "https://arxiv.org/pdf/2307.16362v2",
  "comment": "14 pages, 9 figures, accepted for publication in ApJ",
  "num_versions": null,
  "size_before_bytes": 11038128,
  "size_after_bytes": 741305
}