{
  "title": "R-parity Conserving Minimal SUSY U(1)$_{X}$ Model",
  "authors": [
    "Satsuki Oda",
    "Nobuchika Okada",
    "Nathan Papapietro",
    "Dai-suke Takahashi"
  ],
  "submission_date": "2023-07-31T08:23:32+00:00",
  "revised_dates": [],
  "abstract": "We propose a minimal gauged U(1)$_X$ extension of the MSSM with R-parity conservation. In this model, U(1)$_X$ is a generalization of the well-known U(1) $B-L$. Apart from the MSSM particle content, the model includes three right-handed neutrino (RHN) chiral superfields, each carrying a unit U(1)$_X$ charge. In the presence of RHNs, the model is free from all gauge and mixed gauge-gravitational anomalies. However, there are no U(1)$_X$ Higgs chiral superfields with U(1)$_X$ charge $\\pm2$ involved in the model. Two of the RHN superfields are assigned an odd R-parity, while the last one ($Ψ$) has an even parity. The U(1)$_X$ symmetry is radiatively broken by the VEV of the scalar component of $Ψ$. As a consequence of the absence of U(1)$_X$ Higgs fields and the novel R-parity assignment, the three light neutrinos consist of one massless neutrino and two Dirac neutrinos. In the early universe, the right-handed components of the Dirac neutrinos are in thermal equilibrium with the SM particles through the U(1)$_X$ gauge ($Z^\\prime$) boson. The extra energy density from the RHNs is constrained to avoid disrupting the success of BBN, leading to a lower bound on the scale of U(1)$_X$ symmetry breaking. In our model, a mixture of the U(1)$_X$ gaugino and the fermionic component of $Ψ$ becomes a new dark matter (DM) candidate if it is the lightest sparticle mass eigenstate. We examine this DM phenomenology and identify a parameter region that reproduces the observed DM relic density. Furthermore, we consider constraints from the search for $Z'$ boson resonance at the LHC. The three constraints obtained from the success of BBN, the observed DM relic density, and the $Z^\\prime$ resonance search at the LHC complement each other, narrowing down the allowed parameter region.",
  "categories": [
    "hep-ph",
    "astro-ph.CO",
    "hep-ex"
  ],
  "primary_category": "hep-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16480",
  "pdf_url": "https://arxiv.org/pdf/2307.16480v1",
  "comment": "23 pages, 5 figures. arXiv admin note: text overlap with arXiv:1603.01769",
  "num_versions": null,
  "size_before_bytes": 375949,
  "size_after_bytes": 76867
}