{
  "title": "Measuring 3D tree imbalance of plant models using graph-theoretical approaches",
  "authors": [
    "Sophie J. Kersting",
    "A. Luise Kühn",
    "Mareike Fischer"
  ],
  "submission_date": "2023-07-26T23:03:15+00:00",
  "revised_dates": [
    "2023-12-08T17:34:30+00:00"
  ],
  "abstract": "Imbalance in the 3D structure of plants can be an important indicator of insufficient light or nutrient supply, as well as excessive wind, (formerly present) physical barriers, neighbor or storm damage. It can also be a simple means to detect certain illnesses, since some diseases like the apple proliferation disease, an infection with the barley yellow dwarf virus or plant canker can cause abnormal growth, like \\enquote{witches' brooms} or burls, resulting in a deviating 3D plant architecture. However, quantifying imbalance of plant growth is not an easy task, and it requires a mathematically sound 3D model of plants to which imbalance indices can be applied. Current models of plants are often based on stacked cylinders or voxel matrices and do not allow for measuring the degree of 3D imbalance in the branching structure of the whole plant.\n  On the other hand, various imbalance indices are readily available for so-called graph-theoretical trees and are frequently used in areas like phylogenetics and computer science. While only some basic ideas of these indices can be transferred to the 3D setting, graph-theoretical trees are a logical foundation for 3D plant models that allow for elegant and natural imbalance measures.\n  In this manuscript, our aim is thus threefold: We first present a new graph-theoretical 3D model of plants and discuss desirable properties of imbalance measures in the 3D setting. We then introduce and analyze eight different 3D imbalance indices and their properties. Thirdly, we illustrate all our findings using a data set of 63 bush beans. Moreover, we implemented all our indices in the publicly available \\textsf{R}-software package \\textsf{treeDbalance} accompanying this manuscript.",
  "categories": [
    "q-bio.QM",
    "math.CO",
    "q-bio.PE"
  ],
  "primary_category": "q-bio.QM",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14537",
  "pdf_url": "https://arxiv.org/pdf/2307.14537v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 10062157,
  "size_after_bytes": 339010
}