{
  "title": "An ultra-light helium cooled pixel detector for the Mu3e experiment",
  "authors": [
    "Thomas Theodor Rudzki",
    "Heiko Augustin",
    "David Maximilian Immig",
    "Ruben Kolb",
    "Lukas Mandok"
  ],
  "submission_date": "2023-07-27T12:17:47+00:00",
  "revised_dates": [],
  "abstract": "The Mu3e experiment searches for the lepton flavour violating decay $μ^+ \\rightarrow e^+ e^- e^+$ with an ultimate aimed sensitivity of $1$ event in $10^{16}$ decays. To achieve this goal, the experiment must minimize the material budget per tracking layer to $X/X_0\\approx 0.1\\,\\%$ and use gaseous helium as coolant. The pixel detector uses High-Voltage Monolithic Active Pixel Sensors (HV-MAPS) which are thinned down to $50\\, μm$. Both helium cooling and HV-MAPS are a novelty for particle detectors.\n  Here, the work on successfully cooling a pixel tracker using gaseous helium is presented. The thermal studies focus on the two inner tracking layers, the Mu3e vertex detector, and the first operation of a functional thin pixel detector cooled with gaseous helium. The approach, which circulates gaseous helium under ambient pressure conditions with a gas temperature around $0\\,°C$ using a miniature turbo compressor with a mass flow of $2\\,g/s$ allows the vertex detector to operate below $70\\,°C$ at heat densities of up to $350\\,mW/cm^2$. Finally, performance data of the final HV-MAPS used by Mu3e, the MuPix11, is presented. These results demonstrate the feasibility of using HV-MAPS combined with gaseous helium as a coolant for an ultra-thin pixel detector exploring new frontiers in lepton flavor.",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14803",
  "pdf_url": "https://arxiv.org/pdf/2307.14803v1",
  "comment": "conference proceedings submitted to JINST, New Frontiers on Lepton Flavor 2023, Pisa",
  "num_versions": null,
  "size_before_bytes": 327551,
  "size_after_bytes": 44480
}