{
  "title": "Adaptive Consensus-based Reference Generation for the Regulation of Open-Channel Networks",
  "authors": [
    "Marco Fabris",
    "Marco D. Bellinazzi",
    "Andrea Furlanetto",
    "Angelo Cenedese"
  ],
  "submission_date": "2023-07-23T05:46:51+00:00",
  "revised_dates": [
    "2023-10-30T00:09:59+00:00",
    "2024-02-02T01:15:46+00:00"
  ],
  "abstract": "This paper deals with water management over open-channel networks (OCNs) subject to water height imbalance. The OCN is modeled by means of graph theoretic tools and a regulation scheme is designed basing on an outer reference generation loop for the whole OCN and a set of local controllers. Specifically, it is devised a fully distributed adaptive consensus-based algorithm within the discrete-time domain capable of (i) generating a suitable tracking reference that stabilizes the water increments over the underlying network at a common level; (ii) coping with general flow constraints related to each channel of the considered system. This iterative procedure is derived by solving a guidance problem that guarantees to steer the regulated network - represented as a closed-loop system - while satisfying requirements (i) and (ii), provided that a suitable design for the local feedback law controlling each channel flow is already available. The proposed solution converges exponentially fast towards the average consensus thanks to a Metropolis-Hastings design of the network parameters without violating the imposed constraints over time. In addition, numerical results are reported to support the theoretical findings, and the performance of the developed algorithm is discussed in the context of a realistic scenario.",
  "categories": [
    "eess.SY"
  ],
  "primary_category": "eess.SY",
  "doi": "10.1109/LCSYS.2023.3284482",
  "journal_ref": "IEEE Access, vol. 12, pp. 14423-14436, 2024",
  "arxiv_id": "2307.12233",
  "pdf_url": null,
  "comment": "14 pages, 7 figures",
  "num_versions": null,
  "size_before_bytes": 73762983,
  "size_after_bytes": 4860281
}