{
  "title": "Nonminimal global monopole",
  "authors": [
    "Thiago R. P. Caramês"
  ],
  "submission_date": "2023-07-26T03:36:30+00:00",
  "revised_dates": [
    "2023-09-19T00:44:26+00:00",
    "2023-09-20T00:19:33+00:00",
    "2023-10-10T00:06:51+00:00"
  ],
  "abstract": "In this paper, we investigate the gravitational effects of a global monopole that couples nonminimally to gravity. Considering a coupling parameter of arbitrary strength, we have obtained an analytical solution for the field equations of the model in the asymptotic region outside the monopole's core, thus generalizing previous results. Within the weak coupling regime, we have also analyzed how this matter-geometry interplay affects some physical properties of the monopole, such as its radius and the mass enclosed in its core, which are explicitly computed and expressed in terms of the parameter of the theory. Using the Hahari-Loustó toy model, we have also found that the modification of general relativity (GR) may render a positive sign to the monopole mass, which means a global monopole able to exert attractive gravitational force on matter particles surrounding it. Next, we have studied some properties of a hairy black hole carrying such a global monopole charge. In this vein, we verified that the deviation from GR may provide such a spacetime with both event and Cauchy horizons, thus emulating a Reissner-Nordström framework. Finally, we have performed a study of the geodesic motion of timelike particles around this black hole by setting the conditions for stable circular orbits. We also examined the gravitational bending experienced by photons traveling through this geometry, taking into account finite-distance corrections on the deflection angle. Additionally, we make an order-of-magnitude estimate for this extra contribution considering the light bending caused by Sagittarius A*.",
  "categories": [
    "gr-qc"
  ],
  "primary_category": "gr-qc",
  "doi": "10.1103/PhysRevD.108.084002",
  "journal_ref": "Phys. Rev. D 108, 084002 (2023)",
  "arxiv_id": "2307.13939",
  "pdf_url": null,
  "comment": "V4: 22 Pages, 6 figures; Text improved, typos corrected, results unchanged. Matches the published version",
  "num_versions": null,
  "size_before_bytes": 1065064,
  "size_after_bytes": 423852
}