{
  "title": "Swiper: a new paradigm for efficient weighted distributed protocols",
  "authors": [
    "Andrei Tonkikh",
    "Luciano Freitas"
  ],
  "submission_date": "2023-07-28T13:59:04+00:00",
  "revised_dates": [
    "2024-11-04T15:56:35+00:00"
  ],
  "abstract": "The majority of fault-tolerant distributed algorithms are designed assuming a nominal corruption model, in which at most a fraction $f_n$ of parties can be corrupted by the adversary. However, due to the infamous Sybil attack, nominal models are not sufficient to express the trust assumptions in open (i.e., permissionless) settings. Instead, permissionless systems typically operate in a weighted model, where each participant is associated with a weight and the adversary can corrupt a set of parties holding at most a fraction $f_w$ of the total weight.\n  In this paper, we suggest a simple way to transform a large class of protocols designed for the nominal model into the weighted model. To this end, we formalize and solve three novel optimization problems, which we collectively call the weight reduction problems, that allow us to map large real weights into small integer weights while preserving the properties necessary for the correctness of the protocols. In all cases, we manage to keep the sum of the integer weights to be at most linear in the number of parties, resulting in extremely efficient protocols for the weighted model. Moreover, we demonstrate that, on weight distributions that emerge in practice, the sum of the integer weights tends to be far from the theoretical worst case and, sometimes, even smaller than the number of participants.\n  While, for some protocols, our transformation requires an arbitrarily small reduction in resilience (i.e., $f_w = f_n - ε$), surprisingly, for many important problems, we manage to obtain weighted solutions with the same resilience ($f_w = f_n$) as nominal ones. Notable examples include erasure-coded distributed storage and broadcast protocols, verifiable secret sharing, and asynchronous consensus.",
  "categories": [
    "cs.DC",
    "cs.CR"
  ],
  "primary_category": "cs.DC",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15561",
  "pdf_url": "https://arxiv.org/pdf/2307.15561v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1006698,
  "size_after_bytes": 421436
}