{
  "title": "z-GAL -- A NOEMA spectroscopic redshift survey of bright Herschel galaxies: [III] Physical properties",
  "authors": [
    "S. Berta",
    "F. Stanley",
    "D. Ismail",
    "P. Cox",
    "R. Neri",
    "C. Yang",
    "A. J. Young",
    "S. Jin",
    "H. Dannerbauer",
    "T. J. Bakx",
    "A. Beelen",
    "A. Weiss",
    "A. Nanni",
    "A. Omont",
    "P. van der Werf",
    "M. Krips",
    "A. J. Baker",
    "G. Bendo",
    "E. Borsato",
    "V. Buat",
    "K. M. Butler",
    "N. Chartab",
    "A. Cooray",
    "S. Dye",
    "S. Eales",
    "R. Gavazzi",
    "D. Hughes",
    "R. J. Ivison",
    "B. M. Jones",
    "M. Lehnert",
    "L. Marchetti",
    "H. Messias",
    "M. Negrello",
    "I. Perez-Fournon",
    "D. A. Riechers",
    "S. Serjeant",
    "S. Urquhart",
    "C. Vlahakis"
  ],
  "submission_date": "2023-07-28T18:04:05+00:00",
  "revised_dates": [],
  "abstract": "The z-GAL survey observed 137 bright Herschel-selected targets with the IRAM NOrthern Extended Millimeter Array, with the aim to measure their redshift and study their properties. Several of them have been resolved into multiple sources. Consequently, robust spectroscopic redshifts have been measured for 165 individual galaxies in the range 0.8<z<6.5. In this paper we analyse the millimetre spectra of the z-GAL sources, using both their continuum and line emission to derive their physical properties. At least two spectral lines are detected for each source, including transitions of 12CO, [CI], and H2O. The observed 12CO line ratios and spectral line energy distributions of individual sources resemble those of local starbursts. In seven sources the para-H2O(2_11-2_02) transition is detected and follows the IR versus H2O luminosity relation of sub-millimetre galaxies. The molecular gas mass of the z-GAL sources is derived from their 12CO, [CI], and sub-millimetre dust continuum emission. The three tracers lead to consistent results, with the dust continuum showing the largest scatter when compared to 12CO. The gas-to-dust mass ratio of these sources was computed by combining the information derived from 12CO and the dust continuum and has a median value of 107, similar to star-forming galaxies of near-solar metallicity. The same combined analysis leads to depletion timescales in the range between 0.1 and 1.0 Gyr, which place the z-GAL sources between the `main sequence' of star formation and the locus of starbursts. Finally, we derived a first estimate of stellar masses - modulo possible gravitational magnification - by inverting known gas scaling relations: the z-GAL sample is confirmed to be mostly composed by starbursts, whereas ~25% of its members lie on the main sequence of star-forming galaxies (within +/- 0.5 dex).",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.1051/0004-6361/202346803",
  "journal_ref": "A&A 678, A28 (2023)",
  "arxiv_id": "2307.15748",
  "pdf_url": "https://arxiv.org/pdf/2307.15748v1",
  "comment": "Accepted for publication on A&A; 26 pages; 12 figures",
  "num_versions": null,
  "size_before_bytes": 5150330,
  "size_after_bytes": 370642
}