{
  "title": "Distributions of the Density and Kinetic Temperature of the Molecular Gas in the Central Region of NGC 613 using Hierarchical Bayesian Inference",
  "authors": [
    "Hiroyuki Kaneko",
    "Tomoka Tosaki",
    "Kunihiko Tanaka",
    "Yusuke Miyamoto"
  ],
  "submission_date": "2023-07-26T10:35:24+00:00",
  "revised_dates": [],
  "abstract": "We present position-position-velocity (PPV) cubes of the physical and chemical properties of the molecular medium in the central 1.2 kpc region of the active galaxy NGC 613 at a PPV resolution of 0.$^{\\prime\\prime}$8$\\times$0.$^{\\prime\\prime}$8$\\times$10 km s$^{-1}$ (0.$^{\\prime\\prime}$8 = $\\sim$68 pc). We used eight molecular lines obtained with ALMA. Non-LTE calculation with hierarchical Bayesian inference was used to construct PPV cubes of the gas kinetic temperature ($T_\\mathrm{kin}$), molecular hydrogen volume density ($n_\\mathrm{H_2}$), column densities ($N_\\mathrm{H_2}$), and fractional abundances of four molecules ($^{12}$C$^{18}$O, HCN, HCO$^+$, and CS). The derived $n_\\mathrm{H_2}$, $N_\\mathrm{H_2}$, and $T_\\mathrm{kin}$ ranged 10$^{3.21-3.85}$ cm$^{-3}$, 10$^{20.8-22.1}$ cm$^{-2}$, and 10$^{2.33-2.64}$ K, respectively. Our first application of the non-LTE method with the hierarchical Bayesian inference to external galaxies yielded compatible results compared with the previous studies of this galaxy, demonstrating the efficacy of this method for application to other galaxies. We examined the correlation between gas surface density $Σ_\\mathrm{H_2}$ (converted from $N_\\mathrm{H_2}$) and the star formation rate $Σ_\\mathrm{SFR}$ obtained from the 110 GHz continuum flux map and found two distinct sequences in the $Σ_\\mathrm{H_2}$-$Σ_\\mathrm{SFR}$ diagram; the southwestern subregion of the star-forming ring exhibited a $\\sim$0.5 dex higher star formation efficiency (SFE; $Σ_\\mathrm{SFR}/Σ_\\mathrm{H_2}$) than the eastern subregion. However, they exhibited no systematic difference in $n_\\mathrm{H_2}$, which is often argued as a driver of SFE variation. We suggest that the deficiency of molecular gas in the southwestern subregion, where no significant gas supply is evident along the offset ridges in the bar, is responsible for the elevated SFE.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14092",
  "pdf_url": null,
  "comment": "18 pages, 14 figures, accepted to ApJ",
  "num_versions": null,
  "size_before_bytes": 2224536,
  "size_after_bytes": 362620
}