{
  "title": "Applying Machine Learning Methods to Laser Acceleration of Protons: Lessons Learned from Synthetic Data",
  "authors": [
    "Ronak Desai",
    "Thomas Zhang",
    "Ricky Oropeza",
    "John J. Felice",
    "Joseph R. Smith",
    "Alona Kryshchenko",
    "Chris Orban",
    "Michael L. Dexter",
    "Anil K. Patnaik"
  ],
  "submission_date": "2023-07-29T17:57:22+00:00",
  "revised_dates": [
    "2023-08-27T16:33:06+00:00",
    "2023-09-11T19:54:43+00:00",
    "2024-04-12T16:46:35+00:00",
    "2024-04-16T04:48:10+00:00"
  ],
  "abstract": "Researchers in the field of ultra-intense laser science are beginning to embrace machine learning methods. In this study we consider three different machine learning methods -- a two-hidden layer neural network, Support Vector Regression and Gaussian Process Regression -- and compare how well they can learn from a synthetic data set for proton acceleration in the Target Normal Sheath Acceleration regime. The synthetic data set was generated from a previously published theoretical model by Fuchs et al. 2005 that we modified. Once trained, these machine learning methods can assist with efforts to maximize the peak proton energy, or with the more general problem of configuring the laser system to produce a proton energy spectrum with desired characteristics. In our study we focus on both the accuracy of the machine learning methods and the performance on one GPU including the memory consumption. Although it is arguably the least sophisticated machine learning model we considered, Support Vector Regression performed very well in our tests.",
  "categories": [
    "physics.plasm-ph",
    "physics.comp-ph",
    "physics.data-an"
  ],
  "primary_category": "physics.plasm-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16036",
  "pdf_url": "https://arxiv.org/pdf/2307.16036v5",
  "comment": "new section with an optimization task, updated references",
  "num_versions": null,
  "size_before_bytes": 8747570,
  "size_after_bytes": 449144
}