{
  "title": "Soft-photon theorem for pion-proton elastic scattering revisited",
  "authors": [
    "Piotr Lebiedowicz",
    "Otto Nachtmann",
    "Antoni Szczurek"
  ],
  "submission_date": "2023-07-24T10:23:41+00:00",
  "revised_dates": [
    "2024-10-02T00:45:03+00:00",
    "2024-11-18T01:06:43+00:00"
  ],
  "abstract": "We discuss the reactions $πp \\to πp$ and $πp \\to πp γ$ from a general quantum field theory (QFT) point of view, describing these reactions in QCD and lowest relevant order of electromagnetism. We consider the pion-proton elastic scattering both off shell and on shell. The on-shell amplitudes for $π^{\\pm} p \\to π^{\\pm} p$ scattering are described by two invariant amplitudes, while the off-shell amplitudes contain eight invariant amplitudes. We study the photon emission amplitudes in the soft-photon limit where the c.m. photon energy $ω\\to 0$. The Laurent expansion in $ω$ of the $π^{\\pm} p \\to π^{\\pm} p γ$ amplitudes is considered and the terms of the orders $ω^{-1}$ and $ω^{0}$ are derived. These terms can be expressed by the on-shell invariant amplitudes and their partial derivatives with respect to $s$ and $t$. The pole term $\\propto ω^{-1}$ in the amplitudes corresponds to Weinberg's soft-photon theorem and is well known from the literature. We derive the next-to-leading term $\\propto ω^{0}$ using only rigorous methods of QFT. We give the relation of the Laurent series for $π^{0} p \\to π^{0} p γ$ and Low's soft-photon theorem. Our formulas for the amplitudes in the limit $ω\\to 0$ are valid for photon momentum $k$ satisfying $k^{2} \\geqslant 0$, $k^{0} = ω\\geqslant 0$, that is, for both real and virtual photons. Here we consider a limit where with $ω\\to 0$ we have also $k^{2} \\to 0$. We discuss the behavior of the corresponding cross-sections for $π^{-} p \\to π^{-} p γ$ with respect to $ω$ for $ω\\to 0$. We consider cross sections for unpolarized as well as polarized protons in the initial and final states.",
  "categories": [
    "hep-ph",
    "hep-th"
  ],
  "primary_category": "hep-ph",
  "doi": "10.1103/PhysRevD.110.094028",
  "journal_ref": "Phys. Rev. D 110 (2024) 094028",
  "arxiv_id": "2307.12673",
  "pdf_url": null,
  "comment": "36 pages, 5 figures, v3 accepted for publication in PRD",
  "num_versions": null,
  "size_before_bytes": 4781526,
  "size_after_bytes": 584392
}