{
  "title": "CTAGE: Curvature-Based Topology-Aware Graph Embedding for Learning Molecular Representations",
  "authors": [
    "Yili Chen",
    "Zhengyu Li",
    "Zheng Wan",
    "Hui Yu",
    "Xian Wei"
  ],
  "submission_date": "2023-07-25T06:13:01+00:00",
  "revised_dates": [
    "2024-01-19T01:37:27+00:00"
  ],
  "abstract": "AI-driven drug design relies significantly on predicting molecular properties, which is a complex task. In current approaches, the most commonly used feature representations for training deep neural network models are based on SMILES and molecular graphs. While these methods are concise and efficient, they have limitations in capturing complex spatial information. Recently, researchers have recognized the importance of incorporating three-dimensional information of molecular structures into models. However, capturing spatial information requires the introduction of additional units in the generator, bringing additional design and computational costs. Therefore, it is necessary to develop a method for predicting molecular properties that effectively combines spatial structural information while maintaining the simplicity and efficiency of graph neural networks. In this work, we propose an embedding approach CTAGE, utilizing $k$-hop discrete Ricci curvature to extract structural insights from molecular graph data. This effectively integrates spatial structural information while preserving the training complexity of the network. Experimental results indicate that introducing node curvature significantly improves the performance of current graph neural network frameworks, validating that the information from k-hop node curvature effectively reflects the relationship between molecular structure and function.",
  "categories": [
    "cs.LG",
    "cs.AI",
    "q-bio.QM"
  ],
  "primary_category": "cs.LG",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13275",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 7679236,
  "size_after_bytes": 226706
}