{
  "title": "Self-optimization wavelet-learning method for predicting nonlinear thermal conductivity of highly heterogeneous materials with randomly hierarchical configurations",
  "authors": [
    "Jiale Linghu",
    "Hao Dong",
    "Weifeng Gao",
    "Yufeng Nie"
  ],
  "submission_date": "2023-07-28T08:53:49+00:00",
  "revised_dates": [
    "2023-08-11T02:39:18+00:00"
  ],
  "abstract": "In the present work, we propose a self-optimization wavelet-learning method (SO-W-LM) with high accuracy and efficiency to compute the equivalent nonlinear thermal conductivity of highly heterogeneous materials with randomly hierarchical configurations. The randomly structural heterogeneity, temperature-dependent nonlinearity and material property uncertainty of heterogeneous materials are considered within the proposed self-optimization wavelet-learning framework. Firstly, meso- and micro-structural modeling of random heterogeneous materials are achieved by the proposed computer representation method, whose simulated hierarchical configurations have relatively high volume ratio of material inclusions. Moreover, temperature-dependent nonlinearity and material property uncertainties of random heterogeneous materials are modeled by a polynomial nonlinear model and Weibull probabilistic model, which can closely resemble actual material properties of heterogeneous materials. Secondly, an innovative stochastic three-scale homogenized method (STSHM) is developed to compute the macroscopic nonlinear thermal conductivity of random heterogeneous materials. Background meshing and filling techniques are devised to extract geometry and material features of random heterogeneous materials for establishing material databases. Thirdly, high-dimensional and highly nonlinear material features of material databases are preprocessed and reduced by wavelet decomposition technique. The neural networks are further employed to excavate the predictive models from dimension-reduced low-dimensional data.",
  "categories": [
    "physics.comp-ph"
  ],
  "primary_category": "physics.comp-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15403",
  "pdf_url": "https://arxiv.org/pdf/2307.15403v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 25642499,
  "size_after_bytes": 296967
}