{
  "title": "Evolution of Non-parametric Morphology of Galaxies in the JWST CEERS Field at $z\\simeq$0.8-3.0",
  "authors": [
    "Yao Yao",
    "Jie Song",
    "Xu Kong",
    "Guanwen Fang",
    "Hong-Xin Zhang",
    "Xinkai Chen"
  ],
  "submission_date": "2023-07-26T06:21:36+00:00",
  "revised_dates": [],
  "abstract": "Galaxy morphology is one of the most fundamental ways to describe galaxy properties, but the morphology we observe may be affected by wavelength and spatial resolution, which may introduce systematic bias when comparing galaxies at different redshift. Taking advantage of the broad wavelength coverage from optical to near-IR and high resolution NIRCam instrument of JWST, we measure the non-parametric morphological parameters of a total of 1376 galaxies at $z\\simeq$0.8-3.0 in the CEERS field through an optimized code called {\\tt\\string statmorph\\_csst}. We divide our sample into three redshift intervals and investigate the wavelength- and redshift-dependence of the morphological parameters. We also explore how the widely-used galaxy type classification methods based on the morphological parameters depend on wavelength and spatial resolution. We find that there are variations in all morphological parameters with rest-frame wavelength ($λ_{\\rm rf}$), especially at the short wavelength end, and the $λ_{\\rm rf}$ mainly affects the classification between late-type and early-type galaxy. As the $λ_{\\rm rf}$ increases, the galaxies on the $G-M_{20}$ diagram move to the upper left with a slope of -0.23$\\pm$0.03 on average. We find that spatial resolution mainly affects the merger identification. The merger fraction in F200W resolution can be $\\ga$2 times larger than that in F444W resolution. Furthermore, We compare the morphological parameter evolution of galaxies with different stellar masses. We find that there are differences in the morphological evolution of high- and low-mass (log$M_*\\geqslant$10 and 9$<$log$M_*<$10) galaxies in the studied redshift range, which may be caused by their different evolution paths.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13975",
  "pdf_url": null,
  "comment": "11 pages, 5 figures, accepted in ApJ",
  "num_versions": null,
  "size_before_bytes": 1656340,
  "size_after_bytes": 545103
}