{
  "title": "Distinctive Features of Hairy Black Holes in Teleparallel Gauss-Bonnet Gravity",
  "authors": [
    "Sebastian Bahamonde",
    "Daniela D. Doneva",
    "Ludovic Ducobu",
    "Christian Pfeifer",
    "Stoytcho S. Yazadjiev"
  ],
  "submission_date": "2023-07-27T09:19:59+00:00",
  "revised_dates": [
    "2023-09-25T16:06:35+00:00"
  ],
  "abstract": "We examine the teleparallel formulation of non-minimally coupled scalar Einstein-Gauss-Bonnet gravity. In the teleparallel formulation, gravity is described by torsion instead of curvature, causing the usual Gauss-Bonnet invariant expressed through curvature to decay into two separate invariants built from torsion. Consequently, the teleparallel formulation permits broader possibilities for non-minimal couplings between spacetime geometry and the scalar field. In our teleparallel theory, there are two different branches of equations in spherical symmetry depending on how one solves the antisymmetric part of the field equations, leading to a real and a complex tetrad. We first show that the real tetrad seems to be incompatible with the regularity of the equations at the event horizon, which is a symptom that scalarized black hole solutions beyond the Riemannian Einstein-Gauss-Bonnet theory might not exist. Therefore, we concentrate our study on the complex tetrad. This leads to the emergence of scalarized black hole solutions, where the torsion acts as the scalar field source. Extending our previous work, we study monomial non-minimal couplings of degrees one and two, which are intensively studied in conventional, curvature-based, scalar Einstein-Gauss-Bonnet gravity. We discover that the inclusion of torsion can potentially alter the stability of the resulting scalarized black holes. Specifically, our findings indicate that for a quadratic coupling, which is entirely unstable in the pure curvature formulation, the solutions induced by torsion may exhibit stability within certain regions of the parameter space. In a limiting case, we were also able to find black holes with a strong scalar field close to the horizon but with a vanishing scalar charge.",
  "categories": [
    "gr-qc",
    "astro-ph.HE",
    "hep-th"
  ],
  "primary_category": "gr-qc",
  "doi": "10.1103/PhysRevD.108.064044",
  "journal_ref": "Phys.Rev.D 108 (2023), 064044",
  "arxiv_id": "2307.14720",
  "pdf_url": "https://arxiv.org/pdf/2307.14720v2",
  "comment": "14 pages, 14 figures. Matches published version in PRD",
  "num_versions": null,
  "size_before_bytes": 696531,
  "size_after_bytes": 145805
}