{
  "title": "Search with stochastic home-returns can expedite classical first passage under resetting",
  "authors": [
    "Arup Biswas",
    "Anupam Kundu",
    "Arnab Pal"
  ],
  "submission_date": "2023-07-30T18:19:09+00:00",
  "revised_dates": [
    "2023-11-24T04:48:01+00:00",
    "2024-10-10T10:26:38+00:00"
  ],
  "abstract": "Classical first passage under resetting is a paradigm in the search process. Despite its multitude of applications across interdisciplinary sciences, experimental realizations of such resetting processes posit practical challenges in calibrating these zero time irreversible transitions. Here, we consider a strategy in which resetting is performed using finite time return protocols in lieu of instantaneous returns. These controls could also be accompanied with random fluctuations or errors allowing target detection even during the return phase. To better understand the phenomena, we develop a unified renewal approach that can encapsulate arbitrary search processes centered around home in a fairly general topography containing targets, various resetting times and return mechanisms in arbitrary dimensions. While such finite-time protocols would apparently seem to prolong the overall search time in comparison to the instantaneous resetting process, we show \\textit{on the contrary} that a significant speed-up can be gained by leveraging the stochasticity in home-returns. The formalism is then explored to reveal a universal criterion distilling the benefits of this strategy. We demonstrate how this general principle can be utilized to improve overall performance of a one-dimensional diffusive search process reinforced with experimentally feasible parameters. We believe that such strategies designed with inherent randomness can be made optimal with precise controllability in complex search processes.",
  "categories": [
    "cond-mat.stat-mech"
  ],
  "primary_category": "cond-mat.stat-mech",
  "doi": "10.1103/PhysRevE.110.L042101",
  "journal_ref": "Physical Review E, 110, L042101, 2024",
  "arxiv_id": "2307.16294",
  "pdf_url": "https://arxiv.org/pdf/2307.16294v3",
  "comment": "6 pages, 3 figures",
  "num_versions": null,
  "size_before_bytes": 17704972,
  "size_after_bytes": 538388
}