{
  "title": "Lensed type Ia supernovae in light of SN Zwicky and iPTF16geu",
  "authors": [
    "Ana Sainz de Murieta",
    "Thomas E. Collett",
    "Mark R. Magee",
    "Luke Weisenbach",
    "Coleman M. Krawczyk",
    "Wolfgang Enzi"
  ],
  "submission_date": "2023-07-24T15:25:38+00:00",
  "revised_dates": [
    "2023-07-26T00:23:13+00:00",
    "2023-10-05T00:34:26+00:00"
  ],
  "abstract": "Strong gravitationally lensed supernovae (glSNe) are a powerful probe to obtain a measure of the expansion rate of the Universe, but they are also extremely rare. To date, only two glSNe with multiple images strongly lensed by galaxies have been found, but their short time delays make them unsuitable for cosmography. Here, we simulate a realistic catalogue of lensed supernovae and study the characteristics of the population of detectable systems for different surveys. Compared to previous studies, our simulations also account for the effect of microlensing and its impact on the glSNe yields. We show that the properties of glSNe in shallow surveys (such as the Zwicky Transient Facility; ZTF) are determined by the need for large magnifications, which favours systems of four images with short time delays and low image separations. This picture is consistent with the properties of iPTF16geu and SN Zwicky, but is not representative of the population found in deeper surveys, which are limited by the volume of the Universe that is strongly lensed. For deeper surveys, such as the Legacy Survey of Space and Time (LSST), glSNe show longer time delays and greater angular separations, and the inclusion of microlensing results in 8$\\%$ of glSNe becoming demagnified under the detection threshold. In the 10 years of the survey LSST should be able to find $\\approx$ 180 systems, of which 70 will be suited for cosmography enabling a $\\approx$ 1.2$\\%$ precision $H_0$ measurement with LSST glSNe.",
  "categories": [
    "astro-ph.CO",
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.CO",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12881",
  "pdf_url": null,
  "comment": "12 pages, 9 figures. Submitted",
  "num_versions": null,
  "size_before_bytes": 2359233,
  "size_after_bytes": 815501
}