{
  "title": "Non-Hermitian and Liouvillian skin effects in magnetic systems",
  "authors": [
    "Xin Li",
    "Mohamed Al Begaowe",
    "Shu Zhang",
    "Benedetta Flebus"
  ],
  "submission_date": "2023-07-28T20:19:42+00:00",
  "revised_dates": [
    "2024-09-20T00:57:33+00:00",
    "2025-05-09T17:38:15+00:00",
    "2025-10-17T15:34:00+00:00"
  ],
  "abstract": "The non-Hermitian skin effect (NHSE) has emerged as a hallmark of non-Hermitian physics, with far-reaching implications for transport, topology, and sensing. While recent works have uncovered the NHSE in magnetic systems, these analyses rely on effective non-Hermitian Hamiltonians, thereby leaving open critical questions regarding their applicability and predictive power in experimentally feasible platforms. Here, we address this gap by exploring both the non-Hermitian and Liouvillian dynamics of a spin chain coupled to a shared bosonic reservoir. We identify the parameter regime in which these frameworks yield congruent predictions, while showing that the non-Hermitian approach fails to capture essential dynamical features -- such as relevant timescales and conditions for experimental observability. Our analysis also reveals that the NHSE stems from the interplay between chiral spin couplings and reciprocal nonlocal dissipation -- two interactions that can naturally occur in magnetic crystals and be easily engineered in magnetic heterostructures. Focusing on a concrete example of such heterostructures, we establish an explicit connection between their Landau-Lifshitz-Gilbert (LLG) dynamics and our microscopic model, providing a tangible route toward realizing the NHSE in an experimentally relevant spintronics setup.",
  "categories": [
    "quant-ph",
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "quant-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15792",
  "pdf_url": "https://arxiv.org/pdf/2307.15792v4",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 6771207,
  "size_after_bytes": 542719
}