{
  "title": "A Generic Framework for Hidden Markov Models on Biomedical Data",
  "authors": [
    "Richard Fechner",
    "Jens Dörpinghaus",
    "Robert Rockenfeller",
    "Jennifer Faber"
  ],
  "submission_date": "2023-07-25T06:50:23+00:00",
  "revised_dates": [],
  "abstract": "Background: Biomedical data are usually collections of longitudinal data assessed at certain points in time. Clinical observations assess the presences and severity of symptoms, which are the basis for description and modeling of disease progression. Deciphering potential underlying unknowns solely from the distinct observation would substantially improve the understanding of pathological cascades. Hidden Markov Models (HMMs) have been successfully applied to the processing of possibly noisy continuous signals. The aim was to improve the application HMMs to multivariate time-series of categorically distributed data. Here, we used HHMs to study prediction of the loss of free walking ability as one major clinical deterioration in the most common autosomal dominantly inherited ataxia disorder worldwide. We used HHMs to investigate the prediction of loss of the ability to walk freely, representing a major clinical deterioration in the most common autosomal-dominant inherited ataxia disorder worldwide.\n  Results: We present a prediction pipeline which processes data paired with a configuration file, enabling to construct, validate and query a fully parameterized HMM-based model. In particular, we provide a theoretical and practical framework for multivariate time-series inference based on HMMs that includes constructing multiple HMMs, each to predict a particular observable variable. Our analysis is done on random data, but also on biomedical data based on Spinocerebellar ataxia type 3 disease.\n  Conclusions: HHMs are a promising approach to study biomedical data that naturally are represented as multivariate time-series. Our implementation of a HHMs framework is publicly available and can easily be adapted for further applications.",
  "categories": [
    "cs.DB",
    "q-bio.QM"
  ],
  "primary_category": "cs.DB",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13288",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 668243,
  "size_after_bytes": 152727
}