{
  "title": "Freeform three-mirror anastigmatic large-aperture telescope and receiver optics for CMB-S4",
  "authors": [
    "Patricio A. Gallardo",
    "Roberto Puddu",
    "Kathleen Harrington",
    "Bradford Benson",
    "John Carlstrom",
    "Simon R. Dicker",
    "Nick Emerson",
    "Jon E. Gudmundsson",
    "Michele Limon",
    "Jeff McMahon",
    "Johanna M. Nagy",
    "Tyler Natoli",
    "Michael D. Niemack",
    "Stephen Padin",
    "John Ruhl",
    "Sara M. Simon",
    "the CMB-S4 collaboration"
  ],
  "submission_date": "2023-07-24T16:46:54+00:00",
  "revised_dates": [],
  "abstract": "CMB-S4, the next-generation ground-based cosmic microwave background (CMB) observatory, will provide detailed maps of the CMB at millimeter wavelengths to dramatically advance our understanding of the origin and evolution of the universe. CMB-S4 will deploy large and small aperture telescopes with hundreds of thousands of detectors to observe the CMB at arcminute and degree resolutions at millimeter wavelengths. Inflationary science benefits from a deep delensing survey at arcminute resolutions capable of observing a large field of view at millimeter wavelengths. This kind of survey acts as a complement to a degree angular resolution survey. The delensing survey requires a nearly uniform distribution of cameras per frequency band across the focal plane. We present a large-throughput, large-aperture (5-meter diameter) freeform three-mirror anastigmatic telescope and an array of 85 cameras for CMB observations at arcminute resolutions, which meets the needs of the delensing survey of CMB-S4. A detailed prescription of this three-mirror telescope and cameras is provided, with a series of numerical calculations that indicate expected optical performance and mechanical tolerance.",
  "categories": [
    "astro-ph.IM"
  ],
  "primary_category": "astro-ph.IM",
  "doi": "10.1364/AO.501744",
  "journal_ref": null,
  "arxiv_id": "2307.12931",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 14121499,
  "size_after_bytes": 511193
}