{
  "title": "Unleashing the Potential of Stage-Wise Decision-Making in Scheduling of Graph-Structured Tasks over Mobile Vehicular Clouds",
  "authors": [
    "Minghui Liwang",
    "Bingshuo Guo",
    "Zhanxi Ma",
    "Yuhan Su",
    "Jian Jin",
    "Seyyedali Hosseinalipour",
    "Xianbin Wang",
    "Huaiyu Dai"
  ],
  "submission_date": "2023-07-28T11:34:47+00:00",
  "revised_dates": [
    "2023-09-08T06:56:20+00:00",
    "2023-12-20T10:49:09+00:00"
  ],
  "abstract": "To effectively process high volume of data across a fleet of dynamic and distributed vehicles, it is crucial to implement resource provisioning techniques that can provide reliable, cost-effective, and timely computing services. This article explores computation-intensive task scheduling over mobile vehicular clouds (MVCs). We use undirected weighted graphs (UWGs) to model both the execution of tasks and communication patterns among vehicles in an MVC. We then study reliable and timely scheduling of UWG tasks through a novel mechanism, operating on two complementary decision-making stages: Plan A and Plan B. Plan A entails a proactive decision-making approach, leveraging historical statistical data for the preemptive creation of an optimal mapping ($α$) between tasks and the MVC prior to practical task scheduling. In contrast, Plan B explores a real-time decision-making paradigm, functioning as a reliable contingency plan. It seeks a viable mapping ($β$) if $α$ encounters failures during task scheduling due to the unpredictable nature of the network. Furthermore, we provide an in-depth exploration of the procedural intricacies and key contributing factors that underpin the success of our mechanism. Additionally, we present a case study showcasing the superior performance on time efficiency and computation overhead. We further discuss a series of open directions for future research.",
  "categories": [
    "cs.DC",
    "cs.NI",
    "cs.SI"
  ],
  "primary_category": "cs.DC",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15490",
  "pdf_url": "https://arxiv.org/pdf/2307.15490v3",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 18272884,
  "size_after_bytes": 2545544
}