{
  "title": "Revisiting greenhouse gases adsorption in carbon nanostructures: advances through a combined first-principles and molecular simulation approach",
  "authors": [
    "Henrique Musseli Cezar",
    "Teresa Duarte Lanna",
    "Daniela Andrade Damasceno",
    "Alexsandro Kirch",
    "Caetano Rodrigues Miranda"
  ],
  "submission_date": "2023-07-21T17:04:58+00:00",
  "revised_dates": [],
  "abstract": "Carbon nanostructures are promising materials to improve the performance of current gas separation membrane technologies. From the molecular modeling perspective, an accurate description of the interfacial interactions is mandatory to understand the gas selectivity in the context of greenhouse gases applications. Most of the molecular dynamics simulations studies considered available force fields with the standard Lorentz-Berthelot (LB) mixing rules to describe the interaction among carbon dioxide (CO2), methane (CH4) and carbon structures. We performed a systematic study in which we showed the LB underestimates the fluid/solid interaction energies compared to the density functional theory (DFT) calculation results. To improve the classical description, we propose a new parametrization for the cross-terms of the Lenard-Jones (LJ) potential by fitting DFT forces and energies. The effects of the new parametrization on the gases adsorption within single-walled carbon nanotubes (SWCNTs) with varying diameters, are investigated with Grand Canonical Monte Carlo simulations. We observed considerable differences in the CO2 and CH4 density within SWCNTs compared to those obtained with the standard approach. Our study highlights the importance of going beyond the traditional LB mixing rules in studies involving solid/fluid interfaces of confined systems. The revised mixing terms enhanced fluid/carbon interface description with excellent transferability ranging from SWCNTs to graphene.",
  "categories": [
    "cond-mat.mes-hall"
  ],
  "primary_category": "cond-mat.mes-hall",
  "doi": "10.1016/j.apsusc.2024.160659",
  "journal_ref": null,
  "arxiv_id": "2307.11710",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}