{
  "title": "Hybrid Representation-Enhanced Sampling for Bayesian Active Learning in Musculoskeletal Segmentation of Lower Extremities",
  "authors": [
    "Ganping Li",
    "Yoshito Otake",
    "Mazen Soufi",
    "Masashi Taniguchi",
    "Masahide Yagi",
    "Noriaki Ichihashi",
    "Keisuke Uemura",
    "Masaki Takao",
    "Nobuhiko Sugano",
    "Yoshinobu Sato"
  ],
  "submission_date": "2023-07-26T06:52:29+00:00",
  "revised_dates": [
    "2023-12-21T01:52:22+00:00"
  ],
  "abstract": "Purpose: Manual annotations for training deep learning (DL) models in auto-segmentation are time-intensive. This study introduces a hybrid representation-enhanced sampling strategy that integrates both density and diversity criteria within an uncertainty-based Bayesian active learning (BAL) framework to reduce annotation efforts by selecting the most informative training samples. Methods: The experiments are performed on two lower extremity (LE) datasets of MRI and CT images, focusing on the segmentation of the femur, pelvis, sacrum, quadriceps femoris, hamstrings, adductors, sartorius, and iliopsoas, utilizing a U-net-based BAL framework. Our method selects uncertain samples with high density and diversity for manual revision, optimizing for maximal similarity to unlabeled instances and minimal similarity to existing training data. We assess the accuracy and efficiency using Dice and a proposed metric called reduced annotation cost (RAC), respectively. We further evaluate the impact of various acquisition rules on BAL performance and design an ablation study for effectiveness estimation. Results: In MRI and CT datasets, our method was superior or comparable to existing ones, achieving a 0.8\\% Dice and 1.0\\% RAC increase in CT (statistically significant), and a 0.8\\% Dice and 1.1\\% RAC increase in MRI (not statistically significant) in volume-wise acquisition. Our ablation study indicates that combining density and diversity criteria enhances the efficiency of BAL in musculoskeletal segmentation compared to using either criterion alone. Conclusion: Our sampling method is proven efficient in reducing annotation costs in image segmentation tasks. The combination of the proposed method and our BAL framework provides a semi-automatic way for efficient annotation of medical image datasets.",
  "categories": [
    "eess.IV",
    "cs.CV"
  ],
  "primary_category": "eess.IV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13986",
  "pdf_url": null,
  "comment": "15 pages, 5 figures",
  "num_versions": null,
  "size_before_bytes": 4013743,
  "size_after_bytes": 313671
}