{
  "title": "Geometric quantum complexity of bosonic oscillator systems",
  "authors": [
    "Satyaki Chowdhury",
    "Martin Bojowald",
    "Jakub Mielczarek"
  ],
  "submission_date": "2023-07-25T18:00:07+00:00",
  "revised_dates": [
    "2024-04-19T00:37:42+00:00",
    "2024-10-10T00:18:59+00:00"
  ],
  "abstract": "According to the pioneering work of Nielsen and collaborators, the length of the minimal geodesic in a geometric realization of a suitable operator space provides a measure of the quantum complexity of an operation. Compared with the original concept of complexity based on the minimal number of gates required to construct the desired operation as a product, this geometrical approach amounts to a more concrete and computable definition, but its evaluation is nontrivial in systems with a high-dimensional Hilbert space. The geometrical formulation can more easily be evaluated by considering the geometry associated with a suitable finite-dimensional group generated by a small number of relevant operators of the system. In this way, the method has been applied in particular to the harmonic oscillator, which is also of interest in the present paper. However, subtle and previously unrecognized issues of group theory can lead to unforeseen complications, motivating a new formulation that remains on the level of the underlying Lie algebras for most of the required steps. Novel insights about complexity can thereby be found in a low-dimensional setting, with the potential of systematic extensions to higher dimensions as well as interactions. Specific examples include the quantum complexity of various target unitary operators associated with a harmonic oscillator, inverted harmonic oscillator, and coupled harmonic oscillators. The generality of this approach is demonstrated by an application to an anharmonic oscillator with a cubic term.",
  "categories": [
    "quant-ph",
    "hep-th",
    "math-ph"
  ],
  "primary_category": "quant-ph",
  "doi": "10.1007/JHEP10(2024)048",
  "journal_ref": null,
  "arxiv_id": "2307.13736",
  "pdf_url": null,
  "comment": "Discussions added, improved plots, typos fixed, references added. Matches the published version",
  "num_versions": null,
  "size_before_bytes": 1521151,
  "size_after_bytes": 670490
}