{
  "title": "Towards Head Computed Tomography Image Reconstruction Standardization with Deep Learning Assisted Automatic Detection",
  "authors": [
    "Bowen Zheng",
    "Chenxi Huang",
    "Yuemei Luo"
  ],
  "submission_date": "2023-07-31T06:58:49+00:00",
  "revised_dates": [
    "2023-09-15T07:44:05+00:00"
  ],
  "abstract": "Three-dimensional (3D) reconstruction of head Computed Tomography (CT) images elucidates the intricate spatial relationships of tissue structures, thereby assisting in accurate diagnosis. Nonetheless, securing an optimal head CT scan without deviation is challenging in clinical settings, owing to poor positioning by technicians, patient's physical constraints, or CT scanner tilt angle restrictions. Manual formatting and reconstruction not only introduce subjectivity but also strain time and labor resources. To address these issues, we propose an efficient automatic head CT images 3D reconstruction method, improving accuracy and repeatability, as well as diminishing manual intervention. Our approach employs a deep learning-based object detection algorithm, identifying and evaluating orbitomeatal line landmarks to automatically reformat the images prior to reconstruction. Given the dearth of existing evaluations of object detection algorithms in the context of head CT images, we compared ten methods from both theoretical and experimental perspectives. By exploring their precision, efficiency, and robustness, we singled out the lightweight YOLOv8 as the aptest algorithm for our task, with an mAP of 92.77% and impressive robustness against class imbalance. Our qualitative evaluation of standardized reconstruction results demonstrates the clinical practicability and validity of our method.",
  "categories": [
    "cs.CV",
    "cs.LG",
    "eess.IV"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16440",
  "pdf_url": "https://arxiv.org/pdf/2307.16440v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 15293705,
  "size_after_bytes": 124154
}