{
  "title": "Learning Nonlinear Projections for Reduced-Order Modeling of Dynamical Systems using Constrained Autoencoders",
  "authors": [
    "Samuel E. Otto",
    "Gregory R. Macchio",
    "Clarence W. Rowley"
  ],
  "submission_date": "2023-07-28T04:01:48+00:00",
  "revised_dates": [
    "2023-09-26T00:56:23+00:00"
  ],
  "abstract": "Recently developed reduced-order modeling techniques aim to approximate nonlinear dynamical systems on low-dimensional manifolds learned from data. This is an effective approach for modeling dynamics in a post-transient regime where the effects of initial conditions and other disturbances have decayed. However, modeling transient dynamics near an underlying manifold, as needed for real-time control and forecasting applications, is complicated by the effects of fast dynamics and nonnormal sensitivity mechanisms. To begin to address these issues, we introduce a parametric class of nonlinear projections described by constrained autoencoder neural networks in which both the manifold and the projection fibers are learned from data. Our architecture uses invertible activation functions and biorthogonal weight matrices to ensure that the encoder is a left inverse of the decoder. We also introduce new dynamics-aware cost functions that promote learning of oblique projection fibers that account for fast dynamics and nonnormality. To demonstrate these methods and the specific challenges they address, we provide a detailed case study of a three-state model of vortex shedding in the wake of a bluff body immersed in a fluid, which has a two-dimensional slow manifold that can be computed analytically. In anticipation of future applications to high-dimensional systems, we also propose several techniques for constructing computationally efficient reduced-order models using our proposed nonlinear projection framework. This includes a novel sparsity-promoting penalty for the encoder that avoids detrimental weight matrix shrinkage via computation on the Grassmann manifold.",
  "categories": [
    "math.DS",
    "cs.CE",
    "cs.LG",
    "eess.SY",
    "math.DG"
  ],
  "primary_category": "math.DS",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15288",
  "pdf_url": "https://arxiv.org/pdf/2307.15288v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 13922712,
  "size_after_bytes": 4496580
}