{
  "title": "Spectral tuning of high-harmonic generation with resonance-gradient metasurfaces",
  "authors": [
    "Piyush Jangid",
    "Felix Ulrich Richter",
    "Ming Lun Tseng",
    "Ivan Sinev",
    "Sergey Kruk",
    "Hatice Altug",
    "Yuri Kivshar"
  ],
  "submission_date": "2023-07-28T03:21:16+00:00",
  "revised_dates": [],
  "abstract": "High-index dielectric subwavelength structures and metasurfaces are capable of enhancing light-matter interaction by orders of magnitude via geometry-dependent optical resonances. This enhancement, however, comes with a fundamental limitation of a narrow spectral range of operation in the vicinity of one or few resonant frequencies. Here we tackle this limitation and introduce an innovative and practical approach to achieve spectrally tunable enhancement of light-matter interaction with resonant metasurfaces. We design and fabricate {\\it resonance-gradient metasurfaces} with varying geometrical parameters that translate into resonant frequencies dependence on one of the coordinates of the metasurface. The metasurfaces are composed of bone-like nanoresonators which are made of germanium, and they support high-$Q$ optical resonances in the mid-IR spectral range. We apply this general concept to observe the resonant enhancement of the $3^{\\text{rd}}$ and $5^{\\text{th}}$ harmonics generated from the gradient metasurfaces being used in conjunction with a tunable excitation laser to provide a wide spectral coverage of resonantly-enhanced tunable generation of multiple optical harmonics.",
  "categories": [
    "physics.optics"
  ],
  "primary_category": "physics.optics",
  "doi": "10.1002/adma.202307494",
  "journal_ref": "Adv. Mater. 2023, 2307494",
  "arxiv_id": "2307.15279",
  "pdf_url": "https://arxiv.org/pdf/2307.15279v1",
  "comment": "Main text: 17 pages and 5 figures. Supplementary Information: 5 pages and 2 figures. Conference presentation link: https://doi.org/10.1364/CLEO_FS.2023.FTh4D.7",
  "num_versions": null,
  "size_before_bytes": 4157224,
  "size_after_bytes": 69223
}