{
  "title": "Search for neutrino sources from the direction of IceCube alert events",
  "authors": [
    "Martina Karl"
  ],
  "submission_date": "2023-07-28T08:29:40+00:00",
  "revised_dates": [],
  "abstract": "We search for additional neutrino emission from the direction of IceCube's highest energy public alert events. We take the arrival direction of 122 events with a high probability of being of astrophysical origin and look for steady and transient emission. We investigate 11 years of reprocessed and recalibrated archival IceCube data. For the steady scenario, we investigate if the potential emission is dominated by a single strong source or by many weaker sources. In contrast, for the transient emission we only search for single sources. In both cases, we find no significant additional neutrino component. Not having observed any significant excess, we constrain the maximal neutrino flux coming from all 122 origin directions (including the high-energy events) to $Φ_{90\\%,~100~\\rm{TeV}} = 1.2 \\times 10^{-15}$~(TeV cm$^2$ s)$^{-1}$ at 100~TeV, assuming an $E^{-2}$ emission, with 90\\% confidence. The most significant transient emission of all 122 investigated regions of interest is the neutrino flare associated with the blazar TXS~0506+056. With the recalibrated data, the flare properties of this work agree with previous results. We fit a Gaussian time profile centered at $μ_T = 57001 ^{+38}_{-26}$~MJD and with a width of $σ_T = 64 ^{+35}_{-10}$~days. The best fit spectral index is $γ= 2.3 \\pm 0.4$ and we fit a single flavor fluence of $J_{100~\\rm{TeV}} = 1.2 ^{+1.1} _{-0.8} \\times 10^{-8} $~(TeV~cm$^2$)$^{-1}$. The global p-value for transient emission is $p_{\\rm{global}} = 0.156$ and, therefore, compatible with background.",
  "categories": [
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.HE",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15387",
  "pdf_url": "https://arxiv.org/pdf/2307.15387v1",
  "comment": "Presented at the 38th International Cosmic Ray Conference (ICRC2023). See arXiv:2307.13047 for all IceCube contributions",
  "num_versions": null,
  "size_before_bytes": 1154922,
  "size_after_bytes": 221090
}