{
  "title": "Computational Design of Anisotropic Stealthy Hyperuniform Composites with Engineered Directional Scattering Properties",
  "authors": [
    "Wenlong Shi",
    "David Keeney",
    "Duyu Chen",
    "Yang Jiao",
    "Salvatore Torquato"
  ],
  "submission_date": "2023-07-25T22:05:14+00:00",
  "revised_dates": [],
  "abstract": "Disordered hyperuniform materials are an emerging class of exotic amorphous states of matter that endow them with singular physical properties. Here, we generalize the Fourier-space based numerical construction procedure for designing {\\it isotropic} disordered hyperuniform two-phase heterogeneous materials (i.e., composites) developed by Chen and Torquato [Acta Mater. {\\bf 142}, 152 (2018)] to {\\it anisotropic} microstructures by explicitly incorporating the {\\it vector-dependent} spectral density function ${\\tilde χ}_{_V}({\\bf k})$ of {\\it arbitrary form} that is realizable. We demonstrate the utility of the procedure by generating a wide spectrum of {\\it anisotropic} stealthy hyperuniform (SHU) microstructures with ${\\tilde χ}_{_V}({\\bf k}) = 0$ for ${\\bf k} \\in Ω$. We show how different exclusion-region shapes with various discrete symmetries and varying size affect the resulting statistically anisotropic microstructures as a function of the and phase volume fraction. We find that, among other properties, the directional hyperuniform behaviors imposed by the shape asymmetry (or anisotropy) of certain exclusion regions give rise to distinct anisotropic structures and degree of uniformity in the distribution of the phases on intermediate and large length scales along different directions. Moreover, while the anisotropic exclusion regions impose strong constraints on the {\\it global} symmetry of the resulting media, they can still possess almost isotropic {\\it local} structures. Our construction algorithm enables one to control the statistical anisotropy of composite microstructures which is crucial to engineering directional optical, transport and mechanical properties of two-phase composite media.",
  "categories": [
    "cond-mat.mtrl-sci",
    "cond-mat.stat-mech"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13833",
  "pdf_url": null,
  "comment": "22 figures, 24 pages",
  "num_versions": null,
  "size_before_bytes": 4537143,
  "size_after_bytes": 184186
}