{
  "title": "Magnetic-field periodic quantum Sondheimer oscillations in thin-film graphite",
  "authors": [
    "Toshihiro Taen",
    "Andhika Kiswandhi",
    "Toshihito Osada"
  ],
  "submission_date": "2023-07-28T09:09:59+00:00",
  "revised_dates": [],
  "abstract": "Materials with the mesoscopic scales have provided an excellent platform for quantum-mechanical studies. Among them, the periodic oscillations of the electrical resistivity against the direct and the inverse of the magnetic fields, such as the Aharonov-Bohm effect and the Shubnikov-de Haas effect, manifest the interference of the wavefunction relevant to the electron motion perpendicular to the magnetic field. In contrast, the electron motion along the magnetic field also leads to the magnetic-field periodicity, which is the so-called Sondheimer effect. However, the Sondheimer effect has been understood only in the framework of the semiclassical picture, and thereby its interpretation at the quasiquantum limit was not clear. Here, we show that thin-film graphite exhibits clear sinusoidal oscillations with a period of about 1-3 T over a wide range of the magnetic fields (from around 10 T to 30 T), where conventional quantum oscillations are absent. In addition, the sample with a designed step in the middle for eliminating the stacking disorder effect verifies that the period of the oscillations is inversely proportional to the thickness, which supports the emergence of the Sondheimer oscillations in the quasiquantum limit. These findings suggest that the Sondheimer oscillations can be reinterpreted as inter-Landau-level resonances even at the field range where the semiclassical picture fails. Our results expand the quantum oscillation family, and pave the way for the exploration of the out-of-plane wavefunction motion.",
  "categories": [
    "cond-mat.mes-hall"
  ],
  "primary_category": "cond-mat.mes-hall",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15418",
  "pdf_url": "https://arxiv.org/pdf/2307.15418v1",
  "comment": "17 pages, 5 figures",
  "num_versions": null,
  "size_before_bytes": 4473659,
  "size_after_bytes": 116729
}