{
  "title": "Non-decoupling effects from heavy Higgs bosons by matching 2HDM to HEFT amplitudes",
  "authors": [
    "F. Arco",
    "D. Domenech",
    "M. J. Herrero",
    "R. A. Morales"
  ],
  "submission_date": "2023-07-28T17:38:49+00:00",
  "revised_dates": [],
  "abstract": "In this work we explore the low energy effects induced from the integration of the heavy Higgs boson modes, $H$, $A$ and $H^\\pm$, within the Two Higgs Doublet Model (2HDM) by assuming that the lightest Higgs boson $h$ is the one observed experimentally at $m_h \\sim 125$ GeV. We work within the context of Effective Field Theories, focusing on the Higgs Effective Field Theory (HEFT), although some comparisons with the Standard Model Effective Field Theory (SMEFT) case are also discussed through this work. Our main focus is placed in the computation of the non-decoupling effects from the heavy Higgs bosons and the capture of such effects by means of the HEFT coefficients which are expressed in terms of the input parameters of the 2HDM. Our approach to solve this issue is by matching the amplitudes of the 2HDM and the HEFT for physical processes involving the light Higgs boson $h$ in the external legs, instead of the most frequently used matching procedure at the Lagrangian level. More concretely, we perform the matching at the amplitudes level for the following physical processes, including scattering and decays: $h\\to WW^*\\to Wf\\bar{f'}$, $h\\to ZZ^*\\to Zf\\bar{f}$, $WW \\to hh$, $ZZ \\to hh$, $hh \\to hh$, $h \\to γγ$ and $h \\to γZ$. One important point of this work is that the matching is required to happen at low energies compared to the heavy Higgs boson masses, and these are heavier than the other particle masses. The proper expansion for this heavy mass limit is also defined here, which provides the results for the non-decoupling effects presented in this work. We finally discuss the implications of the resulting effective coefficients, and remark on the interesting correlations detected among them.",
  "categories": [
    "hep-ph"
  ],
  "primary_category": "hep-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15693",
  "pdf_url": "https://arxiv.org/pdf/2307.15693v1",
  "comment": "35 pages, 15 figures",
  "num_versions": null,
  "size_before_bytes": 11899168,
  "size_after_bytes": 1951298
}