{
  "title": "Stable fiber-illumination for extremely precise radial velocities with NEID",
  "authors": [
    "Shubham Kanodia",
    "Andrea S. J. Lin",
    "Emily Lubar",
    "Samuel Halverson",
    "Suvrath Mahadevan",
    "Chad F. Bender",
    "Sarah E. Logsdon",
    "Lawrence W. Ramsey",
    "Joe P. Ninan",
    "Gudmundur Stefansson",
    "Andrew Monson",
    "Christian Schwab",
    "Arpita Roy",
    "Leonardo A. Paredes",
    "Eli Golub",
    "Jesus Higuera",
    "Jessica Klusmeyer",
    "William McBride",
    "Cullen Blake",
    "Scott A. Diddams",
    "Fabien Grise",
    "Arvind F. Gupta",
    "Fred Hearty",
    "Michael W. McElwain",
    "Jayadev Rajagopal",
    "Paul Robertson",
    "Ryan Terrien"
  ],
  "submission_date": "2023-07-23T18:47:20+00:00",
  "revised_dates": [
    "2023-08-17T00:04:56+00:00"
  ],
  "abstract": "NEID is a high-resolution red-optical precision radial velocity (RV) spectrograph recently commissioned at the WIYN 3.5 m telescope at Kitt Peak National Observatory, Arizona, USA. NEID has an extremely stable environmental control system, and spans a wavelength range of 380 to 930 nm with two observing modes: a High Resolution (HR) mode at R $\\sim$ 112,000 for maximum RV precision, and a High Efficiency (HE) mode at R $\\sim$ 72,000 for faint targets. In this manuscript we present a detailed description of the components of NEID's optical fiber feed, which include the instrument, exposure meter, calibration system, and telescope fibers. Many parts of the optical fiber feed can lead to uncalibratable RV errors, which cannot be corrected for using a stable wavelength reference source. We show how these errors directly cascade down to performance requirements on the fiber feed and the scrambling system. We detail the design, assembly, and testing of each component. Designed and built from the bottom-up with a single-visit instrument precision requirement of 27 $\\textrm{cm~s}^{-1}$, close attention was paid to the error contribution from each NEID subsystem. Finally, we include the lab and on-sky tests performed during instrument commissioning to test the illumination stability, and discuss the path to achieving the instrumental stability required to search for a true Earth twin around a Solar-type star.",
  "categories": [
    "astro-ph.IM",
    "astro-ph.EP"
  ],
  "primary_category": "astro-ph.IM",
  "doi": "10.3847/1538-3881/acea60",
  "journal_ref": null,
  "arxiv_id": "2307.12403",
  "pdf_url": null,
  "comment": "The Astronomical Journal, Volume 166, Number 3, 2023",
  "num_versions": null,
  "size_before_bytes": 47371656,
  "size_after_bytes": 10762694
}