{
  "title": "Observations and Modeling of Unstable Proton and Alpha Particle Velocity Distributions in Sub-Alfvenic Solar Wind at PSP Perihelia",
  "authors": [
    "Leon Ofman",
    "Scott A Boardsen",
    "Lan K Jian",
    "Parisa Mostafavi",
    "Jaye L Verniero",
    "Roberto Livi",
    "Michael McManus",
    "Ali Rahmati",
    "Davin Larson",
    "Michael L Stevens"
  ],
  "submission_date": "2023-07-25T11:11:12+00:00",
  "revised_dates": [],
  "abstract": "Past observations show that solar wind (SW) acceleration occurs inside the sub-Alfvenic region, reaching the local Alfven speed at typical distances ~ 10 - 20 Rs (solar radii). Recently, Parker Solar Probe (PSP) traversed regions of sub-Alfvenic SW near perihelia in encounters E8-E12 for the first time providing data in these regions. It became evident that properties of the magnetically dominated SW are considerably different from the super-Alfvenic wind. For example, there are changes in relative abundances and drift of alpha particles with respect to protons, as well as in the magnitude of magnetic fluctuations. We use data of the magnetic field from the FIELDS instrument, and construct ion velocity distribution functions (VDFs) from the sub-Alfvenic regions using Solar Probe Analyzer Ions (SPAN-I) data, and run 2.5D and 3D hybrid models of proton-alpha sub-Alfvenic SW plasma. We investigate the nonlinear evolution of the ion kinetic instabilities in several case studies, and quantify the transfer of energy between the protons, alpha particles, and the kinetic waves. The models provide the 3D ion VDFs at the various stages of the instability evolution in the SW frame. By combining observational analysis with the modeling results, we gain insights on the evolution of the ion instabilities, the heating and the acceleration processes of the sub-Alfvenic SW plasma and quantify the exchange of energy between the magnetic and kinetic components. The modeling results suggest that the ion kinetic instabilities are produced locally in the SW, resulting in anisotropic heating of the ions, as observed by PSP.",
  "categories": [
    "astro-ph.SR",
    "physics.plasm-ph",
    "physics.space-ph"
  ],
  "primary_category": "astro-ph.SR",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13410",
  "pdf_url": null,
  "comment": "Accepted for publication in The Astrophysical Journal",
  "num_versions": null,
  "size_before_bytes": 7984579,
  "size_after_bytes": 84888
}