{
  "title": "Ordering properties of anisotropic hard bodies in one-dimensional channels",
  "authors": [
    "Ana M. Montero",
    "Andrés Santos",
    "Péter Gurin",
    "Szabolcs Varga"
  ],
  "submission_date": "2023-07-27T10:40:02+00:00",
  "revised_dates": [
    "2023-10-21T15:30:42+00:00"
  ],
  "abstract": "The phase behavior and structural properties of hard anisotropic particles (prisms and dumbbells) are examined in one-dimensional channels using the Parsons--Lee (PL) theory, and the transfer-matrix and neighbor-distribution methods. The particles are allowed to move freely along the channel, while their orientations are constrained such that one particle can occupy only two or three different lengths along the channel. In this confinement setting, hard prisms behave as an additive mixture, while hard dumbbells behave as a non-additive one. We prove that all methods provide exact results for the phase properties of hard prisms, while only the neighbor-distribution and transfer-matrix methods are exact for hard dumbbells. This shows that non-additive effects are incorrectly included into the PL theory, which is a successful theory of the isotropic-nematic phase transition of rod-like particles in higher dimensions. In the one-dimensional channel, the orientational ordering develops continuously with increasing density, i.e., the system is isotropic only at zero density, while it becomes perfectly ordered at the close-packing density. We show that there is no orientational correlation in the hard prism system, while the hard dumbbells are orientationally correlated with diverging correlation length at close packing. On the other hand, positional correlations are present for all the systems, the associated correlation length diverging at close packing.",
  "categories": [
    "cond-mat.soft",
    "cond-mat.stat-mech",
    "physics.chem-ph"
  ],
  "primary_category": "cond-mat.soft",
  "doi": "10.1063/5.0169605",
  "journal_ref": "J. Chem. Phys. 159, 154507 (2023)",
  "arxiv_id": "2307.14760",
  "pdf_url": "https://arxiv.org/pdf/2307.14760v2",
  "comment": "14 pages, 6 figures; v2: minor changes",
  "num_versions": null,
  "size_before_bytes": 3289807,
  "size_after_bytes": 274618
}