{
  "title": "Non-invasive Deep-Brain Imaging with 3D Integrated Photoacoustic Tomography and Ultrasound Localization Microscopy (3D-PAULM)",
  "authors": [
    "Yuqi Tang",
    "Zhijie Dong",
    "Nanchao Wang",
    "Angela del Aguila",
    "Natalie Johnston",
    "Tri Vu",
    "Chenshuo Ma",
    "Yirui Xu",
    "Wei Yang",
    "Pengfei Song",
    "Junjie Yao"
  ],
  "submission_date": "2023-07-27T01:22:46+00:00",
  "revised_dates": [],
  "abstract": "Photoacoustic computed tomography (PACT) is a proven technology for imaging hemodynamics in deep brain of small animal models. PACT is inherently compatible with ultrasound (US) imaging, providing complementary contrast mechanisms. While PACT can quantify the brain's oxygen saturation of hemoglobin (sO$_2$), US imaging can probe the blood flow based on the Doppler effect. Further, by tracking gas-filled microbubbles, ultrasound localization microscopy (ULM) can map the blood flow velocity with sub-diffraction spatial resolution. In this work, we present a 3D deep-brain imaging system that seamlessly integrates PACT and ULM into a single device, 3D-PAULM. Using a low ultrasound frequency of 4 MHz, 3D-PAULM is capable of imaging the whole-brain hemodynamic functions with intact scalp and skull in a totally non-invasive manner. Using 3D-PAULM, we studied the mouse brain functions with ischemic stroke. Multi-spectral PACT, US B-mode imaging, microbubble-enhanced power Doppler (PD), and ULM were performed on the same mouse brain with intrinsic image co-registration. From the multi-modality measurements, we future quantified blood perfusion, sO$_2$, vessel density, and flow velocity of the mouse brain, showing stroke-induced ischemia, hypoxia, and reduced blood flow. We expect that 3D-PAULM can find broad applications in studying deep brain functions on small animal models.",
  "categories": [
    "physics.ins-det",
    "physics.bio-ph",
    "physics.med-ph"
  ],
  "primary_category": "physics.ins-det",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14572",
  "pdf_url": "https://arxiv.org/pdf/2307.14572v1",
  "comment": "10 pages",
  "num_versions": null,
  "size_before_bytes": 2260757,
  "size_after_bytes": 1321131
}