{
  "title": "ARPES Detection of Superconducting Gap Sign in Unconventional Superconductors",
  "authors": [
    "Qiang Gao",
    "Jin Mo Bok",
    "Ping Ai",
    "Jing Liu",
    "Hongtao Yan",
    "Xiangyu Luo",
    "Yongqing Cai",
    "Cong Li",
    "Yang Wang",
    "Chaohui Yin",
    "Hao Chen",
    "Genda Gu",
    "Fengfeng Zhang",
    "Feng Yang",
    "Shenjin Zhang",
    "Qinjun Peng",
    "Zhihai Zhu",
    "Guodong Liu",
    "Zuyan Xu",
    "Tao Xiang",
    "Lin Zhao",
    "Han-Yong Choi",
    "X. J. Zhou"
  ],
  "submission_date": "2023-07-31T03:26:35+00:00",
  "revised_dates": [],
  "abstract": "Superconductivity is realized by opening a gap in the superconducting state. The gap symmetry is crucial in understanding the underlying superconductivity mechanism. The magnitude and the phase are essential in fully characterizing the superconducting gap. Angle-resolved photoemission spectroscopy (ARPES) has played a key role in determining the gap symmetry in unconventional superconductors. However, it has been considered so far that ARPES can only measure the magnitude of the superconducting gap but not its phase; the phase has to be detected by other phase-sensitive techniques. Here we propose a new method to directly detect the superconducting gap sign by using ARPES. This method is successfully validated in a cuprate superconductor with a well-known $d$-wave gap symmetry. When two bands are nearby in momentum space and have a strong interband interaction, the resulted electronic structures in the superconducting state are sensitive to the relative gap sign between the two bands which can be captured by ARPES measurements. Our present work provides a new way to detect the gap sign and can be applied to various superconductors, particularly those with multiple orbitals like the iron-based superconductors. It also makes ARPES more powerful to determine both the gap magnitude and the phase that are significant in understanding the superconductivity mechanism of unconventional superconductors.",
  "categories": [
    "cond-mat.supr-con",
    "cond-mat.str-el"
  ],
  "primary_category": "cond-mat.supr-con",
  "doi": "10.1038/s41467-024-48610-9",
  "journal_ref": "Nature Communications 15, 4538 (2024)",
  "arxiv_id": "2307.16384",
  "pdf_url": "https://arxiv.org/pdf/2307.16384v1",
  "comment": "22 pages, 4 figures",
  "num_versions": null,
  "size_before_bytes": 3760418,
  "size_after_bytes": 48959
}