{
  "title": "Reversible magnetic domain reorientation induced by magnetic field pulses with fixed direction",
  "authors": [
    "Xichao Zhang",
    "Jing Xia",
    "Oleg A. Tretiakov",
    "Guoping Zhao",
    "Yan Zhou",
    "Masahito Mochizuki",
    "Xiaoxi Liu",
    "Motohiko Ezawa"
  ],
  "submission_date": "2023-07-28T02:16:29+00:00",
  "revised_dates": [],
  "abstract": "Nanoscale magnetic domains with controllable configurations could be used for classical and quantum applications, where the switching of magnetization configurations is an essential operation for information processing. Here, we report that the magnetic domain reorientation in a notched ferromagnetic nanotrack can be realized and effectively controlled by applying uniform magnetic field pulses in a fixed in-plane direction perpendicular to the nanotrack. Our micromagnetic simulation results show that the configurations of magnetic domains in the notched nanotrack can be switched between a head-to-head state and a tail-to-tail state in a reversible manner driven by magnetic field pulses, while it is unnecessary to reverse the direction of the magnetic field. Such a unique magnetic domain reorientation dynamics is found to depend on magnetic parameters and nanotrack geometries. The reorientation dynamics of magnetic domains also depends on the strength and length of the applied magnetic field pulse. In addition, we point out that the notches at the center of the nanotrack play an important role for the stabilization of the head-to-head and tail-to-tail states during the magnetic domain reorientation. We also qualitatively explain the field-induced reorientation phenomenon with a simplified two-dimensional macrospin model. Our results may make it possible to build spintronic devices driven by a fixed magnetic field. Our findings may also motivate future studies to investigate the classical and quantum applications based on nanoscale magnetic domains.",
  "categories": [
    "cond-mat.mes-hall",
    "physics.app-ph"
  ],
  "primary_category": "cond-mat.mes-hall",
  "doi": "10.1103/PhysRevB.108.064410",
  "journal_ref": "Phys. Rev. B 108, 064410 (2023)",
  "arxiv_id": "2307.15263",
  "pdf_url": "https://arxiv.org/pdf/2307.15263v1",
  "comment": "12 pages, 14 figures",
  "num_versions": null,
  "size_before_bytes": 4763220,
  "size_after_bytes": 257891
}