{
  "title": "Comparing phase-space and phenomenological modeling approaches for Lagrangian particles settling in a turbulent boundary layer",
  "authors": [
    "Andrew P. Grace",
    "David H. Richter",
    "Andrew D. Bragg"
  ],
  "submission_date": "2023-07-25T17:12:26+00:00",
  "revised_dates": [],
  "abstract": "Under the right circumstances, inertial particles (such as sand or dust) settling through the atmospheric boundary layer can experience a net enhancement in their average settling velocity due to their inertia. Since this enhancement arises due to their interactions with the surrounding turbulence it must be modelled at coarse scales. Models for the enhanced settling velocity (or deposition) of the dispersed phase that find practical use in mesoscale weather models are often ad hoc or are built on phenomenological closure assumptions, meaning that the general deposition rate of particle is a key uncertainty. Instead of taking a phenomenological approach, exact phase space methods can be used to model the physical mechanisms responsible for the enhanced settling, and a more general parameterization of the enhanced settling of inertial particles can be built. In this work, we use direct numerical simulations (DNS) and phase space methods to evaluate the efficacy of phenomenological modelling approaches for the enhanced settling velocity of inertial particles with varying friction Stokes numbers and settling velocity parameters. We use the DNS data to estimate profiles of a drift-diffusion based parameterization of the fluid velocity sampled by the particles, which is key for determining the settling velocity behaviour of particles with low to moderate Stokes number. We find that by increasing the settling velocity parameter at moderate friction Stokes number, the magnitude of preferential sweeping is modified, and this behaviour is explained by the drift component. We then use these profiles to argue that the eddy-diffusivity-like closure used in phenomenological models is incomplete, relying on inadequate empirical corrections. Finally, we discuss opportunities for reconciling exact phase space approaches with simpler phenomenological approaches for use in coarse-scale weather models.",
  "categories": [
    "physics.flu-dyn",
    "physics.ao-ph",
    "physics.geo-ph"
  ],
  "primary_category": "physics.flu-dyn",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13659",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 15315427,
  "size_after_bytes": 461589
}