{
  "title": "Task-driven Semantic-aware Green Cooperative Transmission Strategy for Vehicular Networks",
  "authors": [
    "Wanting Yang",
    "Xuefen Chi",
    "Linlin Zhao",
    "Zehui Xiong",
    "Wenchao Jiang"
  ],
  "submission_date": "2023-07-28T03:34:55+00:00",
  "revised_dates": [],
  "abstract": "Considering the infrastructure deployment cost and energy consumption, it is unrealistic to provide seamless coverage of the vehicular network. The presence of uncovered areas tends to hinder the prevalence of the in-vehicle services with large data volume. To this end, we propose a predictive cooperative multi-relay transmission strategy (PreCMTS) for the intermittently connected vehicular networks, fulfilling the 6G vision of semantic and green communications. Specifically, we introduce a task-driven knowledge graph (KG)-assisted semantic communication system, and model the KG into a weighted directed graph from the viewpoint of transmission. Meanwhile, we identify three predictable parameters about the individual vehicles to perform the following anticipatory analysis. Firstly, to facilitate semantic extraction, we derive the closed-form expression of the achievable throughput within the delay requirement. Then, for the extracted semantic representation, we formulate the mutually coupled problems of semantic unit assignment and predictive relay selection as a combinatorial optimization problem, to jointly optimize the energy efficiency and semantic transmission reliability. To find a favorable solution within limited time, we proposed a low-complexity algorithm based on Markov approximation. The promising performance gains of the PreCMTS are demonstrated by the simulations with realistic vehicle traces generated by the SUMO traffic simulator.",
  "categories": [
    "cs.NI"
  ],
  "primary_category": "cs.NI",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15284",
  "pdf_url": "https://arxiv.org/pdf/2307.15284v1",
  "comment": "Accepted by IEEE Transactions on Communications",
  "num_versions": null,
  "size_before_bytes": 7737148,
  "size_after_bytes": 168769
}