{
  "title": "Solving Data Quality Problems with Desbordante: a Demo",
  "authors": [
    "George Chernishev",
    "Michael Polyntsov",
    "Anton Chizhov",
    "Kirill Stupakov",
    "Ilya Shchuckin",
    "Alexander Smirnov",
    "Maxim Strutovsky",
    "Alexey Shlyonskikh",
    "Mikhail Firsov",
    "Stepan Manannikov",
    "Nikita Bobrov",
    "Daniil Goncharov",
    "Ilia Barutkin",
    "Vladislav Shalnev",
    "Kirill Muraviev",
    "Anna Rakhmukova",
    "Dmitriy Shcheka",
    "Anton Chernikov",
    "Mikhail Vyrodov",
    "Yaroslav Kurbatov",
    "Maxim Fofanov",
    "Sergei Belokonnyi",
    "Pavel Anosov",
    "Arthur Saliou",
    "Eduard Gaisin",
    "Kirill Smirnov"
  ],
  "submission_date": "2023-07-27T15:26:26+00:00",
  "revised_dates": [
    "2023-07-28T11:02:25+00:00"
  ],
  "abstract": "Data profiling is an essential process in modern data-driven industries. One of its critical components is the discovery and validation of complex statistics, including functional dependencies, data constraints, association rules, and others.\n  However, most existing data profiling systems that focus on complex statistics do not provide proper integration with the tools used by contemporary data scientists. This creates a significant barrier to the adoption of these tools in the industry. Moreover, existing systems were not created with industrial-grade workloads in mind. Finally, they do not aim to provide descriptive explanations, i.e. why a given pattern is not found. It is a significant issue as it is essential to understand the underlying reasons for a specific pattern's absence to make informed decisions based on the data.\n  Because of that, these patterns are effectively rest in thin air: their application scope is rather limited, they are rarely used by the broader public. At the same time, as we are going to demonstrate in this presentation, complex statistics can be efficiently used to solve many classic data quality problems.\n  Desbordante is an open-source data profiler that aims to close this gap. It is built with emphasis on industrial application: it is efficient, scalable, resilient to crashes, and provides explanations. Furthermore, it provides seamless Python integration by offloading various costly operations to the C++ core, not only mining.\n  In this demonstration, we show several scenarios that allow end users to solve different data quality problems. Namely, we showcase typo detection, data deduplication, and data anomaly detection scenarios.",
  "categories": [
    "cs.DB",
    "cs.AI",
    "cs.CE",
    "cs.LG"
  ],
  "primary_category": "cs.DB",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14935",
  "pdf_url": "https://arxiv.org/pdf/2307.14935v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 958120,
  "size_after_bytes": 569892
}