{
  "title": "On (Normalised) Discounted Cumulative Gain as an Off-Policy Evaluation Metric for Top-$n$ Recommendation",
  "authors": [
    "Olivier Jeunen",
    "Ivan Potapov",
    "Aleksei Ustimenko"
  ],
  "submission_date": "2023-07-27T17:57:42+00:00",
  "revised_dates": [
    "2023-11-15T14:46:14+00:00",
    "2024-06-12T16:01:45+00:00"
  ],
  "abstract": "Approaches to recommendation are typically evaluated in one of two ways: (1) via a (simulated) online experiment, often seen as the gold standard, or (2) via some offline evaluation procedure, where the goal is to approximate the outcome of an online experiment. Several offline evaluation metrics have been adopted in the literature, inspired by ranking metrics prevalent in the field of Information Retrieval. (Normalised) Discounted Cumulative Gain (nDCG) is one such metric that has seen widespread adoption in empirical studies, and higher (n)DCG values have been used to present new methods as the state-of-the-art in top-$n$ recommendation for many years.\n  Our work takes a critical look at this approach, and investigates when we can expect such metrics to approximate the gold standard outcome of an online experiment. We formally present the assumptions that are necessary to consider DCG an unbiased estimator of online reward and provide a derivation for this metric from first principles, highlighting where we deviate from its traditional uses in IR. Importantly, we show that normalising the metric renders it inconsistent, in that even when DCG is unbiased, ranking competing methods by their normalised DCG can invert their relative order. Through a correlation analysis between off- and on-line experiments conducted on a large-scale recommendation platform, we show that our unbiased DCG estimates strongly correlate with online reward, even when some of the metric's inherent assumptions are violated. This statement no longer holds for its normalised variant, suggesting that nDCG's practical utility may be limited.",
  "categories": [
    "cs.IR",
    "cs.LG"
  ],
  "primary_category": "cs.IR",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15053",
  "pdf_url": "https://arxiv.org/pdf/2307.15053v3",
  "comment": "To appear in the research track at the ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD '24)",
  "num_versions": null,
  "size_before_bytes": 7827882,
  "size_after_bytes": 1873146
}