{
  "title": "Theoretical results on a block preconditioner used in ice-sheet modeling: eigenvalue bounds for singular power-law fluids",
  "authors": [
    "Christian Helanow",
    "Josefin Ahlkrona"
  ],
  "submission_date": "2023-07-27T08:23:10+00:00",
  "revised_dates": [],
  "abstract": "The properties of a block preconditioner that has been successfully used in finite element simulations of large scale ice-sheet flow is examined. The type of preconditioner, based on approximating the Schur complement with the mass matrix scaled by the variable viscosity, is well-known in the context of Stokes flow and has previously been analyzed for other types of non-Newtonian fluids. We adapt the theory to hold for the regularized constitutive (power-law) equation for ice and derive eigenvalue bounds of the preconditioned system for both Picard and Newton linearization using \\emph{inf-sup} stable finite elements. The eigenvalue bounds show that viscosity-scaled preconditioning clusters the eigenvalues well with only a weak dependence on the regularization parameter, while the eigenvalue bounds for the traditional non-viscosity-scaled mass-matrix preconditioner are very sensitive to the same regularization parameter. The results are verified numerically in two experiments using a manufactured solution with low regularity and a simulation of glacier flow. The numerical results further show that the computed eigenvalue bounds for the viscosity-scaled preconditioner are nearly independent of the regularization parameter. Experiments are performed using both Taylor-Hood and MINI elements, which are the common choices for \\emph{inf-sup} stable elements in ice-sheet models. Both elements conform well to the theoretical eigenvalue bounds, with MINI elements being more sensitive to the quality of the meshes used in glacier simulations.",
  "categories": [
    "math.NA",
    "physics.comp-ph"
  ],
  "primary_category": "math.NA",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14688",
  "pdf_url": "https://arxiv.org/pdf/2307.14688v1",
  "comment": "27 pages, 6 figures, 1 table",
  "num_versions": null,
  "size_before_bytes": 2510780,
  "size_after_bytes": 69532
}