{
  "title": "Water in the terrestrial planet-forming zone of the PDS 70 disk",
  "authors": [
    "G. Perotti",
    "V. Christiaens",
    "Th. Henning",
    "B. Tabone",
    "L. B. F. M. Waters",
    "I. Kamp",
    "G. Olofsson",
    "S. L. Grant",
    "D. Gasman",
    "J. Bouwman",
    "M. Samland",
    "R. Franceschi",
    "E. F. van Dishoeck",
    "K. Schwarz",
    "M. Güdel",
    "P. -O. Lagage",
    "T. P. Ray",
    "B. Vandenbussche",
    "A. Abergel",
    "O. Absil",
    "A. M. Arabhavi",
    "I. Argyriou",
    "D. Barrado",
    "A. Boccaletti",
    "A. Caratti o Garatti",
    "V. Geers",
    "A. M. Glauser",
    "K. Justannont",
    "F. Lahuis",
    "M. Mueller",
    "C. Nehmé",
    "E. Pantin",
    "S. Scheithauer",
    "C. Waelkens",
    "R. Guadarrama",
    "H. Jang",
    "J. Kanwar",
    "M. Morales-Calderón",
    "N. Pawellek",
    "D. Rodgers-Lee",
    "J. Schreiber",
    "L. Colina",
    "T. R. Greve",
    "G. Östlin",
    "G. Wright"
  ],
  "submission_date": "2023-07-22T10:18:30+00:00",
  "revised_dates": [],
  "abstract": "Terrestrial and sub-Neptune planets are expected to form in the inner ($<10~$AU) regions of protoplanetary disks. Water plays a key role in their formation, although it is yet unclear whether water molecules are formed in-situ or transported from the outer disk. So far Spitzer Space Telescope observations have only provided water luminosity upper limits for dust-depleted inner disks, similar to PDS 70, the first system with direct confirmation of protoplanet presence. Here we report JWST observations of PDS 70, a benchmark target to search for water in a disk hosting a large ($\\sim54~$AU) planet-carved gap separating an inner and outer disk. Our findings show water in the inner disk of PDS 70. This implies that potential terrestrial planets forming therein have access to a water reservoir. The column densities of water vapour suggest in-situ formation via a reaction sequence involving O, H$_2$, and/or OH, and survival through water self-shielding. This is also supported by the presence of CO$_2$ emission, another molecule sensitive to UV photodissociation. Dust shielding, and replenishment of both gas and small dust from the outer disk, may also play a role in sustaining the water reservoir. Our observations also reveal a strong variability of the mid-infrared spectral energy distribution, pointing to a change of inner disk geometry.",
  "categories": [
    "astro-ph.EP",
    "astro-ph.SR"
  ],
  "primary_category": "astro-ph.EP",
  "doi": "10.1038/s41586-023-06317-9",
  "journal_ref": null,
  "arxiv_id": "2307.12040",
  "pdf_url": null,
  "comment": "To appear in Nature on 24 July 2023. 21 pages, 10 figures; includes extended data. Part of the JWST MINDS Guaranteed Time Observations program's science enabling products. Spectra downloadable on Zenodo at https://zenodo.org/record/7991022",
  "num_versions": null,
  "size_before_bytes": 2942564,
  "size_after_bytes": 1128981
}