{
  "title": "Tentative co-orbital submillimeter emission within the Lagrangian region L5 of the protoplanet PDS 70 b",
  "authors": [
    "Olga Balsalobre-Ruza",
    "Itziar de Gregorio-Monsalvo",
    "Jorge Lillo-Box",
    "Nuria Huélamo",
    "Álvaro Ribas",
    "Myriam Benisty",
    "Jaehan Bae",
    "Stefano Facchini",
    "Richard Teague"
  ],
  "submission_date": "2023-07-24T14:00:13+00:00",
  "revised_dates": [],
  "abstract": "Context: High-spatial resolution Atacama Large Millimeter/submillimeter Array (ALMA) data have revealed a plethora of substructures in protoplanetary disks. Some of those features are thought to trace the formation of embedded planets. One example is the gas and dust that accumulated in the co-orbital Lagrangian regions $L_4$/$L_5$, which were tentatively detected in recent years and might be the pristine material for the formation of Trojan bodies. Aims: This work is part of the TROY project, whose ultimate goal is to find robust evidence of exotrojan bodies and study their implications in the exoplanet field. Here, we focus on the early stages of the formation of these bodies by inspecting the iconic system PDS 70, the only confirmed planetary system in formation. Methods: We reanalyzed archival high-angular resolution Band 7 ALMA observations from PDS 70 by doing an independent imaging process to look for emission in the Lagrangian regions of the two detected gas giant protoplanets, PDS 70 b and c. We then projected the orbital paths and visually inspected emission features at the regions around the $L_4$/$L_5$ locations as defined by $\\pm$ 60$^{\\circ}$ in azimuth from the planet position. Results: We found emission at a $\\sim$4-$σ$ level ($\\sim$6-$σ$ when correcting from a cleaning effect) at the position of the $L_{5}$ region of PDS 70 b. This emission corresponds to a dust mass in a range of 0.03- 2 M$_{Moon}$, which potentially accumulated in this gravitational well. Conclusions: The tentative detection of the co-orbital dust trap that we report requires additional observations to be confirmed. We predict that we could detect the co-orbital motion of PDS 70 b and the dust presumably associated with $L_5$ by observing again with the same sensitivity and angular resolution as early as February 2026.",
  "categories": [
    "astro-ph.EP"
  ],
  "primary_category": "astro-ph.EP",
  "doi": "10.1051/0004-6361/202346493",
  "journal_ref": "Astronomy & Astrophysics, Volume 675, id.A172, 2023, 8pp",
  "arxiv_id": "2307.12811",
  "pdf_url": null,
  "comment": "8 pages, 5 figures, 2 tables. Published in Astronomy & Astrophysics",
  "num_versions": null,
  "size_before_bytes": 7661131,
  "size_after_bytes": 141957
}