{
  "title": "Deconfined pseudocriticality in a model spin-1 quantum antiferromagnet",
  "authors": [
    "Vikas Vijigiri",
    "Sumiran Pujari",
    "Nisheeta Desai"
  ],
  "submission_date": "2023-07-26T15:36:00+00:00",
  "revised_dates": [
    "2023-08-30T00:15:28+00:00",
    "2024-06-14T00:29:11+00:00"
  ],
  "abstract": "Berry phase interference arguments that underlie the theory of deconfined quantum criticality (DQC) for spin-$\\frac{1}{2}$ antiferromagnets have also been invoked to allow for continuous transitions in spin-1 magnets including a Néel to (columnar) valence bond solid (cVBS) transition. We provide a microscopic model realization of this transition on the square lattice consisting of Heisenberg exchange ($J_H$) and biquadratic exchange ($J_B$) that favor a Néel phase, and a designed $Q$-term ($Q_B$) interaction which favors a cVBS through large-scale quantum Monte Carlo (QMC) simulations. For $J_H=0$, this model is equivalent to the $SU(3)$ $JQ$ model with a Néel-cVBS transition that has been argued to be DQC through QMC. Upon turning on $J_H$ which brings down the symmetry to $SU(2)$, we find multiple signatures -- a single critical point, high quality collapse of correlation ratios and order parameters, \"$U(1)$-symmetric\" cVBS histograms and lack of double-peak in order parameter histograms for largest sizes studied near the critical point -- that are highly suggestive of a continuous transition scenario. However, Binder analysis finds negative dips that grow sub-extensively that we interpret as these transitions rather being pseudocritical. This along with recent results on spin-$\\frac{1}{2}$ models suggests that deconfined pseudocriticality is the more generic scenario.",
  "categories": [
    "cond-mat.str-el"
  ],
  "primary_category": "cond-mat.str-el",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14254",
  "pdf_url": null,
  "comment": "Several references added. No major changes. 7 pages, 5 figures of main text. 22 pages of supplementary data. Submitted to PRL. Offered PRB. (Review exchange at https://www.dropbox.com/scl/fo/cuzciggsndwwpbznytt5g/AAi9TAQ_eGEL_AQnxU-BbbU?rlkey=0aesnku2bjv62vup1o2ps06sj&dl=0 ; names and accession code redacted)",
  "num_versions": null,
  "size_before_bytes": 27086731,
  "size_after_bytes": 251999
}