{
  "title": "On the Efficiency of Finely Stratified Experiments",
  "authors": [
    "Yuehao Bai",
    "Jizhou Liu",
    "Azeem M. Shaikh",
    "Max Tabord-Meehan"
  ],
  "submission_date": "2023-07-27T20:20:09+00:00",
  "revised_dates": [
    "2024-02-05T19:38:56+00:00",
    "2024-06-14T00:37:59+00:00",
    "2024-08-23T18:51:56+00:00",
    "2025-02-16T19:09:06+00:00",
    "2025-03-17T15:30:24+00:00"
  ],
  "abstract": "This paper studies the use of finely stratified designs for the efficient estimation of a large class of treatment effect parameters that arise in the analysis of experiments. By a \"finely stratified\" design, we mean experiments in which units are divided into groups of a fixed size and a proportion within each group is assigned to a binary treatment uniformly at random. The class of parameters considered are those that can be expressed as the solution to a set of moment conditions constructed using a known function of the observed data. They include, among other things, average treatment effects, quantile treatment effects, and local average treatment effects as well as the counterparts to these quantities in experiments in which the unit is itself a cluster. In this setting, we establish three results. First, we show that under a finely stratified design, the naive method of moments estimator achieves the same asymptotic variance as what could typically be attained under alternative treatment assignment mechanisms only through ex post covariate adjustment. Second, we argue that the naive method of moments estimator under a finely stratified design is asymptotically efficient by deriving a lower bound on the asymptotic variance of regular estimators of the parameter of interest in the form of a convolution theorem. In this sense, finely stratified experiments are attractive because they lead to efficient estimators of treatment effect parameters \"by design.\" Finally, we strengthen this conclusion by establishing conditions under which a \"fast-balancing\" property of finely stratified designs is in fact necessary for the naive method of moments estimator to attain the efficiency bound.",
  "categories": [
    "econ.EM",
    "math.ST",
    "stat.ME"
  ],
  "primary_category": "econ.EM",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15181",
  "pdf_url": "https://arxiv.org/pdf/2307.15181v6",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1825409,
  "size_after_bytes": 1833231
}