{
  "title": "Competing phases and intertwined orders in coupled wires near the self-dual point",
  "authors": [
    "Ken K. W. Ma",
    "Oğuz Türker",
    "Alexander Seidel",
    "Kun Yang"
  ],
  "submission_date": "2023-07-24T23:32:47+00:00",
  "revised_dates": [
    "2023-12-19T04:24:29+00:00",
    "2023-12-21T01:19:16+00:00"
  ],
  "abstract": "The interplay between different quantum phases plays an important role in strongly correlated systems, such as high-$T_c$ cuprates, quantum spin systems, and ultracold atoms. In particular, the application of effective field theory model and renormalization group analysis suggested that the coexistence of density wave (DW) and superfluid (SF) orders can lead to a supersolid phase of ultracold bosons. Here we revisit the problem by considering weakly coupled wires, where we treat the intra-wire interactions exactly via bosonization and inter-wire couplings using a mean-field theory which becomes asymptotically exact in the limit of high dimensionality. We obtain and solve the mean-field equations for the system near the self-dual point, where each wire has the Luttinger parameter $K=1$ and the inter-wire DW and SF coupling strengths are identical. This allows us to find explicit solutions for the possible supersolid order. An energy comparison between different possible solutions shows that the supersolid order is energetically unfavorable at zero temperature. This suggests that the density wave and superfluid phases are connected by a first order transition near the self-dual point. We also discuss the relation between our work and the intertwining of charge density wave and superconducting orders in cuprates.",
  "categories": [
    "cond-mat.str-el",
    "cond-mat.quant-gas"
  ],
  "primary_category": "cond-mat.str-el",
  "doi": "10.1103/PhysRevB.108.245138",
  "journal_ref": "Phys. Rev. B 108, 245138 (2023)",
  "arxiv_id": "2307.13169",
  "pdf_url": null,
  "comment": "Accepted version by PRB. A new appendix is added",
  "num_versions": null,
  "size_before_bytes": 20313621,
  "size_after_bytes": 245595
}