{
  "title": "Malware Resistant Data Protection in Hyper-connected Networks: A survey",
  "authors": [
    "Jannatul Ferdous",
    "Rafiqul Islam",
    "Maumita Bhattacharya",
    "Md Zahidul Islam"
  ],
  "submission_date": "2023-07-24T23:25:06+00:00",
  "revised_dates": [],
  "abstract": "Data protection is the process of securing sensitive information from being corrupted, compromised, or lost. A hyperconnected network, on the other hand, is a computer networking trend in which communication occurs over a network. However, what about malware. Malware is malicious software meant to penetrate private data, threaten a computer system, or gain unauthorised network access without the users consent. Due to the increasing applications of computers and dependency on electronically saved private data, malware attacks on sensitive information have become a dangerous issue for individuals and organizations across the world. Hence, malware defense is critical for keeping our computer systems and data protected. Many recent survey articles have focused on either malware detection systems or single attacking strategies variously. To the best of our knowledge, no survey paper demonstrates malware attack patterns and defense strategies combinedly. Through this survey, this paper aims to address this issue by merging diverse malicious attack patterns and machine learning (ML) based detection models for modern and sophisticated malware. In doing so, we focus on the taxonomy of malware attack patterns based on four fundamental dimensions the primary goal of the attack, method of attack, targeted exposure and execution process, and types of malware that perform each attack. Detailed information on malware analysis approaches is also investigated. In addition, existing malware detection techniques employing feature extraction and ML algorithms are discussed extensively. Finally, it discusses research difficulties and unsolved problems, including future research directions.",
  "categories": [
    "cs.CR"
  ],
  "primary_category": "cs.CR",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13164",
  "pdf_url": null,
  "comment": "30 pages, 9 figures, 7 tables, no where submitted yet",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}