{
  "title": "The Variable Detection of Atmospheric Escape around the young, Hot Neptune AU Mic b",
  "authors": [
    "Keighley E. Rockcliffe",
    "Elisabeth R. Newton",
    "Allison Youngblood",
    "Girish M. Duvvuri",
    "Peter Plavchan",
    "Peter Gao",
    "Andrew W. Mann",
    "Patrick J. Lowrance"
  ],
  "submission_date": "2023-07-27T17:29:02+00:00",
  "revised_dates": [],
  "abstract": "Photoevaporation is a potential explanation for several features within exoplanet demographics. Atmospheric escape observed in young Neptune-sized exoplanets can provide insight into and characterize which mechanisms drive this evolution and at what times they dominate. AU Mic b is one such exoplanet, slightly larger than Neptune (4.19 Earth radii). It closely orbits a 23 Myr pre-Main Sequence M dwarf with a period of 8.46 days. We obtained two visits of AU Mic b at Lyman-alpha with HST/STIS. One flare within the first HST visit is characterized and removed from our search for a planetary transit. We present a non-detection in our first visit followed by the detection of escaping neutral hydrogen ahead of the planet in our second visit. The outflow absorbed about 30% of the star's Lyman-alpha blue-wing 2.5 hours before the planet's white-light transit. We estimate the highest velocity escaping material has a column density of 10^13.96 cm^-2 and is moving 61.26 km/s away from the host star. AU Mic b's large high energy irradiation could photoionize its escaping neutral hydrogen in 44 minutes, rendering it temporarily unobservable. Our time-variable Lyman-alpha transit ahead of AU Mic b could also be explained by an intermediate stellar wind strength from AU Mic that shapes the escaping material into a leading tail. Future Lyman-alpha observations of this system will confirm and characterize the unique variable nature of its Lyman-alpha transit, which combined with modeling will tune the importance of stellar wind and photoionization.",
  "categories": [
    "astro-ph.EP",
    "astro-ph.SR"
  ],
  "primary_category": "astro-ph.EP",
  "doi": "10.3847/1538-3881/ace536",
  "journal_ref": "The Astronomical Journal, Volume 166, Number 2, 2023",
  "arxiv_id": "2307.15024",
  "pdf_url": "https://arxiv.org/pdf/2307.15024v1",
  "comment": "24 pages, 11 figures",
  "num_versions": null,
  "size_before_bytes": 2912050,
  "size_after_bytes": 344686
}