{
  "title": "Towards a reliable prediction of the infrared spectra of cosmic fullerenes and their derivatives in the JWST era",
  "authors": [
    "Jianzhi Xu",
    "Aigen Li",
    "Xiaohu Li",
    "Gao-Lei Hou"
  ],
  "submission_date": "2023-07-28T16:59:00+00:00",
  "revised_dates": [],
  "abstract": "Fullerenes, including C60, C70, and C60+, are widespread in space through their characteristic infrared vibrational features (C60+ also reveals its presence in the interstellar medium through its electronic transitions) and offer great insights into the carbon chemistry and stellar evolution. The potential existence of fullerene-related species in space has long been speculated and recently put forward by a set of laboratory experiments of C60+, C60H+, C60O+, C60OH+, C70H+, and [C60-Metal]+ complexes. The advent of the James Webb Space Telescope (JWST) provides a unique opportunity to search for these fullerene-related species in space. To facilitate JWST search, analysis, and interpretation, an accurate knowledge of their vibrational properties is essential. Here, we compile a VibFullerene database and conduct a systematic theoretical study on those species. We derive a set of range-specific scaling factors for vibrational frequencies, to account for the deficiency of density functional theory calculations in predicting the accurate frequencies. Scaling factors with low root-mean-square and median errors for the frequencies are obtained, and their performance is evaluated, from which the best-performing methods are recommended for calculating the infrared spectra of fullerene derivatives which balance the accuracy and computational cost. Finally, the recommended vibrational frequencies and intensities of fullerene derivatives are presented for future JWST detection.",
  "categories": [
    "astro-ph.GA",
    "physics.chem-ph"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.1093/mnras/stad2335",
  "journal_ref": "Monthly Notices of the Royal Astronomical Society, 2023, 525, 3061",
  "arxiv_id": "2307.15668",
  "pdf_url": "https://arxiv.org/pdf/2307.15668v1",
  "comment": "19 pages, 8 figures, 5 tables. Accepted for publication in MNRAS",
  "num_versions": null,
  "size_before_bytes": 1396421,
  "size_after_bytes": 817805
}