{
  "title": "On the unreasonable vulnerability of transformers for image restoration -- and an easy fix",
  "authors": [
    "Shashank Agnihotri",
    "Kanchana Vaishnavi Gandikota",
    "Julia Grabinski",
    "Paramanand Chandramouli",
    "Margret Keuper"
  ],
  "submission_date": "2023-07-25T23:09:05+00:00",
  "revised_dates": [],
  "abstract": "Following their success in visual recognition tasks, Vision Transformers(ViTs) are being increasingly employed for image restoration. As a few recent works claim that ViTs for image classification also have better robustness properties, we investigate whether the improved adversarial robustness of ViTs extends to image restoration. We consider the recently proposed Restormer model, as well as NAFNet and the \"Baseline network\" which are both simplified versions of a Restormer. We use Projected Gradient Descent (PGD) and CosPGD, a recently proposed adversarial attack tailored to pixel-wise prediction tasks for our robustness evaluation. Our experiments are performed on real-world images from the GoPro dataset for image deblurring. Our analysis indicates that contrary to as advocated by ViTs in image classification works, these models are highly susceptible to adversarial attacks. We attempt to improve their robustness through adversarial training. While this yields a significant increase in robustness for Restormer, results on other networks are less promising. Interestingly, the design choices in NAFNet and Baselines, which were based on iid performance, and not on robust generalization, seem to be at odds with the model robustness. Thus, we investigate this further and find a fix.",
  "categories": [
    "cs.CV",
    "cs.LG",
    "eess.IV"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13856",
  "pdf_url": null,
  "comment": "Tags: Robustness, adversarial attacks, image deblurring, image restoration, NAFNet, Baseline, Restormer, adversarial training",
  "num_versions": null,
  "size_before_bytes": 39707727,
  "size_after_bytes": 143515
}