{
  "title": "Scalable tensor-network error mitigation for near-term quantum computing",
  "authors": [
    "Sergei Filippov",
    "Matea Leahy",
    "Matteo A. C. Rossi",
    "Guillermo García-Pérez"
  ],
  "submission_date": "2023-07-21T17:54:05+00:00",
  "revised_dates": [
    "2023-07-25T00:58:42+00:00"
  ],
  "abstract": "Until fault-tolerance becomes implementable at scale, quantum computing will heavily rely on noise mitigation techniques. While methods such as zero noise extrapolation with probabilistic error amplification (ZNE-PEA) and probabilistic error cancellation (PEC) have been successfully tested on hardware recently, their scalability to larger circuits may be limited. Here, we introduce the tensor-network error mitigation (TEM) algorithm, which acts in post-processing to correct the noise-induced errors in estimations of physical observables. The method consists of the construction of a tensor network representing the inverse of the global noise channel affecting the state of the quantum processor, and the consequent application of the map to informationally complete measurement outcomes obtained from the noisy state. TEM does therefore not require additional quantum operations other than the implementation of informationally complete POVMs, which can be achieved through randomised local measurements. The key advantage of TEM is that the measurement overhead is quadratically smaller than in PEC. We test TEM extensively in numerical simulations in different regimes. We find that TEM can be applied to circuits of twice the depth compared to what is achievable with PEC under realistic conditions with sparse Pauli-Lindblad noise, such as those in [E. van den Berg et al., Nat. Phys. (2023)]. By using Clifford circuits, we explore the capabilities of the method in wider and deeper circuits with lower noise levels. We find that in the case of 100 qubits and depth 100, both PEC and ZNE fail to produce accurate results by using $\\sim 10^5$ shots, while TEM succeeds.",
  "categories": [
    "quant-ph"
  ],
  "primary_category": "quant-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11740",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 37007779,
  "size_after_bytes": 350508
}