{
  "title": "Combining astrometry and JUICE -- Europa Clipper radio science to improve the ephemerides of the Galilean moons",
  "authors": [
    "M. Fayolle",
    "A. Magnanini",
    "V. Lainey",
    "D. Dirkx",
    "M. Zannoni",
    "P. Tortora"
  ],
  "submission_date": "2023-07-29T12:06:05+00:00",
  "revised_dates": [],
  "abstract": "The upcoming JUICE and Europa Clipper missions to Jupiter's Galilean satellites will provide radio science tracking measurements of both spacecraft. Such data are expected to significantly help estimating the moons' ephemerides and related dynamical parameters. However, the two missions will yield an imbalanced dataset, with no flybys planned at Io, condensed over less than six years. Current ephemerides' solutions for the Galilean moons, on the other hand, rely on ground-based astrometry collected over more than a century which, while being less accurate, bring very valuable constraints on the long-term dynamics of the system. An improved solution for the Galilean satellites' complex dynamics could however be achieved by exploiting the existing synergies between these different observation sets. To quantify this, we merged simulated JUICE and Clipper radio science data with existing ground-based astrometric and radar observations, and performed the inversion. Our study specifically focusses on the resulting formal uncertainties in the moons' states, as well as Io's and Jupiter's tidal dissipation parameters. Adding astrometry stabilises the moons' state solution, especially beyond the missions' timelines. It furthermore reduces the uncertainties in $1/Q$ (inverse of the tidal quality factor) by a factor two to four for Jupiter, and about 30-35\\% for Io. Among all data types, classical astrometry data prior to 1960 proved particularly beneficial. We also show that ground observations of Io add the most to the solution, confirming that ground observations can fill the lack of radio science data for this specific moon. We obtained a noticeable solution improvement when exploiting the complementarity between all different observation sets. These promising simulation results thus motivate future efforts to achieve a global solution from actual JUICE and Clipper radio science data.",
  "categories": [
    "astro-ph.EP",
    "astro-ph.IM"
  ],
  "primary_category": "astro-ph.EP",
  "doi": "10.1051/0004-6361/202347065",
  "journal_ref": "A&A 677, A42 (2023)",
  "arxiv_id": "2307.15966",
  "pdf_url": "https://arxiv.org/pdf/2307.15966v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 3458193,
  "size_after_bytes": 1256530
}