{
  "title": "Estimation of the error matrix in a linear least square fit to the data from an experiment performed by smartphone photography",
  "authors": [
    "Sanjoy Kumar Pal",
    "Soumen Sarkar",
    "Surajit Chakrabarti"
  ],
  "submission_date": "2023-07-23T12:47:18+00:00",
  "revised_dates": [],
  "abstract": "Determination of the Young modulus of a metal bar in the form of a cantilever is an old experimental concept. However, we have taken the advantage of modern advanced technology of smartphone camera to find the load depression graph of the cantilever by taking photographs with the smartphone camera. Smartphone photography allows us to find a precise transverse magnification of an object from the size of the real image formed on the sensor of the camera. Image size on the sensor can be obtained with micron level accuracy. From the load depression graph, we have determined the Young modulus of the bar. The sensitive measurements of the depression of the cantilever at its free end by its own weight, have allowed us to determine the density of aluminium. We have added an analysis of the chi squred minimisation technique for determining the parameters and their uncertainities in a linear fit. Starting from the curvature matrix we have made a comprehensive analysis of the error matrix relevant for a two parameter linear fit. Then we have shown how to form the error matrix for the fitted parameters which includes the covariance term between the two correlated parameters, in the context of our specific experiment. We have propagated the errors in the parameters to find the uncertainties in the Young modulus and the density of the bar. We have shown that a precise measurement is possible by smartphone photography.",
  "categories": [
    "physics.ed-ph"
  ],
  "primary_category": "physics.ed-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12312",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 152939,
  "size_after_bytes": 41018
}