{
  "title": "Revised orbits of the two nearest Jupiters",
  "authors": [
    "Fabo Feng",
    "R. Paul Butler",
    "Steven S. Vogt",
    "Bradford Holden",
    "Yicheng Rui"
  ],
  "submission_date": "2023-07-25T16:24:28+00:00",
  "revised_dates": [
    "2023-07-28T00:08:29+00:00",
    "2023-08-09T13:42:37+00:00",
    "2023-08-28T00:20:44+00:00"
  ],
  "abstract": "With its near-to-mid-infrared high contrast imaging capabilities, JWST is ushering us into a golden age of directly imaging Jupiter-like planets. As the two closest cold Jupiters, $\\varepsilon$ Ind A b and $\\varepsilon$ Eridani b have sufficiently wide orbits and adequate infrared emissions to be detected by JWST. To detect more Jupiter-like planets for direct imaging, we develop a GOST-based method to analyze radial velocity data and multiple Gaia data releases simultaneously. Without approximating instantaneous astrometry by catalog astrometry, this approach enables the use of multiple Gaia data releases for detection of both short-period and long-period planets. We determine a mass of $2.96_{-0.38}^{+0.41}$ $M_{\\rm Jup}$ and a period of $42.92_{-4.09}^{+6.38}$ yr for $\\varepsilon$ Ind A b. We also find a mass of $0.76_{-0.11}^{+0.14}$ $M_{\\rm Jup}$, a period of $7.36_{-0.05}^{+0.04}$ yr, and an eccentricity of 0.26$_{-0.04}^{+0.04}$ for $\\varepsilon$ Eridani b. The eccentricity differs from that given by some previous solutions probably due to the sensitivity of orbital eccentricity to noise modeling. Our work refines the constraints on orbits and masses of the two nearest Jupiters and demonstrate the feasibility of using multiple Gaia data releases to constrain Jupiter-like planets.",
  "categories": [
    "astro-ph.EP"
  ],
  "primary_category": "astro-ph.EP",
  "doi": "10.1093/mnras/stad2297",
  "journal_ref": null,
  "arxiv_id": "2307.13622",
  "pdf_url": null,
  "comment": "14 pages, 5 figures, 4 tables, accepted for publication in MNRAS",
  "num_versions": null,
  "size_before_bytes": 15648233,
  "size_after_bytes": 2251354
}