{
  "title": "ClusterSeq: Enhancing Sequential Recommender Systems with Clustering based Meta-Learning",
  "authors": [
    "Mohammmadmahdi Maheri",
    "Reza Abdollahzadeh",
    "Bardia Mohammadi",
    "Mina Rafiei",
    "Jafar Habibi",
    "Hamid R. Rabiee"
  ],
  "submission_date": "2023-07-25T18:53:24+00:00",
  "revised_dates": [],
  "abstract": "In practical scenarios, the effectiveness of sequential recommendation systems is hindered by the user cold-start problem, which arises due to limited interactions for accurately determining user preferences. Previous studies have attempted to address this issue by combining meta-learning with user and item-side information. However, these approaches face inherent challenges in modeling user preference dynamics, particularly for \"minor users\" who exhibit distinct preferences compared to more common or \"major users.\" To overcome these limitations, we present a novel approach called ClusterSeq, a Meta-Learning Clustering-Based Sequential Recommender System. ClusterSeq leverages dynamic information in the user sequence to enhance item prediction accuracy, even in the absence of side information. This model preserves the preferences of minor users without being overshadowed by major users, and it capitalizes on the collective knowledge of users within the same cluster. Extensive experiments conducted on various benchmark datasets validate the effectiveness of ClusterSeq. Empirical results consistently demonstrate that ClusterSeq outperforms several state-of-the-art meta-learning recommenders. Notably, compared to existing meta-learning methods, our proposed approach achieves a substantial improvement of 16-39% in Mean Reciprocal Rank (MRR).",
  "categories": [
    "cs.IR",
    "cs.AI",
    "cs.LG"
  ],
  "primary_category": "cs.IR",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13766",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 2264752,
  "size_after_bytes": 417841
}