{
  "title": "Test of $^{116}$CdWO$_4$ and Li$_2$MoO$_4$ scintillating bolometers in the CROSS underground facility with upgraded detector suspension",
  "authors": [
    "A. Ahmine",
    "I. C. Bandac",
    "A. S. Barabash",
    "V. Berest",
    "L. Bergé",
    "J. M. Calvo-Mozota",
    "P. Carniti",
    "M. Chapellier",
    "I. Dafinei",
    "F. A. Danevich",
    "T. Dixon",
    "L. Dumoulin",
    "F. Ferri",
    "A. Giuliani",
    "C. Gotti",
    "P. Gras",
    "D. L. Helis",
    "A. Ianni",
    "L. Imbert",
    "H. Khalife",
    "V. V. Kobychev",
    "S. I. Konovalov",
    "P. Loaiza",
    "P. de Marcillac",
    "S. Marnieros",
    "C. A. Marrache-Kikuchi",
    "M. Martinez",
    "C. Nones",
    "E. Olivieri",
    "A. Ortiz de Solórzano",
    "Y. Peinaud",
    "G. Pessina",
    "D. V. Poda",
    "Th. Redon",
    "Ph. Rosier",
    "J. A. Scarpaci",
    "V. I. Tretyak",
    "V. I. Umatov",
    "M. Velazquez",
    "M. M. Zarytskyy",
    "A. Zolotarova"
  ],
  "submission_date": "2023-07-27T13:08:54+00:00",
  "revised_dates": [],
  "abstract": "In preparation to the CROSS $2β$ decay experiment, we installed a new detector suspension with magnetic dumping inside a pulse-tube cryostat of a dedicated low-background facility at the LSC (Spain). The suspension was tested with two scintillating bolometers based on large-volume 116CdWO4 (CWO-enr) and Li2MoO4 (LMO) crystals. The former, a reference device, was used for testing new noise conditions and for comparing bolometric performance of an advanced Li2MoO4 crystal developed in the framework of the CLYMENE project, in view of next-generation double-beta decay experiments like CUPID. We cooled down detectors to 15 mK and achieved high performance for all tested devices. In particular both CWO-enr and LMO bolometers demonstrated the energy resolution of 6 keV FWHM for the 2.6 MeV gamma quanta, among the best for thermal detectors based on such compounds. The baseline noise resolution (FWHM) of the CWO-enr detector was improved by 2 keV, compared to the best previous measurement of this detector in the CROSS facility, while the noise of the Ge-based optical bolometer was improved by a factor 2, to 100 eV FWHM. Despite of the evident progress in the improving of noise conditions of the set-up, we see high-frequency harmonics of a pulse-tube induced noise, suggesting a noise pick-up by cabling. Another Ge light detector was assisted with the signal amplification exploiting the Neganov-Trofimov-Luke effect, which allowed to reach 20 eV FWHM noise resolution by applying 60 V electrode bias. Highly-efficient particle identification was achieved with both detectors, despite a low scintillation efficiency of the LMO material. The radiopurity level of the LMO crystal is rather high; only traces of 210Po and 226Ra were detected (0.1 mBq/kg each), while the 228Th activity is expected to be at least an order of magnitude lower, as well as a 40K activity is found to be < 6 mBq/kg.",
  "categories": [
    "physics.ins-det",
    "nucl-ex"
  ],
  "primary_category": "physics.ins-det",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14831",
  "pdf_url": "https://arxiv.org/pdf/2307.14831v1",
  "comment": "Prepared for submission to JINST, 26 pages, 8 figures, 2 tables",
  "num_versions": null,
  "size_before_bytes": 3480571,
  "size_after_bytes": 119525
}