{
  "title": "Single-particle excitations across the localization and many-body localization transition in quasi-periodic systems",
  "authors": [
    "Yogeshwar Prasad",
    "Arti Garg"
  ],
  "submission_date": "2023-07-23T10:41:56+00:00",
  "revised_dates": [
    "2023-09-01T00:01:44+00:00",
    "2024-03-15T00:34:08+00:00"
  ],
  "abstract": "We study localization and many-body localization transition in one dimensional systems in the presence of deterministic quasi-periodic potential. We use single-particle excitations obtained through single-particle Green's function in real space to characterize the localization to delocalization transition. A single parameter scaling analysis of the ratio of the typical to average value of the local density of states (LDOS) of single particle excitations shows that the critical exponent with which the correlation length $ξ$ diverges at the transition point $ξ\\sim |h-h_c|^{-ν}$, coming from the localized side, satisfies the inequality $ν\\ge 1$ for the non-interacting Aubry-Andre (AA) model. For the interacting system with AA potential, we study single particle excitations produced in highly excited many-body eigenstates across the MBL transition and found that the critical exponent obtained from finite-size scaling of the ratio of the typical to average value of the LDOS satisfies $ν\\ge 1$ here as well. This analysis of local density of states shows that the localization and MBL transition in systems with quasi-periodic potential belong to a different universality class than the localization and MBL transition in systems with random disorder where $ν\\ge 2$. In complete contrast to this, finite-size scaling of the level spacing ratio is known to support the same universality class for MBL transitions in systems with quasiperiodic as well as random disorder potentials. For the interacting systems with quasiperiodic potentials, though finite-size scaling of the level spacing ratio shows a transition at $h_c^{lsr}$ which is close to the transition point obtained from LDOS within numerical precision, the critical exponent obtained from finite-size scaling of level spacing ratio is $ν\\sim 0.54$ in close similarity to the MBL systems with random disorder.",
  "categories": [
    "cond-mat.dis-nn",
    "cond-mat.stat-mech"
  ],
  "primary_category": "cond-mat.dis-nn",
  "doi": "10.1103/PhysRevB.109.094204",
  "journal_ref": "Phys. Rev. B 109, 094204 (2024)",
  "arxiv_id": "2307.12288",
  "pdf_url": null,
  "comment": "7 pages, 5 figures",
  "num_versions": null,
  "size_before_bytes": 2122509,
  "size_after_bytes": 403823
}