{
  "title": "Next-Generation Comprehensive Data-Driven Models of Solar Eruptive Events",
  "authors": [
    "Joel C. Allred",
    "Graham S. Kerr",
    "Meriem Alaoui",
    "Juan Camilo Buitrago-Casas",
    "Amir Caspi",
    "Bin Chen",
    "Thomas Y. Chen",
    "Lindsay Glesener",
    "Silvina E. Guidoni",
    "Fan Guo",
    "Judith T. Karpen",
    "Sophie Musset",
    "Katharine K. Reeves",
    "Albert Y. Shih"
  ],
  "submission_date": "2023-07-27T15:38:37+00:00",
  "revised_dates": [],
  "abstract": "Solar flares and coronal mass ejections are interrelated phenomena that together are known as solar eruptive events. These are the main drivers of space weather and understanding their origins is a primary goal of Heliophysics. In this white paper, we advocate for the allocation of sufficient resources to bring together experts in observations and modeling to construct and test next generation data-driven models of solar eruptive events. We identify the key components necessary for constructing comprehensive end-to-end models including global scale 3D MHD resolving magnetic field evolution and reconnection, small scale simulations of particle acceleration in reconnection exhausts, kinetic scale transport of flare-accelerated particles into the lower solar atmosphere, and the radiative and hydrodynamics responses of the solar atmosphere to flare heating. Using this modeling framework, long-standing questions regarding how solar eruptive events release energy, accelerate particles, and heat plasma can be explored.\n  To address open questions in solar flare physics, we recommend that NASA and NSF provide sufficient research and analysis funds to bring together a large body of researchers and numerical tools to tackle the end-to-end modeling framework that we outline. Current dedicated theory and modeling funding programs are relatively small scale and infrequent; funding agencies must recognize that modern space physics demands the use of both observations and modeling to make rapid progress.",
  "categories": [
    "astro-ph.IM",
    "astro-ph.HE",
    "astro-ph.SR",
    "physics.plasm-ph",
    "physics.space-ph"
  ],
  "primary_category": "astro-ph.IM",
  "doi": "10.3847/25c2cfeb.93c25d9e",
  "journal_ref": "Bulletin of the AAS, Vol. 55, Issue 3, Whitepaper #010 (10pp); 2023 July 31",
  "arxiv_id": "2307.14946",
  "pdf_url": "https://arxiv.org/pdf/2307.14946v1",
  "comment": "White paper submitted to the Decadal Survey for Solar and Space Physics (Heliophysics) 2024-2033; 9 pages, 4 figures",
  "num_versions": null,
  "size_before_bytes": 8410983,
  "size_after_bytes": 120072
}