{
  "title": "Integral Field Spectroscopy of 13 Tidal Disruption Event Hosts from the ZTF Survey",
  "authors": [
    "Erica Hammerstein",
    "S. Bradley Cenko",
    "Suvi Gezari",
    "Sylvain Veilleux",
    "Brendan O'Connor",
    "Sjoert van Velzen",
    "Charlotte Ward",
    "Yuhan Yao",
    "Matthew Graham"
  ],
  "submission_date": "2023-07-28T17:52:49+00:00",
  "revised_dates": [
    "2023-09-26T16:04:29+00:00"
  ],
  "abstract": "The host galaxies of tidal disruption events (TDEs) have been shown to possess peculiar properties, including high central light concentrations, unusual star-formation histories, and ``green'' colors. The ubiquity of these large-scale galaxy characteristics among TDE host populations suggests they may serve to boost the TDE rate in such galaxies by influencing the nuclear stellar dynamics. We present the first population study of integral field spectroscopy for thirteen TDE host galaxies across all spectral classes and X-ray brightnesses with the purpose of investigating their large-scale properties. We derive the black hole masses via stellar kinematics (i.e., the $M-σ$ relation) and find masses in the range $5.0 \\lesssim \\log(M_{\\rm BH}/M_\\odot) \\lesssim 8.0$, with a distribution dominated by black holes with $M_{\\rm BH} \\sim 10^6 M_\\odot$. We find one object with $M_{\\rm BH} \\gtrsim 10^8 M_\\odot$, above the ``Hills mass'', which if the disrupted star was of solar type, allows a lower limit of $a \\gtrsim 0.16$ to be placed on its spin, lending further support to the proposed connection between featureless TDEs and jetted TDEs. We also explore the level of rotational support in the TDE hosts, quantified by $(V/σ)_e$, a parameter which has been shown to correlate with stellar age and may explain the peculiar host galaxy preferences of TDEs. We find that the TDE hosts exhibit a broad range in $(V/σ)_e$ following a similar distribution as E+A galaxies, which have been shown to be overrepresented among TDE host populations.",
  "categories": [
    "astro-ph.CO",
    "astro-ph.GA",
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.CO",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15705",
  "pdf_url": "https://arxiv.org/pdf/2307.15705v2",
  "comment": "20 pages, 13 figures, 4 tables; accepted to ApJ",
  "num_versions": null,
  "size_before_bytes": 5926759,
  "size_after_bytes": 2195655
}