{
  "title": "The Tianlin Mission: a 6m UV/Opt/IR space telescope to explore the habitable worlds and the universe",
  "authors": [
    "Wei Wang",
    "Meng Zhai",
    "Gang Zhao",
    "Shen Wang",
    "Jifeng Liu",
    "Jin Chang",
    "Xuejun Zhang",
    "Jihong Dong",
    "Boqian Xu",
    "Frank Grupp"
  ],
  "submission_date": "2023-07-22T08:19:58+00:00",
  "revised_dates": [],
  "abstract": "[Abridged] It is expected that the ongoing and future space-borne planet survey missions including TESS, PLATO, and Earth 2.0 will detect thousands of small to medium-sized planets via the transit technique, including over a hundred habitable terrestrial rocky planets. To conduct a detailed study of these terrestrial planets, particularly the cool ones with wide orbits, the exoplanet community has proposed various follow-up missions. The currently proposed ESA mission ARIEL is capable of characterization of planets down to warm super-Earths mainly using transmission spectroscopy. The NASA 6m UV/Opt/NIR mission proposed in the Astro2020 Decadal Survey may further tackle down to habitable rocky planets, and is expected to launch around 2045. In the meanwhile, China is funding a concept study of a 6-m class space telescope named Tianlin (A UV/Opt/NIR Large Aperture Space Telescope) that aims to start its operation within the next 10-15 years and last for 5+ years. Tianlin will be primarily aimed to the discovery and characterization of rocky planets in the habitable zones (HZ) around nearby stars and to search for potential biosignatures mainly using the direct imaging method. Transmission and emission spectroscopy at moderate to high resolution will be carried out as well on a population of exoplanets to strengthen the understanding of the formation and evolution of exoplanets. It will also carry out in-depth studies of the cosmic web and early galaxies, and constrain the nature of the dark matter and dark energy. We describe briefly the primary scientific motivations and main technical considerations based on our preliminary simulation results. We find that a monolithic off-axis space telescope with a primary mirror diameter larger than 6m equipped with a high contrast chronograph can identify water in the atmosphere of a habitable-zone Earth-like planet around a Sun-like star.",
  "categories": [
    "astro-ph.EP",
    "astro-ph.IM"
  ],
  "primary_category": "astro-ph.EP",
  "doi": "10.1088/1674-4527/ace90f",
  "journal_ref": null,
  "arxiv_id": "2307.12013",
  "pdf_url": null,
  "comment": "15 pages, 5 figures, accepted for publication in RAA and is available online",
  "num_versions": null,
  "size_before_bytes": 1237230,
  "size_after_bytes": 309221
}