{
  "title": "The Strong Maximum Circulation Algorithm: A New Method for Aggregating Preference Rankings",
  "authors": [
    "Nathan Atkinson",
    "Scott C. Ganz",
    "Dorit S. Hochbaum",
    "James B. Orlin"
  ],
  "submission_date": "2023-07-28T17:51:05+00:00",
  "revised_dates": [
    "2024-01-17T02:01:23+00:00",
    "2024-10-17T16:50:54+00:00",
    "2025-01-27T18:07:22+00:00"
  ],
  "abstract": "We present a new optimization-based method for aggregating preferences in settings where each voter expresses preferences over pairs of alternatives. Our approach to identifying a consensus partial order is motivated by the observation that collections of votes that form a cycle can be treated as collective ties. Our approach then removes unions of cycles of votes, or circulations, from the vote graph and determines aggregate preferences from the remainder. Specifically, we study the removal of maximal circulations attained by any union of cycles the removal of which leaves an acyclic graph. We introduce the strong maximum circulation, the removal of which guarantees a unique outcome in terms of the induced partial order, called the strong partial order. The strong maximum circulation also satisfies strong complementary slackness conditions, and is shown to be solved efficiently as a network flow problem. We further establish the relationship between the dual of the maximum circulation problem and Kemeny's method, a popular optimization-based approach for preference aggregation. We also show that identifying a minimum maximal circulation -- i.e., a maximal circulation containing the smallest number of votes -- is an NP-hard problem. Further an instance of the minimum maximal circulation may have multiple optimal solutions whose removal results in conflicting partial orders.",
  "categories": [
    "cs.SI",
    "econ.TH",
    "math.OC"
  ],
  "primary_category": "cs.SI",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15702",
  "pdf_url": "https://arxiv.org/pdf/2307.15702v4",
  "comment": "INFORMS Journal on Optimization, Forthcoming",
  "num_versions": null,
  "size_before_bytes": 694377,
  "size_after_bytes": 660192
}