{
  "title": "Security Analysis of Smart Contract Migration from Ethereum to Arbitrum",
  "authors": [
    "Xueyan Tang",
    "Lingzhi Shi"
  ],
  "submission_date": "2023-07-27T11:05:29+00:00",
  "revised_dates": [
    "2023-12-21T14:11:26+00:00",
    "2024-07-29T07:01:34+00:00"
  ],
  "abstract": "When migrating smart contracts from one blockchain platform to another, there are potential security risks. This is because different blockchain platforms have different environments and characteristics for executing smart contracts. The focus of this paper is to study the security risks associated with the migration of smart contracts from Ethereum to Arbitrum. We collected relevant data and analyzed smart contract migration cases to explore the differences between Ethereum and Arbitrum in areas such as Arbitrum cross-chain messaging, block properties, contract address alias, and gas fees. From the 36 types of smart contract migration cases we identified, we selected 4 typical types of cases and summarized their security risks. The research shows that smart contracts deployed on Ethereum may face certain potential security risks during migration to Arbitrum, mainly due to issues inherent in public blockchain characteristics, such as outdated off-chain data obtained by the inactive sequencer, logic errors based on time, the permission check failed, Denial of Service(DOS) attacks. To mitigate these security risks, we proposed avoidance methods and provided considerations for users and developers to ensure a secure migration process. It's worth noting that this study is the first to conduct an in-depth analysis of the secure migration of smart contracts from Ethereum to Arbitrum.",
  "categories": [
    "cs.CR"
  ],
  "primary_category": "cs.CR",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14773",
  "pdf_url": "https://arxiv.org/pdf/2307.14773v3",
  "comment": "18 pages,10 figures",
  "num_versions": null,
  "size_before_bytes": 6794435,
  "size_after_bytes": 2071566
}