{
  "title": "The Giant Radio Array for Neutrino Detection",
  "authors": [
    "João R. T. de Mello Neto"
  ],
  "submission_date": "2023-07-25T16:41:33+00:00",
  "revised_dates": [],
  "abstract": "Ultra-high-energy cosmic neutrinos (UHE), with energies above 100 PeV, are unparalleled probes of the most energetic astrophysical sources and weak interactions at energies beyond the reach of accelerators. GRAND is an envisioned observatory of UHE particles - neutrinos, cosmic rays, and gamma rays - consisting of 200,000 radio antennas deployed in sub-arrays at different locations worldwide. GRAND aims to detect the radio emission from air showers induced by UHE particle interactions in the atmosphere and underground. For neutrinos, it aims to reach a flux sensitivity of $\\sim 10^{-10}$ GeV cm$^{-2}$ s$^{-1}$ sr$^{-1}$, with a sub-degree angular resolution, which would allow it to test the smallest predicted diffuse fluxes of UHE neutrinos and to discover point sources. The GRAND Collaboration operates three prototype detector arrays simultaneously: GRAND@Nançay in France, GRANDProto300 in China, and GRAND@Auger in Argentina. The primary purpose of GRAND@Nan\\c cay is to serve as a testbench for hardware and triggering systems. On the other hand, GRANDProto300 and GRAND@Auger are exploratory projects that pave the way for future stages of GRAND. GRANDProto300 is being built to demonstrate autonomous radio-detection of inclined air showers and study cosmic rays near the proposed transition between galactic and extragalactic sources. All three arrays are in the commissioning stages. It is expected that by 2028, the detector units of the final design could be produced and deployed, marking the establishment of two GRAND10k arrays in the Northern and Southern hemispheres. We will survey preliminary designs, simulation results, construction plans, and the extensive research program made possible by GRAND.",
  "categories": [
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.HE",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13638",
  "pdf_url": null,
  "comment": "Presented at the 38th International Cosmic Ray Conference (ICRC 2023). 8 pages, 3 figures",
  "num_versions": null,
  "size_before_bytes": 2251239,
  "size_after_bytes": 136027
}