{
  "title": "High-energy neutrino constraints on cosmic-ray re-acceleration in radio halos of massive galaxy clusters",
  "authors": [
    "Kosuke Nishiwaki",
    "Katsuaki Asano",
    "Kohta Murase"
  ],
  "submission_date": "2023-07-25T06:02:11+00:00",
  "revised_dates": [],
  "abstract": "A fraction of merging galaxy clusters host diffuse radio emission in their central region, termed as a giant radio halo (GRH). The most promising mechanism of GRHs is the re-acceleration of non-thermal electrons and positrons by merger-induced turbulence. However, the origin of these seed leptons has been under debate, and either protons or electrons can be primarily-accelerated particles. In this work, we demonstrate that neutrinos can be used as a probe of physical processes in galaxy clusters, and discuss possible constraints on the amount of relativistic protons in the intra-cluster medium with the existing upper limits by IceCube. We calculate radio and neutrino emission from massive ($>10^{14}M_\\odot$) galaxy clusters, using the cluster population model of Nishiwaki & Asano (2022). This model is compatible with the observed statistics of GRHs, and we find that the contribution of GRHs to the isotropic radio background observed with the ARCADE-2 experiment should be subdominant. Our fiducial model predicts the all-sky neutrino flux that is consistent with IceCube's upper limit from the stacking analysis. We also show that the neutrino upper limit gives meaningful constraints on the parameter space of the re-acceleration model, such as the electron-to-proton ratio of primary cosmic-rays and the magnetic field, and in particular the secondary scenario, where the seed electrons mostly originate from inelastic $pp$ collisions, can be constrained even in the presence of re-acceleration.",
  "categories": [
    "astro-ph.HE",
    "astro-ph.CO",
    "hep-ph"
  ],
  "primary_category": "astro-ph.HE",
  "doi": "10.3847/1538-4357/aceaf2",
  "journal_ref": "Astrophys.J. 954 (2023) 188",
  "arxiv_id": "2307.13273",
  "pdf_url": null,
  "comment": "12 pages, 6 figures, accepted for publication in ApJ",
  "num_versions": null,
  "size_before_bytes": 3181640,
  "size_after_bytes": 1100318
}