{
  "title": "Revisiting Néel 60 years on: the magnetic anisotropy of $\\mathrm{L}1_0$ FeNi (tetrataenite)",
  "authors": [
    "Christopher D. Woodgate",
    "Christopher E. Patrick",
    "Laura H. Lewis",
    "Julie B. Staunton"
  ],
  "submission_date": "2023-07-28T10:42:58+00:00",
  "revised_dates": [
    "2023-10-12T10:54:38+00:00"
  ],
  "abstract": "The magnetocrystalline anisotropy energy of atomically ordered $\\mathrm{L}1_0$ FeNi (the meteoritic mineral tetrataenite) is studied within a first-principles electronic structure framework. Two compositions are examined: equiatomic Fe$_{0.5}$Ni$_{0.5}$ and an Fe-rich composition, Fe$_{0.56}$Ni$_{0.44}$. It is confirmed that, for the single crystals modelled in this work, the leading-order anisotropy coefficient $K_1$ dominates the higher-order coefficients $K_2$ and $K_3$. To enable comparison with experiment, the effects of both imperfect atomic long-range order and finite temperature are included. While our computational results initially appear to undershoot the measured experimental values for this system, careful scrutiny of the original analysis due to Néel et al. [J. Appl. Phys. 35, 873 (1964)] suggests that our computed value of $K_1$ is, in fact, consistent with experimental values, and that the noted discrepancy has its origins in the nanoscale polycrystalline, multivariant nature of experimental samples, that yields much larger values of $K_2$ and $K_3$ than expected a priori. These results provide fresh insight into the existing discrepancies in the literature regarding the value of tetrataenite's uniaxial magnetocrystalline anisotropy in both natural and synthetic samples.",
  "categories": [
    "cond-mat.mtrl-sci",
    "physics.app-ph",
    "physics.comp-ph"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": "10.1063/5.0169752",
  "journal_ref": "J. Appl. Phys. 134, 163905 (2023)",
  "arxiv_id": "2307.15470",
  "pdf_url": "https://arxiv.org/pdf/2307.15470v2",
  "comment": "9 pages, 3 figures, 2 tables",
  "num_versions": null,
  "size_before_bytes": 1310600,
  "size_after_bytes": 284923
}