{
  "title": "On interdependence of instabilities and average drop sizes in bag breakup",
  "authors": [
    "Varun Kulkarni",
    "Nikhil Shirdade",
    "Neil Rodrigues",
    "Vishnu Radhakrishna",
    "Paul E. Sojka"
  ],
  "submission_date": "2023-07-30T14:16:22+00:00",
  "revised_dates": [
    "2024-07-25T08:49:39+00:00",
    "2025-06-12T22:14:39+00:00"
  ],
  "abstract": "A drop exposed to cross flow of air experiences sudden accelerations which deform it rapidly ultimately proceeding to disintegrate it into smaller fragments. In this work, we examine the breakup of a drop as a bag film with a bounding rim resulting from acceleration induced Rayleigh-Taylor instabilities and characterized through the Weber number, \\textit{We}, representative of the competition between the disruptive aerodynamic force imparting acceleration and the restorative surface tension force. Our analysis reveals a previously overlooked parabolic dependence ($\\sim We^2$) of the combination of dimensionless instability wavelengths $({\\barλ}_{bag}^2/ {\\barλ}_{rim}^4 {\\barλ}_{film})$ developing on different segments of the deforming drop. Further, we extend these findings to deduce the dependence of the average dimensionless drop sizes for the rim, $\\langle{\\bar{D}}_{rim}\\rangle$ and bag film, $\\langle{\\bar{D}}_{film}\\rangle$ individually, on $We$ and see them to decrease linearly for the rim ($\\sim We^{-1}$) and quadratically for the bag film ($\\sim We^{-2}$). The reported work is expected to have far-reaching implications as it provides unique insights on destabilization and disintegration mechanisms based on theoretical scaling arguments involving the commonly encountered canonical geometries of a toroidal rim and a curved liquid film.",
  "categories": [
    "physics.flu-dyn"
  ],
  "primary_category": "physics.flu-dyn",
  "doi": "10.1063/5.0152096",
  "journal_ref": null,
  "arxiv_id": "2307.16241",
  "pdf_url": "https://arxiv.org/pdf/2307.16241v3",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 3600788,
  "size_after_bytes": 370361
}