{
  "title": "The Space Experiment of the Exo-ecosystem",
  "authors": [
    "Zhu Liu",
    "Duo Cui",
    "Siyao Yang"
  ],
  "submission_date": "2023-07-28T13:59:12+00:00",
  "revised_dates": [],
  "abstract": "The experiment of exo-ecosystem and the exploration of extraterrestrial habitability aims to explore the adaptation of terrestrial life in space conditions for the manned space program and the future interstellar migration, which shows great scientific significance and public interests. By our knowledge the early life on Earth, archaea and extremophile have the ability to adapt to extreme environmental conditions and can potentially habitat in extraterrestrial environments. Here we proposed a design and framework for the experiment on exo-ecosystem and extraterrestrial habitability. The conceptual approach involves building an ecosystem based on archaea and extremophiles in a simulated extraterrestrial environment, with a focus on assessing the exobiological potential and adaptability of terrestrial life forms in such conditions through controlled experiments. Specifically, we introduce the Chinese Exo-Ecosystem Space Experiment (CHEESE), which investigates the survivability and potential for sustained growth, reproduction, and ecological interactions of methanogens under simulated Mars and Moon environments using the China Space Station (CSS) as a platform. We highlight that the space station provides unique yet relatively comprehensive conditions for simulating extraterrestrial environments. In conclusion, space experiments involving exo-ecosystems could pave the way for long-term human habitation in space, ensuring our ability to sustain colonies and settlements beyond Earth while minimizing our ecological impact on celestial bodies.",
  "categories": [
    "astro-ph.EP",
    "physics.pop-ph"
  ],
  "primary_category": "astro-ph.EP",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15562",
  "pdf_url": "https://arxiv.org/pdf/2307.15562v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 774105,
  "size_after_bytes": 465300
}