{
  "title": "Analytic Hall Magnetohydrodynamics toroidal equilibria via the energy-Casimir variational principle",
  "authors": [
    "A. Giannis",
    "D. A. Kaltsas",
    "G. N. Throumoulopoulos"
  ],
  "submission_date": "2023-07-29T22:59:24+00:00",
  "revised_dates": [],
  "abstract": "Equilibrium equations for magnetically confined, axisymmetric plasmas are derived by means of the energy-Casimir variational principle in the context of Hall magnetohydrodynamics (MHD). This approach stems from the noncanonical Hamiltonian structure of Hall MHD, the simplest, quasineutral two-fluid model that incorporates contributions due to ion Hall drifts. The axisymmetric Casimir invariants are used, along with the Hamiltonian functional to apply the energy-Casimir variational principle for axisymmetric two-fluid plasmas with incompressible ion flows. This results in a system of equations of the Grad-Shafranov-Bernoulli (GSB) type with four free functions. Two families of analytic solutions to the GSB system are then calculated, based on specific choices for the free functions. These solutions are subsequently applied to Tokamak-relevant configurations using proper boundary shaping methods. The Hall MHD model predicts a departure of the ion velocity surfaces from the magnetic surfaces which are frozen in the electron fluid. This separation of the characteristic surfaces is corroborated by the analytic solutions calculated in this study. The equilibria constructed by these solutions exhibit favorable characteristics for plasma confinement, for example they possess closed and nested magnetic and flow surfaces with pressure profiles peaked at the plasma core. The relevance of these solutions to laboratory and astrophysical plasmas is finally discussed, with particular focus on systems that involve length scales on the order of the ion skin depth.",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16091",
  "pdf_url": "https://arxiv.org/pdf/2307.16091v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 868928,
  "size_after_bytes": 79745
}