{
  "title": "The valence and Rydberg states of difluoromethane: A combined experimental vacuum ultraviolet spectrum absorption and theoretical study by ab initio configuration interaction and density functional computations",
  "authors": [
    "Michael H. Palmer",
    "Søren Vrønning Hoffmann",
    "Nykola C. Jones",
    "Marcello Coreno",
    "Monica de Simone",
    "Cesare Grazioli"
  ],
  "submission_date": "2023-07-25T09:19:15+00:00",
  "revised_dates": [],
  "abstract": "A new synchrotron study for CH$_2$F$_2$ from has been combined with earlier data. The onset of absorption, band I and also band IV, is resolved into broad vibrational peaks, which contrast with the continuous absorption previously claimed. A new theoretical analysis, using a combination of time dependent density functional theory (TDDFT) calculations and complete active space self-consistent field, leads to a major new interpretation. Adiabatic excitation energies (AEEs) and vertical excitation energies, evaluated by these methods, are used to interpret the spectra in unprecedented detail using theoretical vibronic analysis. This includes both Franck-Condon (FC) and Herzberg-Teller (HT) effects on cold and hot bands. These results lead to the re-assignment of several known excited states and the identification of new ones. The lowest calculated AEE sequence for singlet states is 1$^1$B$_1$ $\\sim$ 1$^1$A$_2$ < 2$^1$B$_1$ < 1$^1$A$_1$ < 2$^1$A$_1$ < 1$^1$B$_2$ < 3$^1$A$_1$ < 3$^1$B$_1$. These, together with calculated higher energy states, give a satisfactory account of the principal maxima observed in the VUV spectrum. Basis sets up to quadruple zeta valence with extensive polarization are used. The diffuse functions within this type of basis generate both valence and low-lying Rydberg excited states. The optimum position for the site of further diffuse functions in the calculations of Rydberg states is shown to lie on the H-atoms. The routine choice on the F-atoms is shown to be inadequate for both CHF$_3$ and CH$_2$F$_2$. The lowest excitation energy region has mixed valence and Rydberg character. TDDFT calculations show that the unusual structure of the onset arises from the near degeneracy of 1$^1$B$_1$ and 1$^1$A$_2$ valence states, which mix in symmetric and antisymmetric combinations.",
  "categories": [
    "physics.chem-ph"
  ],
  "primary_category": "physics.chem-ph",
  "doi": "10.1063/1.5030657",
  "journal_ref": "J. Chem. Phys. 148, 214304 (2018)",
  "arxiv_id": "2307.13354",
  "pdf_url": null,
  "comment": "Manuscript and Supporting Material",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}