{
  "title": "Gauge-independent transition dividing the confinement phase in the lattice SU(2) gauge-adjoint scalar model",
  "authors": [
    "Akihiro Shibata",
    "Kei-Ichi Kondo"
  ],
  "submission_date": "2023-07-29T10:48:00+00:00",
  "revised_dates": [
    "2023-08-14T00:56:09+00:00",
    "2024-08-04T13:08:25+00:00"
  ],
  "abstract": "The lattice SU(2) gauge-scalar model with the scalar field in the adjoint representation of the gauge group has two completely separated confinement and Higgs phases according to the preceding studies based on numerical simulations which have been performed in the specific gauge fixing based on the conventional understanding of the Brout-Englert-Higgs mechanism.\n  In this paper, we re-examine this phase structure in the gauge-independent way based on the numerical simulations performed without any gauge fixing. This is motivated to confirm the recently proposed gauge-independent Brout-Englert-Higgs mechanism for generating the mass of the gauge field without relying on any spontaneous symmetry breaking. For this purpose we investigate correlation functions between gauge-invariant operators obtained by combining the original adjoint scalar field and the new field called the color-direction field which is constructed from the gauge field based on the gauge-covariant decomposition of the gauge field due to Cho-Duan-Ge-Shabanov and Faddeev-Niemi.\n  Consequently, we reproduce gauge-independently the transition line separating confinement phase and Higgs phase, and show surprisingly the existence of a new transition line that divides completely the confinement phase into two parts. Finally, we discuss the physical meaning of the new transition and implications to confinement mechanism.",
  "categories": [
    "hep-lat",
    "hep-ph",
    "hep-th"
  ],
  "primary_category": "hep-lat",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15953",
  "pdf_url": "https://arxiv.org/pdf/2307.15953v3",
  "comment": "15 pages,19 figures; the version to be published in PRD",
  "num_versions": null,
  "size_before_bytes": 1772972,
  "size_after_bytes": 150882
}