{
  "title": "Effects of the inflaton potential on the primordial power spectrum in Loop Quantum Cosmology scenarios",
  "authors": [
    "Beatriz Elizaga Navascués",
    "Guillermo A. Mena Marugán",
    "Jesús Yébana Carrilero"
  ],
  "submission_date": "2023-07-22T09:13:23+00:00",
  "revised_dates": [
    "2023-11-03T00:27:54+00:00"
  ],
  "abstract": "In scenarios of physical interest in Loop Quantum Cosmology, with a preinflationary epoch where the kinetic energy of the inflaton dominates, the analytic study of the dynamics of the primordial fluctuations has been carried out by neglecting the inflaton potential in those stages of the evolution. In this work we develop approximations to investigate the influence of the potential as the period of kinetic dominance gives way to the inflationary regime, treating the potential as a perturbation. Specifically, we study how the potential modifies the effective mass that dictates the dynamics of the scalar perturbations in the preinflationary epochs, within the framework of the so-called hybrid prescription for Loop Quantum Cosmology. Moreover, we motivate and model a transition period that connects the kinetically dominated regime with inflation, allowing us to study the interval of times where the contribution of the potential is no longer negligible but an inflationary description is not yet valid. Finally, we include the main modifications coming from a slow-roll correction to a purely de Sitter evolution of the perturbations during inflation. We analytically solve the dynamics of the perturbations in each of these different epochs of cosmological evolution, starting from initial conditions fixed by the criterion of asymptotic Hamiltonian diagonalization. This enables us to compute and quantitatively analyze the primordial power spectrum in a specific case, using a quadratic inflaton potential.",
  "categories": [
    "gr-qc"
  ],
  "primary_category": "gr-qc",
  "doi": "10.1103/PhysRevD.108.083521",
  "journal_ref": "Phys. Rev. D 108, 083521 (2023)",
  "arxiv_id": "2307.12026",
  "pdf_url": null,
  "comment": "17 pages, 3 figures",
  "num_versions": null,
  "size_before_bytes": 317336,
  "size_after_bytes": 159901
}