{
  "title": "Deciphering the morphological origins of X-shaped radio galaxies: Numerical modeling of Back-flow vs. Jet-reorientation",
  "authors": [
    "Gourab Giri",
    "Bhargav Vaidya",
    "Christian Fendt"
  ],
  "submission_date": "2023-07-28T18:00:01+00:00",
  "revised_dates": [],
  "abstract": "X-shaped Radio Galaxies (XRGs) develop when certain extra-galactic jets deviate from their propagation path. An asymmetric ambient medium (Back-flow model) or complex Active Galactic Nuclei activity (Jet-reorientation model) enforcing the jet direction to deviate may cause such structures. In this context, the present investigation focuses on the modeling of XRGs by performing 3D relativistic magneto-hydrodynamic simulations. We implement different jet propagation models applying an initially identical jet-ambient medium configuration to understand distinctive features. This study, the first of its kind, demonstrates that all adopted models produce XRGs with notable properties, thereby challenging the notion of a universal model. Jet reorientation naturally explains several contentious properties of XRGs, including wing alignment along the ambient medium's primary axis, development of collimated lobes, and the formation of noticeably longer wings than active lobes. Such XRGs disrupt the cluster medium by generating isotropic shocks and channeling more energy than the Back-flow scenario. Our synthetic thermal X-ray maps of the cluster medium reveal four `clear' elongated cavities associated with the wing-lobe alignment, regardless of projection effects, though affecting their age estimation. We show depth and geometric alignment of the evolved cavities may qualify as promising characteristics of XRGs, which may be used to disentangle different formation scenarios.",
  "categories": [
    "astro-ph.GA",
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.GA",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15733",
  "pdf_url": "https://arxiv.org/pdf/2307.15733v1",
  "comment": "Accepted for publication in The Astrophysical Journal Supplement Series (10 Figs, 2 Tables)",
  "num_versions": null,
  "size_before_bytes": 4408645,
  "size_after_bytes": 486110
}