{
  "title": "Chasing Nomadic Worlds: A New Class of Deep Space Missions",
  "authors": [
    "Manasvi Lingam",
    "Andreas M. Hein",
    "T. Marshall Eubanks"
  ],
  "submission_date": "2023-07-23T19:30:33+00:00",
  "revised_dates": [
    "2023-09-06T01:14:01+00:00"
  ],
  "abstract": "Nomadic worlds, i.e., objects not gravitationally bound to any star(s), are of great interest to planetary science and astrobiology. They have garnered attention recently due to constraints derived from microlensing surveys and the recent discovery of interstellar planetesimals. In this paper, we roughly estimate the prevalence of nomadic worlds with radii of $100\\,\\mathrm{km} \\lesssim R \\lesssim 10^4\\,\\mathrm{km}$. The cumulative number density $n_>\\left(>R\\right)$ appears to follow a heuristic power law given by $n_> \\propto R^{-3}$. Therefore, smaller objects are probably much more numerous than larger rocky nomadic planets, and statistically more likely to have members relatively close to the inner Solar system. Our results suggest that tens to hundreds of planet-sized nomadic worlds might populate the spherical volume centered on Earth and circumscribed by Proxima Centauri, and may thus comprise closer interstellar targets than any planets bound to stars. For the first time, we systematically analyze the feasibility of exploring these unbounded objects via deep space missions. We investigate what near-future propulsion systems could allow us to reach nomadic worlds of radius $> R$ in a $50$-year flight timescale. Objects with $R \\sim 100$ km are within the purview of multiple propulsion methods such as electric sails, laser electric propulsion, and solar sails. In contrast, nomadic worlds with $R \\gtrsim 1000$ km are accessible by laser sails (and perhaps nuclear fusion), thereby underscoring their vast potential for deep space exploration.",
  "categories": [
    "astro-ph.EP",
    "astro-ph.GA",
    "physics.space-ph"
  ],
  "primary_category": "astro-ph.EP",
  "doi": "10.1016/j.actaastro.2023.07.030",
  "journal_ref": "Acta Astronautica, 212, 517-533 (2023)",
  "arxiv_id": "2307.12411",
  "pdf_url": null,
  "comment": "Published in Acta Astronautica; 21 pages; 3 figures; 1 table",
  "num_versions": null,
  "size_before_bytes": 1072876,
  "size_after_bytes": 803980
}