{
  "title": "DEMNUni: cross-correlating the nonlinear ISWRS effect with CMB-lensing and galaxies in the presence of massive neutrinos",
  "authors": [
    "Viviana Cuozzo",
    "Carmelita Carbone",
    "Matteo Calabrese",
    "Elisabetta Carella",
    "Marina Migliaccio"
  ],
  "submission_date": "2023-07-28T17:59:05+00:00",
  "revised_dates": [
    "2023-09-18T01:34:29+00:00",
    "2024-03-04T14:24:53+00:00"
  ],
  "abstract": "We present an analytical modelling of the angular cross-correlations between the Integrated Sachs Wolfe-Rees Sciama (ISWRS) effect and large-scale structure tracers in the presence of massive neutrinos. Our method has been validated against large N-body simulations with a massive neutrino particle component, namely the DEMNUni suite. We investigate the impact of different neutrino masses on the cross-correlations between the ISWRS effect and both the galaxy clustering and the lensing of the Cosmic Microwave Background (CMB). We also test the ability of current nonlinear matter power spectrum modellings to reproduce neutrino effects in such cross-correlations. We show that the multipole position of a characteristic sign inversion in the cross-spectra, due to nonlinear effects, is strongly related to the total neutrino mass $M_ν$ and depends almost linearly on it. While these nonlinear cross-correlation signals may not be able alone to constrain the neutrino mass, our approach paves the way to the detection of such cross-spectra on small scales for their exploitation in combination with main probes from future galaxy surveys and CMB experiments.",
  "categories": [
    "astro-ph.CO"
  ],
  "primary_category": "astro-ph.CO",
  "doi": "10.1088/1475-7516/2024/04/073",
  "journal_ref": "JCAP04(2024)073",
  "arxiv_id": "2307.15711",
  "pdf_url": "https://arxiv.org/pdf/2307.15711v3",
  "comment": "30 pages, 13 figures (new version of several figures), this version matches the accepted version in JCAP",
  "num_versions": null,
  "size_before_bytes": 21557415,
  "size_after_bytes": 766812
}