{
  "title": "Phenotype-preserving metric design for high-content image reconstruction by generative inpainting",
  "authors": [
    "Vaibhav Sharma",
    "Artur Yakimovich"
  ],
  "submission_date": "2023-07-26T18:13:16+00:00",
  "revised_dates": [
    "2023-08-02T00:26:34+00:00",
    "2023-08-23T00:33:20+00:00"
  ],
  "abstract": "In the past decades, automated high-content microscopy demonstrated its ability to deliver large quantities of image-based data powering the versatility of phenotypic drug screening and systems biology applications. However, as the sizes of image-based datasets grew, it became infeasible for humans to control, avoid and overcome the presence of imaging and sample preparation artefacts in the images. While novel techniques like machine learning and deep learning may address these shortcomings through generative image inpainting, when applied to sensitive research data this may come at the cost of undesired image manipulation. Undesired manipulation may be caused by phenomena such as neural hallucinations, to which some artificial neural networks are prone. To address this, here we evaluate the state-of-the-art inpainting methods for image restoration in a high-content fluorescence microscopy dataset of cultured cells with labelled nuclei. We show that architectures like DeepFill V2 and Edge Connect can faithfully restore microscopy images upon fine-tuning with relatively little data. Our results demonstrate that the area of the region to be restored is of higher importance than shape. Furthermore, to control for the quality of restoration, we propose a novel phenotype-preserving metric design strategy. In this strategy, the size and count of the restored biological phenotypes like cell nuclei are quantified to penalise undesirable manipulation. We argue that the design principles of our approach may also generalise to other applications.",
  "categories": [
    "eess.IV",
    "cs.CV",
    "q-bio.QM"
  ],
  "primary_category": "eess.IV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14436",
  "pdf_url": null,
  "comment": "8 pages, 3 figures, conference proceedings",
  "num_versions": null,
  "size_before_bytes": 14712419,
  "size_after_bytes": 223760
}