{
  "title": "The first evidence of tidally induced activity in a brown dwarf-M dwarf pair: A Chandra study of the NLTT 41135/41136 system",
  "authors": [
    "Nikoleta Ilić",
    "Katja Poppenhaeger",
    "Desmond Dsouza",
    "Scott J. Wolk",
    "Marcel A. Agüeros",
    "Beate Stelzer"
  ],
  "submission_date": "2023-07-26T09:08:13+00:00",
  "revised_dates": [],
  "abstract": "The magnetic activity of low-mass stars changes as they age. The primary process decreasing the stellar activity level is the angular momentum loss via magnetized stellar wind. However, processes like tidal interactions between stars and their close companions may slow down the braking effect and the subsequent decrease of the activity level. Until now, the tidal impact of substellar objects like brown dwarfs on the evolution of their central stars has not been quantified. Here, we analyse the X-ray properties of NLTT 41135, an M dwarf tightly orbited by a brown dwarf, to determine the impact of tidal interactions between them. We find that NLTT 41135 is more than an order of magnitude brighter in the X-ray regime than its stellar companion NLTT 41136, also an M dwarf star, with whom it forms a wide binary system. To characterize the typical intrinsic activity scatter between coeval M dwarf stars, we analyse a control sample of 25 M dwarf wide binary systems, observed with XMM-Newton and Chandra telescopes and the eROSITA instrument onboard the Spectrum Röntgen Gamma satellite. The activity difference in the NLTT 41135/41136 system is a $3.44 σ$ outlier compared to the intrinsic activity scatter of the control systems. Therefore, the most convincing explanation for the observed activity discrepancy is tidal interactions between the M dwarf and its brown dwarf. This shows that tidal interactions between a star and a substellar companion can moderately alter the expected angular-momentum evolution of the star, making standard observational proxies for its age, such as X-ray emission, unreliable.",
  "categories": [
    "astro-ph.SR",
    "astro-ph.EP",
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.SR",
  "doi": "10.1093/mnras/stad2277",
  "journal_ref": null,
  "arxiv_id": "2307.14056",
  "pdf_url": null,
  "comment": "accepted for publication in MNRAS, 15 pages, 5 figures",
  "num_versions": null,
  "size_before_bytes": 640908,
  "size_after_bytes": 283109
}