{
  "title": "Introducing and Interfacing with Cybersecurity -- A Cards Approach",
  "authors": [
    "Ryan Shah",
    "Manuel Maarek",
    "Shenando Stals",
    "Lynne Baillie",
    "Sheung Chi Chan",
    "Robert Stewart",
    "Hans-Wolfgang Loidl",
    "Olga Chatzifoti"
  ],
  "submission_date": "2023-07-31T10:01:42+00:00",
  "revised_dates": [],
  "abstract": "Cybersecurity is an important topic which is often viewed as one that is inaccessible due to steep learning curves and a perceived requirement of needing specialist knowledge. With a constantly changing threat landscape, practical solutions such as best-practices are employed, but the number of critical cybersecurity-related incidents remains high. To address these concerns, the National Cyber Security Centre published a Cybersecurity Body of Knowledge (CyBOK) to provide a comprehensive information base used to advise and underpin cybersecurity learning. Unfortunately, CyBOK contains over 1000 pages of in-depth material and may not be easy to navigate for novice individuals. Furthermore, it does not allow for easy expression of various cybersecurity scenarios that such individuals may be exposed to. As a solution to these two issues, we propose the use of a playing cards format to provide introductory cybersecurity knowledge that supports learning and discussion, using CyBOK as the foundation for the technical content. Upon evaluation in two user studies, we found that 80% of the participants agreed the cards provided them with introductory knowledge of cybersecurity topics, and 70% agreed the cards provided an interface for discussing topics and enabled them to make links between attacks, vulnerabilities and defences.",
  "categories": [
    "cs.CR",
    "cs.CY",
    "cs.HC"
  ],
  "primary_category": "cs.CR",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16535",
  "pdf_url": "https://arxiv.org/pdf/2307.16535v1",
  "comment": "22 pages (16 plus references and appendices), 5 figures, 1 table",
  "num_versions": null,
  "size_before_bytes": 40803601,
  "size_after_bytes": 7016226
}