{
  "title": "Damping of strong GHz waves near magnetars and the origin of fast radio bursts",
  "authors": [
    "Andrei M. Beloborodov"
  ],
  "submission_date": "2023-07-22T23:13:03+00:00",
  "revised_dates": [
    "2024-08-01T00:44:42+00:00"
  ],
  "abstract": "We investigate how a fast radio burst (FRB) emitted near a magnetar would propagate through its surrounding dipole magnetosphere at radii $r=10^7$-$10^9$ cm. First, we show that a GHz burst emitted in the O-mode with luminosity $L\\gg 10^{40}$ erg/s is immediately damped for all propagation directions except a narrow cone along the magnetic axis. Then we examine bursts in the X-mode. GHz waves propagating near the magnetic equator behave as magnetohydrodynamic (MHD) waves if they have $L\\gg 10^{40}$ erg/s. The waves develop plasma shocks in each oscillation and dissipate at $r\\sim 3 \\times 10^8 L_{42}^{-1/4}$ cm. Waves with lower $L$ or propagation directions closer to the magnetic axis do not obey MHD. Instead, they interact with individual particles and require a kinetic description. The kinetic interaction quickly accelerates particles to Lorentz factors $10^4$-$10^5$ at the expense of the wave energy, which again results in strong damping of the wave. In either propagation regime, MHD or kinetic, the dipole magnetosphere surrounding the FRB source acts as a pillow absorbing the radio burst and re-radiating the absorbed energy in X-rays. These results constrain the origin of observed FRBs. We argue that the observed FRBs avoid damping because they are emitted by relativistic outflows from magnetospheric explosions, so that the GHz waves do not need to propagate through the outer equilibrium magnetosphere surrounding the magnetar.",
  "categories": [
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.HE",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12182",
  "pdf_url": null,
  "comment": "31 pages, 11 figures, accepted to ApJ",
  "num_versions": null,
  "size_before_bytes": 2786854,
  "size_after_bytes": 303618
}