{
  "title": "The GMRT archive atomic gas survey -- II. Mass modelling and dark matter halo properties across late-type spirals",
  "authors": [
    "Prerana Biswas",
    "Veselina Kalinova",
    "Nirupam Roy",
    "Narendra Nath Patra",
    "Nadezda Tyulneva"
  ],
  "submission_date": "2023-07-25T18:00:15+00:00",
  "revised_dates": [],
  "abstract": "Studying the kinematics and mass modelling of galaxies from HI 21 cm data provides valuable insights into the properties of both the baryonic components and the dark matter halo in nearby galaxies. Despite many observational studies, mass modelling of galaxies remains challenging due to different limitations. For example, most of the previous studies involving mass modelling are based on rotation curves derived from two-dimensional velocity fields from HI or H$α$ spectroscopic observation which are often affected by beam smearing and projection effect. However, kinematic modelling done by fitting the \"Tilted ring model\" to three-dimensional data cube is not affected by these issues. In this study, we present and compare 3D kinematic modelling of a pilot sample of eleven galaxies from the GMRT archive atomic gas survey (GARCIA) using two different publicly available pipelines. We model the observed HI rotation curve using 3.6 $μ$m infrared data and SDSS r-band data for stellar contribution, HI surface density profile for gas, and Navarro-Frenk-White (NFW) profile for dark matter halo; and employ the Markov Chain Monte Carlo (MCMC) optimization method for parameter estimation. Further, to validate our analysis, we revisit important scaling relations, e.g., the M$_{gas}$-M$_{star}$ relation, M$_{star}$-M$_{halo}$ relation, M$_{gas}$-M$_{halo}$ relation and Baryonic Tully-Fisher relation (BTFR). The scaling relations from our analysis are broadly consistent with that reported in the literature. A larger sample of galaxies from GARCIA in the near future will allow studying these scaling relations in greater details.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.1093/mnras/stad2285",
  "journal_ref": null,
  "arxiv_id": "2307.13738",
  "pdf_url": null,
  "comment": "16 pages, (9+1) figures. (Accepted for publication in MNRAS)",
  "num_versions": null,
  "size_before_bytes": 1682480,
  "size_after_bytes": 407977
}