{
  "title": "Astrometry and Photometry for $\\approx$1000 L, T, and Y Dwarfs from the UKIRT Hemisphere Survey",
  "authors": [
    "Adam C. Schneider",
    "Jeffrey A. Munn",
    "Frederick J. Vrba",
    "Justice Bruursema",
    "Scott E. Dahm",
    "Stephen J. Williams",
    "Michael C. Liu",
    "Bryan N. Dorland"
  ],
  "submission_date": "2023-07-21T19:43:57+00:00",
  "revised_dates": [],
  "abstract": "We present positions, proper motions, and near-infrared photometry for 966 known objects with spectral types later than M observed as part of the the UKIRT Hemisphere Survey (UHS). We augment the photometry and astrometry from UHS with information from Gaia DR3, Pan-STARRS DR2, and CatWISE 2020 to produce a database of homogeneous photometry and astrometry for this sample. The multi-epoch survey strategy of UHS allows us to determine proper motions for most sources, with a median proper motion uncertainty of $\\sim$3.6 mas yr$^{-1}$. Our UHS proper motion measurements are generally in good agreement with those from Gaia DR3, Pan-STARRS, and CatWISE 2020, with UHS proper motions typically more precise than those from CatWISE 2020 and Pan-STARRS but not Gaia DR3. We critically analyze publicly available spectra for 406 members of this sample and provide updated near-infrared spectral types for $\\sim$100 objects. We determine typical colors as a function of spectral type and provide absolute magnitude vs. spectral type relations for UHS $J$- and $K$-band photometry. Using newly determined proper motions, we highlight several objects of interest, such as objects with large tangential velocities, widely separated co-moving companions, and potential members of young nearby associations.",
  "categories": [
    "astro-ph.SR",
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.SR",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11882",
  "pdf_url": null,
  "comment": "Accepted to AJ",
  "num_versions": null,
  "size_before_bytes": 919085,
  "size_after_bytes": 365288
}