{
  "title": "Impact of Satellite Trails on H.E.S.S. Astronomical Observations",
  "authors": [
    "Thomas Lang",
    "Samuel T. Spencer",
    "Alison M. W. Mitchell"
  ],
  "submission_date": "2023-07-25T07:17:21+00:00",
  "revised_dates": [
    "2023-09-22T00:17:37+00:00"
  ],
  "abstract": "The number of satellites launched into Earth's orbit has almost tripled in the last three years due to the increasing commercialisation of space. Multiple satellite constellations, consisting of over 400,000 individual satellites, have either been partially launched or are proposed for launch in the near future. Many of these satellites are highly reflective, resulting in a high optical brightness that affects ground-based astronomical observations. Despite this caveat, the potential effect of these satellites on gamma-ray-observing Imaging Atmospheric Cherenkov Telescopes (IACTs) has largely been assumed to be negligible due to their nanosecond-scale integration times. However, this assumption has not been verified to date. As IACTs are sensitive to optical wavelength light, we aim to identify satellite trails in data taken by the High Energy Stereoscopic System (H.E.S.S.) IACT array. In particular, this study is aimed at quantifying the potential effects on data quality and extensive air shower event classification and reconstruction. Using night sky background measurements from H.E.S.S., we determined which observation times and pointing directions are affected most by these satellite trails. We then evaluated their impact on the standard Hillas parameter variables used for event analysis. Due to the brightest trails, false trigger events can occur, however, for most modern analyses, the effect on astronomical results will be minimal. We observe a mild increase in the rate of trail detections over time, which is partially correlated with the number of satellite launches. Overall, the fraction of H.E.S.S. data affected is currently minimal. We note that these trails could still have a non-negligible effect on future Cherenkov Telescope Array observations if advanced analysis techniques designed to lower the energy threshold of the instrument are applied.",
  "categories": [
    "astro-ph.IM",
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.IM",
  "doi": "10.1051/0004-6361/202347200",
  "journal_ref": "A&A 677, A141 (2023)",
  "arxiv_id": "2307.13293",
  "pdf_url": null,
  "comment": "11 pages, 14 figures, 5 tables. Replaced with published version. Reproduced with permission from Astronomy & Astrophysics, $©$ ESO",
  "num_versions": null,
  "size_before_bytes": 15547643,
  "size_after_bytes": 370977
}