{
  "title": "On Solving the Rubik's Cube with Domain-Independent Planners Using Standard Representations",
  "authors": [
    "Bharath Muppasani",
    "Vishal Pallagani",
    "Biplav Srivastava",
    "Forest Agostinelli"
  ],
  "submission_date": "2023-07-25T14:52:23+00:00",
  "revised_dates": [
    "2023-08-22T00:46:18+00:00"
  ],
  "abstract": "Rubik's Cube (RC) is a well-known and computationally challenging puzzle that has motivated AI researchers to explore efficient alternative representations and problem-solving methods. The ideal situation for planning here is that a problem be solved optimally and efficiently represented in a standard notation using a general-purpose solver and heuristics. The fastest solver today for RC is DeepCubeA with a custom representation, and another approach is with Scorpion planner with State-Action-Space+ (SAS+) representation. In this paper, we present the first RC representation in the popular PDDL language so that the domain becomes more accessible to PDDL planners, competitions, and knowledge engineering tools, and is more human-readable. We then bridge across existing approaches and compare performance. We find that in one comparable experiment, DeepCubeA (trained with 12 RC actions) solves all problems with varying complexities, albeit only 78.5% are optimal plans. For the same problem set, Scorpion with SAS+ representation and pattern database heuristics solves 61.50% problems optimally, while FastDownward with PDDL representation and FF heuristic solves 56.50% problems, out of which 79.64% of the plans generated were optimal. Our study provides valuable insights into the trade-offs between representational choice and plan optimality that can help researchers design future strategies for challenging domains combining general-purpose solving methods (planning, reinforcement learning), heuristics, and representations (standard or custom).",
  "categories": [
    "cs.AI"
  ],
  "primary_category": "cs.AI",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13552",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 17698291,
  "size_after_bytes": 324052
}