{
  "title": "Triaxial projected shell model approach for negative parity states in even-even nuclei",
  "authors": [
    "Nazira Nazir",
    "S. Jehangir",
    "S. P. Rouoof",
    "G. H. Bhat",
    "J. A. Sheikh",
    "N. Rather",
    "Manzoor A. Malik"
  ],
  "submission_date": "2023-07-27T13:03:32+00:00",
  "revised_dates": [
    "2023-07-31T17:21:31+00:00",
    "2023-09-04T14:43:44+00:00"
  ],
  "abstract": "The triaxial projected shell model (TPSM) approach is generalized to investigate the negative parity band structures in even-even systems. In the earlier version of the TPSM approach, the quasiparticle excitations were restricted to one major oscillator shell and it was possible to study only positive parity states in even-even systems. In the present extension, the excited quasiparticles are allowed to occupy two major oscillator shells, which makes it possible to generate the negative parity states. As a major application of this development, the extended approach is applied to elucidate the negative parity high-spin band structures in $^{102-112}$Ru and it is shown that energies obtained with neutron excitation are slightly lower than the energies calculated with proton excitation. However, the calculated aligned angular momentum ($i_x$) clearly separates the two spectra with neutron $i_x$ in reasonable agreement with the empirically evaluated $i_x$ from the experimental data, whereas proton $i_x$ shows large deviations. Furthermore, we have also deduced the transition quadrupole moments from the TPSM wavefunctions along the negative-parity yrast- and yrare- bands and it is shown that these quantities exhibit rapid changes in the bandcrossing region.",
  "categories": [
    "nucl-th",
    "nucl-ex"
  ],
  "primary_category": "nucl-th",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14827",
  "pdf_url": "https://arxiv.org/pdf/2307.14827v3",
  "comment": "14 pages, 17 figures",
  "num_versions": null,
  "size_before_bytes": 1566245,
  "size_after_bytes": 656582
}