{
  "title": "Long-period radial velocity variations of nine M red giants: The detection of sub-stellar companions around HD 6860 and HD 112300",
  "authors": [
    "Byeong-Cheol Lee",
    "Hee-Jin Do",
    "Myeong-Gu Park",
    "Beomdu Lim",
    "Yeon-Ho Choi",
    "Jae-Rim Koo",
    "Tae-Yang Bang",
    "Hyeong-Ill Oh",
    "Inwoo Han",
    "Heon-Young Chang"
  ],
  "submission_date": "2023-07-29T05:53:33+00:00",
  "revised_dates": [],
  "abstract": "Context. Certain periodic variations of radial velocities (RV) of wobbling giants originate from exoplanets. Indeed, a number of exoplanets have been discovered around giant stars.\n  Aims. The purpose of our study is to find low-amplitude and long-period RV variations around bright M (super) giants in the RGB (or AGB) stage, which are long-period variables (LPVs) or high-proper-motion (HPM) stars.\n  Methods. High-resolution, fiber-fed Bohyunsan Observatory Echelle Spectrograph (BOES) at the Bohyunsan Optical Astronomy Observatory (BOAO) was used to record numerous spectra of nine giants. The observation period for the targets spans 16 years, from 2005 to 2022.\n  Results. We found from the precise RV observations of nine M giants two sub-stellar companions, one with a 28.26$^{+2.05}_{-2.17}$ $M_{J}$ orbiting period of 663.87$^{+4.61}_{-4.31}$ days at a distance of 2.03$^{+0.01}_{-0.01}$ AU (HD 6860) and the other, with a 15.83$^{+2.33}_{-2.74}$ $M_{J}$ orbiting period of 466.63 $^{+1.47}_{-1.28}$ days at a distance of 1.33 $^{+0.08}_{-0.11}$ AU (HD 112300). Our estimate of the stellar parameters for HD 6860 makes it currently the largest star with a sub-stellar companion. We also found RV variations mimicking a planetary companion in HD 18884 and confirmed LPVs in two stars, HD 39801 and HD 42995. The RV variations of some stars seem to be associated with stellar activities rather than reflex orbital motion due to their companions. Such variations are also detected even for HD 6860 and HD 112300, hosting sub-stellar companions.",
  "categories": [
    "astro-ph.SR",
    "astro-ph.EP"
  ],
  "primary_category": "astro-ph.SR",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15897",
  "pdf_url": "https://arxiv.org/pdf/2307.15897v1",
  "comment": "19 pages, 15 figures, Accepted for publication in A&A",
  "num_versions": null,
  "size_before_bytes": 5840177,
  "size_after_bytes": 1426197
}