{
  "title": "Computational design of new superconducting materials and their targeted experimental synthesis",
  "authors": [
    "Dmitrii Semenok"
  ],
  "submission_date": "2023-07-25T08:11:58+00:00",
  "revised_dates": [],
  "abstract": "In the last six years (2015-2021), many superconducting hydrides with critical temperatures $\\textit{T}$$_C$ of up to 253 K, a record for today, have been discovered. Now, a special field of hydride superconductivity at ultrahigh pressures has developed. For the most part, the properties of superhydrides are well described by the Migdal-Eliashberg theory of strong electron-phonon interaction, especially when anharmonicity of phonons is taken into account. The isotope effect, the effect of the magnetic field (up to 60-70 T) on the critical temperature and critical current in the hydride samples, the dependence of $\\textit{T}$$_C$ on the pressure and degree of doping - all data indicate that polyhydrides are conventional superconductors, the theory of which was created by Bardeen, Cooper, and Schrieffer in 1957.\n  This work presents a retrospective analysis of data for 2015-2021 and describes the main directions for future research in the field of hydride superconductivity. The thesis consists of six chapters devoted to the study of the structure and superconductivity of binary and ternary superhydrides of thorium (ThH$_9$ and ThH$_{10}$), yttrium (YH$_6$ and YH$_9$), europium and other lanthanides (Ce, Pr, Nd), and lanthanum-yttrium (La-Y). This work describes the physical properties of cubic decahydrides, hexahydrides, and hexagonal metal nonahydrides, demonstrates high efficiency of evolutionary algorithms and density functional methods in predicting the formation of polyhydrides under high-pressure and high-temperature conditions. We proposed a theoretical-experimental algorithm for analyzing the superconducting properties of hydrides, which makes it possible to systematize the accumulated experimental data. In general, this research is a vivid example of the effectiveness and synergy of modern methods for studying the condensed state of matter under high pressures.",
  "categories": [
    "cond-mat.supr-con",
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.supr-con",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13313",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}