{
  "title": "An overlapping domain decomposition method for the solution of parametric elliptic problems via proper generalized decomposition",
  "authors": [
    "Marco Discacciati",
    "Ben J. Evans",
    "Matteo Giacomini"
  ],
  "submission_date": "2023-07-30T22:47:06+00:00",
  "revised_dates": [
    "2023-09-26T10:03:26+00:00"
  ],
  "abstract": "A non-intrusive proper generalized decomposition (PGD) strategy, coupled with an overlapping domain decomposition (DD) method, is proposed to efficiently construct surrogate models of parametric linear elliptic problems. A parametric multi-domain formulation is presented, with local subproblems featuring arbitrary Dirichlet interface conditions represented through the traces of the finite element functions used for spatial discretization at the subdomain level, with no need for additional auxiliary basis functions. The linearity of the operator is exploited to devise low-dimensional problems with only few active boundary parameters. An overlapping Schwarz method is used to glue the local surrogate models, solving a linear system for the nodal values of the parametric solution at the interfaces, without introducing Lagrange multipliers to enforce the continuity in the overlapping region. The proposed DD-PGD methodology relies on a fully algebraic formulation allowing for real-time computation based on the efficient interpolation of the local surrogate models in the parametric space, with no additional problems to be solved during the execution of the Schwarz algorithm. Numerical results for parametric diffusion and convection-diffusion problems are presented to showcase the accuracy of the DD-PGD approach, its robustness in different regimes and its superior performance with respect to standard high-fidelity DD methods.",
  "categories": [
    "math.NA"
  ],
  "primary_category": "math.NA",
  "doi": "10.1016/j.cma.2023.116484",
  "journal_ref": "Computer Methods in Applied Mechanics and Engineering, 418, 116484 (2024)",
  "arxiv_id": "2307.16334",
  "pdf_url": "https://arxiv.org/pdf/2307.16334v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 7686448,
  "size_after_bytes": 276788
}