{
  "title": "An Experimental Study of Noise Reduction in Wind Turbine Airfoils with Serrated Trailing Edges",
  "authors": [
    "Weicheng Xue",
    "Shaohong Jia",
    "Hongyu Wang",
    "Zhe Chen",
    "Bing Yang"
  ],
  "submission_date": "2023-07-23T00:21:31+00:00",
  "revised_dates": [
    "2024-09-25T00:22:47+00:00",
    "2025-02-11T01:53:09+00:00"
  ],
  "abstract": "This study explores the noise reduction achieved by airfoils with serrated trailing edges in a low turbulence wind tunnel, focusing on acoustic spectral characteristics and wake flow field measurements. We analyze the effects of various factors, including Reynolds number, angle of attack, serration parameters, and model type, on sound power levels and far-field radiation patterns. Our findings reveal that serrated trailing edges significantly reduce blunt vortex shedding noise and laminar separation bubble noise across a broader frequency range, particularly in the mid-to-high frequency range, with reductions delineated by two boundaries. Interestingly, the serration geometry exhibits minimal impact on noise reduction, which varies with the angle of attack and airfoil profile across all tested conditions. Additionally, while serrations effectively lower noise levels, especially at higher frequencies, they do not significantly alter the airfoil's acoustic directivity patterns. Measurements of wake flow velocity spectra demonstrate a clear correlation between reduced wake turbulence and noise reduction, as serrated edges decrease the power spectral density of turbulent velocity fluctuations, effectively disrupting larger vortex structures responsible for noise generation. These valuable insights contribute to understanding the acoustic benefits of serrated trailing edges.",
  "categories": [
    "physics.flu-dyn"
  ],
  "primary_category": "physics.flu-dyn",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12188",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 67280300,
  "size_after_bytes": 698481
}