{
  "title": "Agent-Based Model: Simulating a Virus Expansion Based on the Acceptance of Containment Measures",
  "authors": [
    "Alejandro Rodríguez-Arias",
    "Amparo Alonso-Betanzos",
    "Bertha Guijarro-Berdiñas",
    "Noelia Sánchez-Marroño"
  ],
  "submission_date": "2023-07-28T08:01:05+00:00",
  "revised_dates": [],
  "abstract": "Compartmental epidemiological models categorize individuals based on their disease status, such as the SEIRD model (Susceptible-Exposed-Infected-Recovered-Dead). These models determine the parameters that influence the magnitude of an outbreak, such as contagion and recovery rates. However, they don't account for individual characteristics or population actions, which are crucial for assessing mitigation strategies like mask usage in COVID-19 or condom distribution in HIV. Additionally, studies highlight the role of citizen solidarity, interpersonal trust, and government credibility in explaining differences in contagion rates between countries. Agent-Based Modeling (ABM) offers a valuable approach to study complex systems by simulating individual components, their actions, and interactions within an environment. ABM provides a useful tool for analyzing social phenomena. In this study, we propose an ABM architecture that combines an adapted SEIRD model with a decision-making model for citizens. In this paper, we propose an ABM architecture that allows us to analyze the evolution of virus infections in a society based on two components: 1) an adaptation of the SEIRD model and 2) a decision-making model for citizens. In this way, the evolution of infections is affected, in addition to the spread of the virus itself, by individual behavior when accepting or rejecting public health measures. We illustrate the designed model by examining the progression of SARS-CoV-2 infections in A Coruña, Spain. This approach makes it possible to analyze the effect of the individual actions of citizens during an epidemic on the spread of the virus.",
  "categories": [
    "cs.AI",
    "physics.soc-ph"
  ],
  "primary_category": "cs.AI",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15723",
  "pdf_url": "https://arxiv.org/pdf/2307.15723v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 3492822,
  "size_after_bytes": 339794
}