{
  "title": "A systematic study of the connection between white dwarf period spectra and model structure",
  "authors": [
    "Agnes Bischoff-Kim"
  ],
  "submission_date": "2023-07-25T19:58:14+00:00",
  "revised_dates": [],
  "abstract": "To date, pulsational variability has been measured from nearly 70 DBVs and 500 DAVs, with only a fraction of these having been the subjects of asteroseismic analysis. One way to approach white dwarf asteroseismology is forward modeling, where one assumes an interior structure and calculates the model's periods. Many such models are calculated, in the search for the one that best matches an observed period spectrum. It is not computationaly manageable, nor necessary, to vary every possible parameter for every object. We engage in a systematic study, based on a sample of 14 hydrogen atmosphere white dwarfs, chosen to be representative of the types of pulsation spectra we encounter in white dwarf asteroseismology. These white dwarfs are modeled with carbon and oxygen cores . Our goal is to draw a connection between the period spectra and what parameters they are most sensitive to. We find that the presence of longer period modes generally muddies the mass and effective temperature determinations, unless continuous sequences of l = 1 and l = 2 modes are present. All period spectra are sensitive to structure in the helium and hydrogen envelope and most to at least some fatures of the oxygen abundance profile. Such sensitivity can be achieved either by the presence of specific low radial overtone modes, or by the presence of longer period modes. Convective efficiency only matters when fitting periods greater than 800 s. The results of this study can be used to inform parameter selection and pave the way to pipeline asteroseismic fitting of white dwarfs.",
  "categories": [
    "astro-ph.SR"
  ],
  "primary_category": "astro-ph.SR",
  "doi": "10.3847/1538-4357/acdeee",
  "journal_ref": null,
  "arxiv_id": "2307.13796",
  "pdf_url": null,
  "comment": "17 pages, 9 figures. In press at the ApJ",
  "num_versions": null,
  "size_before_bytes": 3892066,
  "size_after_bytes": 315442
}