{
  "title": "Persistent homology analysis of type 2 diabetes genome-wide association studies in protein-protein interaction networks",
  "authors": [
    "Euijun Song"
  ],
  "submission_date": "2023-07-31T11:17:30+00:00",
  "revised_dates": [
    "2023-09-01T16:00:30+00:00"
  ],
  "abstract": "Genome-wide association studies (GWAS) involving increasing sample sizes have identified hundreds of genetic variants associated with complex diseases, such as type 2 diabetes (T2D); however, it is unclear how GWAS hits form unique topological structures in protein-protein interaction (PPI) networks. Using persistent homology, this study explores the evolution and persistence of the topological features of T2D GWAS hits in the PPI network with increasing P-value thresholds. We define an $n$-dimensional persistent disease module as a higher-order generalization of the largest connected component (LCC). The 0-dimensional persistent T2D disease module is the LCC of the T2D GWAS hits, which is significantly detected in the PPI network (196 nodes and 235 edges, P$<$0.05). In the 1-dimensional homology group analysis, all 18 1-dimensional holes (loops) of the T2D GWAS hits persist over all P-value thresholds. The 1-dimensional persistent T2D disease module comprising these 18 persistent 1-dimensional holes is significantly larger than that expected by chance (59 nodes and 83 edges, P$<$0.001), indicating a significant topological structure in the PPI network. Our computational topology framework potentially possesses broad applicability to other complex phenotypes in identifying topological features that play an important role in disease pathobiology.",
  "categories": [
    "q-bio.MN",
    "math.AT"
  ],
  "primary_category": "q-bio.MN",
  "doi": "10.3389/fgene.2023.1270185",
  "journal_ref": "Frontiers in Genetics (2023) 14:1270185",
  "arxiv_id": "2307.16575",
  "pdf_url": "https://arxiv.org/pdf/2307.16575v2",
  "comment": "13 pages, 4 figures, manuscript revised",
  "num_versions": null,
  "size_before_bytes": 3485746,
  "size_after_bytes": 69367
}