{
  "title": "Exploring the equilibrium and dynamic phase transition properties of Ising ferromagnet on a decorated triangular lattice",
  "authors": [
    "Yusuf Yüksel"
  ],
  "submission_date": "2023-07-24T10:47:00+00:00",
  "revised_dates": [],
  "abstract": "We study the equilibrium and dynamic phase transition properties of two-dimensional Ising model on a decorated triangular lattice under the influence of a time-dependent magnetic field composed of a periodic square wave part plus a time independent bias term. Using Monte Carlo simulations with standard Metropolis algorithm, we determine the equilibrium critical behavior in zero field. At a fixed temperature corresponding to the multidroplet regime, we locate the relaxation time and the dynamic critical half-period at which a dynamic phase transition takes place between ferromagnetic and paramagnetic states. Benefiting from finite-size scaling theory, we estimate the dynamic critical exponent ratios for the dynamic order parameter and its scaled variance, respectively. The response function of the average energy is found to follow a logarithmic scaling as a function of lattice size. At the critical half-period and in the vicinity of small bias field regime, average of the dynamic order parameter obeys a scaling relation with a dynamic scaling exponent which is very close to the equilibrium critical isotherm value. Finally, in the slow critical dynamics regime, investigation of metamagnetic fluctuations in the presence of bias field revels a symmetric double-peak behavior for the scaled variance contours of dynamic order parameter and average energy. Our results strongly resemble those previously reported for kinetic Ising models.",
  "categories": [
    "cond-mat.stat-mech"
  ],
  "primary_category": "cond-mat.stat-mech",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12684",
  "pdf_url": null,
  "comment": "9 pages, 10 figures",
  "num_versions": null,
  "size_before_bytes": 3207241,
  "size_after_bytes": 75953
}