{
  "title": "Differential Evolution Algorithm based Hyper-Parameters Selection of Transformer Neural Network Model for Load Forecasting",
  "authors": [
    "Anuvab Sen",
    "Arul Rhik Mazumder",
    "Udayon Sen"
  ],
  "submission_date": "2023-07-28T04:29:53+00:00",
  "revised_dates": [
    "2023-08-04T05:33:56+00:00",
    "2023-09-21T16:04:00+00:00",
    "2023-09-22T15:27:21+00:00",
    "2024-02-05T03:20:06+00:00"
  ],
  "abstract": "Accurate load forecasting plays a vital role in numerous sectors, but accurately capturing the complex dynamics of dynamic power systems remains a challenge for traditional statistical models. For these reasons, time-series models (ARIMA) and deep-learning models (ANN, LSTM, GRU, etc.) are commonly deployed and often experience higher success. In this paper, we analyze the efficacy of the recently developed Transformer-based Neural Network model in Load forecasting. Transformer models have the potential to improve Load forecasting because of their ability to learn long-range dependencies derived from their Attention Mechanism. We apply several metaheuristics namely Differential Evolution to find the optimal hyperparameters of the Transformer-based Neural Network to produce accurate forecasts. Differential Evolution provides scalable, robust, global solutions to non-differentiable, multi-objective, or constrained optimization problems. Our work compares the proposed Transformer based Neural Network model integrated with different metaheuristic algorithms by their performance in Load forecasting based on numerical metrics such as Mean Squared Error (MSE) and Mean Absolute Percentage Error (MAPE). Our findings demonstrate the potential of metaheuristic-enhanced Transformer-based Neural Network models in Load forecasting accuracy and provide optimal hyperparameters for each model.",
  "categories": [
    "cs.NE",
    "cs.LG"
  ],
  "primary_category": "cs.NE",
  "doi": null,
  "journal_ref": "14th IEEE International Symposium Series on Computational Intelligence (SSCI 2023)",
  "arxiv_id": "2307.15299",
  "pdf_url": "https://arxiv.org/pdf/2307.15299v5",
  "comment": "6 Pages, 6 Figures, 2 Tables, Accepted by the 14th IEEE International Symposium Series on Computational Intelligence (SSCI 2023), December 5-8, 2023, Mexico City, Mexico",
  "num_versions": null,
  "size_before_bytes": 8302211,
  "size_after_bytes": 1558175
}