{
  "title": "Spacetime-symmetry breaking effects in gravitational-wave generation at the first post-Newtonian order",
  "authors": [
    "Nils A. Nilsson",
    "Christophe Le-Poncin Lafitte"
  ],
  "submission_date": "2023-07-25T07:34:20+00:00",
  "revised_dates": [
    "2023-12-08T01:24:11+00:00"
  ],
  "abstract": "Current searches for signals of departures from the fundamental symmetries of General Relativity using gravitational waves are largely dominated by propagation effects like dispersion and birefringence from highly dynamic sources such as coalescing binary-black holes and neutron stars. In this paper we take steps towards probing the nature of spacetime symmetries in the {\\it generation-stage} of gravitational waves; by using a generic effective-field theory, we solve the modified Einstein equations order-by-order (in the coefficients for the symmetry breaking) for a generic source, and we write down the the first Post-Newtonian corrections, which includes contributions from the spacetime-symmetry breaking terms. Choosing as the source a system of point particles allows us to write down a simple toy solution explicitly, and we see that in contrast to General Relativity, the monopolar and dipolar contributions are non-vanishing. We comment on the detectability of such signals by the Laser Interferometer Space Antenna (LISA) space mission, which has high signal-to-noise galactic binaries (which can be modelled as point particles) well inside its predicted sensitivity band, sources which are inaccessible for current ground-based detectors, and we also discuss the possibility of going beyond the quadrupole formula and the first Post-Newtonian order, which would reveal effects which could be probed by ground-based detectors observing coalescence events.",
  "categories": [
    "gr-qc",
    "hep-th"
  ],
  "primary_category": "gr-qc",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13302",
  "pdf_url": null,
  "comment": "14 pages, 3 figures, accepted for publication in Physical Review D",
  "num_versions": null,
  "size_before_bytes": 283037,
  "size_after_bytes": 277624
}