{
  "title": "Flavor composition of neutrinos from choked gamma-ray bursts",
  "authors": [
    "Matias M. Reynoso",
    "Florencia A. Deus"
  ],
  "submission_date": "2023-07-29T22:37:44+00:00",
  "revised_dates": [
    "2023-10-07T10:28:00+00:00"
  ],
  "abstract": "Choked gamma-ray bursts (CGRBs) are possible neutrino sources that have been proposed as capable of generating the flux detected by IceCube, since no accompanying gamma-ray signal is expected, as required by observations. We focus on obtaining the neutrino flux and flavor composition corresponding to CGRBs under different assumptions for the target photon density and the magnetic field of the emission region. We consider the injection of both electrons and protons into the internal shocks of CGRBs, and using a steady-state transport equation, we account for all the relevant cooling processes. In particular, we include the usually adopted background of soft photons, which is the thermalized emission originated at the shocked jet head. Additionally, we consider the synchrotron photons emitted by the electrons co-accelerated with the protons at the internal shocks in the jet. We also obtain the distributions of pions, kaons, and muons using the transport equation to account for the cooling effects due not only to synchrotron emission but also interactions with the soft photons in the ambient. We integrate the total diffuse flux of neutrinos of different flavors and compute the flavor ratios to be observed on Earth. As a consequence of the losses suffered mainly by pions and muons, we find these ratios to depend on the energy: for energies above ~(10^5-10^6) GeV (depending on the magnetic field, proton-to-electron ratio, and jet power), we find that the electron flavor ratio decreases and the muon flavor ratio increases, while the tau flavor ratio increases only moderately. Our results are sensitive to the mentioned key physical parameters of the emitting region of CGRBs. Hence, the obtained flavor ratios are to be contrasted with cumulative data from ongoing and future neutrino instruments in order to assess the contribution of these sources to the diffuse flux of astrophysical neutrinos.",
  "categories": [
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.HE",
  "doi": "10.1051/0004-6361/202345958",
  "journal_ref": "A&A 677, A53 (2023)",
  "arxiv_id": "2307.16088",
  "pdf_url": "https://arxiv.org/pdf/2307.16088v2",
  "comment": "Final version. Typos corrected and Figs. 17 and 18 replaced by the correct versions",
  "num_versions": null,
  "size_before_bytes": 3023072,
  "size_after_bytes": 281911
}