{
  "title": "Semi-Grant-Free Orthogonal Multiple Access with Partial-Information for Short Packet Transmissions",
  "authors": [
    "Alberto Rech",
    "Stefano Tomasin",
    "Lorenzo Vangelista",
    "Cristina Costa"
  ],
  "submission_date": "2023-07-27T13:24:41+00:00",
  "revised_dates": [],
  "abstract": "Next-generation internet-of-things (IoT) networks require extremely low latency, complexity, and collision probability. We introduce the novel partial-information multiple access (PIMA) scheme, a semi-grant-free (GF) coordinated random access (RA) protocol for short packet transmission, with the aim of reducing the latency and packet loss of traditional multiple access schemes, as well as more recent preamble-based schemes. With PIMA, the base station (BS) acquires partial information on instantaneous traffic conditions in the partial information acquisition (PIA) sub-frame, estimating the number of active devices, i.e., having packets waiting for transmission in their queue. Based on this estimate, the BS chooses both the total number of slots to be allocated in the data transmission (DT) sub-frame and the respective user-to-slot assignment. Although collisions may still occur due to multiple users assigned to the same slot, they are drastically reduced with respect to the slotted ALOHA (SALOHA) scheme, while achieving lower latency than both time-division multiple-access (TDMA) and preamble-based protocols, due to the extremely reduced overhead of the PIA sub-frame. Finally, we analyze and assess the performance of PIMA under various activation statistics, proving the robustness of the proposed solution to the intensity of traffic, also with burst traffic.",
  "categories": [
    "cs.IT",
    "cs.NI",
    "eess.SP"
  ],
  "primary_category": "cs.IT",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14846",
  "pdf_url": "https://arxiv.org/pdf/2307.14846v1",
  "comment": "Journal paper, 11 pages, 8 figures. arXiv admin note: text overlap with arXiv:2304.12057",
  "num_versions": null,
  "size_before_bytes": 165063,
  "size_after_bytes": 110652
}