{
  "title": "Nonabelian partial difference sets constructed using abelian techniques",
  "authors": [
    "James Davis",
    "John Polhill",
    "Ken Smith",
    "Eric Swartz"
  ],
  "submission_date": "2023-07-28T16:12:40+00:00",
  "revised_dates": [],
  "abstract": "A $(v,k,λ, μ)$-partial difference set (PDS) is a subset $D$ of a group $G$ such that $|G| = v$, $|D| = k$, and every nonidentity element $x$ of $G$ can be written in either $λ$ or $μ$ different ways as a product $gh^{-1}$, depending on whether or not $x$ is in $D$. Assuming the identity is not in $D$ and $D$ is inverse-closed, the corresponding Cayley graph ${\\rm Cay}(G,D)$ will be strongly regular. Partial difference sets have been the subject of significant study, especially in abelian groups, but relatively little is known about PDSs in nonabelian groups. While many techniques useful for abelian groups fail to translate to a nonabelian setting, the purpose of this paper is to show that examples and constructions using abelian groups can be modified to generate several examples in nonabelian groups. In particular, in this paper we use such techniques to construct the first known examples of PDSs in nonabelian groups of order $q^{2m}$, where $q$ is a power of an odd prime $p$ and $m \\ge 2$. The groups constructed can have exponent as small as $p$ or as large as $p^r$ in a group of order $p^{2r}$. Furthermore, we construct what we believe are the first known Paley-type PDSs in nonabelian groups and what we believe are the first examples of Paley-Hadamard difference sets in nonabelian groups, and, using analogues of product theorems for abelian groups, we obtain several examples of each. We conclude the paper with several possible future research directions.",
  "categories": [
    "math.CO",
    "math.GR"
  ],
  "primary_category": "math.CO",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15648",
  "pdf_url": "https://arxiv.org/pdf/2307.15648v1",
  "comment": "26 pages",
  "num_versions": null,
  "size_before_bytes": 87380,
  "size_after_bytes": 88572
}