{
  "title": "Quick Updates for the Perturbed Static Output Feedback Control Problem in Linear Systems",
  "authors": [
    "MirSaleh Bahavarnia",
    "Ahmad F. Taha"
  ],
  "submission_date": "2023-07-30T09:16:20+00:00",
  "revised_dates": [
    "2024-05-15T16:50:37+00:00",
    "2024-07-19T00:51:27+00:00",
    "2025-04-25T16:59:56+00:00"
  ],
  "abstract": "This paper introduces a method for efficiently updating a nominal stabilizing static output feedback (SOF) controller in perturbed linear systems. As operating points and state-space matrices change in dynamic systems, accommodating updates to the SOF controller are necessary. Traditional methods address such changes by re-solving for the updated SOF gain, which is often \\textit{(i)} computationally expensive due to the NP-hard nature of the problem or \\textit{(ii)} infeasible due the limitations of its semidefinite programming relaxations. To overcome this, we leverage the concept of \\textit{minimum destabilizing real perturbation} to formulate a norm minimization problem that yields fast, reliable controller updates. This approach accommodates a variety of known perturbations, including abrupt changes, model inaccuracies, and equilibrium-dependent linearizations. We also introduce geometric metrics to quantify the proximity to instability and rigorously define stability-guaranteed regions. Extensive numerical simulations validate the efficiency and robustness of the proposed method. We demonstrate the results on the SOF control of mutlti-machine power networks with changing operating points, and demonstrate that the computed quick updates produce comparable solutions to the SOF ones, while requiring orders of magnitude less time.",
  "categories": [
    "eess.SY",
    "math.OC"
  ],
  "primary_category": "eess.SY",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16178",
  "pdf_url": "https://arxiv.org/pdf/2307.16178v4",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 29946124,
  "size_after_bytes": 2727939
}