{
  "title": "Compressed gate characterization for quantum devices with time-correlated noise",
  "authors": [
    "M. J. Gullans",
    "M. Caranti",
    "A. R. Mills",
    "J. R. Petta"
  ],
  "submission_date": "2023-07-26T18:05:49+00:00",
  "revised_dates": [
    "2024-01-22T01:16:36+00:00"
  ],
  "abstract": "As quantum devices make steady progress towards intermediate scale and fault-tolerant quantum computing, it is essential to develop rigorous and efficient measurement protocols that account for known sources of noise. Most existing quantum characterization protocols such as gate set tomography and randomized benchmarking assume the noise acting on the qubits is Markovian. However, this assumption is often not valid, as for the case of 1/f charge noise or hyperfine nuclear spin noise. Here, we present a general framework for quantum process tomography (QPT) in the presence of time-correlated noise. We further introduce fidelity benchmarks that quantify the relative strength of different sources of Markovian and non-Markovian noise. As an application of our method, we perform a comparative theoretical and experimental analysis of silicon spin qubits. We first develop a detailed noise model that accounts for the dominant sources of noise and validate the model against experimental data. Applying our framework for time-correlated QPT, we find that the number of independent parameters needed to characterize one and two-qubit gates can be compressed by 10x and 100x, respectively, when compared to the fully generic case. These compressions reduce the amount of tomographic measurements needed in experiment, while also significantly speeding up numerical simulations of noisy quantum circuit dynamics compared to time-dependent Hamiltonian simulation. Using this compressed noise model, we find good agreement between our theoretically predicted process fidelities and two qubit interleaved randomized benchmarking fidelities of 99.8% measured in recent experiments on silicon spin qubits. More broadly, our formalism can be directly extended to develop efficient and scalable tuning protocols for high-fidelity control of large-arrays of quantum devices with non-Markovian noise.",
  "categories": [
    "quant-ph",
    "cond-mat.mes-hall"
  ],
  "primary_category": "quant-ph",
  "doi": "10.1103/PRXQuantum.5.010306",
  "journal_ref": "PRX Quantum 5, 010306 (2024)",
  "arxiv_id": "2307.14432",
  "pdf_url": null,
  "comment": "11 pages, 3 figures, comments welcome",
  "num_versions": null,
  "size_before_bytes": 5599215,
  "size_after_bytes": 248313
}