{
  "title": "Programmable spectral shaping to improve the measurement precision of frequency comb mode-resolved spectral interferometric ranging",
  "authors": [
    "Yoon-Soo Jang",
    "Sunghoon Eom",
    "Jungjae Park",
    "Jonghan Jin"
  ],
  "submission_date": "2023-07-28T04:37:44+00:00",
  "revised_dates": [],
  "abstract": "Comb-mode resolved spectral domain interferometry (CORE-SDI), which is capable of measuring length of kilometers or more with precision on the order of nanometers, is considered to be a promising technology for next-generation length standards, replacing laser displacement interferometers. In this study, we aim to improve the measurement precision of CORE-SDI using programmable spectral shaping. We report the generation of effectively broad and symmetric light sources through the programmable spectral shaping. The light source used here was generated by the spectrally-broadened electro-optic comb with a repetition rate of 17.5 GHz. Through the programmable spectral shaping, the optical spectrum was flattened within 1 dB, resulting in a square-shaped optical spectrum. As a result, the 3-dB spectral width was extended from 1.15 THz to 6.7 THz. We performed a comparison between the measurement results of various spectrum shapes. We confirmed an improvement in the measurement precision from 69 nm to 6 nm, which was also corroborated by numerical simulations. We believe that this study on enhancing the measurement precision of CORE-SDI through the proposed spectral shaping will make a significant contribution to reducing the measurement uncertainty of future CORE-SDI systems, thereby advancing the development of next-generation length standards.",
  "categories": [
    "physics.optics"
  ],
  "primary_category": "physics.optics",
  "doi": "10.1016/j.optlastec.2023.110324",
  "journal_ref": "Optics & Laser Technology 170, 110324, 2024",
  "arxiv_id": "2307.15302",
  "pdf_url": "https://arxiv.org/pdf/2307.15302v1",
  "comment": "22 pages, 10 figures",
  "num_versions": null,
  "size_before_bytes": 2139560,
  "size_after_bytes": 1250298
}