{
  "title": "Characterising the role of human behaviour in the effectiveness of contact-tracing applications",
  "authors": [
    "Ariadna Fosch",
    "Alberto Aleta",
    "Yamir Moreno"
  ],
  "submission_date": "2023-07-24T22:47:20+00:00",
  "revised_dates": [],
  "abstract": "Albeit numerous countries relied on contact-tracing (CT) applications as an epidemic control measure against the COVID-19 pandemic, the debate around their effectiveness is still open. Most studies indicate that very high levels of adoption are required to stop disease progression, placing the main interest of policymakers in promoting app adherence. However, other factors of human behaviour, like delays in adherence or heterogeneous compliance, are often disregarded. To characterise the impact of human behaviour on the effectiveness of CT apps we propose a multilayer network model reflecting the co-evolution of an epidemic outbreak and the app adoption dynamics over a synthetic population generated from survey data. The model was initialised to produce epidemic outbreaks resembling the first wave of the COVID-19 pandemic and was used to explore the impact of different changes in behavioural features in peak incidence and maximal prevalence. The results corroborate the relevance of the number of users for the effectiveness of CT apps but also highlight the need for early adoption and, at least, moderate levels of compliance, which are factors often not considered by most policymakers. The insight obtained was used to identify a bottleneck in the implementation of several apps, such as the Spanish CT app, where we hypothesise that a simplification of the reporting system could result in increased effectiveness through a rise in the levels of compliance.",
  "categories": [
    "physics.soc-ph",
    "cs.SI"
  ],
  "primary_category": "physics.soc-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13157",
  "pdf_url": null,
  "comment": "25 pages including all figures and SM",
  "num_versions": null,
  "size_before_bytes": 1706878,
  "size_after_bytes": 67008
}