{
  "title": "ASCON: Anatomy-aware Supervised Contrastive Learning Framework for Low-dose CT Denoising",
  "authors": [
    "Zhihao Chen",
    "Qi Gao",
    "Yi Zhang",
    "Hongming Shan"
  ],
  "submission_date": "2023-07-23T04:36:05+00:00",
  "revised_dates": [],
  "abstract": "While various deep learning methods have been proposed for low-dose computed tomography (CT) denoising, most of them leverage the normal-dose CT images as the ground-truth to supervise the denoising process. These methods typically ignore the inherent correlation within a single CT image, especially the anatomical semantics of human tissues, and lack the interpretability on the denoising process. In this paper, we propose a novel Anatomy-aware Supervised CONtrastive learning framework, termed ASCON, which can explore the anatomical semantics for low-dose CT denoising while providing anatomical interpretability. The proposed ASCON consists of two novel designs: an efficient self-attention-based U-Net (ESAU-Net) and a multi-scale anatomical contrastive network (MAC-Net). First, to better capture global-local interactions and adapt to the high-resolution input, an efficient ESAU-Net is introduced by using a channel-wise self-attention mechanism. Second, MAC-Net incorporates a patch-wise non-contrastive module to capture inherent anatomical information and a pixel-wise contrastive module to maintain intrinsic anatomical consistency. Extensive experimental results on two public low-dose CT denoising datasets demonstrate superior performance of ASCON over state-of-the-art models. Remarkably, our ASCON provides anatomical interpretability for low-dose CT denoising for the first time. Source code is available at https://github.com/hao1635/ASCON.",
  "categories": [
    "eess.IV",
    "cs.CV"
  ],
  "primary_category": "eess.IV",
  "doi": "10.1007/978-3-031-43999-5_34",
  "journal_ref": "MICCAI 2023",
  "arxiv_id": "2307.12225",
  "pdf_url": null,
  "comment": "MICCAI 2023",
  "num_versions": null,
  "size_before_bytes": 3846732,
  "size_after_bytes": 115985
}