{
  "title": "Normal form for singular Bautin bifurcation in a slow-fast system with Holling type III functional response",
  "authors": [
    "Tapan Saha",
    "Pranali Roy Chowdhury",
    "Pallav Jyoti Pal",
    "Malay Banerjee"
  ],
  "submission_date": "2023-07-22T08:15:51+00:00",
  "revised_dates": [],
  "abstract": "Over the last few decades, complex oscillations of slow-fast systems have been a key area of research. In the theory of slow-fast systems, the location of singular Hopf bifurcation and maximal canard is determined by computing the first Lyapunov coefficient. In particular, the analysis of canards is based on the genericity condition that the first Lyapunov coefficient must be non-zero. This manuscript aims to further extend the results to the case where the first Lyapunov coefficient vanishes. For that, the analytic expression of the second Lyapunov coefficient and the investigation of the normal form for codimension-2 singular Bautin bifurcation in a predator-prey system is done by explicitly identifying the locally invertible parameter-dependent transformations. A planar slow-fast predator-prey model with Holling type III functional response is considered here, where the prey population growth is affected by the weak Allee effect, and the prey reproduces much faster than the predator. Using geometric singular perturbation theory, normal form theory of slow-fast systems, and blow-up technique, we provide a detailed mathematical investigation of the system to show a variety of rich and complex nonlinear dynamics including but not limited to the existence of canards, relaxation oscillations, canard phenomena, singular Hopf bifurcation, and singular Bautin bifurcation. Additionally, numerical simulations are conducted to support the theoretical findings.",
  "categories": [
    "math.DS"
  ],
  "primary_category": "math.DS",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12011",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1460097,
  "size_after_bytes": 1363241
}