{
  "title": "Probing The Early Universe Cosmology With NANOGrav: Possibilities and Limitations",
  "authors": [
    "Ido Ben-Dayan",
    "Utkarsh Kumar",
    "Udaykrishna Thattarampilly",
    "Amresh Verma"
  ],
  "submission_date": "2023-07-27T18:00:07+00:00",
  "revised_dates": [
    "2023-10-05T17:37:48+00:00"
  ],
  "abstract": "A stochastic gravitational wave background is a prediction of a number of astrophysical and cosmological phenomena including early Universe Cosmology. Recently, the NANOGrav Collaboration reported conclusive evidence for a stochastic gravitational-wave background. We analyze the NANOGrav signal assuming it is of primordial origin including the reheating phase. We use the latest measurements from NANOGrav to constrain the Universe's reheating equation of state $w_{re}$ the reheating temperature, $T_{re}$, the tensor to scalar ratio $r$, and the tensor tilt $n_t$. Assuming the constant equation of state $w_{re}$ responsible for reheating phase, we find preference for instant reheating, $w_{re} = 0.36^{+0.15}_{-0.28}$, and a very blue tilt $n_t = 1.94^{+0.43}_{-0.88}$. We find a degeneracy between the tensor to scalar ratio $r$ and $T_{re}$ and suggest ways to break this degeneracy. In all cases where the reheating temperature is constrained, it is constrained to be very low with $T_{re}\\leq 10^5 GeV$. We further find that a scale-invariant spectrum as suggested by inflation implies a stiff equation of state $w_{re}=19/3$. If extrapolated, the blue-tilted primordial spectrum that agrees with the NANOGrav signal at corresponding frequencies is incompatible with the LIGO bound. This incompatibility is another challenge for connecting NANOGrav with the primordial spectrum. We discuss a number of ways to circumvent this issue. We split the spectrum into a sum of astrophysical and primordial spectra and constrain the astrophysical and primordial components using NANOGrav data and the LIGO bound. In another attempt, we use the same data and constrain the running of the spectrum. Any of these or a combination of such methods can be used to reconcile the NANOGrav data and the LIGO bound with the primordial power spectrum.",
  "categories": [
    "astro-ph.CO",
    "gr-qc",
    "hep-th"
  ],
  "primary_category": "astro-ph.CO",
  "doi": "10.1103/PhysRevD.108.103507",
  "journal_ref": null,
  "arxiv_id": "2307.15123",
  "pdf_url": "https://arxiv.org/pdf/2307.15123v2",
  "comment": "13 pages, 5 figures, 3 tables, reference added, figure changed",
  "num_versions": null,
  "size_before_bytes": 2544143,
  "size_after_bytes": 1876302
}