{
  "title": "Broadband Dispersive-Wave Emission Coupled with Two-Stage Soliton Self-Compression in Gas-Filled Anti-Resonant Hollow-Core Fibers",
  "authors": [
    "Jinyu Pan",
    "Zhiyuan Huang",
    "Yifei Chen",
    "Fei Yu",
    "Dakun Wu",
    "Tiandao Chen",
    "Donghan Liu",
    "Yue Yu",
    "Xin Jiang",
    "Meng Pang",
    "Yuxin Leng",
    "Ruxin Li"
  ],
  "submission_date": "2023-07-30T07:05:23+00:00",
  "revised_dates": [],
  "abstract": "We studied the underlying mechanism of broadband dispersive-wave emission within a resonance band of gas-filled anti-resonant hollow-core fiber. Both theoretical and experimental results unveiled that the high-order soliton, launched into the hollow-core fiber, experienced two stages of pulse compression, resulting in a multi-peak structure of the dispersive-wave spectrum. Over the first-stage pulse compression, a sharp increase of the pulse peak power triggered the first time of dispersion-wave emission, and simultaneously caused ionization of the noble gas filled in the fiber core. Strong soliton-plasma interactions led to blue shifting of the pump pulse, and the blue-shifted pulse experienced a decreasing dispersion value in the fiber waveguide, resulting in an increase of its soliton order. Then, the second-stage pulse compression due to the high-order soliton effect triggered the second time of dispersive-wave emission at a phase-matched frequency slightly lower than that in the first stage. Multi-peak spectra of the output dispersive-waves and their formation dynamics were clearly observed in our experiments, which can be understood using a delicate coupling mechanism among three nonlinear effects including high-order-soliton compression, soliton-plasma interaction and phase-matched dispersive-wave emission. The output broadband dispersive-wave could be potentially compressed to sub-30 fs duration using precise chirp-compensation technique.",
  "categories": [
    "physics.optics"
  ],
  "primary_category": "physics.optics",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16147",
  "pdf_url": "https://arxiv.org/pdf/2307.16147v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1541855,
  "size_after_bytes": 906842
}