{
  "title": "Machine Learning Potential for Modelling H$_2$ Adsorption/Diffusion in MOF with Open Metal Sites",
  "authors": [
    "Shanping Liu",
    "Romain Dupuis",
    "Dong Fan",
    "Salma Benzaria",
    "Michael Bonneau",
    "Prashant Bhatt",
    "Mohamed Eddaoudi",
    "Guillaume Maurin"
  ],
  "submission_date": "2023-07-28T12:39:50+00:00",
  "revised_dates": [],
  "abstract": "Metal-organic frameworks (MOFs) incorporating open metal sites (OMS) have been identified as promising sorbents for many societally relevant-adsorption applications including CO$_2$ capture, natural gas purification and H$_2$ storage. It is critical to derive generic interatomic potential to achieve accurate and effective evaluation of MOFs for H$_2$ adsorption. On this path, as a proof-of-concept, the Al-soc-MOF containing Al-OMS, previously envisaged as a potential candidate for H$_2$ adsorption, was selected and a machine learning potential (MLP) was derived from a dataset initially generated by ab-initio molecular dynamics (AIMD) simulations. This MLP was further implemented in MD simulations to explore the binding modes of H$_2$ as well as its temperature dependence distribution in the MOFs pores from 10K to 90K. MLP-Grand Canonical Monte Carlo (GCMC) simulations were further performed to predict the H$_2$ sorption isotherm of Al-soc-MOF at 77K that was further confirmed by gravimetric sorption measurements. As a further step, MLP-based MD simulations were conducted to anticipate the kinetics of H$_2$ in this MOF. This work delivers the first MLP able to describe accurately the interactions between the challenging H$_2$ guest molecule and MOFs containing OMS. This innovative strategy applied to one of the most complex molecules owing to its highly polarizable nature alongside its quantum-mechanical effects that are only accurately described by quantum calculations, paves the way towards a more systematic accurate and efficient in silico assessment of the MOFs containing OMS for H$_2$ adsorption and beyond to the low-pressure capture/sensing of diverse molecules.",
  "categories": [
    "cond-mat.mtrl-sci",
    "physics.comp-ph"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15528",
  "pdf_url": "https://arxiv.org/pdf/2307.15528v1",
  "comment": "11 pages, 4 figures",
  "num_versions": null,
  "size_before_bytes": 895202,
  "size_after_bytes": 522127
}