{
  "title": "Multi-GPU Approach for Training of Graph ML Models on large CFD Meshes",
  "authors": [
    "Sebastian Strönisch",
    "Maximilian Sander",
    "Andreas Knüpfer",
    "Marcus Meyer"
  ],
  "submission_date": "2023-07-25T15:49:25+00:00",
  "revised_dates": [],
  "abstract": "Mesh-based numerical solvers are an important part in many design tool chains. However, accurate simulations like computational fluid dynamics are time and resource consuming which is why surrogate models are employed to speed-up the solution process. Machine Learning based surrogate models on the other hand are fast in predicting approximate solutions but often lack accuracy. Thus, the development of the predictor in a predictor-corrector approach is the focus here, where the surrogate model predicts a flow field and the numerical solver corrects it. This paper scales a state-of-the-art surrogate model from the domain of graph-based machine learning to industry-relevant mesh sizes of a numerical flow simulation. The approach partitions and distributes the flow domain to multiple GPUs and provides halo exchange between these partitions during training. The utilized graph neural network operates directly on the numerical mesh and is able to preserve complex geometries as well as all other properties of the mesh. The proposed surrogate model is evaluated with an application on a three dimensional turbomachinery setup and compared to a traditionally trained distributed model. The results show that the traditional approach produces superior predictions and outperforms the proposed surrogate model. Possible explanations, improvements and future directions are outlined.",
  "categories": [
    "cs.LG",
    "cs.DC",
    "math.NA"
  ],
  "primary_category": "cs.LG",
  "doi": "10.2514/6.2023-1203",
  "journal_ref": "Sebastian Stroenisch, Maximilian Sander, Marcus Meyer and Andreas Knuepfer. \"Multi-GPU Approach for Training of Graph ML Models on large CFD Meshes,\" AIAA 2023-1203. AIAA SCITECH 2023 Forum. January 2023",
  "arxiv_id": "2307.13592",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 8090664,
  "size_after_bytes": 137975
}