{
  "title": "Adaptive RRI Selection Algorithms for Improved Cooperative Awareness in Decentralized NR-V2X",
  "authors": [
    "Avik Dayal",
    "Vijay K. Shah",
    "Harpreet S. Dhillon",
    "Jeffrey H. Reed"
  ],
  "submission_date": "2023-07-24T01:59:43+00:00",
  "revised_dates": [],
  "abstract": "Decentralized vehicle-to-everything (V2X) networks (i.e., C-V2X Mode-4 and NR-V2X Mode-2) utilize sensing-based semi-persistent scheduling (SPS) where vehicles sense and reserve suitable radio resources for Basic Safety Message (BSM) transmissions at prespecified periodic intervals termed as Resource Reservation Interval (RRI). Vehicles rely on these received periodic BSMs to localize nearby (transmitting) vehicles and infrastructure, referred to as cooperative awareness. Cooperative awareness enables line of sight and non-line of sight localization, extending a vehicle's sensing and perception range. In this work, we first show that under high vehicle density scenarios, existing SPS (with prespecified RRIs) suffer from poor cooperative awareness, quantified as tracking error. Decentralized vehicle-to-everything (V2X) networks (i.e., C-V2X Mode-4 and NR-V2X Mode-2) utilize sensing-based semi-persistent scheduling (SPS) where vehicles sense and reserve suitable radio resources for Basic Safety Message (BSM) transmissions at prespecified periodic intervals termed as Resource Reservation Interval (RRI). Vehicles rely on these received periodic BSMs to localize nearby (transmitting) vehicles and infrastructure, referred to as cooperative awareness. Cooperative awareness enables line of sight and non-line of sight localization, extending a vehicle's sensing and perception range. In this work, we first show that under high vehicle density scenarios, existing SPS (with prespecified RRIs) suffer from poor cooperative awareness, quantified as tracking error.",
  "categories": [
    "cs.IT"
  ],
  "primary_category": "cs.IT",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12473",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 18904962,
  "size_after_bytes": 1404634
}