{
  "title": "AutoSourceID-Classifier. Star-Galaxy Classification using a Convolutional Neural Network with Spatial Information",
  "authors": [
    "F. Stoppa",
    "S. Bhattacharyya",
    "R. Ruiz de Austri",
    "P. Vreeswijk",
    "S. Caron",
    "G. Zaharijas",
    "S. Bloemen",
    "G. Principe",
    "D. Malyshev",
    "V. Vodeb",
    "P. J. Groot",
    "E. Cator",
    "G. Nelemans"
  ],
  "submission_date": "2023-07-26T18:55:36+00:00",
  "revised_dates": [],
  "abstract": "Aims. Traditional star-galaxy classification techniques often rely on feature estimation from catalogues, a process susceptible to introducing inaccuracies, thereby potentially jeopardizing the classification's reliability. Certain galaxies, especially those not manifesting as extended sources, can be misclassified when their shape parameters and flux solely drive the inference. We aim to create a robust and accurate classification network for identifying stars and galaxies directly from astronomical images. By leveraging convolutional neural networks (CNN) and additional information about the source position, we aim to accurately classify all stars and galaxies within a survey, particularly those with a signal-to-noise ratio (S/N) near the detection limit. Methods. The AutoSourceID-Classifier (ASID-C) algorithm developed here uses 32x32 pixel single filter band source cutouts generated by the previously developed ASID-L code. ASID-C utilizes CNNs to distinguish these cutouts into stars or galaxies, leveraging their strong feature-learning capabilities. Subsequently, we employ a modified Platt Scaling calibration for the output of the CNN. This technique ensures that the derived probabilities are effectively calibrated, delivering precise and reliable results. Results. We show that ASID-C, trained on MeerLICHT telescope images and using the Dark Energy Camera Legacy Survey (DECaLS) morphological classification, outperforms similar codes like SourceExtractor. ASID-C opens up new possibilities for accurate celestial object classification, especially for sources with a S/N near the detection limit. Potential applications of ASID-C, like real-time star-galaxy classification and transient's host identification, promise significant contributions to astronomical research.",
  "categories": [
    "astro-ph.IM",
    "hep-ph"
  ],
  "primary_category": "astro-ph.IM",
  "doi": "10.1051/0004-6361/202347576",
  "journal_ref": "A&A 680, A109 (2023)",
  "arxiv_id": "2307.14456",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 9883947,
  "size_after_bytes": 200840
}