{
  "title": "Structure and Noise in Dense and Sparse Random Graphs: Percolated Stochastic Block Model via the EM Algorithm and Belief Propagation with Non-Backtracking Spectra",
  "authors": [
    "Marianna Bolla",
    "Hannu Reittu",
    "Runtian Zhou"
  ],
  "submission_date": "2023-07-31T08:55:27+00:00",
  "revised_dates": [
    "2023-08-20T12:06:46+00:00",
    "2023-12-20T19:27:22+00:00",
    "2023-12-26T20:56:37+00:00",
    "2024-07-25T19:27:45+00:00",
    "2024-12-01T16:23:39+00:00"
  ],
  "abstract": "In this survey paper it is illustrated how spectral clustering methods for unweighted graphs are adapted to the dense and sparse regimes. Whereas Laplacian and modularity based spectral clustering is apt to dense graphs, recent results show that for sparse ones, the non-backtracking spectrum is the best candidate to find assortative clusters of nodes. Here belief propagation in the sparse stochastic block model is derived with arbitrarily given model parameters that results in a non-linear system of equations; with linear approximation, the spectrum of the non-backtracking matrix is able to specify the number $k$ of clusters. Then the model parameters themselves can be estimated by the EM algorithm.\n  Bond percolation in the assortative model is considered in the following two senses: the within- and between-cluster edge probabilities decrease with the number of nodes and edges coming into existence in this way are retained with probability $β$. As a consequence, the optimal $k$ is the number of the structural real eigenvalues (greater than $\\sqrt{c}$, where $c$ is the average degree) of the non-backtracking matrix of the graph. Assuming, these eigenvalues $μ_1 >\\dots > μ_k$ are distinct, the multiple phase transitions obtained for $β$ are $β_i =\\frac{c}{μ_i^2}$; further, at $β_i$ the number of detectable clusters is $i$, for $i=1,\\dots ,k$. Inflation-deflation techniques are also discussed to classify the nodes themselves, which can be the base of the sparse spectral clustering. Simulation results, as well as real life examples are presented.",
  "categories": [
    "math.CO",
    "stat.ME"
  ],
  "primary_category": "math.CO",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16502",
  "pdf_url": "https://arxiv.org/pdf/2307.16502v6",
  "comment": "33 pages, 18 figures",
  "num_versions": null,
  "size_before_bytes": 121190036,
  "size_after_bytes": 573695
}