{
  "title": "Toward a Physical Understanding of Galaxy-Halo Alignment",
  "authors": [
    "Kun Xu",
    "Y. P. Jing",
    "Donghai Zhao"
  ],
  "submission_date": "2023-07-23T14:00:56+00:00",
  "revised_dates": [
    "2023-10-30T00:39:23+00:00",
    "2023-11-07T01:29:44+00:00"
  ],
  "abstract": "We investigate the alignment of galaxy and halo orientations using the TNG300-1 hydrodynamical simulation. Our analysis reveals that the distribution of the 2D misalignment angle $θ_{\\rm{2D}}$ can be well described by a truncated shifted exponential (TSE) distribution with only {\\textit{one}} free parameter across different redshifts and galaxy/halo properties. We demonstrate that the galaxy-ellipticity (GI) correlations of galaxies can be reproduced by perturbing halo orientations with the obtained $θ_{\\rm{2D}}$ distribution, with only a small bias ($<3^{\\circ}$) possibly arising from unaccounted couplings between $θ_{\\rm{2D}}$ and other factors. We find that both the 2D and 3D misalignment angles $θ_{\\rm{2D}}$ and $θ_{\\rm{3D}}$ decrease with ex situ stellar mass fraction $F_{\\rm{acc}}$, halo mass $M_{\\rm{vir}}$ and stellar mass $M_{*}$, while increasing with disk-to-total stellar mass fraction $F_{\\rm{disk}}$ and redshift. These dependences are in good agreement with our recent observational study based on the BOSS galaxy samples. Our results suggest that $F_{\\rm{acc}}$ is a key factor in determining the galaxy-halo alignment. Grouping galaxies by $F_{\\rm{acc}}$ nearly eliminates the dependence of $θ_{\\rm{3D}}$ on $M_{\\rm{vir}}$ for all three principle axes, and also reduces the redshift dependence. For $θ_{\\rm{2D}}$, we find a more significant redshift dependence than for $θ_{\\rm{3D}}$ even after controlling $F_{\\rm{acc}}$, which may be attributed to the evolution of galaxy and halo shapes. Our findings present a valuable model for observational studies and enhance our understanding of galaxy-halo alignment.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.3847/1538-4357/acf835",
  "journal_ref": "The Astrophysical Journal, Volume 957, 2023, Number 1",
  "arxiv_id": "2307.12334",
  "pdf_url": null,
  "comment": "19 pages, 12 figures, Published in ApJ",
  "num_versions": null,
  "size_before_bytes": 5200009,
  "size_after_bytes": 3977020
}