{
  "title": "On-surface synthesis and characterization of Teranthene and Hexanthene: Ultrashort graphene nanoribbons with mixed armchair and zigzag edges",
  "authors": [
    "Gabriela Borin Barin",
    "Marco Di Giovannantonio",
    "Thorsten G. Lohr",
    "Shantanu Mishra",
    "Amogh Kinikar",
    "Mickael L. Perrin",
    "Jan Overbeck",
    "Michel Calame",
    "Xinliang Feng",
    "Roman Fasel",
    "Pascal Ruffieux"
  ],
  "submission_date": "2023-07-31T11:56:45+00:00",
  "revised_dates": [],
  "abstract": "Graphene nanoribbons (GNRs) exhibit a broad range of physicochemical properties that critically depend on their width and edge topology. While the chemically stable GNRs with armchair edges (AGNRs) are semiconductors with width-tunable band gap, GNRs with zigzag edges (ZGNRs) host spin-polarized edge states, which renders them interesting for applications in spintronic and quantum technologies. However, these states significantly increase their reactivity. For GNRs fabricated via on-surface synthesis under ultrahigh vacuum conditions on metal substrates, the expected reactivity of zigzag edges is a serious concern in view of substrate transfer and device integration under ambient conditions, but corresponding investigations are scarce. Using 10-bromo-9,9':10',9''-teranthracene as a precursor, we have thus synthesized hexanthene (HA) and teranthene (TA) as model compounds for ultrashort GNRs with mixed armchair and zigzag edges, characterized their chemical and electronic structure by means of scanning probe methods, and studied their chemical reactivity upon air exposure by Raman spectroscopy. We present a detailed identification of molecular orbitals and vibrational modes, assign their origin to armchair or zigzag edges, and discuss the chemical reactivity of these edges based on characteristic Raman spectral features.",
  "categories": [
    "cond-mat.mtrl-sci",
    "physics.chem-ph"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": "10.1039/D3NR03736C",
  "journal_ref": null,
  "arxiv_id": "2307.16596",
  "pdf_url": "https://arxiv.org/pdf/2307.16596v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 3004900,
  "size_after_bytes": 1735042
}