{
  "title": "Molecular modeling of interfacial properties of the hydrogen+water+decane mixture in three-phase equilibrium",
  "authors": [
    "Yafan Yang",
    "Jingyu Wan",
    "Jingfa Li",
    "Guangsi Zhao",
    "Xiangyu Shang"
  ],
  "submission_date": "2023-07-28T07:05:40+00:00",
  "revised_dates": [],
  "abstract": "The understanding of geochemical interactions between H2 and geofluids is of great importance for underground H2 storage but requires further study. We report the first investigation on the three-phase fluid mixture containing H2, H2O, and n-C10H22. Molecular dynamics simulation and PC-SAFT density gradient theory are employed to estimate the interfacial properties under various conditions (temperature ranges from 298 to 373 K and pressure is up to around 100 MPa). Our results demonstrate that interfacial tensions (IFTs) of the H2-H2O interface in the H2+H2O+C10H22 three-phase mixture are smaller than IFTs in the H2+H2O two-phase mixture. This decrement of IFT can be attributed to C10H22 adsorption in the interface. Importantly, H2 accumulates in the H2O-C10H22 interface in the three-phase systems, which leads to weaker increments of IFT with increasing pressure compared to IFTs in the water+C10H22 two-phase mixture. In addition, the IFTs of the H2-C10H22 interface are hardly influenced by H2O due to the limited amount of H2O dissolved in bulk phases. Nevertheless, relatively strong enrichments and positive surface excesses of H2O are seen in the H2-C10H22 interfacial region. Furthermore, the values of the spreading coefficient are mostly negative revealing the presence of the three-phase contact for the H2+H2O+C10H22 mixture under studied conditions.",
  "categories": [
    "physics.chem-ph"
  ],
  "primary_category": "physics.chem-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15356",
  "pdf_url": "https://arxiv.org/pdf/2307.15356v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 10522537,
  "size_after_bytes": 184711
}