{
  "title": "A Coronal Mass Ejection Source Region Catalogue and their Associated Properties",
  "authors": [
    "Satabdwa Majumdar",
    "Ritesh Patel",
    "Vaibhav Pant",
    "Dipankar Banerjee",
    "Aarushi Rawat",
    "Abhas Pradhan",
    "Paritosh Singh"
  ],
  "submission_date": "2023-07-25T02:21:38+00:00",
  "revised_dates": [
    "2023-10-27T00:19:43+00:00"
  ],
  "abstract": "The primary objective of this study is to connect the coronal mass ejections (CMEs) to their source regions, primarily creating a CME source region (CSR) catalogue, and secondly probing into the influence the source regions have on different statistical properties of CMEs. We create a source region catalogue for 3327 CMEs from 1998 to 2017, thus capturing the different phases of cycle 23 and 24. The identified source regions are segregated into 3 classes, Active Regions (ARs), Prominence Eruptions (PEs) and Active Prominences (APs), while the CMEs are segregated into slow and fast based on their average projected speeds. We find the contribution of these three source region types to the occurrences of slow and fast CMEs to be different in the above period. A study of the distribution of average speeds reveals different power-laws for CMEs originating from different sources, and the power-law is different during the different phases of cycles 23 and 24. A study of statistical latitudinal deflections showed equator-ward deflections, while the magnitude of deflections again bears an imprint of the source regions. An East-West asymmetry is also noted, particularly in the rising phase of cycle 23, with the presence of active longitudes for the CMEs, with a preference towards the Western part of the Sun. Our results show that different aspects of CME kinematics bear a strong imprint of the source regions they originate from, thus indicating the existence of different ejection and/or propagation mechanisms of these CMEs.",
  "categories": [
    "astro-ph.SR"
  ],
  "primary_category": "astro-ph.SR",
  "doi": "10.3847/1538-4365/aceb62",
  "journal_ref": null,
  "arxiv_id": "2307.13208",
  "pdf_url": null,
  "comment": "29 Pages, 18 Figures. Accepted in The Astrophysical Journal Supplement Series (APJS)",
  "num_versions": null,
  "size_before_bytes": 9608005,
  "size_after_bytes": 944062
}