{
  "title": "Photon discerner: Adaptive quantum optical sensing near the shot noise limit",
  "authors": [
    "F. Bao",
    "L. Bauer",
    "A. E. Rubio Lopez",
    "Z. Jacob"
  ],
  "submission_date": "2023-07-27T18:35:02+00:00",
  "revised_dates": [],
  "abstract": "Photon statistics of an optical field can be used for quantum optical sensing in low light level scenarios free of bulky optical components. However, photon-number-resolving detection to unravel the photon statistics is challenging. Here, we propose a novel detection approach, that we call `photon discerning', which uses adaptive photon thresholding for photon statistical estimation without recording exact photon numbers. Our photon discerner is motivated by the field of neural networks where tunable thresholds have proven efficient for isolating optimal decision boundaries in machine learning tasks. The photon discerner maximizes Fisher information per photon by iteratively choosing the optimal threshold in real-time to approach the shot noise limit. Our proposed scheme of adaptive photon thresholding leads to unique remote-sensing applications of quantum DoLP (degree of linear polarization) camera and quantum LiDAR. We investigate optimal thresholds and show that the optimal photon threshold can be counter-intuitive (not equal to 1) even for weak signals (mean photon number much less than 1), due to the photon bunching effect. We also put forth a superconducting nanowire realization of the photon discerner which can be experimentally implemented in the near-term. We show that the adaptivity of our photon discerner enables it to beat realistic photon-number-resolving detectors with limited photon-number resolution. Our work suggests a new class of detectors for information-theory driven, compact, and learning-based quantum optical sensing.",
  "categories": [
    "quant-ph",
    "physics.optics"
  ],
  "primary_category": "quant-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15141",
  "pdf_url": "https://arxiv.org/pdf/2307.15141v1",
  "comment": "12 pages, 9 figures",
  "num_versions": null,
  "size_before_bytes": 1675812,
  "size_after_bytes": 118587
}