{
  "title": "A deep transfer learning network for structural condition identification with limited real-world training data",
  "authors": [
    "Nengxin Bao",
    "Tong Zhang",
    "Ruizhi Huang",
    "Suryakanta Biswal",
    "Jingyong Su",
    "Ying Wang"
  ],
  "submission_date": "2023-07-28T01:19:15+00:00",
  "revised_dates": [],
  "abstract": "Structural condition identification based on monitoring data is important for automatic civil infrastructure asset management. Nevertheless, the monitoring data is almost always insufficient, because the real-time monitoring data of a structure only reflects a limited number of structural conditions, while the number of possible structural conditions is infinite. With insufficient monitoring data, the identification performance may significantly degrade. This study aims to tackle this challenge by proposing a deep transfer learning (TL) approach for structural condition identification. It effectively integrates physics-based and data-driven methods, by generating various training data based on the calibrated finite element (FE) model, pretraining a deep learning (DL) network, and transferring its embedded knowledge to the real monitoring/testing domain. Its performance is demonstrated in a challenging case, vibration-based condition identification of steel frame structures with bolted connection damage. The results show that even though the training data are from a different domain and with different types of labels, intrinsic physics can be learned through the pretraining process, and the TL results can be clearly improved, with the identification accuracy increasing from 81.8% to 89.1%. The comparative studies show that SHMnet with three convolutional layers stands out as the pretraining DL architecture, with 21.8% and 25.5% higher identification accuracy values over the other two networks, VGGnet-16 and ResNet-18. The findings of this study advance the potential application of the proposed approach towards expert-level condition identification based on limited real-world training data.",
  "categories": [
    "cs.CE"
  ],
  "primary_category": "cs.CE",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15249",
  "pdf_url": "https://arxiv.org/pdf/2307.15249v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 2347616,
  "size_after_bytes": 1354891
}