{
  "title": "Software development in startup companies: A systematic mapping study",
  "authors": [
    "Nicolò Paternoster",
    "Carmine Giardino",
    "Michael Unterkalmsteiner",
    "Tony Gorschek",
    "Pekka Abrahamsson"
  ],
  "submission_date": "2023-07-24T19:49:57+00:00",
  "revised_dates": [],
  "abstract": "Context: Software startups are newly created companies with no operating history and fast in producing cutting-edge technologies. These companies develop software under highly uncertain conditions, tackling fast-growing markets under severe lack of resources. Therefore, software startups present an unique combination of characteristics which pose several challenges to software development activities. Objective: This study aims to structure and analyze the literature on software development in startup companies, determining thereby the potential for technology transfer and identifying software development work practices reported by practitioners and researchers. Method: We conducted a systematic mapping study, developing a classification schema, ranking the selected primary studies according their rigor and relevance, and analyzing reported software development work practices in startups. Results: A total of 43 primary studies were identified and mapped, synthesizing the available evidence on software development in startups. Only 16 studies are entirely dedicated to software development in startups, of which 10 result in a weak contribution (advice and implications (6); lesson learned (3); tool (1)). Nineteen studies focus on managerial and organizational factors. Moreover, only 9 studies exhibit high scientific rigor and relevance. From the reviewed primary studies, 213 software engineering work practices were extracted, categorized and analyzed. Conclusion: This mapping study provides the first systematic exploration of the state-of-art on software startup research. The existing body of knowledge is limited to a few high quality studies. Furthermore, the results indicate that software engineering work practices are chosen opportunistically, adapted and configured to provide value under the constrains imposed by the startup context.",
  "categories": [
    "cs.SE"
  ],
  "primary_category": "cs.SE",
  "doi": "10.1016/j.infsof.2014.04.014",
  "journal_ref": "Inf. Softw. Technol. 56(10): 1200-1218 (2014)",
  "arxiv_id": "2307.13104",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 6264313,
  "size_after_bytes": 153523
}