{
  "title": "The effect of axisymmetric confinement on propulsion of a three-sphere microswimmer",
  "authors": [
    "Ali Gürbüz",
    "Andrew Lemus",
    "Ebru Demir",
    "On Shun Pak",
    "Abdallah Daddi-Moussa-Ider"
  ],
  "submission_date": "2023-07-26T06:22:53+00:00",
  "revised_dates": [],
  "abstract": "Swimming at the microscale has recently garnered substantial attention due to the fundamental biological significance of swimming microorganisms and the wide range of biomedical applications for artificial microswimmers. These microswimmers invariably find themselves surrounded by different confining boundaries, which can impact their locomotion in significant and diverse ways. In this work, we employ a widely used three-sphere swimmer model to investigate the effect of confinement on swimming at low Reynolds numbers. We conduct theoretical analysis via the point-particle approximation and numerical simulations based on the finite element method to examine the motion of the swimmer along the centerline in a capillary tube. The axisymmetric configuration reduces the motion to one-dimensional movement, which allows us to quantify how the degree of confinement affects the propulsion speed in a simple manner. Our results show that the confinement does not significantly affect the propulsion speed until the ratio of the radius of the tube to the radius of the sphere is in the range of $\\mathcal{O}(1)-\\mathcal{O}(10)$, where the swimmer undergoes substantial reduction in its propulsion speed as the radius of the tube decreases. We provide some physical insights into how reduced hydrodynamic interactions between moving spheres under confinement may hinder the propulsion of the three-sphere swimmer. We also remark that the reduced propulsion performance stands in stark contrast to the enhanced helical propulsion observed in a capillary tube, highlighting how the manifestation of confinement effects can vary qualitatively depending on the propulsion mechanisms employed by the swimmers.",
  "categories": [
    "physics.flu-dyn",
    "cond-mat.soft"
  ],
  "primary_category": "physics.flu-dyn",
  "doi": "10.1063/5.0163348",
  "journal_ref": null,
  "arxiv_id": "2307.14386",
  "pdf_url": null,
  "comment": "10 pages, 7 figures, revised manuscript resubmitted to Phys Fluids",
  "num_versions": null,
  "size_before_bytes": 3434610,
  "size_after_bytes": 114311
}