{
  "title": "Rethinking Medical Report Generation: Disease Revealing Enhancement with Knowledge Graph",
  "authors": [
    "Yixin Wang",
    "Zihao Lin",
    "Haoyu Dong"
  ],
  "submission_date": "2023-07-24T04:56:23+00:00",
  "revised_dates": [],
  "abstract": "Knowledge Graph (KG) plays a crucial role in Medical Report Generation (MRG) because it reveals the relations among diseases and thus can be utilized to guide the generation process. However, constructing a comprehensive KG is labor-intensive and its applications on the MRG process are under-explored. In this study, we establish a complete KG on chest X-ray imaging that includes 137 types of diseases and abnormalities. Based on this KG, we find that the current MRG data sets exhibit a long-tailed problem in disease distribution. To mitigate this problem, we introduce a novel augmentation strategy that enhances the representation of disease types in the tail-end of the distribution. We further design a two-stage MRG approach, where a classifier is first trained to detect whether the input images exhibit any abnormalities. The classified images are then independently fed into two transformer-based generators, namely, ``disease-specific generator\" and ``disease-free generator\" to generate the corresponding reports. To enhance the clinical evaluation of whether the generated reports correctly describe the diseases appearing in the input image, we propose diverse sensitivity (DS), a new metric that checks whether generated diseases match ground truth and measures the diversity of all generated diseases. Results show that the proposed two-stage generation framework and augmentation strategies improve DS by a considerable margin, indicating a notable reduction in the long-tailed problem associated with under-represented diseases.",
  "categories": [
    "cs.CV",
    "cs.AI",
    "cs.LG"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12526",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 3889276,
  "size_after_bytes": 150247
}