{
  "title": "Magnetic supersolid phases of two-dimensional extended Bose-Hubbard model with spin-orbit coupling",
  "authors": [
    "Dong-Dong Pu",
    "Ji-Guo Wang",
    "Ya-Fei Song",
    "Xiao-Dong Bai"
  ],
  "submission_date": "2023-07-28T05:11:26+00:00",
  "revised_dates": [
    "2023-07-31T03:35:11+00:00"
  ],
  "abstract": "The study of ultracold atomic spin systems with long-range interaction provides the possibility of searching for magnetic supersolid phases in quantum many-body scenarios. In this paper, we consider two-species Bose gases with spin-orbit coupling and nearest-neighbor interaction confined in a two-dimensional optical lattice. The competition between spin-orbit coupling and interactions creates rich ground-state diagrams with supersolid phases exhibiting phase modulations or magnetic orderings. We obtain the phase-twisted and phase-striped pair checkboard supersolid phases that are generated by the combination of spin-orbit coupling and intraspecies nearest-neighbor interaction. The introduction of interspecies nearest-neighbor interaction enriches the quantum phases of the system. It leads to the appearance of the phase-twisted and phase-striped lattice supersolid phases. In addition to the lattice supersolid phase, we find the emergence of nontrivial supersolid phases that depend on the interspecies on-site interaction strength. The lattice-insulated supersolid phase with supersolidility in one species but insulation in the other exists in the miscible domain, while the pair striped supersolid phase with stripe structures in each species is in the immiscible domain. Finally, to further characterize each phase, we discuss their spin-dependent momentum distributions and spin textures. The magnetic textures, such as antiferromagnetic, spiral and stripe orders, are shown in SS phases. The results here could help in the observe for these magnetic supersolid phases in ultracold atomic experiments with nearest-neighbor interaction and spin-orbit coupling in optical lattice.",
  "categories": [
    "cond-mat.quant-gas"
  ],
  "primary_category": "cond-mat.quant-gas",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15310",
  "pdf_url": "https://arxiv.org/pdf/2307.15310v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1999018,
  "size_after_bytes": 118797
}