{
  "title": "Impact of Black Swan Events on Ethereum Blockchain ERC20 Token Transaction Networks",
  "authors": [
    "Moturi Pradeep",
    "Uday Kumar Reddy Dyapa",
    "Sarika Jalan",
    "Priodyuti Pradhan"
  ],
  "submission_date": "2023-07-27T12:38:48+00:00",
  "revised_dates": [],
  "abstract": "The Ethereum blockchain and its ERC20 token standard have revolutionized the landscape of digital assets and decentralized applications. ERC20 tokens developed on the Ethereum blockchain have gained significant attention since their introduction. They are programmable and interoperable tokens, enabling various applications and token economies. Transaction graphs, representing the flow of the value between wallets within the Ethereum network, have played a crucial role in understanding the system's dynamics, such as token transfers and the behavior of traders. Here, we explore the evolution of daily transaction graphs of ERC20 token transactions, which sheds light on the trader's behavior during the Black Swan Events -- 2018 crypto crash and the COVID-19 pandemic. By using the tools from network science and differential geometry, we analyze 0.98 billion of ERC20 token transaction data from November 2015 to January 2023. Our analysis reveals that ERC20 financial ecosystem has evolved from a localized wealth formation period to a more mature financial ecosystem where wealth has dispersed among the traders in the network after the crypto crash and during the pandemic period. Before the crash, most sellers only sell the tokens, and buyers only buy the tokens. However, after the crash and during the pandemic period, sellers and buyers both performed buying and selling activities. In addition, we observe no significant negative impact of the COVID-19 pandemic on user behavior in the financial ecosystem.",
  "categories": [
    "nlin.AO"
  ],
  "primary_category": "nlin.AO",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14812",
  "pdf_url": "https://arxiv.org/pdf/2307.14812v1",
  "comment": "12 pages, 9 figures",
  "num_versions": null,
  "size_before_bytes": 37312847,
  "size_after_bytes": 46788
}