{
  "title": "Generative convective parametrization of dry atmospheric boundary layer",
  "authors": [
    "Florian Heyder",
    "Juan Pedro Mellado",
    "Jörg Schumacher"
  ],
  "submission_date": "2023-07-27T13:37:29+00:00",
  "revised_dates": [],
  "abstract": "Turbulence parametrizations will remain a necessary building block in kilometer-scale Earth system models. In convective boundary layers, where the mean vertical gradients of conserved properties such as potential temperature and moisture are approximately zero, the standard ansatz which relates turbulent fluxes to mean vertical gradients via an eddy diffusivity has to be extended by mass flux parametrizations for the typically asymmetric up- and downdrafts in the atmospheric boundary layer. In this work, we present a parametrization for a dry convective boundary layer based on a generative adversarial network. The model incorporates the physics of self-similar layer growth following from the classical mixed layer theory by Deardorff. This enhances the training data base of the generative machine learning algorithm and thus significantly improves the predicted statistics of the synthetically generated turbulence fields at different heights inside the boundary layer. The algorithm training is based on fully three-dimensional direct numerical simulation data. Differently to stochastic parametrizations, our model is able to predict the highly non-Gaussian transient statistics of buoyancy fluctuations, vertical velocity, and buoyancy flux at different heights thus also capturing the fastest thermals penetrating into the stabilized top region. The results of our generative algorithm agree with standard two-equation or multi-plume stochastic mass-flux schemes. The present parametrization provides additionally the granule-type horizontal organization of the turbulent convection which cannot be obtained in any of the other model closures. Our work paves the way to efficient data-driven convective parametrizations in other natural flows, such as moist convection, upper ocean mixing, or convection in stellar interiors.",
  "categories": [
    "physics.flu-dyn",
    "cs.LG",
    "physics.ao-ph"
  ],
  "primary_category": "physics.flu-dyn",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14857",
  "pdf_url": "https://arxiv.org/pdf/2307.14857v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 13017956,
  "size_after_bytes": 88111
}