{
  "title": "Single Proxy Synthetic Control",
  "authors": [
    "Chan Park",
    "Eric Tchetgen Tchetgen"
  ],
  "submission_date": "2023-07-31T00:21:14+00:00",
  "revised_dates": [
    "2023-11-28T19:29:19+00:00",
    "2024-11-26T21:47:19+00:00",
    "2025-03-05T15:49:40+00:00"
  ],
  "abstract": "Synthetic control methods are widely used to estimate the treatment effect on a single treated unit in time-series settings. A common approach to estimate synthetic control weights is to regress the treated unit's pre-treatment outcome and covariates' time series measurements on those of untreated units via ordinary least squares. However, this approach can perform poorly if the pre-treatment fit is not near perfect, whether the weights are normalized or not. In this paper, we introduce a single proxy synthetic control approach, which views the outcomes of untreated units as proxies of the treatment-free potential outcome of the treated unit, a perspective we leverage to construct a valid synthetic control. Under this framework, we establish an alternative identification strategy and corresponding estimation methods for synthetic controls and the treatment effect on the treated unit. Notably, unlike existing proximal synthetic control methods, which require two types of proxies for identification, ours relies on a single type of proxy, thus facilitating its practical relevance. Additionally, we adapt a conformal inference approach to perform inference about the treatment effect, obviating the need for a large number of post-treatment observations. Lastly, our framework can accommodate time-varying covariates and nonlinear models. We demonstrate the proposed approach in a simulation study and a real-world application.",
  "categories": [
    "stat.ME"
  ],
  "primary_category": "stat.ME",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16353",
  "pdf_url": "https://arxiv.org/pdf/2307.16353v4",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 27826590,
  "size_after_bytes": 11356879
}