{
  "title": "Around the GLOBE: Numerical Aggregation Question-Answering on Heterogeneous Genealogical Knowledge Graphs with Deep Neural Networks",
  "authors": [
    "Omri Suissa",
    "Maayan Zhitomirsky-Geffet",
    "Avshalom Elmalech"
  ],
  "submission_date": "2023-07-30T12:09:00+00:00",
  "revised_dates": [],
  "abstract": "One of the key AI tools for textual corpora exploration is natural language question-answering (QA). Unlike keyword-based search engines, QA algorithms receive and process natural language questions and produce precise answers to these questions, rather than long lists of documents that need to be manually scanned by the users. State-of-the-art QA algorithms based on DNNs were successfully employed in various domains. However, QA in the genealogical domain is still underexplored, while researchers in this field (and other fields in humanities and social sciences) can highly benefit from the ability to ask questions in natural language, receive concrete answers and gain insights hidden within large corpora. While some research has been recently conducted for factual QA in the genealogical domain, to the best of our knowledge, there is no previous research on the more challenging task of numerical aggregation QA (i.e., answering questions combining aggregation functions, e.g., count, average, max). Numerical aggregation QA is critical for distant reading and analysis for researchers (and the general public) interested in investigating cultural heritage domains. Therefore, in this study, we present a new end-to-end methodology for numerical aggregation QA for genealogical trees that includes: 1) an automatic method for training dataset generation; 2) a transformer-based table selection method, and 3) an optimized transformer-based numerical aggregation QA model. The findings indicate that the proposed architecture, GLOBE, outperforms the state-of-the-art models and pipelines by achieving 87% accuracy for this task compared to only 21% by current state-of-the-art models. This study may have practical implications for genealogical information centers and museums, making genealogical data research easy and scalable for experts as well as the general public.",
  "categories": [
    "cs.CL",
    "cs.AI",
    "cs.IR",
    "cs.LG"
  ],
  "primary_category": "cs.CL",
  "doi": "10.1145/3586081",
  "journal_ref": null,
  "arxiv_id": "2307.16208",
  "pdf_url": "https://arxiv.org/pdf/2307.16208v1",
  "comment": "ACM Journal on Computing and Cultural Heritage (2023)",
  "num_versions": null,
  "size_before_bytes": 1042616,
  "size_after_bytes": 645639
}