{
  "title": "Micron-size spatial superpositions for the QGEM-protocol via screening and trapping",
  "authors": [
    "Martine Schut",
    "Andrew Geraci",
    "Sougato Bose",
    "Anupam Mazumdar"
  ],
  "submission_date": "2023-07-28T18:00:18+00:00",
  "revised_dates": [
    "2023-12-18T00:06:51+00:00"
  ],
  "abstract": "The quantum gravity-induced entanglement of masses (QGEM) protocol for testing quantum gravity using entanglement witnessing utilizes the creation of spatial quantum superpositions of two neutral, massive matter-wave interferometers kept adjacent to each other, separated by a distance d. The mass and the spatial superposition should be such that the two quantum systems can entangle solely via the quantum nature of gravity. Despite being charge-neutral, there are many electromagnetic backgrounds that can also entangle the systems, such as the dipole-dipole interaction, and the Casimir-Polder interaction. To minimize electromagnetic-induced interactions between the masses it is pertinent to isolate the two superpositions by a conducting plate. However, the conducting plate will also exert forces on the masses and hence the trajectories of the two superpositions would be affected. To minimize this effect, we propose to trap the two interferometers such that the trapping potential dominates over the attraction between the conducting plate and the matter-wave interferometers. The superpositions can still be created via the Stern-Gerlach effect in the direction parallel to the plate, where the trapping potential is negligible. The combination of trapping and shielding provides a better parameter space for the parallel configuration of the experiment, where the requirement on the size of the spatial superposition, to witness the entanglement between the two masses purely due to their quantum nature of gravity, decreases by at least two orders of magnitude as compared to the original protocol paper.",
  "categories": [
    "quant-ph",
    "gr-qc"
  ],
  "primary_category": "quant-ph",
  "doi": "10.1103/PhysRevResearch.6.013199",
  "journal_ref": "Phys.Rev.Res. 6 (2024) 1, 013199",
  "arxiv_id": "2307.15743",
  "pdf_url": "https://arxiv.org/pdf/2307.15743v2",
  "comment": "Version accepted to PRR",
  "num_versions": null,
  "size_before_bytes": 6327146,
  "size_after_bytes": 236588
}