{
  "title": "Information-based Preprocessing of PLC Data for Automatic Behavior Modeling",
  "authors": [
    "Brandon K. Sai",
    "Jonas Gram",
    "Thomas Bauernhansl"
  ],
  "submission_date": "2023-07-28T08:54:49+00:00",
  "revised_dates": [
    "2024-01-15T10:31:17+00:00"
  ],
  "abstract": "Cyber-physical systems (CPS) offer immense optimization potential for manufacturing processes through the availability of multivariate time series data of actors and sensors. Based on automated analysis software, the deployment of adaptive and responsive measures is possible for time series data. Due to the complex and dynamic nature of modern manufacturing, analysis and modeling often cannot be entirely automated. Even machine- or deep learning approaches often depend on a priori expert knowledge and labelling. In this paper, an information-based data preprocessing approach is proposed. By applying statistical methods including variance and correlation analysis, an approximation of the sampling rate in event-based systems and the utilization of spectral analysis, knowledge about the underlying manufacturing processes can be gained prior to modeling. The paper presents, how statistical analysis enables the pruning of a dataset's least important features and how the sampling rate approximation approach sets the base for further data analysis and modeling. The data's underlying periodicity, originating from the cyclic nature of an automated manufacturing process, will be detected by utilizing the fast Fourier transform. This information-based preprocessing method will then be validated for process time series data of cyber-physical systems' programmable logic controllers (PLC).",
  "categories": [
    "eess.SY",
    "cs.CE",
    "stat.ME"
  ],
  "primary_category": "eess.SY",
  "doi": "10.1016/j.procir.2023.09.038",
  "journal_ref": "Information-based Preprocessing of PLC Data for Automatic Behavior Modeling, Procedia CIRP, Volume 120, 2023, Pages 565-571, ISSN 2212-8271",
  "arxiv_id": "2307.15404",
  "pdf_url": "https://arxiv.org/pdf/2307.15404v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1562681,
  "size_after_bytes": 916810
}