{
  "title": "DFR-Net: Density Feature Refinement Network for Image Dehazing Utilizing Haze Density Difference",
  "authors": [
    "Zhongze Wang",
    "Haitao Zhao",
    "Lujian Yao",
    "Jingchao Peng",
    "Kaijie Zhao"
  ],
  "submission_date": "2023-07-26T02:53:29+00:00",
  "revised_dates": [],
  "abstract": "In image dehazing task, haze density is a key feature and affects the performance of dehazing methods. However, some of the existing methods lack a comparative image to measure densities, and others create intermediate results but lack the exploitation of their density differences, which can facilitate perception of density. To address these deficiencies, we propose a density-aware dehazing method named Density Feature Refinement Network (DFR-Net) that extracts haze density features from density differences and leverages density differences to refine density features. In DFR-Net, we first generate a proposal image that has lower overall density than the hazy input, bringing in global density differences. Additionally, the dehazing residual of the proposal image reflects the level of dehazing performance and provides local density differences that indicate localized hard dehazing or high density areas. Subsequently, we introduce a Global Branch (GB) and a Local Branch (LB) to achieve density-awareness. In GB, we use Siamese networks for feature extraction of hazy inputs and proposal images, and we propose a Global Density Feature Refinement (GDFR) module that can refine features by pushing features with different global densities further away. In LB, we explore local density features from the dehazing residuals between hazy inputs and proposal images and introduce an Intermediate Dehazing Residual Feedforward (IDRF) module to update local features and pull them closer to clear image features. Sufficient experiments demonstrate that the proposed method achieves results beyond the state-of-the-art methods on various datasets.",
  "categories": [
    "cs.CV"
  ],
  "primary_category": "cs.CV",
  "doi": "10.1109/TMM.2024.3369979",
  "journal_ref": null,
  "arxiv_id": "2307.13927",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 14858996,
  "size_after_bytes": 905183
}