{
  "title": "Circuit decompositions and scheduling for neutral atom devices with limited local addressability",
  "authors": [
    "Natalia Nottingham",
    "Michael A. Perlin",
    "Dhirpal Shah",
    "Ryan White",
    "Hannes Bernien",
    "Frederic T. Chong",
    "Jonathan M. Baker"
  ],
  "submission_date": "2023-07-27T16:47:13+00:00",
  "revised_dates": [
    "2024-09-23T15:51:30+00:00"
  ],
  "abstract": "Despite major ongoing advancements in neutral atom hardware technology, there remains limited work in systems-level software tailored to overcoming the challenges of neutral atom quantum computers. In particular, most current neutral atom architectures do not natively support local addressing of single-qubit rotations about an axis in the xy-plane of the Bloch sphere. Instead, these are executed via global beams applied simultaneously to all qubits. While previous neutral atom experimental work has used straightforward synthesis methods to convert short sequences of operations into this native gate set, these methods cannot be incorporated into a systems-level framework nor applied to entire circuits without imposing impractical amounts of serialization. Without sufficient compiler optimizations, decompositions involving global gates will significantly increase circuit depth, gate count, and accumulation of errors. No prior compiler work has addressed this, and adapting existing compilers to solve this problem is nontrivial.\n  In this paper, we present an optimized compiler pipeline that translates an input circuit from an arbitrary gate set into a realistic neutral atom native gate set containing global gates. We focus on decomposition and scheduling passes that minimize the final circuit's global gate count and total global rotation amount. As we show, these costs contribute the most to the circuit's duration and overall error, relative to costs incurred by other gate types. Compared to the unoptimized version of our compiler pipeline, minimizing global gate costs gives up to 4.77x speedup in circuit duration. Compared to the closest prior existing work, we achieve up to 53.8x speedup. For large circuits, we observe a few orders of magnitude improvement in circuit fidelities.",
  "categories": [
    "quant-ph",
    "cs.AR",
    "cs.ET"
  ],
  "primary_category": "quant-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14996",
  "pdf_url": "https://arxiv.org/pdf/2307.14996v2",
  "comment": "12 pages, 9 figures, published in IEEE International Conference on Quantum Computing and Engineering (QCE) 2024",
  "num_versions": null,
  "size_before_bytes": 11042854,
  "size_after_bytes": 767522
}