{
  "title": "Locked Polyomino Tilings",
  "authors": [
    "Jamie Tucker-Foltz"
  ],
  "submission_date": "2023-07-29T14:44:28+00:00",
  "revised_dates": [
    "2023-09-30T05:08:42+00:00",
    "2023-12-02T05:57:56+00:00",
    "2024-12-10T04:44:26+00:00"
  ],
  "abstract": "A locked $t$-omino tiling is a grid tiling by $t$-ominoes such that, if you remove any pair of tiles, the only way to fill in the remaining $2t$ grid cells with $t$-ominoes is to use the same two tiles in the exact same configuration as before. We exclude degenerate cases where there is only one tiling overall due to small dimensions. It is a classic (and straightforward) result that finite grids do not admit locked 2-omino tilings. In this paper, we construct explicit locked $t$-omino tilings for $t \\geq 3$ on grids of various dimensions. Most notably, we show that locked 3- and 4-omino tilings exist on finite square grids of arbitrarily large size, and locked $t$-omino tilings of the infinite grid exist for arbitrarily large $t$. The result for 4-omino tilings in particular is remarkable because they are so rare and difficult to construct: Only a single tiling is known to exist on any grid up to size $40 \\times 40$. In a weighted version of the problem where vertices of the grid may have weights from the set $\\{1, 2\\}$ that count toward the total tile size, we demonstrate the existence of locked tilings on arbitrarily large square weighted grids with only 6 tiles.\n  Locked $t$-omino tilings arise as obstructions to widely used political redistricting algorithms in a model of redistricting where the underlying census geography is a grid graph. Most prominent is the ReCom Markov chain, which takes a random walk on the space of redistricting plans by iteratively merging and splitting pairs of districts (tiles) at a time. Locked $t$-omino tilings are isolated states in the state space of ReCom. The constructions in this paper are counterexamples to the meta-conjecture that ReCom is irreducible on graphs of practical interest.",
  "categories": [
    "math.CO",
    "cs.DM"
  ],
  "primary_category": "math.CO",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15996",
  "pdf_url": "https://arxiv.org/pdf/2307.15996v4",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 2840103,
  "size_after_bytes": 187852
}