{
  "title": "Fermionic condensate and the mean energy-momentum tensor in the Fulling-Rindler vacuum",
  "authors": [
    "S. Bellucci",
    "V. Kh. Kotanjyan",
    "A. A. Saharian"
  ],
  "submission_date": "2023-07-24T13:59:08+00:00",
  "revised_dates": [
    "2023-11-17T01:14:21+00:00"
  ],
  "abstract": "We investigate the properties of the fermionic Fulling-Rindler vacuum for a massive Dirac field in a general number of spatial dimensions. As important local characteristics, the fermionic condensate and the expectation value of the energy-momentum tensor are evaluated. The renormalization is reduced to the subtraction of the corresponding expectation values for the Minkowski vacuum. It is shown that the fermion condensate vanishes for a massless field and is negative for nonzero mass. Unlike the case of scalar fields, the fermionic vacuum stresses are isotropic for general case of massive fields. The energy density and the pressures are negative. For a massless field the corresponding spectral distributions exhibit thermal properties with the standard Unruh temperature. However, the density-of-states factor is not Planckian for general number of spatial dimensions. Another interesting feature is that the thermal distribution is of the Bose-Einstein type in even number of spatial dimensions. This feature has been observed previously in the response of a particle detector uniformly accelerating through the Minkowski vacuum. In an even number of space dimensions the fermion condensate and the mean energy-momentum tensor coincide for the fields realizing two inequivalent irreducible representations of the Clifford algebra. In the massless case, we consider also the vacuum energy-momentum tensor for Dirac fields in the conformal vacuum of the Milne universe, in static open universe and in the hyperbolic vacuum of de Sitter spacetime.",
  "categories": [
    "hep-th",
    "gr-qc",
    "quant-ph"
  ],
  "primary_category": "hep-th",
  "doi": "10.1103/PhysRevD.108.085014",
  "journal_ref": "Phys. Rev. D 108 (2023) 085014",
  "arxiv_id": "2307.12809",
  "pdf_url": null,
  "comment": "28 pages, 5 figures, Discussion added",
  "num_versions": null,
  "size_before_bytes": 1001977,
  "size_after_bytes": 225638
}