{
  "title": "Utilisation of open intent recognition models for customer support intent detection",
  "authors": [
    "Rasheed Mohammad",
    "Oliver Favell",
    "Shariq Shah",
    "Emmett Cooper",
    "Edlira Vakaj"
  ],
  "submission_date": "2023-07-31T10:20:16+00:00",
  "revised_dates": [],
  "abstract": "Businesses have sought out new solutions to provide support and improve customer satisfaction as more products and services have become interconnected digitally. There is an inherent need for businesses to provide or outsource fast, efficient and knowledgeable support to remain competitive. Support solutions are also advancing with technologies, including use of social media, Artificial Intelligence (AI), Machine Learning (ML) and remote device connectivity to better support customers. Customer support operators are trained to utilise these technologies to provide better customer outreach and support for clients in remote areas. Interconnectivity of products and support systems provide businesses with potential international clients to expand their product market and business scale. This paper reports the possible AI applications in customer support, done in collaboration with the Knowledge Transfer Partnership (KTP) program between Birmingham City University and a company that handles customer service systems for businesses outsourcing customer support across a wide variety of business sectors. This study explored several approaches to accurately predict customers' intent using both labelled and unlabelled textual data. While some approaches showed promise in specific datasets, the search for a single, universally applicable approach continues. The development of separate pipelines for intent detection and discovery has led to improved accuracy rates in detecting known intents, while further work is required to improve the accuracy of intent discovery for unknown intents.",
  "categories": [
    "cs.CL"
  ],
  "primary_category": "cs.CL",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16544",
  "pdf_url": "https://arxiv.org/pdf/2307.16544v1",
  "comment": "9 pages, 3 figures, conference",
  "num_versions": null,
  "size_before_bytes": 380535,
  "size_after_bytes": 229078
}