{
  "title": "Collaborative Graph Neural Networks for Attributed Network Embedding",
  "authors": [
    "Qiaoyu Tan",
    "Xin Zhang",
    "Xiao Huang",
    "Hao Chen",
    "Jundong Li",
    "Xia Hu"
  ],
  "submission_date": "2023-07-22T04:52:27+00:00",
  "revised_dates": [],
  "abstract": "Graph neural networks (GNNs) have shown prominent performance on attributed network embedding. However, existing efforts mainly focus on exploiting network structures, while the exploitation of node attributes is rather limited as they only serve as node features at the initial layer. This simple strategy impedes the potential of node attributes in augmenting node connections, leading to limited receptive field for inactive nodes with few or even no neighbors. Furthermore, the training objectives (i.e., reconstructing network structures) of most GNNs also do not include node attributes, although studies have shown that reconstructing node attributes is beneficial. Thus, it is encouraging to deeply involve node attributes in the key components of GNNs, including graph convolution operations and training objectives. However, this is a nontrivial task since an appropriate way of integration is required to maintain the merits of GNNs. To bridge the gap, in this paper, we propose COllaborative graph Neural Networks--CONN, a tailored GNN architecture for attribute network embedding. It improves model capacity by 1) selectively diffusing messages from neighboring nodes and involved attribute categories, and 2) jointly reconstructing node-to-node and node-to-attribute-category interactions via cross-correlation. Experiments on real-world networks demonstrate that CONN excels state-of-the-art embedding algorithms with a great margin.",
  "categories": [
    "cs.LG",
    "cs.IR",
    "cs.SI"
  ],
  "primary_category": "cs.LG",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11981",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 644019,
  "size_after_bytes": 408197
}