{
  "title": "Flat-sky Angular Power Spectra Revisited",
  "authors": [
    "Zucheng Gao",
    "Zvonimir Vlah",
    "Anthony Challinor"
  ],
  "submission_date": "2023-07-25T18:56:42+00:00",
  "revised_dates": [
    "2025-04-16T00:51:28+00:00"
  ],
  "abstract": "We revisit the flat-sky approximation for evaluating the angular power spectra of projected random fields by retaining information about the correlations along the line of sight. With broad, overlapping radial window functions, these line-of-sight correlations are suppressed and are ignored in the Limber approximation. However, retaining the correlations is important for narrow window functions or unequal-time spectra but introduces significant computational difficulties due to the highly oscillatory nature of the integrands involved. We deal with the integral over line-of-sight wave-modes in the flat-sky approximation analytically, using the FFTlog expansion of the 3D power spectrum. This results in an efficient computational method, which is a substantial improvement compared to any full-sky approaches. We apply our results to galaxy clustering (with and without redshift-space distortions), CMB lensing and galaxy lensing observables. For clustering, we find excellent agreement with the full-sky results on large (percent-level agreement) and intermediate or small (subpercent agreement) scales, dramatically out-performing the Limber approximation for both wide and narrow window functions, and in equal- and unequal-time cases. In the case of lensing, we show on the full sky that the angular power spectrum of the convergence can be very well approximated by projecting the 3D Laplacian (rather than the correct angular Laplacian) of the gravitational potential, even on large scales. Combining this approximation with our flat-sky techniques provides an efficient and accurate evaluation of the CMB lensing angular power spectrum on all scales.",
  "categories": [
    "astro-ph.CO"
  ],
  "primary_category": "astro-ph.CO",
  "doi": "10.1088/1475-7516/2024/02/003",
  "journal_ref": null,
  "arxiv_id": "2307.13768",
  "pdf_url": null,
  "comment": "37 pages, 14 figures. Accepted JCAP",
  "num_versions": null,
  "size_before_bytes": 7835935,
  "size_after_bytes": 336273
}