{
  "title": "Blockchain-empowered Federated Learning for Healthcare Metaverses: User-centric Incentive Mechanism with Optimal Data Freshness",
  "authors": [
    "Jiawen Kang",
    "Jinbo Wen",
    "Dongdong Ye",
    "Bingkun Lai",
    "Tianhao Wu",
    "Zehui Xiong",
    "Jiangtian Nie",
    "Dusit Niyato",
    "Yang Zhang",
    "Shengli Xie"
  ],
  "submission_date": "2023-07-29T12:54:03+00:00",
  "revised_dates": [],
  "abstract": "Given the revolutionary role of metaverses, healthcare metaverses are emerging as a transformative force, creating intelligent healthcare systems that offer immersive and personalized services. The healthcare metaverses allow for effective decision-making and data analytics for users. However, there still exist critical challenges in building healthcare metaverses, such as the risk of sensitive data leakage and issues with sensing data security and freshness, as well as concerns around incentivizing data sharing. In this paper, we first design a user-centric privacy-preserving framework based on decentralized Federated Learning (FL) for healthcare metaverses. To further improve the privacy protection of healthcare metaverses, a cross-chain empowered FL framework is utilized to enhance sensing data security. This framework utilizes a hierarchical cross-chain architecture with a main chain and multiple subchains to perform decentralized, privacy-preserving, and secure data training in both virtual and physical spaces. Moreover, we utilize Age of Information (AoI) as an effective data-freshness metric and propose an AoI-based contract theory model under Prospect Theory (PT) to motivate sensing data sharing in a user-centric manner. This model exploits PT to better capture the subjective utility of the service provider. Finally, our numerical results demonstrate the effectiveness of the proposed schemes for healthcare metaverses.",
  "categories": [
    "cs.GT",
    "cs.DC",
    "cs.LG"
  ],
  "primary_category": "cs.GT",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15975",
  "pdf_url": "https://arxiv.org/pdf/2307.15975v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 5539785,
  "size_after_bytes": 123512
}