{
  "title": "Correlation Functions of Huge Operators in AdS$_3$/CFT$_2$: Domes, Doors and Book Pages",
  "authors": [
    "Jacob Abajian",
    "Francesco Aprile",
    "Robert C. Myers",
    "Pedro Vieira"
  ],
  "submission_date": "2023-07-25T00:47:27+00:00",
  "revised_dates": [],
  "abstract": "We describe solutions of asymptotically AdS$_3$ Einstein gravity that are sourced by the insertion of operators in the boundary CFT$_2$, whose dimension scales with the central charge of the theory. Previously, we found that the geometry corresponding to a black hole two-point function is simply related to an infinite covering of the Euclidean BTZ black hole. However, here we find that the geometry sourced by the presence of a third black hole operator turns out to be a Euclidean wormhole with two asymptotic boundaries. We construct this new geometry as a quotient of empty AdS$_3$ realized by domes and doors. The doors give access to the infinite covers that are needed to describe the insertion of the operators, while the domes describe the fundamental domains of the quotient on each cover. In particular, despite the standard fact that the Fefferman-Graham expansion is single-sided, the extended bulk geometry contains a wormhole that connects two asymptotic boundaries. We observe that the two-sided wormhole can be made single-sided by cutting off the wormhole and gluing on a \"Lorentzian cap\". In this way, the geometry gives the holographic description of a three-point function, up to phases. By rewriting the metric in terms of a Liouville field, we compute the on-shell action and find that the result matches with the Heavy-Heavy-Heavy three-point function predicted by the modular bootstrap. Finally, we describe the geometric transition between doors and defects, that is, when one or more dual operators describe a conical defect insertion, rather than a black hole insertion.",
  "categories": [
    "hep-th",
    "gr-qc"
  ],
  "primary_category": "hep-th",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13188",
  "pdf_url": null,
  "comment": "45 pages, 21 figures",
  "num_versions": null,
  "size_before_bytes": 15458958,
  "size_after_bytes": 157490
}