{
  "title": "MUSE-ALMA Haloes IX: Morphologies and Stellar Properties of Gas-rich Galaxies",
  "authors": [
    "Arjun Karki",
    "Varsha P. Kulkarni",
    "Simon Weng",
    "Céline Péroux",
    "Ramona Augustin",
    "Matthew Hayes",
    "Mohammadreza Ayromlou",
    "Glenn G. Kacprzak",
    "J. Christopher Howk",
    "Roland Szakacs",
    "Anne Klitsch",
    "Aleksandra Hamanowicz",
    "Alejandra Fresco",
    "Martin A. Zwaan",
    "Andrew D. Biggs",
    "Andrew J. Fox",
    "Susan Kassin",
    "Harald Kuntschner"
  ],
  "submission_date": "2023-07-21T17:30:05+00:00",
  "revised_dates": [],
  "abstract": "Understanding how galaxies interact with the circumgalactic medium (CGM) requires determining how galaxies morphological and stellar properties correlate with their CGM properties. We report an analysis of 66 well-imaged galaxies detected in HST and VLT MUSE observations and determined to be within $\\pm$500 km s$^{-1}$ of the redshifts of strong intervening quasar absorbers at $0.2 \\lesssim z \\lesssim 1.4$ with H I column densities $N_{\\rm H I}$ $>$ $10^{18}$ $\\rm cm^{-2}$. We present the geometrical properties (Sérsic indices, effective radii, axis ratios, and position angles) of these galaxies determined using GALFIT. Using these properties along with star formation rates (SFRs, estimated using the H$α$ or [O II] luminosity) and stellar masses ($M_{*}$ estimated from spectral energy distribution fits), we examine correlations among various stellar and CGM properties. Our main findings are as follows: (1) SFR correlates well with $M_{*}$, and most absorption-selected galaxies are consistent with the star formation main sequence (SFMS) of the global population. (2) More massive absorber counterparts are more centrally concentrated and are larger in size. (3) Galaxy sizes and normalized impact parameters correlate negatively with $N_{\\rm H I}$, consistent with higher $N_{\\rm H I}$ absorption arising in smaller galaxies, and closer to galaxy centers. (4) Absorption and emission metallicities correlate with $M_{*}$ and sSFR, implying metal-poor absorbers arise in galaxies with low past star formation and faster current gas consumption rates. (5) SFR surface densities of absorption-selected galaxies are higher than predicted by the Kennicutt-Schmidt relation for local galaxies, suggesting a higher star formation efficiency in the absorption-selected galaxies.",
  "categories": [
    "astro-ph.GA",
    "physics.app-ph",
    "physics.space-ph"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.1093/mnras/stad2134",
  "journal_ref": null,
  "arxiv_id": "2307.11721",
  "pdf_url": null,
  "comment": "Accepted for publication in MNRAS, 25 pages, 19 figures",
  "num_versions": null,
  "size_before_bytes": 8689638,
  "size_after_bytes": 405462
}