{
  "title": "Explaining Full-disk Deep Learning Model for Solar Flare Prediction using Attribution Methods",
  "authors": [
    "Chetraj Pandey",
    "Rafal A. Angryk",
    "Berkay Aydin"
  ],
  "submission_date": "2023-07-29T03:18:56+00:00",
  "revised_dates": [],
  "abstract": "This paper contributes to the growing body of research on deep learning methods for solar flare prediction, primarily focusing on highly overlooked near-limb flares and utilizing the attribution methods to provide a post hoc qualitative explanation of the model's predictions. We present a solar flare prediction model, which is trained using hourly full-disk line-of-sight magnetogram images and employs a binary prediction mode to forecast $\\geq$M-class flares that may occur within the following 24-hour period. To address the class imbalance, we employ a fusion of data augmentation and class weighting techniques; and evaluate the overall performance of our model using the true skill statistic (TSS) and Heidke skill score (HSS). Moreover, we applied three attribution methods, namely Guided Gradient-weighted Class Activation Mapping, Integrated Gradients, and Deep Shapley Additive Explanations, to interpret and cross-validate our model's predictions with the explanations. Our analysis revealed that full-disk prediction of solar flares aligns with characteristics related to active regions (ARs). In particular, the key findings of this study are: (1) our deep learning models achieved an average TSS=0.51 and HSS=0.35, and the results further demonstrate a competent capability to predict near-limb solar flares and (2) the qualitative analysis of the model explanation indicates that our model identifies and uses features associated with ARs in central and near-limb locations from full-disk magnetograms to make corresponding predictions. In other words, our models learn the shape and texture-based characteristics of flaring ARs even at near-limb areas, which is a novel and critical capability with significant implications for operational forecasting.",
  "categories": [
    "cs.LG",
    "astro-ph.SR"
  ],
  "primary_category": "cs.LG",
  "doi": "10.1007/978-3-031-43430-3_5",
  "journal_ref": null,
  "arxiv_id": "2307.15878",
  "pdf_url": "https://arxiv.org/pdf/2307.15878v1",
  "comment": "19 pages, 7 figures, Preprint accepted at European Conference on Machine Learning and Principles and Practice of Knowledge Discovery in Databases (ECML-PKDD) 2023",
  "num_versions": null,
  "size_before_bytes": 5526787,
  "size_after_bytes": 170603
}