{
  "title": "General relativistic pulsations of ultra-massive ZZ Ceti stars",
  "authors": [
    "Alejandro H. Córsico",
    "S. Reece Boston",
    "Leandro G. Althaus",
    "Mukremin Kilic",
    "S. O. Kepler",
    "María E. Camisassa",
    "Santiago Torres"
  ],
  "submission_date": "2023-07-21T18:06:57+00:00",
  "revised_dates": [],
  "abstract": "Ultra-massive white dwarf stars are currently being discovered at a considerable rate, thanks to surveys such as the {\\it Gaia} space mission. These dense and compact stellar remnants likely play a major role in type Ia supernova explosions. It is possible to probe the interiors of ultra-massive white dwarfs through asteroseismology. In the case of the most massive white dwarfs, General Relativity could affect their structure and pulsations substantially. In this work, we present results of relativistic pulsation calculations employing relativistic ultra-massive ONe-core white dwarf models with hydrogen-rich atmospheres and masses ranging from $1.29$ to $1.369 M_{\\odot}$ with the aim of assessing the impact of General Relativity on the adiabatic gravity ($g$)-mode period spectrum of very-high mass ZZ Ceti stars. Employing the relativistic Cowling approximation for the pulsation analysis, we find that the critical buoyancy (Brunt-Väisälä) and acoustic (Lamb) frequencies are larger for the relativistic case, compared to the Newtonian case, due to the relativistic white dwarf models having smaller radii and higher gravities for a fixed stellar mass. In addition, the $g$-mode periods are shorter in the relativistic case than in the Newtonian computations, with relative differences of up to $\\sim 50$ \\% for the highest-mass models ($1.369 M_{\\odot}$) and for effective temperatures typical of the ZZ Ceti instability strip. Hence, the effects of General Relativity on the structure, evolution, and pulsations of white dwarfs with masses larger than $\\sim 1.29 M_{\\odot}$ cannot be ignored in the asteroseismological analysis of ultra-massive ZZ Ceti stars.",
  "categories": [
    "astro-ph.SR",
    "astro-ph.HE",
    "gr-qc"
  ],
  "primary_category": "astro-ph.SR",
  "doi": "10.1093/mnras/stad2248",
  "journal_ref": null,
  "arxiv_id": "2307.11834",
  "pdf_url": null,
  "comment": "15 pages, 21 figures, 2 tables. Accepted for publication in MNRAS",
  "num_versions": null,
  "size_before_bytes": 1579030,
  "size_after_bytes": 103532
}