{
  "title": "Limiting Moments of Autocorrelation Demerit Factors of Binary Sequences",
  "authors": [
    "Daniel J. Katz",
    "Miriam E. Ramirez"
  ],
  "submission_date": "2023-07-27T00:58:11+00:00",
  "revised_dates": [
    "2024-04-27T17:40:59+00:00",
    "2024-06-11T17:28:02+00:00",
    "2024-10-21T16:00:49+00:00"
  ],
  "abstract": "Various problems in engineering and natural science demand binary sequences that do not resemble translates of themselves, that is, the sequences must have small aperiodic autocorrelation at every nonzero shift. If $f$ is a sequence, then the demerit factor of $f$ is the sum of the squared magnitudes of the autocorrelations at all nonzero shifts for the sequence obtained by normalizing $f$ to unit Euclidean norm. The demerit factor is the reciprocal of Golay's merit factor, and low demerit factor indicates low self-similarity of a sequence under translation. We endow the $2^\\ell$ binary sequences of length $\\ell$ with uniform probability measure and consider the distribution of their demerit factors. Earlier works used combinatorial techniques to find exact formulas for the mean, variance, skewness, and kurtosis of the distribution as a function of $\\ell$. These revealed that for $\\ell \\geq 4$, the $p$th central moment of this distribution is strictly positive for every $p \\geq 2$. This article shows that for every $p$, the $p$th central moment is $\\ell^{-2 p}$ times a quasi-polynomial function of $\\ell$ with rational coefficients. It also shows that, in the limit as $\\ell$ tends to infinity, the $p$th standardized moment is the same as that of the standard normal distribution.",
  "categories": [
    "cs.IT",
    "cs.DM",
    "eess.SP",
    "math.CO",
    "math.PR"
  ],
  "primary_category": "cs.IT",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14566",
  "pdf_url": "https://arxiv.org/pdf/2307.14566v4",
  "comment": "28 pages",
  "num_versions": null,
  "size_before_bytes": 324546,
  "size_after_bytes": 329202
}