{
  "title": "The impact of cosmic rays on the interstellar medium and galactic outflows of Milky Way analogues",
  "authors": [
    "Francisco Rodríguez Montero",
    "Sergio Martin-Alvarez",
    "Adrianne Slyz",
    "Julien Devriendt",
    "Yohan Dubois",
    "Debora Sijacki"
  ],
  "submission_date": "2023-07-25T18:00:04+00:00",
  "revised_dates": [],
  "abstract": "During the last decade, cosmological simulations have managed to reproduce realistic and morphologically diverse galaxies, spanning the Hubble sequence. Central to this success was a phenomenological calibration of the few included feedback processes, whilst glossing over higher complexity baryonic physics. This approach diminishes the predictive power of such simulations, preventing to further our understanding of galaxy formation. To tackle this fundamental issue, we investigate the impact of cosmic rays (CRs) and magnetic fields on the interstellar medium (ISM) and the launching of outflows in a cosmological zoom-in simulation of a Milky Way-like galaxy. We find that including CRs decreases the stellar mass of the galaxy by a factor of 10 at high redshift and $\\sim 4$ at cosmic noon, leading to a stellar mass to halo mass ratio in good agreement with abundance matching models. Such decrease is caused by two effects: i) a reduction of cold, high-density, star-forming gas, and ii) a larger fraction of SN events exploding at lower densities, where they have a higher impact. SN-injected CRs produce enhanced, multi-phase galactic outflows, which are accelerated by CR pressure gradients in the circumgalactic medium of the galaxy. While the mass budget of these outflows is dominated by the warm ionised gas, warm neutral and cold gas phases contribute significantly at high redshifts. Importantly, our work shows that future JWST observations of galaxies and their multi-phase outflows across cosmic time have the ability to constrain the role of CRs in regulating star formation.",
  "categories": [
    "astro-ph.GA",
    "astro-ph.CO"
  ],
  "primary_category": "astro-ph.GA",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13733",
  "pdf_url": null,
  "comment": "20 pages, 11 figures, submitted MNRAS",
  "num_versions": null,
  "size_before_bytes": 13876675,
  "size_after_bytes": 1434232
}