{
  "title": "EFLNet: Enhancing Feature Learning for Infrared Small Target Detection",
  "authors": [
    "Bo Yang",
    "Xinyu Zhang",
    "Jian Zhang",
    "Jun Luo",
    "Mingliang Zhou",
    "Yangjun Pi"
  ],
  "submission_date": "2023-07-27T09:23:22+00:00",
  "revised_dates": [
    "2024-02-27T12:19:09+00:00"
  ],
  "abstract": "Single-frame infrared small target detection is considered to be a challenging task, due to the extreme imbalance between target and background, bounding box regression is extremely sensitive to infrared small target, and target information is easy to lose in the high-level semantic layer. In this article, we propose an enhancing feature learning network (EFLNet) to address these problems. First, we notice that there is an extremely imbalance between the target and the background in the infrared image, which makes the model pay more attention to the background features rather than target features. To address this problem, we propose a new adaptive threshold focal loss (ATFL) function that decouples the target and the background, and utilizes the adaptive mechanism to adjust the loss weight to force the model to allocate more attention to target features. Second, we introduce the normalized Gaussian Wasserstein distance (NWD) to alleviate the difficulty of convergence caused by the extreme sensitivity of the bounding box regression to infrared small target. Finally, we incorporate a dynamic head mechanism into the network to enable adaptive learning of the relative importance of each semantic layer. Experimental results demonstrate our method can achieve better performance in the detection performance of infrared small target compared to the state-of-the-art (SOTA) deep-learning-based methods. The source codes and bounding box annotated datasets are available at https://github.com/YangBo0411/infrared-small-target.",
  "categories": [
    "cs.CV"
  ],
  "primary_category": "cs.CV",
  "doi": "10.1109/TGRS.2024.3365677",
  "journal_ref": "IEEE Transactions on Geoscience and Remote Sensing 19 February 2024",
  "arxiv_id": "2307.14723",
  "pdf_url": "https://arxiv.org/pdf/2307.14723v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 73233864,
  "size_after_bytes": 807314
}