{
  "title": "Modification of charged-particle jets in event-shape engineered Pb$-$Pb collisions at $\\sqrt{s_{\\rm NN}} = 5.02$ TeV",
  "authors": [
    "ALICE Collaboration"
  ],
  "submission_date": "2023-07-26T10:50:04+00:00",
  "revised_dates": [
    "2024-04-15T00:51:46+00:00"
  ],
  "abstract": "Charged-particle jet yields have been measured in semicentral Pb$-$Pb collisions at center-of-mass energy per nucleon-nucleon collision $\\sqrt{s_{\\rm NN}} = 5.02$ TeV with the ALICE detector at the LHC. These yields are reported as a function of the jet transverse momentum, and further classified by their angle with respect to the event plane and the event shape, characterized by ellipticity, in an effort to study the path-length dependence of jet quenching. Jets were reconstructed at midrapidity from charged-particle tracks using the anti-$k_{\\rm T}$ algorithm with resolution parameters $R =$ 0.2 and 0.4, with event-plane angle and event-shape values determined using information from forward scintillating detectors. The results presented in this letter show that, in semicentral Pb$-$Pb collisions, there is no significant difference between jet yields in predominantly isotropic and elliptical events. However, out-of-plane jets are observed to be more suppressed than in-plane jets. Further, this relative suppression is greater for low transverse momentum ($<$ 50 GeV/$c$) $R =$ 0.2 jets produced in elliptical events, with out-of-plane to in-plane jet-yield ratios varying up to 5.2$σ$ between different event-shape classes. These results agree with previous studies indicating that jets experience azimuthally anisotropic suppression when traversing the QGP medium, and can provide additional constraints on the path-length dependence of jet energy loss.",
  "categories": [
    "nucl-ex",
    "hep-ex"
  ],
  "primary_category": "nucl-ex",
  "doi": "10.1016/j.physletb.2024.138584",
  "journal_ref": "Phys. Lett. B 851 (2024) 138584",
  "arxiv_id": "2307.14097",
  "pdf_url": null,
  "comment": "21 pages, 4 captioned figures, 2 tables, authors from page 15, published version, figures at http://alice-publications.web.cern.ch/node/9514",
  "num_versions": null,
  "size_before_bytes": 2937623,
  "size_after_bytes": 2357866
}