{
  "title": "Challenges in Cepheid Evolution and Pulsation Modeling",
  "authors": [
    "Joyce A. Guzik",
    "Jason Jackiewicz",
    "Nancy R. Evans"
  ],
  "submission_date": "2023-07-23T17:28:48+00:00",
  "revised_dates": [],
  "abstract": "Cepheids have long been used as standard candles to determine distances around the Milky Way and to nearby galaxies. A discrepancy still remains for Hubble Constant determinations using Cepheids vs. the cosmic microwave background or calibrations to the tip of the red-giant branch. Therefore, refinement of Cepheid period-luminosity relations continues to be an active topic of research.\n  Cepheids are also important laboratories for testing stellar physics. This paper explores outstanding questions in Cepheid evolution and pulsation modeling. We examine the discrepancy between Cepheid masses determined from pulsation properties and binary orbital dynamics and those determined using stellar evolution models. We review attempts to resolve the discrepancy by including rotation, convective overshooting, and mass loss. We review the impact of uncertainties in nuclear reaction rates on Cepheid evolution and the extent of blue loops in the Hertzsprung-Russell diagram. We consider implications for Cepheids of stellar opacity revisions suggested in light of findings for the Sun and other types of variable stars.\n  We apply the 1-D open-source MESA stellar evolution code and the MESA radial stellar pulsation (RSP) nonlinear hydrodynamics code to investigate changes in input physics for Cepheid models. We touch on progress in 2-D and 3-D stellar modeling applied to Cepheids. Additional areas in which Cepheid models are being tested against observations include: predicting the edges of the Cepheid pulsation instability strip; predicting period-change rates and implications for instability strip crossings; explaining period and amplitude modulations and periodicities that may be non-radial pulsation modes; discovering what can be learned from Cepheid observations in X-ray, ultraviolet, and radio wavelengths. We also show a few examples of Cepheid light curves from NASA TESS photometry.",
  "categories": [
    "astro-ph.SR"
  ],
  "primary_category": "astro-ph.SR",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12386",
  "pdf_url": null,
  "comment": "10 pages, 17 figures. Revised and updated version of conference proceedings submitted for 2023 Society for Astronomical Sciences Symposium on Telescope Science, June 22-24, 2023, eds. J.C. Martin, R.K. Buchheim, R.M. Gill, W. Green, and J. Menke",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}