{
  "title": "Recommendation Unlearning via Matrix Correction",
  "authors": [
    "Jiahao Liu",
    "Dongsheng Li",
    "Hansu Gu",
    "Tun Lu",
    "Jiongran Wu",
    "Peng Zhang",
    "Li Shang",
    "Ning Gu"
  ],
  "submission_date": "2023-07-29T11:36:38+00:00",
  "revised_dates": [],
  "abstract": "Recommender systems are important for providing personalized services to users, but the vast amount of collected user data has raised concerns about privacy (e.g., sensitive data), security (e.g., malicious data) and utility (e.g., toxic data). To address these challenges, recommendation unlearning has emerged as a promising approach, which allows specific data and models to be forgotten, mitigating the risks of sensitive/malicious/toxic user data. However, existing methods often struggle to balance completeness, utility, and efficiency, i.e., compromising one for the other, leading to suboptimal recommendation unlearning. In this paper, we propose an Interaction and Mapping Matrices Correction (IMCorrect) method for recommendation unlearning. Firstly, we reveal that many collaborative filtering (CF) algorithms can be formulated as mapping-based approach, in which the recommendation results can be obtained by multiplying the user-item interaction matrix with a mapping matrix. Then, IMCorrect can achieve efficient recommendation unlearning by correcting the interaction matrix and enhance the completeness and utility by correcting the mapping matrix, all without costly model retraining. Unlike existing methods, IMCorrect is a whitebox model that offers greater flexibility in handling various recommendation unlearning scenarios. Additionally, it has the unique capability of incrementally learning from new data, which further enhances its practicality. We conducted comprehensive experiments to validate the effectiveness of IMCorrect and the results demonstrate that IMCorrect is superior in completeness, utility, and efficiency, and is applicable in many recommendation unlearning scenarios.",
  "categories": [
    "cs.IR",
    "cs.LG"
  ],
  "primary_category": "cs.IR",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15960",
  "pdf_url": "https://arxiv.org/pdf/2307.15960v1",
  "comment": "14 pages, under review",
  "num_versions": null,
  "size_before_bytes": 1465425,
  "size_after_bytes": 405986
}