{
  "title": "Non-parametric Hypothesis Tests for Distributional Group Symmetry",
  "authors": [
    "Kenny Chiu",
    "Benjamin Bloem-Reddy"
  ],
  "submission_date": "2023-07-28T22:51:28+00:00",
  "revised_dates": [
    "2024-12-23T17:07:50+00:00"
  ],
  "abstract": "Symmetry plays a central role in the sciences, machine learning, and statistics. For situations in which data are known to obey a symmetry, a multitude of methods that exploit symmetry have been developed. Statistical tests for the presence or absence of general group symmetry, however, are largely non-existent. This work formulates non-parametric hypothesis tests, based on a single independent and identically distributed sample, for distributional symmetry under a specified group. We provide a general formulation of tests for symmetry that apply to two broad settings. The first setting tests for the invariance of a marginal or joint distribution under the action of a compact group. Here, an asymptotically unbiased test only requires a computable metric on the space of probability distributions and the ability to sample uniformly random group elements. Building on this, we propose an easy-to-implement conditional Monte Carlo test and prove that it achieves exact $p$-values with finitely many observations and Monte Carlo samples. The second setting tests for the invariance or equivariance of a conditional distribution under the action of a locally compact group. We show that the test for conditional invariance or equivariance can be formulated as particular tests of conditional independence. We implement these tests from both settings using kernel methods and study them empirically on synthetic data. Finally, we apply them to testing for symmetry in geomagnetic satellite data and in two problems from high-energy particle physics.",
  "categories": [
    "stat.ME",
    "stat.ML"
  ],
  "primary_category": "stat.ME",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15834",
  "pdf_url": "https://arxiv.org/pdf/2307.15834v2",
  "comment": "This article has been superseded by arXiv:2412.14391",
  "num_versions": null,
  "size_before_bytes": 1871336,
  "size_after_bytes": 501654
}