{
  "title": "Analytical framework for mutual approximations -- Derivation and application to Jovian satellites",
  "authors": [
    "M. Fayolle",
    "D. Dirkx",
    "P. N. A. M. Visser",
    "V. Lainey"
  ],
  "submission_date": "2023-07-29T12:57:54+00:00",
  "revised_dates": [],
  "abstract": "The apparent close encounters of two satellites in the plane of the sky, called mutual approximations, have been suggested as a different type of astrometric observation to refine the moons' ephemerides. The main observables are the central instants of the close encounters, which have the advantage of being free of any scaling and orientation errors. However, no analytical formulation is available yet for the partials of these central instants, leaving numerical approaches or alternative observables (e.g. derivatives of the apparent distance) as options. Filling that gap, this paper develops an analytical method to include central instants as direct observables in the ephemerides estimation and assesses the quality of the resulting solution. To this end, we ran a covariance analysis to compare the estimated solutions obtained with the two types of observables (central instants versus alternative observables), using the Galilean moons of Jupiter as a test case. Alternative observables can be equivalent to central instants in most cases. However, obtaining consistent solutions between the two observable types requires to accurately weigh each alternative observable individually, based on each mutual approximation's characteristics. In that case, using central instants still yields a small improvement of 10-20% of the formal errors in the radial and normal directions (RSW frame), compared to the alternative observables' solution. This improvement increases for mutual approximations with low impact parameters and large impact velocities. Choosing between the two observables thus requires careful assessment based on the characteristics of the available observations. Using central instants over alternative observables ensures that the state estimation fully benefits from the information encoded in mutual approximations, which can be desirable for certain applications.",
  "categories": [
    "astro-ph.EP",
    "astro-ph.IM"
  ],
  "primary_category": "astro-ph.EP",
  "doi": "10.1051/0004-6361/202141261",
  "journal_ref": "Astronomy & Astrophysics 652 (2021): A93",
  "arxiv_id": "2307.15976",
  "pdf_url": "https://arxiv.org/pdf/2307.15976v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 6986252,
  "size_after_bytes": 4429582
}