{
  "title": "Big Bang in Dipole Cosmology",
  "authors": [
    "A. Allahyari",
    "E. Ebrahimian",
    "R. Mondol",
    "M. M. Sheikh-Jabbari"
  ],
  "submission_date": "2023-07-28T20:09:07+00:00",
  "revised_dates": [
    "2025-01-19T08:55:49+00:00"
  ],
  "abstract": "We continue the study of dipole cosmology framework put forward in \\cite{Krishnan:2022qbv}, a beyond FLRW setting that has a preferred direction in the metric which may be associated with a cosmological tilt, a cosmic dipole. In this setup the shear and the tilt can be positive or negative given the dipole direction. We thoroughly analyze evolution of the universe in this setting, particularly focusing on the behaviour near the Big Bang (BB). We first analyze a single fluid model with a generic constant equation of state $w$. While details of the behavior near the BB depends on $w$ and the other initial conditions, we find that when the shear is negative we have a shear dominated BB singularity, whereas for a positive shear we have a much milder singularity, the whimper singularity \\cite{Ellis:1974ug}, at which the tilt blows up while curvature invariants remain finite. We then consider dipole $Λ$CDM model which besides the shear has two tilt parameters, one for radiation and one for the pressureless matter. For positive (negative) shear we again find whimper (curvature) singularity near the BB. Moreover, when the tilt parameters have opposite signs, the shear can change sign from negative to positive in the course of evolution of the Universe. We show that the relative tilt of the radiation and the matter generically remains sizable at late times.",
  "categories": [
    "astro-ph.CO",
    "gr-qc",
    "hep-th"
  ],
  "primary_category": "astro-ph.CO",
  "doi": "10.1140/epjc/s10052-025-13799-6",
  "journal_ref": "Eur. Phys. J. C 85, 119 (2025)",
  "arxiv_id": "2307.15791",
  "pdf_url": "https://arxiv.org/pdf/2307.15791v2",
  "comment": "35 pages, 15 figures, 2 tables",
  "num_versions": null,
  "size_before_bytes": 27530215,
  "size_after_bytes": 1572632
}