{
  "title": "Analyzing time series of unequal durations using Multidimensional Recurrence Quantification Analysis (MdRQA): validation and implementation using Python",
  "authors": [
    "Swarag Thaikkandi",
    "K. M. Sharika"
  ],
  "submission_date": "2023-07-21T16:28:04+00:00",
  "revised_dates": [
    "2023-07-25T00:46:34+00:00",
    "2023-08-11T00:25:11+00:00",
    "2023-08-14T00:08:48+00:00",
    "2023-08-16T00:21:10+00:00"
  ],
  "abstract": "In recent years, recurrent quantification analysis (RQA) and its multi-dimensional version (MdRQA) have emerged as a popular tool for assessing interpersonal behavioral or physiological synchrony in groups of two or more individuals. While experimental data in such studies are typically collected for a fixed, pre-determined duration, naturally occurring phenomena may often reach a state of transition after an unpredictable or varying duration of time. The resulting recurrence plots (RPs) across samples cannot be compared directly via linear scaling because the sensitivity of RQA variables to local dynamics would vary. We propose to address this by using the sliding window technique on individual RPs and using the summary statistics of the different RQA variable distributions computed across the sliding windows to differentiate the dynamics of the original time series of unequal durations. We first tested our approach in two simulated models: 1) the Rossler attractor and 2) the Kuramoto model. We compared the ability of different summary statistics of RQA variable distributions to accurately predict the dynamic states of the system across varying levels of noise, unequal lengths of time series, and, in the case of the Kuramoto model, different numbers of oscillators across samples. We found that the mode was the most robust to the degree of noise in the signals. We further tested and validated it on open access data from a recent study comparing spontaneously generated interpersonal movement synchrony in a dyad. To our knowledge, this is the first systematic attempt to validate the use of MdRQA in computing and comparing synchrony between systems of non-uniform composition and unequal time series data, paving the way for future work that examines interpersonal synchrony in more naturalistic, ecologically valid contexts.",
  "categories": [
    "q-bio.NC"
  ],
  "primary_category": "q-bio.NC",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11675",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 52187626,
  "size_after_bytes": 1492552
}