{
  "title": "Meson spectrum of $\\text{SU}(2)$ QCD$_{1+1}$ with Quarks in Large Representations",
  "authors": [
    "Anurag Kaushal",
    "Naveen S. Prabhakar",
    "Spenta R. Wadia"
  ],
  "submission_date": "2023-07-27T17:18:05+00:00",
  "revised_dates": [
    "2023-09-13T09:59:16+00:00",
    "2023-11-03T08:07:02+00:00"
  ],
  "abstract": "We consider $\\text{SU}(2)$ quantum chromodynamics in $1+1$ dimensions with a single quark in the spin $J$ representation of the gauge group and study the theory in the large $J$ limit where the gauge coupling $g^2 \\to 0$ and $J \\to \\infty$ with $λ= g^2 J^2$ fixed. We work with a Dirac spinor field for arbitrary $J$, and with a Majorana spinor for integer $J$ since the integer spin representations of $\\text{SU}(2)$ are real, and analyse the two cases separately.\n  The theory is reformulated in terms of global color non-singlet fermion bilocal operators which satisfy a $W_\\infty \\times \\text{U}(2J+1)$ algebra. In the large $J$ limit, the dynamics of the bilocal fields is captured by fluctuations along a particular coadjoint orbit of the $W_\\infty$ algebra. We show that the global colour-singlet sector of the bilocal field fluctuations satisfy the same integral equation for meson wavefunctions that appears in the 't Hooft model. For Majorana spinors in the integer spin $J$ representation, the Majorana condition projects out half of the meson spectrum, as a result of which the linear spacing of the asymptotic meson spectrum for Majorana fermions is double that of Dirac fermions. The Majorana condition also projects out the zero mass bound state that is present for the Dirac quark at zero quark mass.\n  We also consider the formulation of the model in terms of local charge densities and compute the quark spectral function in the large $J$ limit: we see evidence for the absence of a pole in the quark propagator.",
  "categories": [
    "hep-th"
  ],
  "primary_category": "hep-th",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15015",
  "pdf_url": "https://arxiv.org/pdf/2307.15015v3",
  "comment": "45 pages",
  "num_versions": null,
  "size_before_bytes": 438613,
  "size_after_bytes": 444733
}