{
  "title": "The nature of hypergraph $k$-core percolation problems",
  "authors": [
    "Ginestra Bianconi",
    "Sergey N. Dorogovtsev"
  ],
  "submission_date": "2023-07-28T06:51:01+00:00",
  "revised_dates": [
    "2023-11-09T16:54:11+00:00"
  ],
  "abstract": "Hypergraphs are higher-order networks that capture the interactions between two or more nodes. Hypergraphs can always be represented by factor graphs, i.e. bipartite networks between nodes and factor nodes (representing groups of nodes). Despite this universal representation, here we reveal that $k$-core percolation on hypergraphs can be significantly distinct from $k$-core percolation on factor graphs. We formulate the theory of hypergraph $k$-core percolation based on the assumption that a hyperedge can only be intact if all its nodes are intact. This scenario applies for instance to supply chains where the production of a product requires all raw materials and all processing steps; in biology it applies to protein-interaction networks where protein complexes can only function if all the proteins are present, and it applies as well to chemical reaction networks where a chemical reaction can take place only when all the reactants are present. Formulating a message-passing theory for hypergraph $k$-core percolation, and combining it with the theory of critical phenomena on networks we demonstrate sharp differences with previously studied factor graph $k$-core percolation processes where it is allowed for hyperedges to have one or more damaged nodes and still be intact. To solve the dichotomy between $k$-core percolation on hypergraphs and on factor graphs, we define a set of pruning processes that act either exclusively on nodes or exclusively on hyperedges and depend of their second-neighborhood connectivity. We show that the resulting second-neighbor $k$-core percolation problems are significantly distinct from each other. Moreover we reveal that although these processes remain distinct from factor graphs $k$-core processes, when the pruning process acts exclusively on hyperedges the phase diagram is reduced to the one of factor graph $k$-cores.",
  "categories": [
    "cond-mat.dis-nn",
    "cond-mat.stat-mech",
    "physics.soc-ph"
  ],
  "primary_category": "cond-mat.dis-nn",
  "doi": "10.1103/PhysRevE.109.014307",
  "journal_ref": "Phys. Rev. E 109, 014307 (2024)",
  "arxiv_id": "2307.15346",
  "pdf_url": "https://arxiv.org/pdf/2307.15346v2",
  "comment": "(18 pages, 8 figures)",
  "num_versions": null,
  "size_before_bytes": 1802048,
  "size_after_bytes": 271431
}