{
  "title": "Observation of $π$ solitons in oscillating waveguide arrays",
  "authors": [
    "Antonina A. Arkhipova",
    "Yiqi Zhang",
    "Yaroslav V. Kartashov",
    "Sergei A. Zhuravitskii",
    "Nikolay N. Skryabin",
    "Ivan V. Dyakonov",
    "Alexander A. Kalinkin",
    "Sergei P. Kulik",
    "Victor O. Kompanets",
    "Sergey V. Chekalin",
    "Victor N. Zadkov"
  ],
  "submission_date": "2023-07-24T15:03:42+00:00",
  "revised_dates": [],
  "abstract": "Floquet systems with periodically varying in time parameters enable realization of unconventional topological phases that do not exist in static systems with constant parameters and that are frequently accompanied by appearance of novel types of the topological states. Among such Floquet systems are the Su-Schrieffer-Heeger lattices with periodically-modulated couplings that can support at their edges anomalous $π$ modes of topological origin despite the fact that the lattice spends only half of the evolution period in topologically nontrivial phase, while during other half-period it is topologically trivial. Here, using Su-Schrieffer-Heeger arrays composed from periodically oscillating waveguides inscribed in transparent nonlinear optical medium, we report experimental observation of photonic anomalous $π$ modes residing at the edge or in the corner of the one- or two-dimensional arrays, respectively, and demonstrate a new class of topological $π$ solitons bifurcating from such modes in the topological gap of the Floquet spectrum at high powers. $π$ solitons reported here are strongly oscillating nonlinear Floquet states exactly reproducing their profiles after each longitudinal period of the structure. They can be dynamically stable in both one- and two-dimensional oscillating waveguide arrays, the latter ones representing the first realization of the Floquet photonic higher-order topological insulator, while localization properties of such $π$ solitons are determined by their power.",
  "categories": [
    "physics.optics",
    "nlin.PS"
  ],
  "primary_category": "physics.optics",
  "doi": "10.1016/j.scib.2023.07.048",
  "journal_ref": "Science Bulletin 68, 2017-2024 (2023)",
  "arxiv_id": "2307.12865",
  "pdf_url": null,
  "comment": "10 pages, 6 figures, to appear in Science Bulletin",
  "num_versions": null,
  "size_before_bytes": 8359477,
  "size_after_bytes": 74701
}