{
  "title": "Heterogeneous Receptors - Based Molecule Harvesting in MC: Analysis for ISI Mitigation and Energy Efficiency",
  "authors": [
    "Xinyu Huang",
    "Yu Huang",
    "Miaowen Wen",
    "Nan Yang",
    "Robert Schober"
  ],
  "submission_date": "2023-07-26T13:57:31+00:00",
  "revised_dates": [],
  "abstract": "This paper investigates a spherical transmitter (TX) with a membrane covered by heterogeneous receptors of varying sizes and arbitrary locations for molecular communication (MC), where molecules are encapsulated within vesicles and released from the TX through membrane fusion. Assuming continuous vesicle generation at the TX and a transparent receiver (RX), we calculate the molecule release rate, the fraction of absorbed molecules at the TX, and the received signal at the RX. All obtained analytical expressions are functions of all receptors locations and sizes, and are validated by particle-based simulations. Our numerical results indicate that evenly distributed receptors on the TX membrane can absorb more molecules than randomly distributed receptors or a single receptor. Furthermore, inspired by the autoreceptor functionality in synaptic communication, we incorporate a negative feedback mechanism (NFM) at the TX, such that molecule release stops after a certain period. We then derive the fraction of molecules that can be reused for the subsequent emissions when considering both NFM and molecule harvesting. Our numerical results demonstrate that incorporating NFM can reduce inter-symbol interference (ISI) while maintaining the same peak received signal as the case without NFM. Additionally, our results show that TXs incorporating both molecule harvesting and NFM can achieve a higher energy efficiency and lower error probability than TXs employing only molecule harvesting or neither functionality.",
  "categories": [
    "cs.ET"
  ],
  "primary_category": "cs.ET",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14202",
  "pdf_url": null,
  "comment": "30 pages, 9 figures, Submitted to IEEE journals for possible publication. arXiv admin note: substantial text overlap with arXiv:2211.14603",
  "num_versions": null,
  "size_before_bytes": 28305542,
  "size_after_bytes": 93075
}