{
  "title": "Existence, Stability and Slow Dynamics of Spikes in a 1D Minimal Keller--Segel Model with Logistic Growth",
  "authors": [
    "Fanze Kong",
    "Michael Ward",
    "Juncheng Wei"
  ],
  "submission_date": "2023-07-29T05:51:47+00:00",
  "revised_dates": [],
  "abstract": "We analyze the existence, linear stability, and slow dynamics of localized 1D spike patterns for a Keller--Segel model of chemotaxis that includes the effect of logistic growth of the cellular population. Our analysis of localized patterns for this two-component reaction-diffusion (RD) model is based, not on the usual limit of a large chemotactic drift coefficient, but instead on the singular limit of an asymptotically small diffusivity $d_2=ε^2\\ll 1$ of the chemoattractant concentration field. In the limit $d_2\\ll 1$, steady-state and quasi-equilibrium 1D multi-spike patterns are constructed asymptotically. To determine the linear stability of steady-state $N$-spike patterns we analyze the spectral properties associated with both the ''large'' ${\\mathcal O}(1)$ and the ''small'' $o(1)$ eigenvalues associated with the linearization of the Keller--Segel model. By analyzing a nonlocal eigenvalue problem characterizing the large eigenvalues, it is shown that $N$-spike equilibria can be destabilized by a zero-eigenvalue crossing leading to a competition instability if the cellular diffusion rate $d_1$ exceeds a threshold, or from a Hopf bifurcation if a relaxation time constant $τ$ is too large. In addition, a matrix eigenvalue problem that governs the stability properties of an $N$-spike steady-state with respect to the small eigenvalues is derived. From an analysis of this matrix problem, an explicit range of $d_1$ where the $N$-spike steady-state is stable to the small eigenvalues is identified. Finally, for quasi-equilibrium spike patterns that are stable on an ${\\mathcal O}(1)$ time-scale, we derive a differential algebraic system (DAE) governing the slow dynamics of a collection of localized spikes. Unexpectedly, our analysis is rather closely related to the analysis of spike patterns for the Gierer--Meinhardt RD system.",
  "categories": [
    "math.AP"
  ],
  "primary_category": "math.AP",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15896",
  "pdf_url": "https://arxiv.org/pdf/2307.15896v1",
  "comment": "55 pages",
  "num_versions": null,
  "size_before_bytes": 1076196,
  "size_after_bytes": 261887
}