{
  "title": "Reverberation of pulsar wind nebulae (III): Modelling of the plasma interface empowering a long term radiative evolution",
  "authors": [
    "R. Bandiera",
    "N. Bucciantini",
    "B. Olmi",
    "D. F. Torres"
  ],
  "submission_date": "2023-07-25T13:35:23+00:00",
  "revised_dates": [],
  "abstract": "The vast majority of Pulsar Wind Nebulae (PWNe) present in the Galaxy is formed by middle-aged systems characterized by a strong interaction of the PWN itself with the supernova remnant (SNR). Unfortunately, modelling these systems can be quite complex and numerically expensive, due to the non-linearity of the PWN-SNR evolution even in the simple 1D / one-zone case when the reverse shock of the SNR reaches the PWN, and the two begin to interact (and reverberation starts).\n  Here we introduce a new numerical technique that couples the numerical efficiency of the one-zone thin shell approach with the reliability of a full ``lagrangian'' evolution, able to correctly reproduce the PWN-SNR interaction during the reverberation and to consistently evolve the particle spectrum beyond. Based on our previous findings, we show that our novel strategy resolves many of the uncertainties present in previous approaches, as the arbitrariness in the SNR structure, and ensure a robust evolution, compatible with results that can be obtained with more complex 1D dynamical approaches. Our approach enable us for the first time to provide reliable spectral models of the later compression phases in the evolution of PWNe. While in general we found that the compression is less extreme than that obtained without such detailed dynamical considerations, leading to the formation of less structured spectral energy distributions, we still find that a non negligible fraction of PWNe might experience a super-efficient phase, with the optical and/or X-ray luminosity exceeding the spin-down one.",
  "categories": [
    "astro-ph.HE",
    "astro-ph.IM"
  ],
  "primary_category": "astro-ph.HE",
  "doi": "10.1093/mnras/stad2387",
  "journal_ref": null,
  "arxiv_id": "2307.13491",
  "pdf_url": null,
  "comment": "12 pages, 2 tables, 5 figures",
  "num_versions": null,
  "size_before_bytes": 6653193,
  "size_after_bytes": 293242
}