{
  "title": "Interplay Between Anisotropy- and Skewness-driven Whistler Instabilities in the Solar Wind under the Core-Strahlo model",
  "authors": [
    "Bea Zenteno-Quinteros",
    "Pablo S Moya",
    "Marian Lazar",
    "Adolfo F Vinas",
    "Stefaan Poedts"
  ],
  "submission_date": "2023-07-25T16:30:43+00:00",
  "revised_dates": [],
  "abstract": "Temperature anisotropy and field-aligned skewness are commonly observed non-thermal features in electron velocity distributions in the solar wind. These characteristics can act as a source of free energy to destabilize different electromagnetic wave modes, which may alter the plasma state through wave-particle interactions. Previous theoretical studies have mainly focused on analyzing these non-thermal features and self-generated instabilities individually. However, to obtain a more accurate and realistic understanding of kinetic processes in the solar wind, it is necessary to examine the interplay between these two energy sources. By means of linear kinetic theory, in this paper we investigate the excitation of the parallel-propagating whistler mode, when it is destabilized by electron populations exhibiting both temperature anisotropy and field-aligned strahl or skewness. To describe the solar wind electrons, we adopt the Core-Strahlo model as an alternative approach. This model offers the advantage of representing the suprathermal features of halo and strahl electrons, using a single skew-Kappa distribution already known as the strahlo population. Our findings show that when the electron strahlo exhibits an intrinsic temperature anisotropy, this suprathermal population becomes a stronger and more efficient source of free energy for destabilizing the whistler mode. This suggests a greater involvement of the anisotropic strahlo in processes conditioned by wave-particle interactions. Present results also suggest that the contribution of core anisotropy can be safely disregarded when assessing the importance of instabilities driven by the suprathermal population. This allows for a focused study, particularly regarding the regulation of electron heat flux in the solar wind.",
  "categories": [
    "astro-ph.SR",
    "physics.plasm-ph",
    "physics.space-ph"
  ],
  "primary_category": "astro-ph.SR",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13630",
  "pdf_url": null,
  "comment": "18 pages, 8 figures, accepted for publication in The Astrophysical Journal",
  "num_versions": null,
  "size_before_bytes": 3601387,
  "size_after_bytes": 140438
}