{
  "title": "Optimal worst-risk minimization in structural equation models with random coefficients",
  "authors": [
    "Philip Kennerberg",
    "Ernst Wit"
  ],
  "submission_date": "2023-07-28T06:58:56+00:00",
  "revised_dates": [
    "2023-08-10T13:53:04+00:00",
    "2024-07-24T08:52:24+00:00"
  ],
  "abstract": "The insight that causal parameters are particularly suitable for out-of-sample prediction has sparked a lot development of causal-like predictors. However, the connection with strict causal targets, has limited the development with good risk minimization properties, but without a direct causal interpretation. In this manuscript we derive the optimal out-of-sample risk minimizing predictor of a certain target $Y$ in a non-linear system $(X,Y)$ that has been trained in several within-sample environments. We consider data from an observation environment, and several shifted environments. Each environment corresponds to a structural equation model (SEM), with random coefficients and with its own shift and noise vector, both in $L^2$. Unlike previous approaches, we also allow shifts in the target value. We define a sieve of out-of-sample environments, consisting of all shifts $\\tilde{A}$ that are at most $γ$ times as strong as any weighted average of the observed shift vectors. For each $β\\in\\mathbb{R}^p$ we show that the supremum of the risk functions $R_{\\tilde{A}}(β)$ has a worst-risk decomposition into a (positive) non-linear combination of risk functions, depending on $γ$. We then define the set $\\mathcal{B}_γ$, as minimizers of this risk. The main result of the paper is that there is a unique minimizer ($|\\mathcal{B}_γ|=1$) that can be consistently estimated by an explicit estimator, outside a set of zero Lebesgue measure in the parameter space. A practical obstacle for the initial method of estimation is that it involves the solution of a general degree polynomials. Therefore, we prove that an approximate estimator using the bisection method is also consistent.",
  "categories": [
    "math.ST",
    "math.PR"
  ],
  "primary_category": "math.ST",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15350",
  "pdf_url": "https://arxiv.org/pdf/2307.15350v3",
  "comment": "arXiv admin note: text overlap with arXiv:2306.03588",
  "num_versions": null,
  "size_before_bytes": 421183,
  "size_after_bytes": 426294
}