{
  "title": "Restrictions on Physical Stochastic Reservoir Computers",
  "authors": [
    "Anthony M. Polloreno"
  ],
  "submission_date": "2023-07-26T19:41:05+00:00",
  "revised_dates": [
    "2025-03-25T01:12:28+00:00",
    "2025-04-03T01:08:43+00:00",
    "2025-04-08T00:47:35+00:00",
    "2025-07-22T00:55:29+00:00"
  ],
  "abstract": "Reservoir computation is a recurrent framework for learning and predicting time series data, that benefits from extremely simple training and interpretability, often as the the dynamics of a physical system. In this paper, we will study the impact of noise on the learning capabilities of analog reservoir computers. Recent work on reservoir computation has shown that the information processing capacity (IPC) is a useful metric for quantifying the degradation of the performance due to noise. We further this analysis and demonstrate that this degradation of the IPC limits the possible features that can be meaningfully constructed in an analog reservoir computing setting. We borrow a result from quantum complexity theory that relates the circuit model of computation to a continuous time model, and demonstrate an exponential reduction in the accessible volume of reservoir configurations. We conclude by relating this degradation in the IPC to the fat-shattering dimension of a family of functions describing the reservoir dynamics, which allows us to express our result in terms of a classification task. We conclude that any physical, analog reservoir computer that is exposed to noise can only be used to perform a polynomial amount of learning, despite the exponentially large latent space, even with an exponential amount of post-processing.",
  "categories": [
    "cs.LG",
    "cs.IT"
  ],
  "primary_category": "cs.LG",
  "doi": "10.1103/xrh4-7ljd",
  "journal_ref": "Physical Review Applied 24.1 (2025): 014031",
  "arxiv_id": "2307.14474",
  "pdf_url": null,
  "comment": "12 pages, 1 figure",
  "num_versions": null,
  "size_before_bytes": 2366669,
  "size_after_bytes": 1202605
}