{
  "title": "Leveraging arbitrary mobile sensor trajectories with shallow recurrent decoder networks for full-state reconstruction",
  "authors": [
    "Megan R. Ebers",
    "Jan P. Williams",
    "Katherine M. Steele",
    "J. Nathan Kutz"
  ],
  "submission_date": "2023-07-20T21:42:01+00:00",
  "revised_dates": [],
  "abstract": "Sensing is one of the most fundamental tasks for the monitoring, forecasting and control of complex, spatio-temporal systems. In many applications, a limited number of sensors are mobile and move with the dynamics, with examples including wearable technology, ocean monitoring buoys, and weather balloons. In these dynamic systems (without regions of statistical-independence), the measurement time history encodes a significant amount of information that can be extracted for critical tasks. Most model-free sensing paradigms aim to map current sparse sensor measurements to the high-dimensional state space, ignoring the time-history all together. Using modern deep learning architectures, we show that a sequence-to-vector model, such as an LSTM (long, short-term memory) network, with a decoder network, dynamic trajectory information can be mapped to full state-space estimates. Indeed, we demonstrate that by leveraging mobile sensor trajectories with shallow recurrent decoder networks, we can train the network (i) to accurately reconstruct the full state space using arbitrary dynamical trajectories of the sensors, (ii) the architecture reduces the variance of the mean-square error of the reconstruction error in comparison with immobile sensors, and (iii) the architecture also allows for rapid generalization (parameterization of dynamics) for data outside the training set. Moreover, the path of the sensor can be chosen arbitrarily, provided training data for the spatial trajectory of the sensor is available. The exceptional performance of the network architecture is demonstrated on three applications: turbulent flows, global sea-surface temperature data, and human movement biomechanics.",
  "categories": [
    "cs.LG",
    "math.DS"
  ],
  "primary_category": "cs.LG",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11793",
  "pdf_url": null,
  "comment": "11 pages, 5 figures, 2 tables",
  "num_versions": null,
  "size_before_bytes": 6482200,
  "size_after_bytes": 115279
}