{
  "title": "Few-shot Image Classification based on Gradual Machine Learning",
  "authors": [
    "Na Chen",
    "Xianming Kuang",
    "Feiyu Liu",
    "Kehao Wang",
    "Qun Chen"
  ],
  "submission_date": "2023-07-28T12:30:41+00:00",
  "revised_dates": [],
  "abstract": "Few-shot image classification aims to accurately classify unlabeled images using only a few labeled samples. The state-of-the-art solutions are built by deep learning, which focuses on designing increasingly complex deep backbones. Unfortunately, the task remains very challenging due to the difficulty of transferring the knowledge learned in training classes to new ones. In this paper, we propose a novel approach based on the non-i.i.d paradigm of gradual machine learning (GML). It begins with only a few labeled observations, and then gradually labels target images in the increasing order of hardness by iterative factor inference in a factor graph. Specifically, our proposed solution extracts indicative feature representations by deep backbones, and then constructs both unary and binary factors based on the extracted features to facilitate gradual learning. The unary factors are constructed based on class center distance in an embedding space, while the binary factors are constructed based on k-nearest neighborhood. We have empirically validated the performance of the proposed approach on benchmark datasets by a comparative study. Our extensive experiments demonstrate that the proposed approach can improve the SOTA performance by 1-5% in terms of accuracy. More notably, it is more robust than the existing deep models in that its performance can consistently improve as the size of query set increases while the performance of deep models remains essentially flat or even becomes worse.",
  "categories": [
    "cs.CV",
    "cs.AI"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15524",
  "pdf_url": "https://arxiv.org/pdf/2307.15524v1",
  "comment": "17 pages,6 figures,5 tables, 55 conferences",
  "num_versions": null,
  "size_before_bytes": 10699136,
  "size_after_bytes": 1078932
}