{
  "title": "Frustration-Induced Superconductivity in the $t$-$t'$ Hubbard Model",
  "authors": [
    "Changkai Zhang",
    "Jheng-Wei Li",
    "Jan von Delft"
  ],
  "submission_date": "2023-07-27T13:15:19+00:00",
  "revised_dates": [],
  "abstract": "The two-dimensional (2D) Hubbard model is widely believed to capture key ingredients of high-$T_c$ superconductivity in cuprate materials. However, compelling evidence remains elusive. In particular, various magnetic orders may emerge as strong competitors of superconducting orders. Here, we study the ground state properties of the doped 2D $t$-$t'$ Hubbard model on a square lattice via the infinite Projected Entangled-Pair State (iPEPS) method with $\\mathrm{U}(1)$ or $\\mathrm{SU}(2)$ spin symmetry. The former is compatible with antiferromagnetic orders, while the latter forbids them. Therefore, we obtain by comparison a detailed understanding of the magnetic impact on superconductivity. Moreover, an additional $t'$ term accommodates the particle-hole asymmetry, which facilitates studies on the discrepancies between electron- and hole-doped systems. We demonstrate that (i) a positive $t'/t$ significantly amplifies the strength of superconducting orders; (ii) at sufficiently large doping levels, the $t$-$t'$ Hubbard model favors a uniform state with superconducting orders instead of stripe states with charge and spin modulations; and (iii) the enhancement of magnetic frustration, by increasing either the strength of NNN interactions or the charge doping, impairs stripe orders and helps stabilize superconductivity.",
  "categories": [
    "cond-mat.str-el",
    "cond-mat.supr-con"
  ],
  "primary_category": "cond-mat.str-el",
  "doi": "10.1103/PhysRevLett.134.116502",
  "journal_ref": "Phys. Rev. Lett. 134, 116502 (2025)",
  "arxiv_id": "2307.14835",
  "pdf_url": "https://arxiv.org/pdf/2307.14835v1",
  "comment": "14 pages, 13 figures",
  "num_versions": null,
  "size_before_bytes": 9889893,
  "size_after_bytes": 211343
}