{
  "title": "The X-ray corona in the black-hole binary GRO J1655--40 from the properties of non-harmonically related quasi-periodic oscillations",
  "authors": [
    "Sandeep K. Rout",
    "Mariano Mendez",
    "Federico Garcia"
  ],
  "submission_date": "2023-07-28T11:29:02+00:00",
  "revised_dates": [
    "2023-08-01T06:01:23+00:00",
    "2023-11-26T12:10:27+00:00"
  ],
  "abstract": "The study of quasi periodic oscillations (QPOs) plays a vital role in understanding the nature and geometry of the Comptonizing medium around black-hole X-ray binaries. The spectral-state dependence of various types of QPOs (namely A, B, & C) suggests that they could have different origins. The simultaneous presence of different types of QPOs would therefore imply the simultaneous occurrence of different mechanisms. In this work we study the radiative properties of two non-harmonically related QPOs in the black-hole binary GRO J1655--40 detected at the peak of the ultraluminous state during the 2005 outburst of the source. The two QPOs have been previously identified as types B & C, respectively. We jointly fit the phase-lag and rms spectra of the QPOs and the time-averaged spectrum of the source with the time-dependent Comptonization model vkompth to infer the geometry of the media producing the QPOs. The time-averaged spectrum required a hot disk of 2.3 keV and a steep power law with index 2.7, revealing that the source was in an ultraluminous state. The corona that drives the variability of the type-B QPO is smaller in size and has a lower feedback fraction than the one that drives the variability of the type-C QPO. This suggests the simultaneous presence of a horizontally extended corona covering the accretion disk and a vertically elongated jet-like corona that are responsible for the type-C & B QPOs, respectively.",
  "categories": [
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.HE",
  "doi": "10.1093/mnras/stad2321",
  "journal_ref": null,
  "arxiv_id": "2307.15486",
  "pdf_url": "https://arxiv.org/pdf/2307.15486v3",
  "comment": "Updated with corrections from https://doi.org/10.1093/mnras/stad2899",
  "num_versions": null,
  "size_before_bytes": 5072988,
  "size_after_bytes": 2077356
}