{
  "title": "The mechanical response of fire ant rafts",
  "authors": [
    "Robert J. Wagner",
    "Samuel Lamont",
    "Zachary T. White",
    "Franck J. Vernerey"
  ],
  "submission_date": "2023-07-22T02:58:34+00:00",
  "revised_dates": [],
  "abstract": "Fire ants (Solenopsis invicta) cohesively aggregate via the formation of voluntary ant-to-ant attachments when under confinement or exposed to water. Once formed, these aggregations act as viscoelastic solids due to dynamic bond exchange between neighboring ants as demonstrated by rate-dependent mechanical response of 3D aggregations, confined in rheometers. We here investigate the mechanical response of 2D, planar ant rafts roughly as they form in nature. Specifically, we load rafts under uniaxial tension to failure, as well as to 50% strain for two cycles with various recovery times between. We do so while measuring raft reaction force (to estimate network-scale stress), as well as the networks' instantaneous velocity fields and topological damage responses to elucidate the ant-scale origins of global mechanics. The rafts display brittle-like behavior even at slow strain rates (relative to the unloaded bond detachment rate) for which Transient Network Theory predicts steady-state creep. This provides evidence that loaded ant-to-ant bonds undergo mechanosensitive bond stabilization or act as \\say{catch bonds}. This is further supported by the coalescence of voids that nucleate due to biaxial stress conditions and merge due to bond dissociation. The characteristic timescales of void coalescence due to chain dissociation provide evidence that the local detachment of stretched bonds is predominantly strain- (as opposed to bond lifetime-) dependent, even at slow strain rates, implying that bond detachment rates diminish significantly under stretch. Significantly, when the voids are closed by restoring the rafts to unstressed conditions, mechanical recovery occurs, confirming the presence of concentration-dependent bond association that - combined with force-diminished dissociation - could further bolster network cohesion under certain stress states.",
  "categories": [
    "cond-mat.soft"
  ],
  "primary_category": "cond-mat.soft",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11966",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 22273090,
  "size_after_bytes": 169319
}