{
  "title": "Classifying core collapse supernova remnants by their morphology as shaped by the last exploding jets",
  "authors": [
    "Noam Soker"
  ],
  "submission_date": "2023-07-28T16:56:11+00:00",
  "revised_dates": [
    "2023-08-02T04:43:31+00:00",
    "2023-08-24T14:43:16+00:00"
  ],
  "abstract": "Under the assumption that jets explode all core collapse supernovae (CCSNe) I classify 14 CCSN remnants (CCSNRs) into five groups according to their morphology as shaped by jets, and attribute the classes to the specific angular momentum of the pre-collapse core. Point-symmetry (1 CCSNR): According to the jittering jets explosion mechanism (JJEM) when the pre-collapse core rotates very slowly the newly born neutron star (NS) launches tens of jet-pairs in all directions. The last several jet-pairs might leave an imprint of several pairs of ears, i.e., a point-symmetric morphology. One pair of ears (8 CCSNRs): More rapidly rotating cores might force the last pair of jets to be long-lived and shape one pair of jet-inflated ears that dominate the morphology. S-shaped (1 CCSNR): The accretion disk might precess, leading to an S-shaped morphology. Barrel-shaped (3 CCSNRs): Even more rapidly rotating pre-collapse cores might result in a final energetic pair of jets that clear the region along the axis of the pre-collapse core rotation and form a barrel-shaped morphology. Elongated (1 CCSNR): Very rapidly rotating pre-collapse core force all jets to be along the same axis such that the jets are inefficient in expelling mass from the equatorial plane and the long-lasting accretion process turns the NS into a black hole (BH). The two new results of this study are the classification of CCSNRs into five classes based on jet-shaped morphological features, and the attribution of the morphological classes mainly to the pre-collapse core rotation in the frame of the JJEM.",
  "categories": [
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.HE",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15666",
  "pdf_url": "https://arxiv.org/pdf/2307.15666v3",
  "comment": "Accepted for publication in Research in Astronomy and Astrophysics",
  "num_versions": null,
  "size_before_bytes": 6494786,
  "size_after_bytes": 385170
}