{
  "title": "HODLR3D: Hierarchical matrices for $N$-body problems in three dimensions",
  "authors": [
    "V A Kandappan",
    "Vaishnavi Gujjula",
    "Sivaram Ambikasaran"
  ],
  "submission_date": "2023-07-30T19:04:55+00:00",
  "revised_dates": [],
  "abstract": "This article introduces HODLR3D, a class of hierarchical matrices arising out of $N$-body problems in three dimensions. HODLR3D relies on the fact that certain off-diagonal matrix sub-blocks arising out of the $N$-body problems in three dimensions are numerically low-rank. For the Laplace kernel in $3$D, which is widely encountered, we prove that all the off-diagonal matrix sub-blocks are rank deficient in finite precision. We also obtain the growth of the rank as a function of the size of these matrix sub-blocks. For other kernels in three dimensions, we numerically illustrate a similar scaling in rank for the different off-diagonal sub-blocks. We leverage this hierarchical low-rank structure to construct HODLR3D representation, with which we accelerate matrix-vector products. The storage and computational complexity of the HODLR3D matrix-vector product scales almost linearly with system size. We demonstrate the computational performance of HODLR3D representation through various numerical experiments. Further, we explore the performance of the HODLR3D representation on distributed memory systems. HODLR3D, described in this article, is based on a weak admissibility condition. Among the hierarchical matrices with different weak admissibility conditions in $3$D, only in HODLR3D did the rank of the admissible off-diagonal blocks not scale with any power of the system size. Thus, the storage and the computational complexity of the HODLR3D matrix-vector product remain tractable for $N$-body problems with large system sizes.",
  "categories": [
    "math.NA"
  ],
  "primary_category": "math.NA",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16303",
  "pdf_url": "https://arxiv.org/pdf/2307.16303v1",
  "comment": "pre-peer review version",
  "num_versions": null,
  "size_before_bytes": 1039704,
  "size_after_bytes": 417708
}