{
  "title": "Synthesizing Event-centric Knowledge Graphs of Daily Activities Using Virtual Space",
  "authors": [
    "Shusaku Egami",
    "Takanori Ugai",
    "Mikiko Oono",
    "Koji Kitamura",
    "Ken Fukuda"
  ],
  "submission_date": "2023-07-30T11:50:36+00:00",
  "revised_dates": [],
  "abstract": "Artificial intelligence (AI) is expected to be embodied in software agents, robots, and cyber-physical systems that can understand the various contextual information of daily life in the home environment to support human behavior and decision making in various situations. Scene graph and knowledge graph (KG) construction technologies have attracted much attention for knowledge-based embodied question answering meeting this expectation. However, collecting and managing real data on daily activities under various experimental conditions in a physical space are quite costly, and developing AI that understands the intentions and contexts is difficult. In the future, data from both virtual spaces, where conditions can be easily modified, and physical spaces, where conditions are difficult to change, are expected to be combined to analyze daily living activities. However, studies on the KG construction of daily activities using virtual space and their application have yet to progress. The potential and challenges must still be clarified to facilitate AI development for human daily life. Thus, this study proposes the VirtualHome2KG framework to generate synthetic KGs of daily life activities in virtual space. This framework augments both the synthetic video data of daily activities and the contextual semantic data corresponding to the video contents based on the proposed event-centric schema and virtual space simulation results. Therefore, context-aware data can be analyzed, and various applications that have conventionally been difficult to develop due to the insufficient availability of relevant data and semantic information can be developed. We also demonstrate herein the utility and potential of the proposed VirtualHome2KG framework through several use cases, including the analysis of daily activities by querying, embedding, and clustering, and fall risk detection among ...",
  "categories": [
    "cs.AI",
    "cs.DB",
    "cs.IR",
    "cs.MM"
  ],
  "primary_category": "cs.AI",
  "doi": "10.1109/ACCESS.2023.3253807",
  "journal_ref": "IEEE Access, Volume 11, pp.23857-23873, 2023",
  "arxiv_id": "2307.16206",
  "pdf_url": "https://arxiv.org/pdf/2307.16206v1",
  "comment": "17 pages, 12 figures, and this paper has been accepted by IEEE Access",
  "num_versions": null,
  "size_before_bytes": 7588365,
  "size_after_bytes": 4451908
}