{
  "title": "QUIJOTE scientific results -- XIII. Intensity and polarization study of supernova remnants in the QUIJOTE-MFI wide survey: CTB 80, Cygnus Loop, HB 21, CTA 1, Tycho and HB 9",
  "authors": [
    "Carlos Hugo López-Caraballo",
    "Beatriz Ruiz-Granados",
    "Ricardo Genova Santos",
    "Mateo Fernández-Torreiro",
    "Jose Alberto Rubiño-Martin",
    "Mike Peel",
    "Frederick Poidevin",
    "Eduardo Artal",
    "Mark Ashdown",
    "Rita Belen Barreiro",
    "Francisco Javier Casas",
    "Elena de la Hoz",
    "Raul González-González",
    "Federica Guidi",
    "Diego Herranz",
    "Roger Hoyland",
    "Anthony N Lasenby",
    "Enrique Martinez-Gonzalez",
    "Lucio Piccirillo",
    "Rafael Rebolo",
    "Denis Tramonte",
    "Flavien Vansyngel",
    "Patricio Vielva",
    "Robert Watson"
  ],
  "submission_date": "2023-07-28T12:19:30+00:00",
  "revised_dates": [],
  "abstract": "We use the new QUIJOTE-MFI wide survey (11, 13, 17 and 19 GHz) to produce spectral energy distributions (SEDs), on an angular scale of 1 deg, of the supernova remnants (SNRs) CTB 80, Cygnus Loop, HB 21, CTA 1, Tycho and HB 9. We provide new measurements of the polarized synchrotron radiation in the microwave range. For each SNR, the intensity and polarization SEDs are obtained and modelled by combining QUIJOTE-MFI maps with ancillary data. In intensity, we confirm the curved power law spectra of CTB 80 and HB 21 with a break frequency $ν_{\\rm b}$ at 2.0$^{+1.2}_{-0.5}$ GHz and 5.0$^{+1.2}_{-1.0}$ GHz respectively; and spectral indices respectively below and above the spectral break of $-0.34\\pm0.04$ and $-0.86\\pm0.5$ for CTB 80, and $-0.24\\pm0.07$ and $-0.60\\pm0.05$ for HB 21. In addition, we provide upper limits on the Anomalous Microwave Emission (AME), suggesting that the AME contribution is negligible towards these remnants. From a simultaneous intensity and polarization fit, we recover synchrotron spectral indices as flat as $-0.24$, and the whole sample has a mean and scatter of $-0.44\\pm0.12$. The polarization fractions have a mean and scatter of $6.1\\pm1.9$\\%. When combining our results with the measurements from other QUIJOTE studies of SNRs, we find that radio spectral indices are flatter for mature SNRs, and particularly flatter for CTB 80 ($-0.24^{+0.07}_{-0.06}$) and HB 21 ($-0.34^{+0.04}_{-0.03}$). In addition, the evolution of the spectral indices against the SNRs age is modelled with a power-law function, providing an exponent $-0.07\\pm0.03$ and amplitude $-0.49\\pm0.02$ (normalised at 10 kyr), which are conservative with respect to previous studies of our Galaxy and the Large Magellanic Cloud.",
  "categories": [
    "astro-ph.HE",
    "astro-ph.CO",
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.HE",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15518",
  "pdf_url": "https://arxiv.org/pdf/2307.15518v1",
  "comment": "33 pages, 15 figure, 15 tables. Submitted to MNRAS. QUIJOTE data maps available at https://research.iac.es/proyecto/quijote",
  "num_versions": null,
  "size_before_bytes": 17648509,
  "size_after_bytes": 723325
}