{
  "title": "Diffuse emission in microlensed quasars and its implications for accretion-disk physics",
  "authors": [
    "C. Fian",
    "D. Chelouche",
    "S. Kaspi"
  ],
  "submission_date": "2023-07-27T13:00:24+00:00",
  "revised_dates": [],
  "abstract": "We investigate the discrepancy between the predicted size of accretion disks (ADs) in quasars and the observed sizes as deduced from gravitational microlensing studies. Specifically, we aim to understand whether the discrepancy is due to an inadequacy of current AD models or whether it can be accounted for by the contribution of diffuse broad-line region (BLR) emission to the observed continuum signal. We employed state-of-the-art emission models for quasars and high-resolution microlensing magnification maps and compared the attributes of their magnification-distribution functions to those obtained for pure Shakura-Sunyaev disk models. We tested the validity of our detailed model predictions by examining their agreement with published microlensing estimates of the half-light radius of the continuum-emitting region in a sample of lensed quasars. Our findings suggest that the steep disk temperature profiles found by microlensing studies are erroneous as the data are largely affected by the BLR, which does not obey a temperature-wavelength relation. We show with a sample of 12 lenses that the mere contribution of the BLR to the continuum signal is able to account for the deduced overestimation factors as well as the implied size-wavelength relation. Our study points to a likely solution to the AD size conundrum in lensed quasars, which is related to the interpretation of the observed signals rather than to disk physics. Our findings significantly weaken the tension between AD theory and observations, and suggest that microlensing can provide a new means to probe the hitherto poorly constrained diffuse BLR emission around accreting black holes.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.1051/0004-6361/202346766",
  "journal_ref": "A&A 677, A94 (2023)",
  "arxiv_id": "2307.14824",
  "pdf_url": "https://arxiv.org/pdf/2307.14824v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 2788768,
  "size_after_bytes": 320539
}