{
  "title": "The rich molecular environment of the luminous blue variable star AFGL 2298",
  "authors": [
    "J. R. Rizzo",
    "C. Bordiu",
    "C. Buemi",
    "P. Leto",
    "A. Ingallinera",
    "F. Bufano",
    "G. Umana",
    "L. Cerrigone",
    "C. Trigilio"
  ],
  "submission_date": "2023-07-21T18:37:31+00:00",
  "revised_dates": [],
  "abstract": "We investigated the molecular environment of AFGL 2298, an obscured Galactic Luminous blue variable (LBV) star which hosts a highly structured circumstellar environment with hints of multiple mass-loss events in the last few $10^4$ a. We present spectral line observations of AFGL 2298 at 1 and 3 mm performed with the IRAM 30m radio telescope. Furthermore, we report the detection of several carbon- and nitrogen- bearing species (CO, $^{13}$CO, C$^{18}$O, C$^{17}$O, HCO$^+$, HCN, HNC, H$^{13}$CO$^+$, CN, N$_2$H$^+$, and C$_2$H) in the surroundings of AFGL 2298. In addition, we identified three velocity components that clearly stand out from the Galactic background. The morphology, kinematics, masses and isotopic ratios, together with a comparative study of the fractional abundances, lead us to suggest that two of these components (36 and 70 km/s) have a stellar origin. The other component (46 km/s) most likely traces swept-up interstellar material, probably harbouring also a photon-dominated region. The first inventory of the circumstellar molecular gas around AFGL 2298 is provided. The results are compatible with the hypothesis of former mass-loss events, produced before the one that created the infrared nebula. There are chemical hints of the presence of ejected stellar material, and also swept up gas. These findings will help to better understand the mass-loss history of this class of evolved massive stars, which heavily influence the overall chemical evolution of the Galaxy.",
  "categories": [
    "astro-ph.SR",
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.SR",
  "doi": "10.1051/0004-6361/202346980",
  "journal_ref": "A&A 678, A55 (2023)",
  "arxiv_id": "2307.11851",
  "pdf_url": null,
  "comment": "Accepted to Astronomy and Astrophysics. 15 pages, 4 tables, 11 figures",
  "num_versions": null,
  "size_before_bytes": 19235182,
  "size_after_bytes": 92993
}