{
  "title": "Spacecraft VLBI tracking to enhance stellar occultations astrometry of planetary satellites",
  "authors": [
    "M. Fayolle",
    "V. Lainey",
    "D. Dirkx",
    "L. I. Gurvits",
    "G. Cimo",
    "S. J. Bolton"
  ],
  "submission_date": "2023-07-29T11:37:23+00:00",
  "revised_dates": [],
  "abstract": "Stellar occultations currently provide the most accurate ground-based measurements of the positions of natural satellites (down to a few kilometres for the Galilean moons). However, when using these observations in the calculation of satellite ephemerides, the uncertainty in the planetary ephemerides dominates the error budget of the occultation. We quantify the local refinement in the central planet's position achievable by performing Very Long Baseline Interferometry (VLBI) tracking of an in-system spacecraft temporally close to an occultation. We demonstrate the potential of using VLBI to enhance the science return of stellar occultations for satellite ephemerides. We identified the most promising observation and tracking opportunities offered by the Juno spacecraft around Jupiter as perfect test cases, for which we ran simulations of our VLBI experiment. VLBI tracking at Juno's perijove close to a stellar occultation locally (in time) reduces the uncertainty in Jupiter's angular position in the sky to 250-400 m. This represents up to an order of magnitude improvement with respect to current solutions and is lower than the stellar occultation error, thus allowing the moon ephemeris solution to fully benefit from the observation. Our simulations showed that the proposed tracking and observation experiment can efficiently use synergies between ground- and space-based observations to enhance the science return on both ends. The reduced error budget for stellar occultations indeed helps to improve the moons' ephemerides, which in turn benefit planetary missions and their science products, such as the recently launched JUICE and upcoming Europa Clipper missions.",
  "categories": [
    "astro-ph.EP",
    "astro-ph.IM"
  ],
  "primary_category": "astro-ph.EP",
  "doi": "10.1051/0004-6361/202347019",
  "journal_ref": null,
  "arxiv_id": "2307.15961",
  "pdf_url": "https://arxiv.org/pdf/2307.15961v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1050028,
  "size_after_bytes": 520002
}