{
  "title": "The Population Resemblance Statistic: A Chi-Square Measure of Fit for Banking",
  "authors": [
    "Nelis Potgieter",
    "Corli van Zyl",
    "WD Schutte",
    "Fred Lombard"
  ],
  "submission_date": "2023-07-21T19:34:29+00:00",
  "revised_dates": [
    "2023-11-07T01:42:14+00:00",
    "2025-03-28T00:33:22+00:00"
  ],
  "abstract": "The Population Stability Index (PSI) is a widely used measure in credit risk modeling and monitoring within the banking industry. Its purpose is to monitor for changes in the population underlying a model, such as a scorecard, to ensure that the current population closely resembles the one used during model development. If substantial differences between populations are detected, model reconstruction may be necessary. Despite its widespread use, the origins and properties of the PSI are not well documented. Previous literature has suggested using arbitrary constants as a rule-of-thumb to assess resemblance (or \"stability\"), regardless of sample size. However, this approach too often calls for model reconstruction in small sample sizes while not detecting the need often enough in large sample sizes.\n  This paper introduces an alternative discrepancy measure, the Population Resemblance statistic (PRS), based on the Pearson chi-square statistic. Properties of the PRS follow from the non-central chi-square distribution. Specifically, the PRS allows for critical values that are configured according to sample size and the number of risk categories. Implementation relies on the specification of a set of parameters, enabling practitioners to calibrate the procedure with their risk tolerance and sensitivity to population shifts. The PRS is demonstrated to be universally competent in a simulation study and with real-world examples.",
  "categories": [
    "stat.AP",
    "math.ST"
  ],
  "primary_category": "stat.AP",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11878",
  "pdf_url": null,
  "comment": "32 pages. 7 figures. 6 tables",
  "num_versions": null,
  "size_before_bytes": 1398292,
  "size_after_bytes": 469395
}