{
  "title": "Fano resonances in tilted Weyl semimetals in an oscillating quantum well",
  "authors": [
    "Souvik Das",
    "Arnab Maity",
    "Rajib Sarkar",
    "Anirudha Menon",
    "Tanay Nag",
    "Banasri Basu"
  ],
  "submission_date": "2023-07-29T08:32:59+00:00",
  "revised_dates": [
    "2024-07-05T06:29:56+00:00"
  ],
  "abstract": "Considering the low-energy model of tilted Weyl semimetal, we study the electronic transmission through a periodically driven quantum well, oriented in the transverse direction with respect to the tilt. We adopt the formalism of Floquet scattering theory and investigate the emergence of Fano resonances as an outcome of matching between the Floquet sidebands and quasi-bound states. The Fano resonance energy changes linearly with the tilt strength suggesting the fact that tilt-mediated part of quasi-bound states energies depends on the above factor. Given a value of momentum parallel (perpendicular) to the tilt, we find that the energy gap between two Fano resonances, appearing for two adjacent values of transverse (collinear) momentum with respect to the tilt direction, is insensitive (sensitive) to the change in the tilt strength. Such a coupled (decoupled) behavior of tilt strength and the collinear (transverse) momentum can be understood from the tilt-mediated and normal parts of the quasi-bound state energies inside the potential well. We vary the other tilt parameters and chirality of the Weyl points to conclusively verify the exact form of the tilt-mediated part of the quasi-bound state energy that is the same as the tilt term in the static dispersion. The tilt orientation can significantly alter the transport in terms of evolution of Fano resoance energy with tilt momentum. We analytically find the explicit form of the bound state energy that further supports all our numerical findings. Our work paves the way to probe the tilt-mediated part of quasi-bound state energy to understand the complex interplay between the tilt and Fano resonance.",
  "categories": [
    "cond-mat.mes-hall",
    "quant-ph"
  ],
  "primary_category": "cond-mat.mes-hall",
  "doi": "10.1088/1361-648X/ad5acd",
  "journal_ref": "J. Phys.: Condens. Matter 36 395804 (2024)",
  "arxiv_id": "2307.15928",
  "pdf_url": "https://arxiv.org/pdf/2307.15928v2",
  "comment": "16 pages, 7 figures",
  "num_versions": null,
  "size_before_bytes": 5270476,
  "size_after_bytes": 140345
}