{
  "title": "QCD corrections to the Golden decay channel of the Higgs boson",
  "authors": [
    "Mandeep Kaur",
    "Maguni Mahakhud",
    "Ambresh Shivaji",
    "Xiaoran Zhao"
  ],
  "submission_date": "2023-07-29T19:49:27+00:00",
  "revised_dates": [
    "2024-03-19T12:22:03+00:00"
  ],
  "abstract": "Future colliders aim to provide highly precise experimental measurements of the properties of the Higgs boson. In order to benefit from these precision machines, theoretical errors in the Higgs sector observables have to match at least the experimental uncertainties. The theoretical uncertainties in the Higgs sector observables can be reduced by including missing higher-order terms in their perturbative calculations. In this direction, we compute the mixed QCD-electroweak corrections at ${\\mathcal O}(αα_s)$ to the Higgs decay into four charged leptons by considering the golden decay channel, $ H \\to e^+e^-μ^+μ^-$. Due to color conservation, these corrections receive contributions only from the two-loop virtual diagrams. In the complex mass scheme, we find that the mixed QCD-electroweak corrections to the partial decay width, relative to the leading order predictions, are positive and about $0.27\\%$ for $α_s(M_Z)$. Relative to the next-to-leading order electroweak corrections, the mixed QCD-electroweak corrections are found to be approximately $18\\%$ for $α_s(M_Z)$. With respect to the leading order, we observe a flat effect of the mixed QCD-electroweak corrections on the invariant mass distribution of the lepton pairs with fixed QCD coupling. The $φ$ distribution, due to the mixed QCD-electroweak corrections, follows a $(1-\\cos φ)$ dependence.",
  "categories": [
    "hep-ph",
    "hep-ex",
    "hep-th"
  ],
  "primary_category": "hep-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16063",
  "pdf_url": "https://arxiv.org/pdf/2307.16063v2",
  "comment": "21 pages, 10 figures",
  "num_versions": null,
  "size_before_bytes": 5769412,
  "size_after_bytes": 1112264
}