{
  "title": "A Survey on Reservoir Computing and its Interdisciplinary Applications Beyond Traditional Machine Learning",
  "authors": [
    "Heng Zhang",
    "Danilo Vasconcellos Vargas"
  ],
  "submission_date": "2023-07-27T05:20:20+00:00",
  "revised_dates": [],
  "abstract": "Reservoir computing (RC), first applied to temporal signal processing, is a recurrent neural network in which neurons are randomly connected. Once initialized, the connection strengths remain unchanged. Such a simple structure turns RC into a non-linear dynamical system that maps low-dimensional inputs into a high-dimensional space. The model's rich dynamics, linear separability, and memory capacity then enable a simple linear readout to generate adequate responses for various applications. RC spans areas far beyond machine learning, since it has been shown that the complex dynamics can be realized in various physical hardware implementations and biological devices. This yields greater flexibility and shorter computation time. Moreover, the neuronal responses triggered by the model's dynamics shed light on understanding brain mechanisms that also exploit similar dynamical processes. While the literature on RC is vast and fragmented, here we conduct a unified review of RC's recent developments from machine learning to physics, biology, and neuroscience. We first review the early RC models, and then survey the state-of-the-art models and their applications. We further introduce studies on modeling the brain's mechanisms by RC. Finally, we offer new perspectives on RC development, including reservoir design, coding frameworks unification, physical RC implementations, and interaction between RC, cognitive neuroscience and evolution.",
  "categories": [
    "cs.NE",
    "cs.AI",
    "cs.AR",
    "cs.LG"
  ],
  "primary_category": "cs.NE",
  "doi": "10.1109/ACCESS.2023.3299296",
  "journal_ref": "IEEE Access, vol. 11, pp. 81033-81070 (2023)",
  "arxiv_id": "2307.15092",
  "pdf_url": "https://arxiv.org/pdf/2307.15092v1",
  "comment": "51 pages, 19 figures, IEEE Access",
  "num_versions": null,
  "size_before_bytes": 22892686,
  "size_after_bytes": 541550
}