{
  "title": "Gravitational redshift test of EEP with RA from near Earth to the distance of the Moon",
  "authors": [
    "N. V. Nunes",
    "N. Bartel",
    "A. Belonenko",
    "G. D. Manucharyan",
    "S. M. Popov",
    "V. N. Rudenko",
    "L. I. Gurvits",
    "G. Cimò",
    "G. Molera Calvés",
    "M. V. Zakhvatkin",
    "M. F. Bietenholz"
  ],
  "submission_date": "2023-07-25T12:02:36+00:00",
  "revised_dates": [],
  "abstract": "The Einstein Equivalence Principle (EEP) is a cornerstone of general relativity and predicts the existence of gravitational redshift. We report on new results of measuring this shift with RadioAstron (RA), a space VLBI spacecraft launched into an evolving high eccentricity orbit around Earth with geocentric distances reaching 353,000 km. The spacecraft and ground tracking stations at Pushchino, Russia, and Green Bank, USA, were each equipped with a hydrogen maser frequency standard allowing a possible violation of the predicted gravitational redshift, in the form of a violation parameter $\\varepsilon$, to be measured. By alternating between RadioAstron's frequency referencing modes during dedicated sessions between 2015 and 2017, the recorded downlink frequencies can essentially be corrected for the non-relativistic Doppler shift. We report on an analysis using the Doppler-tracking frequency measurements made during these sessions and find $\\varepsilon = (2.1 \\pm 3.3)\\times10^{-4}$. We also discuss prospects for measuring $\\varepsilon$ with a significantly smaller uncertainty using instead the time-domain recordings of the spacecraft signals and envision how $10^{-7}$ might be possible for a future space VLBI mission.",
  "categories": [
    "gr-qc",
    "astro-ph.IM"
  ],
  "primary_category": "gr-qc",
  "doi": "10.1088/1361-6382/ace609",
  "journal_ref": null,
  "arxiv_id": "2307.13435",
  "pdf_url": null,
  "comment": "Nelson V Nunes et al 2023 Class. Quantum Grav. in press https://doi.org/10.1088/1361-6382/ace609",
  "num_versions": null,
  "size_before_bytes": 3917449,
  "size_after_bytes": 74151
}