{
  "title": "Morphology of clean and surfactant-laden droplets in homogeneous isotropic turbulence",
  "authors": [
    "Ianto Cannon",
    "Giovanni Soligo",
    "Marco E. Rosti"
  ],
  "submission_date": "2023-07-28T09:55:51+00:00",
  "revised_dates": [
    "2024-04-14T08:35:57+00:00"
  ],
  "abstract": "We perform direct numerical simulations of surfactant-laden droplets in homogeneous isotropic turbulence with Taylor Reynolds number of 180. The droplets are modelled using the volume of fluid method, and the soluble surfactant is transported using an advection-diffusion equation. Effects of surfactant on the droplet and local flow statistics are well approximated using a lower, averaged value of surface tension, allowing us to extend the framework developed by Hinze (1955) and Kolmogorov (1949) for surfactant-free bubbles. The Kolmogorov-Hinze scale $d_H$ is indeed found to be a pivotal length scale in the droplets' dynamics, separating the coalescence-dominated (droplets smaller than $d_H$) and the breakage-dominated (droplets larger than $d_H$) regimes in the droplet size distribution. We find that droplets smaller than $d_H$ have compact, regular, spheroid-like shapes, whereas droplets larger than $d_H$ have long, convoluted, filamentous shapes with a diameter equal to $d_H$. This results in two different scaling laws for the interfacial area of the droplet. The normalised area, $A/d_H^2$, of droplets smaller than $d_H$ is proportional to $d^2$, while the area of droplets larger than $d_H$ is proportional to $d^3$, where $d$ is the droplet size. We further characterise the large filamentous droplets by computing the number of handles (loops of the dispersed phase extending into the carrier phase) and voids (regions of the carrier fluid entirely enclosed by the dispersed phase) on each droplet. The number of handles per unit length of filament scales inversely with surface tension. The number of voids is proportional to the droplet size and independent of surface tension. Handles are indeed an unstable feature of the interface and are destroyed by the restoring effect of surface tension, whereas voids can move freely in the interior of the droplets, unaffected by surface tension.",
  "categories": [
    "physics.flu-dyn"
  ],
  "primary_category": "physics.flu-dyn",
  "doi": "10.1017/jfm.2024.380",
  "journal_ref": "J. Fluid Mech. 987 (2024) A31",
  "arxiv_id": "2307.15448",
  "pdf_url": "https://arxiv.org/pdf/2307.15448v2",
  "comment": "33 pages, 13 figures",
  "num_versions": null,
  "size_before_bytes": 30033931,
  "size_after_bytes": 458336
}