{
  "title": "Event-based Vision for Early Prediction of Manipulation Actions",
  "authors": [
    "Daniel Deniz",
    "Cornelia Fermuller",
    "Eduardo Ros",
    "Manuel Rodriguez-Alvarez",
    "Francisco Barranco"
  ],
  "submission_date": "2023-07-26T17:50:17+00:00",
  "revised_dates": [],
  "abstract": "Neuromorphic visual sensors are artificial retinas that output sequences of asynchronous events when brightness changes occur in the scene. These sensors offer many advantages including very high temporal resolution, no motion blur and smart data compression ideal for real-time processing. In this study, we introduce an event-based dataset on fine-grained manipulation actions and perform an experimental study on the use of transformers for action prediction with events. There is enormous interest in the fields of cognitive robotics and human-robot interaction on understanding and predicting human actions as early as possible. Early prediction allows anticipating complex stages for planning, enabling effective and real-time interaction. Our Transformer network uses events to predict manipulation actions as they occur, using online inference. The model succeeds at predicting actions early on, building up confidence over time and achieving state-of-the-art classification. Moreover, the attention-based transformer architecture allows us to study the role of the spatio-temporal patterns selected by the model. Our experiments show that the Transformer network captures action dynamic features outperforming video-based approaches and succeeding with scenarios where the differences between actions lie in very subtle cues. Finally, we release the new event dataset, which is the first in the literature for manipulation action recognition. Code will be available at https://github.com/DaniDeniz/EventVisionTransformer.",
  "categories": [
    "cs.CV",
    "cs.AI"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14332",
  "pdf_url": null,
  "comment": "15 pages, 9 figures",
  "num_versions": null,
  "size_before_bytes": 7940234,
  "size_after_bytes": 133655
}