{
  "title": "Impact of 3D Antenna Radiation Pattern in UAV Air-to-Ground Path Loss Modeling and RSRP-based Localization in Rural Area",
  "authors": [
    "Sung Joon Maeng",
    "Hyeokjun Kwon",
    "Ozgur Ozdemir",
    "İsmail Güvenç"
  ],
  "submission_date": "2023-07-24T04:17:57+00:00",
  "revised_dates": [
    "2023-10-04T00:16:08+00:00"
  ],
  "abstract": "Ensuring reliable and seamless wireless connectivity for unmanned aerial vehicles (UAVs) has emerged as a critical requirement for a wide range of applications. The increasing deployment of UAVs has increased the significance of cellular-connected UAVs (C-UAVs) in enabling beyond-visual line of sight (BVLOS) communications. To ensure the successful operation of C-UAVs within existing terrestrial networks, it is vital to understand the distinctive characteristics associated with air-to-ground signal propagation. In this paper, we investigate the impact of 3D antenna patterns on a UAV air-to-ground path loss model, utilizing datasets obtained from a measurement campaign. We conducted UAV experiments in a rural area at various fixed heights, while also characterizing the 3D antenna radiation pattern by using an anechoic chamber facility. By analyzing reference signal received power (RSRP) using path loss models that account for antenna patterns, we observed that our measurement results, obtained at different UAV heights, aligned well with the two-ray path loss model when incorporating the measured antenna pattern. We propose an RSRP-based localization algorithm at a UAV that takes into account antenna patterns in both offline and online scenarios. Through our experimentation dataset, we show that incorporating measured antenna patterns significantly enhances the source localization accuracy.",
  "categories": [
    "eess.SP"
  ],
  "primary_category": "eess.SP",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12515",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 50262207,
  "size_after_bytes": 563780
}