{
  "title": "An Inexact Feasible Interior Point Method for Linear Optimization with High Adaptability to Quantum Computers",
  "authors": [
    "Mohammadhossein Mohammadisiahroudi",
    "Ramin Fakhimi",
    "Zeguan Wu",
    "Tamás Terlaky"
  ],
  "submission_date": "2023-07-26T18:32:39+00:00",
  "revised_dates": [
    "2025-07-08T00:06:56+00:00"
  ],
  "abstract": "The use of quantum computing to accelerate complex optimization problems is a burgeoning research field. This paper applies Quantum Linear System Algorithms (QLSAs) to Newton systems within Interior Point Methods (IPMs) to take advantage of quantum speedup in solving Linear Optimization (LO) problems. Due to their inexact nature, QLSAs can be applied only to inexact variants of IPMs. Existing IPMs with inexact Newton directions are infeasible methods due to the inexact nature of their computations. This paper proposes an Inexact-Feasible IPM (IF-IPM) for LO problems, using a novel linear system to generate inexact but feasible steps. We show that this method has $\\Ocal(\\sqrt{n}L)$ iteration complexity, analogous to the best exact IPMs, where $n$ is the number of variables and $L$ is the binary length of the input data. Moreover, we examine how QLSAs can efficiently solve the proposed system in an iterative refinement (IR) scheme to find the exact solution without excessive calls to QLSAs. We show that the proposed IR-IF-IPM can also be helpful to mitigate the impact of the condition number when a classical iterative method, such as a Conjugate Gradient method or a quantum solver is used at iterations of IPMs. After applying the proposed IF-IPM to the self-dual embedding formulation, we investigate the proposed IF-IPM's efficiency using the QISKIT simulator of QLSA.",
  "categories": [
    "math.OC"
  ],
  "primary_category": "math.OC",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14445",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 3902624,
  "size_after_bytes": 517750
}