{
  "title": "Non-Equilibrium Abundances Treated Holistically (NEATH): the molecular composition of star-forming clouds",
  "authors": [
    "F. D. Priestley",
    "P. C. Clark",
    "S. C. O. Glover",
    "S. E. Ragan",
    "O. Fehér",
    "L. R. Prole",
    "R. S. Klessen"
  ],
  "submission_date": "2023-07-24T18:53:06+00:00",
  "revised_dates": [],
  "abstract": "Much of what we know about molecular clouds, and by extension star formation, comes from molecular line observations. Interpreting these correctly requires knowledge of the underlying molecular abundances. Simulations of molecular clouds typically only model species that are important for the gas thermodynamics, which tend to be poor tracers of the denser material where stars form. We construct a framework for post-processing these simulations with a full time-dependent chemical network, allowing us to model the behaviour of observationally-important species not present in the reduced network used for the thermodynamics. We use this to investigate the chemical evolution of molecular gas under realistic physical conditions. We find that molecules can be divided into those which reach peak abundances at moderate densities ($10^3 \\, {\\rm cm^{-3}}$) and decline sharply thereafter (such as CO and HCN), and those which peak at higher densities and then remain roughly constant (e.g. NH$_3$, N$_2$H$^+$). Evolving the chemistry with physical properties held constant at their final values results in a significant overestimation of gas-phase abundances for all molecules, and does not capture the drastic variations in abundance caused by different evolutionary histories. The dynamical evolution of molecular gas cannot be neglected when modelling its chemistry.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.1093/mnras/stad2278",
  "journal_ref": null,
  "arxiv_id": "2307.13072",
  "pdf_url": null,
  "comment": "14 pages, 13 figures. MNRAS accepted",
  "num_versions": null,
  "size_before_bytes": 5417020,
  "size_after_bytes": 82891
}