{
  "title": "An equivariant graph neural network for the elasticity tensors of all seven crystal systems",
  "authors": [
    "Mingjian Wen",
    "Matthew K. Horton",
    "Jason M. Munro",
    "Patrick Huck",
    "Kristin A. Persson"
  ],
  "submission_date": "2023-07-28T00:43:51+00:00",
  "revised_dates": [
    "2024-01-22T03:04:22+00:00"
  ],
  "abstract": "The elasticity tensor that describes the elastic response of a material to external forces is among the most fundamental properties of materials. The availability of full elasticity tensors for inorganic crystalline compounds, however, is limited due to experimental and computational challenges. Here, we report the materials tensor (MatTen) model for rapid and accurate estimation of the full fourth-rank elasticity tensors of crystals. Based on equivariant graph neural networks, MatTen satisfies the two essential requirements for elasticity tensors: independence of the frame of reference and preservation of material symmetry. Consequently, it provides a unified treatment of elasticity tensors for all seven crystal systems across diverse chemical spaces, without the need to deal with each separately.. MatTen was trained on a dataset of first-principles elasticity tensors garnered by the Materials Project over the past several years (we are releasing the data herein) and has broad applications in predicting the isotropic elastic properties of polycrystalline materials, examining the anisotropic behavior of single crystals, and discovering new materials with exceptional mechanical properties. Using MatTen, we have discovered a hundred new crystals with extremely large maximum directional Young's modulus and eleven polymorphs of elemental cubic metals with unconventional spatial orientation of Young's modulus.",
  "categories": [
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": "10.1039/D3DD00233K",
  "journal_ref": null,
  "arxiv_id": "2307.15242",
  "pdf_url": "https://arxiv.org/pdf/2307.15242v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 5895228,
  "size_after_bytes": 215419
}