{
  "title": "Molecular Dynamics Study of Argon Flow in a Carbon Nanotube",
  "authors": [
    "Anuj Chaudhri"
  ],
  "submission_date": "2023-07-28T18:49:11+00:00",
  "revised_dates": [],
  "abstract": "This study focuses on trying to understand the flow of argon inside carbon nanotubes. The methodology of molecular dynamics and its implementation as a tool to effectively model fluid flows inside nanocomponents is established, followed by an understanding of the intermolecular potentials which effectively model the interactions between the argon and carbon atoms. Argon is one of the most non-reactive elements in the periodic table. Being a noble gas the intermolecular interactions can be easily modeled using simple potential energy functions. The reason for using Argon lies in the simplicity in modeling its behavior and benchmarking the results with existing studies in literature. The first two cases serve to benchmark the numerical scheme by plotting the flow velocity and the structures of argon atoms while flowing inside and outside the tube. The third case simulates argon flowing from a reservoir which is twice as big as the largest dimension of the argon crystal. The simulation is carried out on short tubes with low densities of atoms. Two stages of transport are observed during the simulations. The first stage is characterized by the entry of the argon atoms into the tube which depends strongly on the repulsive forces between the argon atoms and the attractive forces between the argon and carbon tip atoms. The second stage is more chaotic as the molecules travel back and forth in the tube due to competition between the kinetic energy and the attractive potential energy of the carbon atoms on the argon. It is also observed that the argon atoms move closer to the walls of the tube. In case of higher densities they move in a coordinated fashion forming spiral-like structures. The transport is erratic and is observed in all the cases, indicating that the motion of atoms inside nanocomponents is highly randomized, yet governed solely by the intermolecular forces.",
  "categories": [
    "physics.flu-dyn",
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "physics.flu-dyn",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15765",
  "pdf_url": "https://arxiv.org/pdf/2307.15765v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1314391,
  "size_after_bytes": 788416
}