{
  "title": "Synchronization and its slow decay in noisy oscillators with simplicial interactions",
  "authors": [
    "Yuichiro Marui",
    "Hiroshi Kori"
  ],
  "submission_date": "2023-07-25T05:08:44+00:00",
  "revised_dates": [
    "2025-02-11T02:19:52+00:00"
  ],
  "abstract": "Previous studies on oscillator populations with two-simplex interaction have reported novel phenomena such as discontinuous desynchronization transitions and multistability of synchronized states. However, the noise effect is not well understood. Here, we study a higher-order network of noisy oscillators with generic interactions consisting of one-simplex and two types of two-simplex interactions. We observe that when a type of two-simplex interaction is dominant, synchrony is eroded and eventually disappears even for infinitesimally weak noise. Nevertheless, synchronized states may persist for extended periods, with the lifetime increasing approximately exponentially with the strength of the two-simplex interaction. When one-simplex or another type of two-simplex interaction is sufficiently strong, noise erosion is prevented, and synchronized states become persistent. A weakly nonlinear analysis reveals that as one-simplex coupling increases, the synchronized state appears supercritically or subscritically, depending on the interaction strength. Furthermore, assuming weak noise and using Kramers' rate theory, we derive a closed dynamical equation for the Kuramoto order parameter, from which the time scale of the erosion process is derived. Our study elucidates the synchronization and desynchronization of oscillator assemblies in higher-order networks and is expected to provide insights into such systems' design and control principles.",
  "categories": [
    "nlin.AO"
  ],
  "primary_category": "nlin.AO",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13260",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 6591616,
  "size_after_bytes": 376150
}