{
  "title": "Are Scopus journal field classifications ever misleading?",
  "authors": [
    "Mike Thelwall",
    "Stephen Pinfield"
  ],
  "submission_date": "2023-07-28T10:01:48+00:00",
  "revised_dates": [],
  "abstract": "Journal field classifications in Scopus are used for citation-based indicators and by authors choosing appropriate journals to submit to. Whilst prior research has found that Scopus categories are occasionally misleading, it is not known how this varies for different journal types. In response, we assessed whether specialist, cross-field and general academic journals sometimes have publication practices that do not match their Scopus classifications. For this, we compared the Scopus narrow fields of journals with the fields that best fit their articles' titles and abstracts. We also conducted qualitative follow-up to distinguish between Scopus classification errors and misleading journal aims. The results show sharp field differences in the extent to which both cross-field and apparently specialist journals publish articles that match their Scopus narrow fields, and the same for general journals. The results also suggest that a few journals have titles and aims that do not match their contents well, and that some large topics spread themselves across many relevant disciplines. Thus, the likelihood that a journal's Scopus narrow fields reflect its contents varies substantially by field (although without systematic field trends) and some cross-field topics seem to cause difficulties in appropriately classifying relevant journals. These issues undermine citation-based indicators that rely on journal-level classification and may confuse scholars seeking publishing venues.",
  "categories": [
    "cs.DL"
  ],
  "primary_category": "cs.DL",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15449",
  "pdf_url": "https://arxiv.org/pdf/2307.15449v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 743270,
  "size_after_bytes": 451180
}