{
  "title": "Diraxiogenesis",
  "authors": [
    "Maximilian Berbig"
  ],
  "submission_date": "2023-07-26T11:40:24+00:00",
  "revised_dates": [
    "2023-10-11T00:24:19+00:00",
    "2024-01-17T01:37:46+00:00"
  ],
  "abstract": "The family of Dirac Seesaw models offers an intriguing alternative explanation for the smallness of neutrino masses without necessarily requiring microscopic lepton number violation, when compared to the more familiar class of Majorana Seesaws. A global $\\text{U}(1)_\\text{D}$ symmetry, that is explicitly broken by a higher dimensional scalar operator, ensures that the right handed neutrino does not couple directly to the Standard Model like Higgs and an exact gauged or residual lepton number symmetry prohibits all Majorana masses. We demonstrate that all three Dirac Seesaws possess a Pseudo-Nambu-Goldstone boson associated with the $\\text{U}(1)_\\text{D}$ symmetry, that we call the Diraxion, whose cosmological dynamics have so far been left unexplored. Furthermore we illustrate that a Dirac-Leptogenesis version of the recently proposed Lepto-Axiogenesis scenario can be realized in this class of models, leading to a unified origin of the observed baryon asymmetry and dark matter relic abundance. Explaining only the baryon asymmetry can lead to potentially observable amounts of right handed neutrino dark radiation with $ΔN_\\text{eff.}\\lesssim 0.028$. On the other hand, if we only fix the dark matter abundance via the kinetic misalignment mechanism, this set-up could lead to detectable signatures in proposed cosmic neutrino background experiments via decays of eV-scale Diraxions to neutrinos. Here there is no domain wall problem, since topological defects decay to a subleading fraction of relic Diraxions. A key ingredient of all Axiogenesis scenarios is the dynamics of relatively light scalar called the Saxion, that in our case has a mass at the GeV-scale and which might reveal itself in heavy meson decays or collider searches. Our setup predicts isocurvature perturbations in baryons, dark matter and dark radiation sourced by fluctuations of the Saxion.",
  "categories": [
    "hep-ph"
  ],
  "primary_category": "hep-ph",
  "doi": "10.1007/JHEP01(2024)061",
  "journal_ref": "JHEP01(2024)061",
  "arxiv_id": "2307.14121",
  "pdf_url": null,
  "comment": "v1: main text 61 pages + 5 pages of appendices, 11 figures, Comments are always welcome! v2: references and comments added, captions improved, mistake about domain walls corrected, discussion on dark radiation expanded, v3: references corrected and appendix about the absence of chiral hypermagnetic instability added, matches published version",
  "num_versions": null,
  "size_before_bytes": 3491106,
  "size_after_bytes": 1010423
}