{
  "title": "Rotational flows in solar coronal flux rope cavities",
  "authors": [
    "Valeriia Liakh",
    "Rony Keppens"
  ],
  "submission_date": "2023-07-27T15:25:41+00:00",
  "revised_dates": [],
  "abstract": "We present a 2.5-dimensional magnetohydrodynamic simulation of a systematically rotating prominence inside its coronal cavity using the open-source \\texttt{MPI-AMRVAC} code. Our simulation starts from a non-adiabatic, gravitationally stratified corona, permeated with a sheared arcade magnetic structure. The flux rope (FR) is formed through converging and shearing footpoints driving, simultaneously applying randomized heating at the bottom. The latter induces a left-right asymmetry of temperature and density distributions with respect to the polarity-inversion line. This asymmetry drives flows along the loops before the FR formation, which gets converted to net rotational motions upon reconnection of the field lines. As the thermal instability within the FR develops, angular momentum conservation about its axis leads to a systematic rotation of both hot coronal and cold condensed plasma. The initial rotational velocity exceeds $60\\ \\mathrm{km\\ s^{-1}}$. The synthesized images confirm the simultaneous rotations of the coronal plasma seen in 211 and 193 Å and condensations seen in 304 Å. Furthermore, the formation of the dark cavity is evident in 211 and 193 Å images. Our numerical experiment is inspired by observations of so-called giant solar prominence tornadoes, and reveals that asymmetric FR formation can be crucial in triggering rotational motions. We reproduce observed spinning motions inside the coronal cavity, augmenting our understanding of the complex dynamics of rotating prominences.",
  "categories": [
    "astro-ph.SR"
  ],
  "primary_category": "astro-ph.SR",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14934",
  "pdf_url": "https://arxiv.org/pdf/2307.14934v1",
  "comment": "11 pages,5 figures, accepted for publication in The Astrophysical Journal Letters",
  "num_versions": null,
  "size_before_bytes": 21612039,
  "size_after_bytes": 17149381
}