{
  "title": "Bose-Einstein Condensation and Black Holes in Dark Matter and Dark Energy",
  "authors": [
    "Kemal Gültekin"
  ],
  "submission_date": "2023-07-30T08:08:18+00:00",
  "revised_dates": [
    "2023-08-10T10:51:48+00:00"
  ],
  "abstract": "The main aim of this study is to reveal curved space and particle physics effects on the formation of Bose-Einstein condensate (BEC) scalar fields in cosmology and around a black hole. Cosmological scalar fields for dark energy and dark matter may be considered as a result of Bose-Einstein condensation. In this regard, our main attention will be devoted to BECs in curved space. By considering the dynamics of a BEC scalar field at a microscopic level, we first study the initial phase of the formation of condensation in cosmology. To this end, we initially introduce an effective Minkowski space formulation that enables considering only the effect of particle physics processes, excluding the effect of gravitational particle production and enabling us to see cosmological evolution more easily. Then, by using this formulation, we study a model with a trilinear coupling that induces the processes. After considering the phase evolution of the produced particles, we find that they evolve towards the formation of a BEC if some specific conditions are satisfied. In principle, the effective Minkowski space formulation introduced in this study can be applied to particle physics processes in any sufficiently smooth spacetime. In this regard, we also analyse if a BEC scalar field is realized in the spacetime around a Reissner - Nordström black hole. We find that the produced particles of particle physics processes are localized in a region around the black hole and have a tendency toward condensation if the emerged particles are much heavier than ingoing particles. We also find that such a configuration is phenomenologically viable only if the scalars and the black hole have dark electric charges. Finally, we consider gravitational collapse around Schwarzschild black holes and form a first step towards a study in future about the effects of gravitational collapse on Bose-Einstein condensation.",
  "categories": [
    "gr-qc",
    "astro-ph.CO",
    "hep-ph",
    "hep-th"
  ],
  "primary_category": "gr-qc",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16161",
  "pdf_url": "https://arxiv.org/pdf/2307.16161v2",
  "comment": "Ph.D thesis; 86 pages; 8 figures",
  "num_versions": null,
  "size_before_bytes": 1250914,
  "size_after_bytes": 652650
}