{
  "title": "Adapted poling to break the nonlinear efficiency limit in nanophotonic lithium niobate waveguides",
  "authors": [
    "Pao-Kang Chen",
    "Ian Briggs",
    "Chaohan Cui",
    "Liang Zhang",
    "Manav Shah",
    "Linran Fan"
  ],
  "submission_date": "2023-07-21T16:17:29+00:00",
  "revised_dates": [],
  "abstract": "Nonlinear frequency mixing is of critical importance in extending the wavelength range of optical sources. It is also indispensable for emerging applications such as quantum information and photonic signal processing. Conventional lithium niobate with periodic poling is the most widely used device for frequency mixing due to the strong second-order nonlinearity. The recent development of nanophotonic lithium niobate waveguides promises improvements of nonlinear efficiencies by orders of magnitude with sub-wavelength optical conferment. However, the intrinsic nanoscale inhomogeneity in nanophotonic lithium niobate limits the coherent interaction length, leading to low nonlinear efficiencies. Therefore, the performance of nanophotonic lithium niobate waveguides is still far behind conventional counterparts. Here, we overcome this limitation and demonstrate ultra-efficient second order nonlinearity in nanophotonic lithium niobate waveguides significantly outperforming conventional crystals. This is realized by developing the adapted poling approach to eliminate the impact of nanoscale inhomogeneity in nanophotonic lithium niobate waveguides. We realize overall secondharmonic efficiency near 10^4 %/W without cavity enhancement, which saturates the theoretical limit. Phase-matching bandwidths and temperature tunability are improved through dispersion engineering. The ideal square dependence of the nonlinear efficiency on the waveguide length is recovered. We also break the trade-off between the energy conversion ratio and pump power. A conversion ratio over 80% is achieved in the single-pass configuration with pump power as low as 20 mW.",
  "categories": [
    "physics.optics"
  ],
  "primary_category": "physics.optics",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11671",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 28846210,
  "size_after_bytes": 606716
}