{
  "title": "Cosmic Birefringence as a probe of dark matter nature: Sterile neutrino and dipolar dark matter",
  "authors": [
    "Jafar Khodagholizadeh",
    "S. Mahmoudi",
    "R. Mohammadi",
    "M. Sadegh"
  ],
  "submission_date": "2023-07-30T17:42:06+00:00",
  "revised_dates": [],
  "abstract": "Recently, non-zero rotation angle $β=0.30^\\circ\\pm0.11^\\circ$ $(68\\%\\text{ C.L.})$ [Phys. Rev. Lett. \\textbf{128}, no.9, 091302 (2022)] has been reported for linear polarization of cosmic microwave background (CMB) radiation, which is known as cosmic birefringence (CB). We used this birefringence angle of CMB to study and distinguish different candidates of dark matter (DM), e.g., dipolar and sterile neutrino DM. We calculated CMB forward scattering by those probable candidates of DM to generate $β$ in the presence of primordial scalar fluctuations' background. We explicitly plotted bounds on the mass and electromagnetic coupling for different sectors of DM, sterile neutrino, and dipolar DM, and compared them with other experimental bounds. Regarding dipolar DM, our calculations put a bound on the Majorana magnetic dipole moment about $\\mathcal{M}\\leqslant 1.4\\times10^{-14}\\,\\fracβ{0.30^\\circ}\\sqrt{\\frac{m_{\\text{\\tiny{DM}}}}{1\\,GeV}}\\, e.\\text{\\,cm}$. In the case of sterile neutrino DM, the bound on the mass and mixing angle was estimated at $θ^2 \\leqslant 3.3\\,(rad)^2\\fracβ{0.30^\\circ}\\,\\frac{m_{DM}}{\\rm{KeV}} $, which can be a new constraint for sterile neutrino DM whose production mechanism is motivated by models with a hidden sector coupled to the sterile neutrino. Based on our results, if the constraint on the mass and the electromagnetic coupling for DM must be within the allowed region, none of the considered candidates can compensate for all the observed CB angles. We also discussed the maximum contribution of the CB angle via CMB forward scattering by different sectors of the dark matter.",
  "categories": [
    "hep-ph",
    "gr-qc"
  ],
  "primary_category": "hep-ph",
  "doi": "10.1103/PhysRevD.108.023023",
  "journal_ref": "Phys. Rev. D 108, 023023 (2023)",
  "arxiv_id": "2307.16286",
  "pdf_url": "https://arxiv.org/pdf/2307.16286v1",
  "comment": "Published version",
  "num_versions": null,
  "size_before_bytes": 1965530,
  "size_after_bytes": 99795
}