{
  "title": "Magnetic Antiskyrmions in Two-Dimensional van der Waals Magnets Engineered by Layer Stacking",
  "authors": [
    "Kai Huang",
    "Edward Schwartz",
    "Ding-Fu Shao",
    "Alexey A. Kovalev",
    "Evgeny Y. Tsymbal"
  ],
  "submission_date": "2023-07-28T18:57:30+00:00",
  "revised_dates": [],
  "abstract": "Magnetic skyrmions and antiskyrmions are topologically protected quasiparticles exhibiting a whirling spin texture in real space. Antiskyrmions offer some advantages over skyrmions as they are expected to have higher stability and can be electrically driven with no transverse motion. However, unlike the widely investigated skyrmions, antiskyrmions are rarely observed due to the required anisotropic Dzyaloshinskii-Moriya interaction (DMI). Here we propose to exploit the recently demonstrated van der Waals (vdW) assembly of two-dimensional (2D) materials that breaks inversion symmetry and creates conditions for anisotropic DMI. Using a 2D vdW magnet CrI${}_3$ as an example, we demonstrate, based on density functional theory (DFT) calculations, that this strategy is a promising platform to realize antiskyrmions. Polar layer stacking of two centrosymmetric magnetic monolayers of CrI${}_3$ efficiently lowers the symmetry, resulting in anisotropic DMI that supports antiskyrmions. The DMI is reversible by switching the ferroelectric polarization inherited from the polar layer stacking, offering the control of antiskyrmions by an electric field. Furthermore, we find that the magnetocrystalline anisotropy and DMI of CrI${}_3$ can be efficiently modulated by Mn doping, creating a possibility to control the size of antiskyrmions. Using atomistic spin dynamics simulations with the parameters obtained from our DFT calculations, we predict the formation of antiskyrmions in a Cr${}_{0.88}$Mn${}_{0.12}$I${}_3$ bilayer and switching their spin texture with polarization reversal. Our results open a new direction to generate and control magnetic antiskyrmions in 2D vdW magnetic systems.",
  "categories": [
    "cond-mat.mtrl-sci",
    "cond-mat.mes-hall"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": "10.1103/PhysRevB.109.024426",
  "journal_ref": null,
  "arxiv_id": "2307.15769",
  "pdf_url": "https://arxiv.org/pdf/2307.15769v1",
  "comment": "10 pages, 6 figures",
  "num_versions": null,
  "size_before_bytes": 3107193,
  "size_after_bytes": 1804231
}