{
  "title": "One-shot Joint Extraction, Registration and Segmentation of Neuroimaging Data",
  "authors": [
    "Yao Su",
    "Zhentian Qian",
    "Lei Ma",
    "Lifang He",
    "Xiangnan Kong"
  ],
  "submission_date": "2023-07-27T21:14:40+00:00",
  "revised_dates": [],
  "abstract": "Brain extraction, registration and segmentation are indispensable preprocessing steps in neuroimaging studies. The aim is to extract the brain from raw imaging scans (i.e., extraction step), align it with a target brain image (i.e., registration step) and label the anatomical brain regions (i.e., segmentation step). Conventional studies typically focus on developing separate methods for the extraction, registration and segmentation tasks in a supervised setting. The performance of these methods is largely contingent on the quantity of training samples and the extent of visual inspections carried out by experts for error correction. Nevertheless, collecting voxel-level labels and performing manual quality control on high-dimensional neuroimages (e.g., 3D MRI) are expensive and time-consuming in many medical studies. In this paper, we study the problem of one-shot joint extraction, registration and segmentation in neuroimaging data, which exploits only one labeled template image (a.k.a. atlas) and a few unlabeled raw images for training. We propose a unified end-to-end framework, called JERS, to jointly optimize the extraction, registration and segmentation tasks, allowing feedback among them. Specifically, we use a group of extraction, registration and segmentation modules to learn the extraction mask, transformation and segmentation mask, where modules are interconnected and mutually reinforced by self-supervision. Empirical results on real-world datasets demonstrate that our proposed method performs exceptionally in the extraction, registration and segmentation tasks. Our code and data can be found at https://github.com/Anonymous4545/JERS",
  "categories": [
    "cs.CV",
    "cs.AI"
  ],
  "primary_category": "cs.CV",
  "doi": "10.1145/3580305.3599452",
  "journal_ref": null,
  "arxiv_id": "2307.15198",
  "pdf_url": "https://arxiv.org/pdf/2307.15198v1",
  "comment": "Published as a research track paper at KDD 2023. Code: https://github.com/Anonymous4545/JERS",
  "num_versions": null,
  "size_before_bytes": 6003214,
  "size_after_bytes": 763929
}