{
  "title": "A High Frequency Active Clamp Forward Converter with Coreless Transformer",
  "authors": [
    "Reza Asrar Ghaderloo",
    "Ali Parsa Sirat",
    "Abbas Shoulaie"
  ],
  "submission_date": "2023-07-24T13:54:49+00:00",
  "revised_dates": [],
  "abstract": "In this paper, a highly compact, low power (<10W), high frequency (2 MHz) isolated active clamp forward converter, comprising a coreless Printed Circuit Board-based transformer is proposed. To decrease the size of converter, high switching frequency is considered which lead to decrease in inductor, capacitor and transformer size. Highly switch loss due to hard switching is an important constraint of forward topology to increase frequency. In this paper, the active clamp circuit is added to forward topology to achieve zero voltage switching and decrease switching loss drastically. Due to zero voltage switching, the proposed converter can operate in high frequency. The principle of active clamp forward converter is described in this paper. Another constraint to increase the switching frequency of forward converter is transformer core losses. In this paper, coreless PCB-based transformer is proposed and implemented to be utilized in the structure of the active clamp forward converter. Instead of classic core-based transformer, using a PCB-based transformer as the power transmitter has increased the efficiency due to elimination of core hysteresis loss. The equivalent circuit, transfer function and input impedance of PCB-based coreless transformer are presented in high frequency. Finally, an experimental prototype of the active clamp forward converter which uses a coreless transformer is implemented. The experimental results of proposed converter are presented to evaluate the theoretical analysis and performance.",
  "categories": [
    "eess.SY"
  ],
  "primary_category": "eess.SY",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12804",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}