{
  "title": "FLiCR: A Fast and Lightweight LiDAR Point Cloud Compression Based on Lossy RI",
  "authors": [
    "Jin Heo",
    "Christopher Phillips",
    "Ada Gavrilovska"
  ],
  "submission_date": "2023-07-27T17:04:05+00:00",
  "revised_dates": [],
  "abstract": "Light detection and ranging (LiDAR) sensors are becoming available on modern mobile devices and provide a 3D sensing capability. This new capability is beneficial for perceptions in various use cases, but it is challenging for resource-constrained mobile devices to use the perceptions in real-time because of their high computational complexity. In this context, edge computing can be used to enable LiDAR online perceptions, but offloading the perceptions on the edge server requires a low-latency, lightweight, and efficient compression due to the large volume of LiDAR point clouds data.\n  This paper presents FLiCR, a fast and lightweight LiDAR point cloud compression method for enabling edge-assisted online perceptions. FLiCR is based on range images (RI) as an intermediate representation (IR), and dictionary coding for compressing RIs. FLiCR achieves its benefits by leveraging lossy RIs, and we show the efficiency of bytestream compression is largely improved with quantization and subsampling. In addition, we identify the limitation of current quality metrics for presenting the entropy of a point cloud, and introduce a new metric that reflects both point-wise and entropy-wise qualities for lossy IRs. The evaluation results show FLiCR is more suitable for edge-assisted real-time perceptions than the existing LiDAR compressions, and we demonstrate the effectiveness of our compression and metric with the evaluations on 3D object detection and LiDAR SLAM.",
  "categories": [
    "cs.MM",
    "cs.DC"
  ],
  "primary_category": "cs.MM",
  "doi": "10.1109/SEC54971.2022.00012",
  "journal_ref": "In 2022 IEEE/ACM 7th Symposium on Edge Computing (SEC) (pp. 54-67). IEEE 2022",
  "arxiv_id": "2307.15005",
  "pdf_url": "https://arxiv.org/pdf/2307.15005v1",
  "comment": "12 pages, 11 figures, conference paper",
  "num_versions": null,
  "size_before_bytes": 5368979,
  "size_after_bytes": 1864204
}