{
  "title": "Correlation function of flavored fermion in holographic QCD",
  "authors": [
    "Si-wen Li",
    "Yi-peng Zhang",
    "Hao-qian Li"
  ],
  "submission_date": "2023-07-25T09:28:41+00:00",
  "revised_dates": [
    "2023-09-19T00:36:52+00:00",
    "2023-09-21T00:19:57+00:00",
    "2024-05-06T00:37:42+00:00"
  ],
  "abstract": "By using the gauge-gravity duality, we investigate the correlation function of flavored fermion in the \\mathrm{D}_{p}/\\mathrm{D}_{p+4} model as top-down approaches of holographic QCD for p=4,3. The bulk spinor, as the source of the flavored fermion in QCD, is identified to the worldvolume fermion on the flavor \\mathrm{D}_{p+4}-branes and the standard form of its action can be therefore obtained by the T-duality rules in string theory. Keeping this in hand, we afterwards generalize the prescription for two-point correlation function in AdS/CFT dictionary into general D-brane backgrounds and apply it to the case of p=4,3, i.e. the D4/D8 and D3/D7 approach respectively. Resultantly, our numerical calculation with the bubble background always displays discrete peaks in the correlation functions which imply the bound states created by the flavored fermions as the confinement in QCD. With the black brane background, the onshell condition illustrated by the correlation function covers basically the dispersion curves of fermion obtained by the hard thermal loop approximation in the hot medium. Finally, we interpret the flavored fermions in the bubble background as baryons by taking into account a baryon vertex, then find the two-point correlation function is able to fit the lowest baryon spectrum. In this sense, we conclude remarkably that our top-down approach in this work could reveal the fundamental properties of QCD both in the confined and deconfined phase.",
  "categories": [
    "hep-th"
  ],
  "primary_category": "hep-th",
  "doi": "10.1103/PhysRevD.109.086020",
  "journal_ref": null,
  "arxiv_id": "2307.13357",
  "pdf_url": null,
  "comment": "42 pages; 12 figures; 1 table; added a new figure",
  "num_versions": null,
  "size_before_bytes": 73327869,
  "size_after_bytes": 397616
}