{
  "title": "Open Problems in Computer Vision for Wilderness SAR and The Search for Patricia Wu-Murad",
  "authors": [
    "Thomas Manzini",
    "Robin Murphy"
  ],
  "submission_date": "2023-07-26T22:09:29+00:00",
  "revised_dates": [
    "2023-08-10T01:46:11+00:00"
  ],
  "abstract": "This paper details the challenges in applying two computer vision systems, an EfficientDET supervised learning model and the unsupervised RX spectral classifier, to 98.9 GB of drone imagery from the Wu-Murad wilderness search and rescue (WSAR) effort in Japan and identifies 3 directions for future research. There have been at least 19 proposed approaches and 3 datasets aimed at locating missing persons in drone imagery, but only 3 approaches (2 unsupervised and 1 of an unknown structure) are referenced in the literature as having been used in an actual WSAR operation. Of these proposed approaches, the EfficientDET architecture and the unsupervised spectral RX classifier were selected as the most appropriate for this setting. The EfficientDET model was applied to the HERIDAL dataset and despite achieving performance that is statistically equivalent to the state-of-the-art, the model fails to translate to the real world in terms of false positives (e.g., identifying tree limbs and rocks as people), and false negatives (e.g., failing to identify members of the search team). The poor results in practice for algorithms that showed good results on datasets suggest 3 areas of future research: more realistic datasets for wilderness SAR, computer vision models that are capable of seamlessly handling the variety of imagery that can be collected during actual WSAR operations, and better alignment on performance measures.",
  "categories": [
    "cs.CV",
    "cs.AI",
    "cs.LG"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14527",
  "pdf_url": "https://arxiv.org/pdf/2307.14527v2",
  "comment": "10 pages, 10 figures",
  "num_versions": null,
  "size_before_bytes": 5633543,
  "size_after_bytes": 207321
}