{
  "title": "MATNilm: Multi-appliance-task Non-intrusive Load Monitoring with Limited Labeled Data",
  "authors": [
    "Jing Xiong",
    "Tianqi Hong",
    "Dongbo Zhao",
    "Yu Zhang"
  ],
  "submission_date": "2023-07-27T11:14:11+00:00",
  "revised_dates": [
    "2023-07-29T04:10:22+00:00"
  ],
  "abstract": "Non-intrusive load monitoring (NILM) identifies the status and power consumption of various household appliances by disaggregating the total power usage signal of an entire house. Efficient and accurate load monitoring facilitates user profile establishment, intelligent household energy management, and peak load shifting. This is beneficial for both the end-users and utilities by improving the overall efficiency of a power distribution network. Existing approaches mainly focus on developing an individual model for each appliance. Those approaches typically rely on a large amount of household-labeled data which is hard to collect. In this paper, we propose a multi-appliance-task framework with a training-efficient sample augmentation (SA) scheme that boosts the disaggregation performance with limited labeled data. For each appliance, we develop a shared-hierarchical split structure for its regression and classification tasks. In addition, we also propose a two-dimensional attention mechanism in order to capture spatio-temporal correlations among all appliances. With only one-day training data and limited appliance operation profiles, the proposed SA algorithm can achieve comparable test performance to the case of training with the full dataset. Finally, simulation results show that our proposed approach features a significantly improved performance over many baseline models. The relative errors can be reduced by more than 50% on average. The codes of this work are available at https://github.com/jxiong22/MATNilm",
  "categories": [
    "cs.LG",
    "eess.SP"
  ],
  "primary_category": "cs.LG",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14778",
  "pdf_url": "https://arxiv.org/pdf/2307.14778v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 6255432,
  "size_after_bytes": 210368
}