{
  "title": "Subcycle tomography of quantum light",
  "authors": [
    "Geehyun Yang",
    "Matthias Kizmann",
    "Alfred Leitenstorfer",
    "Andrey S. Moskalenko"
  ],
  "submission_date": "2023-07-24T14:00:23+00:00",
  "revised_dates": [],
  "abstract": "Quantum light is considered to be one of the key resources of the coming second quantum revolution expected to give rise to groundbreaking technologies and applications. If the spatio-temporal and polarization structure of modes is known, the properties of quantum light are well understood. This information provides the basis for contemporary quantum optics and its applications in quantum communication and metrology. However, thinking about quantum light at the most fundamental timescale, namely the oscillation cycle of a mode or the inverse frequency of an involved photon, we realize that the corresponding picture has been missing until now. For instance, how to comprehend and characterize a single photon at this timescale? To fill this gap, we demonstrate theoretically how local quantum measurements allow to reconstruct and visualize a quantum field under study at subcycle scales, even when its temporal mode structure is a priori unknown. In particular, generation and tomography of ultrabroadband squeezed states as well as photon-subtracted states derived from them are described, incorporating also single-photon states. Our results set a cornerstone in the emerging chapter of quantum physics termed time-domain quantum optics. We expect this development to elicit new spectroscopic concepts for approaching e.g. fundamental correlations and entanglement in the dynamics of quantum matter, overcoming the temporal limitation set by the oscillation cycles of both light and elementary excitations.",
  "categories": [
    "quant-ph",
    "physics.optics"
  ],
  "primary_category": "quant-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12812",
  "pdf_url": null,
  "comment": "43 pages, 15 figures",
  "num_versions": null,
  "size_before_bytes": 4416765,
  "size_after_bytes": 172276
}