{
  "title": "Summaries, Highlights, and Action items: Design, implementation and evaluation of an LLM-powered meeting recap system",
  "authors": [
    "Sumit Asthana",
    "Sagih Hilleli",
    "Pengcheng He",
    "Aaron Halfaker"
  ],
  "submission_date": "2023-07-28T20:25:11+00:00",
  "revised_dates": [
    "2024-08-29T00:32:15+00:00",
    "2025-03-20T18:06:18+00:00"
  ],
  "abstract": "Meetings play a critical infrastructural role in coordinating work. The recent surge of hybrid and remote meetings in computer-mediated spaces has led to new problems (e.g., more time spent in less engaging meetings) and new opportunities (e.g., automated transcription/captioning and recap support). Advances in dialogue summarization offer the potential for improving post-meeting experiences, but fixed-length summaries often fail to meet diverse needs, such as quick overviews or detailed insights. To address these gaps, we use cognitive science and discourse theories to conceptualize two recap designs: important highlights and a structured, hierarchical minutes view, targeting complementary recap needs. We operationalize these representations into high-fidelity prototypes using dialogue summarization. Finally, we evaluate the representations' effectiveness with seven users in the context of their work meetings at Microsoft. Our results show both recap types are valuable in different contexts, enabling collaboration through discussions and consensus-building. Exploring the meaning of users adding, editing, and deleting from recaps suggests varying alignment for using these actions to improve AI-recap. Our design implications, such as incorporating organizational artifacts (e.g., linking presentations) in recaps and personalizing context, advance the discourse of effective recap designs for organizational work and support past results from cognition studies.",
  "categories": [
    "cs.HC",
    "cs.AI",
    "cs.IR"
  ],
  "primary_category": "cs.HC",
  "doi": "10.1145/3711074",
  "journal_ref": null,
  "arxiv_id": "2307.15793",
  "pdf_url": "https://arxiv.org/pdf/2307.15793v3",
  "comment": "Accepted at CSCW 2024",
  "num_versions": null,
  "size_before_bytes": 9394021,
  "size_after_bytes": 1814207
}