{
  "title": "Four years of Type Ia Supernovae Observed by TESS: Early Time Light Curve Shapes and Constraints on Companion Interaction Models",
  "authors": [
    "M. M. Fausnaugh",
    "P. J. Vallely",
    "M. A. Tucker",
    "C. S. Kochanek",
    "B. J. Shappee",
    "K. Z. Stanek",
    "George R. Ricker",
    "Roland Vanderspek",
    "Manan Agarwal",
    "Tansu Daylan",
    "Rahul Jayaraman",
    "Rebekah Hounsell",
    "Daniel Muthukrishna"
  ],
  "submission_date": "2023-07-21T18:00:02+00:00",
  "revised_dates": [
    "2023-07-31T00:02:25+00:00"
  ],
  "abstract": "We present 307 Type Ia supernova (SN) light curves from the first four years of the TESS mission. We use this sample to characterize the shapes of the early time light curves, measure the rise times from first light to peak, and search for companion star interactions. Using simulations, we show that light curves must have noise $<$10% of the peak to avoid biases in the early time light curve shape, restricting our quantitative analysis to 74 light curves. We find that the mean power law index $t^{β_1}$ of the early time light curves is 1.93$\\pm$ 0.57 and the mean rise time to peak is 15.7 $\\pm$ 3.5 days. We also estimate the underlying population distribution and find a Gaussian component with mean $β_1 = 2.29$, width 0.34, and a tail extending to values less than 1.0. We use model comparison techniques to test for the presence of companion interactions. In contrast to recent results in the literature, we find that the data can rarely distinguish between models with and without companion interactions, and caution is needed when claiming detections of early time flux excesses. Nevertheless, we find three high-quality SN light curves that tentatively prefer the addition of a companion interaction model, but the statistical evidence is not robust. We also find two SNe that disfavor the addition of a companion interaction model to a curved power law model. Taking the 74 SNe together, we calculate 3$σ$ upper limits on the presence of companion signatures to control for orientation effects that can hide companions in individual light curves. Our results rule out common progenitor systems with companions having Roche lobe radii $>$ 31 R$_{\\odot}$ (99.9% confidence level) and disfavor companions having Roche lobe radii $>$ 10 R$_{\\odot}$ (95% confidence level). Lastly, we discuss the implications of our results for the intrinsic fraction of single degenerate progenitor systems.",
  "categories": [
    "astro-ph.HE",
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.HE",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11815",
  "pdf_url": null,
  "comment": "40 pages, 23 figures, accepted for publication in ApJ. Figure sets for all 307 objects in Figures 3, 13, 14, and 16, can be viewed at https://space.mit.edu/home/faus/snIa_fig_sets/ in advance of the online journal article",
  "num_versions": null,
  "size_before_bytes": 16606842,
  "size_after_bytes": 1217358
}