{
  "title": "Construction of stationary trajectories for a model of a system of N particles with interaction",
  "authors": [
    "Igor Pavlov"
  ],
  "submission_date": "2023-05-24T16:11:10+00:00",
  "revised_dates": [],
  "abstract": "For the classical N-body problem, an approach is proposed based on the introduction of some natural in the physical sense optimization problems of mathematical programming for finding a conditional minimum for the characteristics of the system on the set of its possible states. The solution of these problems then makes it possible to construct families of flat stationary and periodic trajectories of the system and also to find relationships and estimates for the characteristics of the system on these trajectories. It is shown that when the system moves on a plane on trajectories generated by the global minimum in these optimization problems, at any time the minimum possible size of the system is achieved at each current level of its \"cohesion\" (or potential energy). Similar optimization problems are considered for finding a conditional minimum for the characteristics of a system in three-dimensional space. It is shown that the solution of these problems can be achieved only on flat trajectories of the system and is achieved, in particular, on the constructed flat stationary and periodic trajectories. In addition, it is shown that the trajectory of the system in three-dimensional space, at least at one point of which the minimum possible size of the system is achieved at the current value of its cohesion (or potential energy), can only be flat. And such trajectories are, in particular, flat stationary and periodic trajectories generated by the global minimum in the considered optimization problems.",
  "categories": [
    "math.DS",
    "astro-ph.GA",
    "math-ph",
    "math.OC"
  ],
  "primary_category": "math.DS",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13610",
  "pdf_url": null,
  "comment": "32 pages",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}