{
  "title": "Petz recovery from subsystems in conformal field theory",
  "authors": [
    "Shreya Vardhan",
    "Annie Y. Wei",
    "Yijian Zou"
  ],
  "submission_date": "2023-07-26T18:06:28+00:00",
  "revised_dates": [],
  "abstract": "We probe the multipartite entanglement structure of the vacuum state of a CFT in 1+1 dimensions, using recovery operations that attempt to reconstruct the density matrix in some region from its reduced density matrices on smaller subregions. We use an explicit recovery channel known as the twirled Petz map, and study distance measures such as the fidelity, relative entropy, and trace distance between the original state and the recovered state. One setup we study in detail involves three contiguous intervals $A$, $B$ and $C$ on a spatial slice, where we can view these quantities as measuring correlations between $A$ and $C$ that are not mediated by the region $B$ that lies between them. We show that each of the distance measures is both UV finite and independent of the operator content of the CFT, and hence depends only on the central charge and the cross-ratio of the intervals. We evaluate these universal quantities numerically using lattice simulations in critical spin chain models, and derive their analytic forms in the limit where $A$ and $C$ are close using the OPE expansion. In the case where $A$ and $C$ are far apart, we find a surprising non-commutativity of the replica trick with the OPE limit. For all values of the cross-ratio, the fidelity is strictly better than a general information-theoretic lower bound in terms of the conditional mutual information. We also compare the mutual information between various subsystems in the original and recovered states, which leads to a more qualitative understanding of the differences between them. Further, we introduce generalizations of the recovery operation to more than three adjacent intervals, for which the fidelity is again universal with respect to the operator content.",
  "categories": [
    "hep-th",
    "cond-mat.stat-mech",
    "cond-mat.str-el",
    "quant-ph"
  ],
  "primary_category": "hep-th",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14434",
  "pdf_url": null,
  "comment": "50+22 pages, 29 figures",
  "num_versions": null,
  "size_before_bytes": 8880135,
  "size_after_bytes": 3367821
}