{
  "title": "Learnability transitions in monitored quantum dynamics via eavesdropper's classical shadows",
  "authors": [
    "Matteo Ippoliti",
    "Vedika Khemani"
  ],
  "submission_date": "2023-07-27T17:14:02+00:00",
  "revised_dates": [
    "2023-07-30T03:35:00+00:00",
    "2024-04-05T18:29:15+00:00"
  ],
  "abstract": "Monitored quantum dynamics -- unitary evolution interspersed with measurements -- has recently emerged as a rich domain for phase structure in quantum many-body systems away from equilibrium. Here we study monitored dynamics from the point of view of an eavesdropper who has access to the classical measurement outcomes, but not to the quantum many-body system. We show that a measure of information flow from the quantum system to the classical measurement record -- the informational power -- undergoes a phase transition in correspondence with the measurement-induced phase transition (MIPT). This transition determines the eavesdropper's (in)ability to learn properties of an unknown initial quantum state of the system, given a complete classical description of the monitored dynamics and arbitrary classical computational resources. We make this learnability transition concrete by defining classical shadows protocols that the eavesdropper may apply to this problem, and show that the MIPT manifests as a transition in the sample complexity of various shadow estimation tasks, which become harder in the low-measurement phase. We focus on three applications of interest: Pauli expectation values (where we find the MIPT appears as a point of optimal learnability for typical Pauli operators), many-body fidelity, and global charge in $U(1)$-symmetric dynamics. Our work unifies different manifestations of the MIPT under the umbrella of learnability and gives this notion a general operational meaning via classical shadows.",
  "categories": [
    "quant-ph",
    "cond-mat.stat-mech"
  ],
  "primary_category": "quant-ph",
  "doi": "10.1103/PRXQuantum.5.020304",
  "journal_ref": "PRX Quantum 5, 020304 (2024)",
  "arxiv_id": "2307.15011",
  "pdf_url": "https://arxiv.org/pdf/2307.15011v3",
  "comment": "16+4 pages, 3 figures. v2: fixed error in Fig.1 panel labels. v3: published version",
  "num_versions": null,
  "size_before_bytes": 1585654,
  "size_after_bytes": 556092
}