{
  "title": "A Legendre-Fenchel identity for the nonlinear Schrödinger equations on $\\mathbb{R}^d\\times\\mathbb{T}^m$: theory and applications",
  "authors": [
    "Yongming Luo"
  ],
  "submission_date": "2023-07-30T07:37:37+00:00",
  "revised_dates": [
    "2023-08-21T17:58:09+00:00"
  ],
  "abstract": "The present paper is inspired by a previous work \\cite{Luo_Waveguide_MassCritical} of the author, where the large data scattering problem for the focusing cubic nonlinear Schrödinger equation (NLS) on $\\mathbb{R}^2\\times\\mathbb{T}$ was studied. Nevertheless, the results from \\cite{Luo_Waveguide_MassCritical} are by no means sharp, as we could not even prove the existence of ground state solutions on the formulated threshold. By making use of the variational tools introduced by the author \\cite{Luo_inter}, we establish in this paper the sharpened scattering results. Yet due to the mass-critical nature of the model, we encounter the major challenge that the standard scaling arguments fail to perturb the energy functionals. We overcome this difficulty by proving a crucial Legendre-Fenchel identity for the variational problems with prescribed mass and frequency. More precisely, we build up a general framework based on the Legendre-Fenchel identity and show that the much harder or even unsolvable variational problem with prescribed mass, can in fact be equivalently solved by considering the much easier variational problem with prescribed frequency. As an application showing how the geometry of the domain affects the existence of the ground state solutions, we also prove that while all mass-critical ground states on $\\mathbb{R}^d$ must possess the fixed mass $\\widehat M(Q)$, the existence of mass-critical ground states on $\\mathbb{R}^d\\times\\mathbb{T}$ is ensured for a sequence of mass numbers approaching zero.",
  "categories": [
    "math.AP"
  ],
  "primary_category": "math.AP",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16153",
  "pdf_url": "https://arxiv.org/pdf/2307.16153v2",
  "comment": "A gap in the proof of Thm 1.5 fixed. Thm. 1.5 reformulated",
  "num_versions": null,
  "size_before_bytes": 241383,
  "size_after_bytes": 241383
}