{
  "title": "A Tale of Two Disks: Mapping the Milky Way with the Final Data Release of APOGEE",
  "authors": [
    "Julie Imig",
    "Cathryn Price",
    "Jon A. Holtzman",
    "Alexander Stone-Martinez",
    "Steven R. Majewski",
    "David H. Weinberg",
    "Jennifer A. Johnson",
    "Carlos Allende Prieto",
    "Rachael L. Beaton",
    "Timothy C. Beers",
    "Dmitry Bizyaev",
    "Michael R. Blanton",
    "Joel R. Brownstein",
    "Katia Cunha",
    "José G. Fernández-Trincado",
    "Diane K. Feuillet",
    "Sten Hasselquist",
    "Christian R. Hayes",
    "Henrik Jönsson",
    "Richard R. Lane",
    "Jianhui Lian",
    "Szabolcs Mészáros",
    "David L. Nidever",
    "Annie C. Robin",
    "Matthew Shetrone",
    "Verne Smith",
    "John C. Wilson"
  ],
  "submission_date": "2023-07-26T01:27:31+00:00",
  "revised_dates": [],
  "abstract": "We present new maps of the Milky Way disk showing the distribution of metallicity ([Fe/H]), $α$-element abundances ([Mg/Fe]), and stellar age, using a sample of 66,496 red giant stars from the final data release (DR17) of the Apache Point Observatory Galactic Evolution Experiment (APOGEE) survey. We measure radial and vertical gradients, quantify the distribution functions for age and metallicity, and explore chemical clock relations across the Milky Way for the low-$α$ disk, high-$α$ disk, and total population independently. The low-$α$ disk exhibits a negative radial metallicity gradient of $-0.06 \\pm 0.001$ dex kpc$^{-1}$, which flattens with distance from the midplane. The high-$α$ disk shows a flat radial gradient in metallicity and age across nearly all locations of the disk. The age and metallicity distribution functions shift from negatively skewed in the inner Galaxy to positively skewed at large radius. Significant bimodality in the [Mg/Fe]-[Fe/H] plane and in the [Mg/Fe]-age relation persist across the entire disk. The age estimates have typical uncertainties of $\\sim0.15$ in $\\log$(age) and may be subject to additional systematic errors, which impose limitations on conclusions drawn from this sample. Nevertheless, these results act as critical constraints on galactic evolution models, constraining which physical processes played a dominant role in the formation of the Milky Way disk. We discuss how radial migration predicts many of the observed trends near the solar neighborhood and in the outer disk, but an additional more dramatic evolution history, such as the multi-infall model or a merger event, is needed to explain the chemical and age bimodality elsewhere in the Galaxy.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.3847/1538-4357/ace9b8",
  "journal_ref": "ApJ 954 124 (2023)",
  "arxiv_id": "2307.13887",
  "pdf_url": null,
  "comment": "41 pages, 32 figures, accepted to ApJ",
  "num_versions": null,
  "size_before_bytes": 11803852,
  "size_after_bytes": 773919
}