{
  "title": "Real-space quantum-to-classical transition of time dependent background fluctuations",
  "authors": [
    "S. Mahesh Chandran",
    "Karthik Rajeev",
    "S. Shankaranarayanan"
  ],
  "submission_date": "2023-07-25T16:17:30+00:00",
  "revised_dates": [
    "2024-02-12T01:04:19+00:00"
  ],
  "abstract": "Understanding the emergence of classical behavior from a quantum theory is vital to establishing the quantum origin for the temperature fluctuations observed in the Cosmic Microwave Background (CMB). We show that a real-space approach can comprehensively address the quantum-to-classical transition problem in the leading order of curvature perturbations. To this end, we test spatial bipartitions of quadratic systems for the interplay between three different signatures of classical behavior: i) decoherence, ii) peaking of the Wigner function about classical trajectories, and iii) relative suppression of non-commutativity in observables. We extract these signatures from the covariance matrix of a multi-mode Gaussian state and address them primarily in terms of entanglement entropy and log-classicality. Through a phase-space stability analysis of spatial sub-regions via their reduced Wigner function, we ascertain that the underlying cause for the dominance of classicality signatures is the occurrence of gapped inverted mode instabilities. While the choice of conjugate variables enhances some of these signatures, decoherence studied via entanglement entropy is the stronger and more reliable condition for classicality to emerge. We demonstrate the absence of decoherence, which preempts a quantum-to-classical transition of scalar fluctuations in an expanding background in $(1+1)$-dimensions using two examples: i) a Tanh-like expansion and ii) a de-Sitter expansion. We provide connection between log classicality and particle number by studying the evolution of each normal mode at late times. We then extend the analysis to leading order fluctuations in $(3+1)-$dimensions to show that a quantum-to-classical transition occurs in the de-Sitter expansion and discuss the relevance of our analysis in distinguishing cosmological models.",
  "categories": [
    "gr-qc",
    "astro-ph.CO",
    "hep-th",
    "quant-ph"
  ],
  "primary_category": "gr-qc",
  "doi": "10.1103/PhysRevD.109.023503",
  "journal_ref": null,
  "arxiv_id": "2307.13611",
  "pdf_url": null,
  "comment": "Version 2: 45 pages, 9 figures, 1 Table. Improved plots and included additional discussions. Results unchanged. Version accepted in Phys. Rev. D",
  "num_versions": null,
  "size_before_bytes": 3819983,
  "size_after_bytes": 928362
}