{
  "title": "Signature of nodal topology in nonlinear quantum transport across junctions in Weyl and multi-Weyl semimetals",
  "authors": [
    "Suvendu Ghosh",
    "Snehasish Nandy",
    "Jian-Xin Zhu",
    "A. Taraphder"
  ],
  "submission_date": "2023-07-21T17:48:06+00:00",
  "revised_dates": [
    "2023-08-15T00:22:21+00:00",
    "2024-02-02T01:18:14+00:00"
  ],
  "abstract": "We investigate quantum transport through a rectangular potential barrier in Weyl semimetals (WSMs) and multi-Weyl semimetals (MSMs), within the framework of Landauer-Büttiker formalism. Our study uncovers the role of nodal topology imprinted in the electric current and the shot noise. We find that, in contrast to the finite odd-order conductance and noise power, the even-order contributions vanish at the nodes. Additionally, depending on the topological charge ($J$), the linear conductance ($G_1$) scales with the Fermi energy ($E_F$) as $G_1^{E_F>U}\\propto E_F^{2/J}$. We demonstrate that the $E_F$-dependence of the second-order conductance and shot noise power could quite remarkably distinguish an MSM from a WSM depending on the band topology, and may induce several smoking gun experiments in nanostructures made out of WSMs and MSMs. Analyzing shot noise and Fano factor, we show that the transport across the rectangular barrier follows the sub-Poissonian statistics. Interestingly, we obtain universal values of Fano factor at the nodes unique to their topological charges. The universality for a fixed $J$, however, indicates that only a fixed number of open channels participate in the transport through evanescent waves at the nodes. The proposed results can serve as a potential diagnostic tool to identify different topological systems in experiments.",
  "categories": [
    "cond-mat.mes-hall",
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.mes-hall",
  "doi": "10.1103/PhysRevB.109.045437",
  "journal_ref": "Phys. Rev. B 109, 045437 (2024)",
  "arxiv_id": "2307.11737",
  "pdf_url": null,
  "comment": "12 pages, 5 figures, Comments are welcome",
  "num_versions": null,
  "size_before_bytes": 4796086,
  "size_after_bytes": 328223
}