{
  "title": "Learning heterogeneous delays in a layer of spiking neurons for fast motion detection",
  "authors": [
    "Antoine Grimaldi",
    "Laurent U Perrinet"
  ],
  "submission_date": "2023-07-26T10:01:04+00:00",
  "revised_dates": [],
  "abstract": "The precise timing of spikes emitted by neurons plays a crucial role in shaping the response of efferent biological neurons. This temporal dimension of neural activity holds significant importance in understanding information processing in neurobiology, especially for the performance of neuromorphic hardware, such as event-based cameras. Nonetheless, many artificial neural models disregard this critical temporal dimension of neural activity. In this study, we present a model designed to efficiently detect temporal spiking motifs using a layer of spiking neurons equipped with heterogeneous synaptic delays. Our model capitalizes on the diverse synaptic delays present on the dendritic tree, enabling specific arrangements of temporally precise synaptic inputs to synchronize upon reaching the basal dendritic tree. We formalize this process as a time-invariant logistic regression, which can be trained using labeled data. To demonstrate its practical efficacy, we apply the model to naturalistic videos transformed into event streams, simulating the output of the biological retina or event-based cameras. To evaluate the robustness of the model in detecting visual motion, we conduct experiments by selectively pruning weights and demonstrate that the model remains efficient even under significantly reduced workloads. In conclusion, by providing a comprehensive, event-driven computational building block, the incorporation of heterogeneous delays has the potential to greatly improve the performance of future spiking neural network algorithms, particularly in the context of neuromorphic chips.",
  "categories": [
    "q-bio.NC"
  ],
  "primary_category": "q-bio.NC",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14077",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 968144,
  "size_after_bytes": 299802
}