{
  "title": "Constraints on the ghost-free parity-violating gravity from Laser-ranged Satellites",
  "authors": [
    "Jin Qiao",
    "Zhao Li",
    "Ran Ji",
    "Tao Zhu",
    "Guoliang Li",
    "Wen Zhao",
    "Jiming Chen"
  ],
  "submission_date": "2023-07-24T15:30:02+00:00",
  "revised_dates": [
    "2023-11-07T01:38:10+00:00"
  ],
  "abstract": "This paper explores the evolutionary behavior of the Earth-satellite binary system within the framework of the ghost-free parity-violating gravity and the corresponding discussion on the parity-violating effect from the laser-ranged satellites. For this purpose, we start our study with the Parameterized Post-Newtonian (PPN) metric of this gravity theory to study the orbital evolution of the satellites in which the spatial-time sector of the spacetime is modified due to the parity violation. With this modified PPN metric, we calculate the effects of the parity-violating sector of metrics on the time evolution of the orbital elements for an Earth-satellite binary system. We find that among the five orbital elements, the parity violation has no effect on the semi-latus rectum, while the eccentricity and ascending node are affected only in a periodic manner. These three orbital elements are the same as the results of general relativity and are also consistent with the observations of the present experiment. In particular, parity violation produces non-zero corrections to the eccentricity and pericenter, which will accumulate with the evolution of time, indicating that the parity violation of gravity produces observable secular effects. The observational constraint on the parity-violating effect is derived by confronting the theoretical prediction with the observation by the LAGEOS II pericenter advance, giving a constraint on the parity-violating parameter space from the satellite experiments.",
  "categories": [
    "gr-qc"
  ],
  "primary_category": "gr-qc",
  "doi": "10.1088/1475-7516/2023/10/066",
  "journal_ref": "JCAP 10(2023)066",
  "arxiv_id": "2307.12886",
  "pdf_url": null,
  "comment": "13 pages, no figure",
  "num_versions": null,
  "size_before_bytes": 145807,
  "size_after_bytes": 147621
}