{
  "title": "Observational Signatures of Modified Bardeen Black Hole: Shadow and Strong Gravitational Lensing",
  "authors": [
    "Niyaz Uddin Molla",
    "Amna Ali",
    "Ujjal Debnath"
  ],
  "submission_date": "2023-07-21T09:46:23+00:00",
  "revised_dates": [
    "2023-11-21T01:16:04+00:00"
  ],
  "abstract": "This paper is devoted to studying the observational signatures modified by Bardeen black hole via shadow and strong lensing observations. Influence of the modified Bardeen black hole parameters q, g, and the parameter $μ$ on the shadow radius of the black hole have been investigated numerically and graphically. Recently, EHT collaboration observed the image and shadow of supermassive black holes $M87^*$ and $SgrA^*$ where the shadow angular diameter $θ_d=42\\pm3$ for $M87^*$ and $θ_d=51.8\\pm2.3$ for $SgrA^*$. The modified black hole parameters q and $μ$ for the fixed value of g have been constrained by the EHT collaboration data for the angular shadow diameter of $M87^*$ and $SgrA^*$. It has been observed that the constrain ranges of the parameters $μ$ and $q$ of modified Bardeen black hole as $-0.89\\leq μ/8M^2 \\leq 0.4$ and $0\\leq |q|\\leq 0.185$ for $M87^*$; and $-1.38\\leq μ/8M^2 \\leq 0.1$ and $0\\leq |q|\\leq 0.058$ for $SgrA^*$, keeping the fixed value $g/2M=0.2$. Modified Bardeen black holes with the additional parameters $μ$,$g$ and $q$ besides the mass M of the black hole as the supermassive black holes $M87^*$ and $SgrA^*$; and it is observed that to be a viable astrophysical black hole candidate. Furthermore, Gravitational lensing in the strong field limit for modified Bardeen black hole has been investigated numerically as well as graphically and compared to the other ordinary astrophysical black hole such as Schwarzschild ($μ=\\&q=0$) and regular Bardeen ($μ=0$) black hole.",
  "categories": [
    "gr-qc",
    "astro-ph.CO"
  ],
  "primary_category": "gr-qc",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11798",
  "pdf_url": null,
  "comment": "20 pages, 30 figures",
  "num_versions": null,
  "size_before_bytes": 36292027,
  "size_after_bytes": 385986
}