{
  "title": "Validating polyp and instrument segmentation methods in colonoscopy through Medico 2020 and MedAI 2021 Challenges",
  "authors": [
    "Debesh Jha",
    "Vanshali Sharma",
    "Debapriya Banik",
    "Debayan Bhattacharya",
    "Kaushiki Roy",
    "Steven A. Hicks",
    "Nikhil Kumar Tomar",
    "Vajira Thambawita",
    "Adrian Krenzer",
    "Ge-Peng Ji",
    "Sahadev Poudel",
    "George Batchkala",
    "Saruar Alam",
    "Awadelrahman M. A. Ahmed",
    "Quoc-Huy Trinh",
    "Zeshan Khan",
    "Tien-Phat Nguyen",
    "Shruti Shrestha",
    "Sabari Nathan",
    "Jeonghwan Gwak",
    "Ritika K. Jha",
    "Zheyuan Zhang",
    "Alexander Schlaefer",
    "Debotosh Bhattacharjee",
    "M. K. Bhuyan",
    "Pradip K. Das",
    "Deng-Ping Fan",
    "Sravanthi Parsa",
    "Sharib Ali",
    "Michael A. Riegler",
    "Pål Halvorsen",
    "Thomas De Lange",
    "Ulas Bagci"
  ],
  "submission_date": "2023-07-30T16:08:45+00:00",
  "revised_dates": [
    "2023-09-09T09:29:35+00:00",
    "2023-09-28T07:03:10+00:00",
    "2024-05-06T18:40:43+00:00"
  ],
  "abstract": "Automatic analysis of colonoscopy images has been an active field of research motivated by the importance of early detection of precancerous polyps. However, detecting polyps during the live examination can be challenging due to various factors such as variation of skills and experience among the endoscopists, lack of attentiveness, and fatigue leading to a high polyp miss-rate. Deep learning has emerged as a promising solution to this challenge as it can assist endoscopists in detecting and classifying overlooked polyps and abnormalities in real time. In addition to the algorithm's accuracy, transparency and interpretability are crucial to explaining the whys and hows of the algorithm's prediction. Further, most algorithms are developed in private data, closed source, or proprietary software, and methods lack reproducibility. Therefore, to promote the development of efficient and transparent methods, we have organized the \"Medico automatic polyp segmentation (Medico 2020)\" and \"MedAI: Transparency in Medical Image Segmentation (MedAI 2021)\" competitions. We present a comprehensive summary and analyze each contribution, highlight the strength of the best-performing methods, and discuss the possibility of clinical translations of such methods into the clinic. For the transparency task, a multi-disciplinary team, including expert gastroenterologists, accessed each submission and evaluated the team based on open-source practices, failure case analysis, ablation studies, usability and understandability of evaluations to gain a deeper understanding of the models' credibility for clinical deployment. Through the comprehensive analysis of the challenge, we not only highlight the advancements in polyp and surgical instrument segmentation but also encourage qualitative evaluation for building more transparent and understandable AI-based colonoscopy systems.",
  "categories": [
    "eess.IV",
    "cs.CV"
  ],
  "primary_category": "eess.IV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16262",
  "pdf_url": "https://arxiv.org/pdf/2307.16262v4",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 83946821,
  "size_after_bytes": 1847911
}