{
  "title": "Towards General Low-Light Raw Noise Synthesis and Modeling",
  "authors": [
    "Feng Zhang",
    "Bin Xu",
    "Zhiqiang Li",
    "Xinran Liu",
    "Qingbo Lu",
    "Changxin Gao",
    "Nong Sang"
  ],
  "submission_date": "2023-07-31T09:10:10+00:00",
  "revised_dates": [
    "2023-08-17T12:10:15+00:00"
  ],
  "abstract": "Modeling and synthesizing low-light raw noise is a fundamental problem for computational photography and image processing applications. Although most recent works have adopted physics-based models to synthesize noise, the signal-independent noise in low-light conditions is far more complicated and varies dramatically across camera sensors, which is beyond the description of these models. To address this issue, we introduce a new perspective to synthesize the signal-independent noise by a generative model. Specifically, we synthesize the signal-dependent and signal-independent noise in a physics- and learning-based manner, respectively. In this way, our method can be considered as a general model, that is, it can simultaneously learn different noise characteristics for different ISO levels and generalize to various sensors. Subsequently, we present an effective multi-scale discriminator termed Fourier transformer discriminator (FTD) to distinguish the noise distribution accurately. Additionally, we collect a new low-light raw denoising (LRD) dataset for training and benchmarking. Qualitative validation shows that the noise generated by our proposed noise model can be highly similar to the real noise in terms of distribution. Furthermore, extensive denoising experiments demonstrate that our method performs favorably against state-of-the-art methods on different sensors.",
  "categories": [
    "cs.CV",
    "cs.MM",
    "eess.IV"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": "Proceedings of the IEEE/CVF International Conference on Computer Vision (ICCV), 2023, pp. 10820-10830",
  "arxiv_id": "2307.16508",
  "pdf_url": "https://arxiv.org/pdf/2307.16508v2",
  "comment": "11 pages, 7 figures. Accepted by ICCV 2023",
  "num_versions": null,
  "size_before_bytes": 12065948,
  "size_after_bytes": 198547
}