{
  "title": "Estimating the number of planets that PLATO can detect",
  "authors": [
    "F. Matuszewski",
    "N. Nettelmann",
    "J. Cabrera",
    "A. Börner",
    "H. Rauer"
  ],
  "submission_date": "2023-07-22T20:39:09+00:00",
  "revised_dates": [],
  "abstract": "The PLATO mission is scheduled for launch in 2026. This study aims to estimate the number of exoplanets that PLATO can detect as a function of planetary size and period, stellar brightness, and observing strategy options. Deviations from these estimates will be informative of the true occurrence rates of planets, which helps constraining planet formation models. For this purpose, we developed the Planet Yield for PLATO estimator (PYPE), which adopts a statistical approach. We apply given occurrence rates from planet formation models and from different search and vetting pipelines for the Kepler data. We estimate the stellar sample to be observed by PLATO using a fraction of the all-sky PLATO stellar input catalog (PIC). PLATO detection efficiencies are calculated under different assumptions that are presented in detail in the text. The results presented here primarily consider the current baseline observing duration of four years. We find that the expected PLATO planet yield increases rapidly over the first year and begins to saturate after two years. A nominal (2+2) four-year mission could yield about several thousand to several tens of thousands of planets, depending on the assumed planet occurrence rates. We estimate a minimum of 500 Earth-size (0.8-1.25 RE) planets, about a dozen of which would reside in a 250-500d period bin around G stars. We find that one-third of the detected planets are around stars bright enough (V $\\leq 11$) for RV-follow-up observations. We find that a three-year-long observation followed by 6 two-month short observations (3+1 years) yield roughly twice as many planets as two long observations of two years (2+2 years). The former strategy is dominated by short-period planets, while the latter is more beneficial for detecting earths in the habitable zone.",
  "categories": [
    "astro-ph.EP"
  ],
  "primary_category": "astro-ph.EP",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12163",
  "pdf_url": null,
  "comment": "14 pages, 11 figures, accepted by A&A (July 5, 2023)",
  "num_versions": null,
  "size_before_bytes": 6375179,
  "size_after_bytes": 1288339
}