{
  "title": "Cancellation of small-x divergences in the three-gluon-vertex Hamiltonian with canonical gluon mass",
  "authors": [
    "Juan José Gálvez-Viruet",
    "María Gómez-Rocha"
  ],
  "submission_date": "2023-07-26T11:12:38+00:00",
  "revised_dates": [],
  "abstract": "The front form of Hamiltonian dynamics provides a framework within QCD in which interaction terms are invariant under 7 of 10 Poincaré transformations and the vacuum structure is simple. However, canonical expressions are divergent and must be regulated before attempting to define an eigenvalue problem. The renormalization group procedure for effective particles (RGPEP) provides a systematic way of renormalizing Hamiltonians and obtaining counterterms. One of its achievements is the description of asymptotic freedom with a running coupling defined as the coefficient of the three-gluon-vertex operators in the renormalized Hamiltonian. Yet, the results we obtain need a deeper understanding since the coefficient function shows a finite cutoff dependence, at least in the third-order terms of the perturbative expansion. In this work, we present an RGPEP computation of the three-gluon vertex with a different regularization scheme based on massive gluons. Our calculation shows that the three-gluon Hamiltonian interaction term has a finite limit as the gluon mass vanishes, but the finite function $h(x)$ that was obtained in previous calculations as a consequence of the finite dependence on the regularization is different. This result indicates a need for understanding how to eliminate finite regularization effects from Hamiltonians for effective quarks and gluons in QCD. Nevertheless, it is remarkable that all terms depending on the gluon mass cancel out in the limit of vanishing gluon mass in a non trivial way, even when each term individually diverges in such limit.",
  "categories": [
    "hep-ph",
    "nucl-th"
  ],
  "primary_category": "hep-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14108",
  "pdf_url": null,
  "comment": "13 pages, 12 figures",
  "num_versions": null,
  "size_before_bytes": 2821468,
  "size_after_bytes": 1055480
}