{
  "title": "The radio emission in radio-quiet quasars: the VLBA perspective",
  "authors": [
    "Sina Chen",
    "Ari Laor",
    "Ehud Behar",
    "Ranieri D. Baldi",
    "Joseph D. Gelfand"
  ],
  "submission_date": "2023-07-25T16:01:46+00:00",
  "revised_dates": [],
  "abstract": "The origin of the radio emission in radio-quiet quasars (RQQ) is not established yet. We present new VLBA observations at 1.6 and 4.9 GHz of ten RQQ (nine detected), which together with published earlier observations of eight RQQ (five detected), forms a representative sample of 18 RQQ drawn from the Palomar-Green sample of low z (< 0.5) AGN. The spectral slope of the integrated emission extends from very steep (alpha < -1.98) to strongly inverted (alpha = +2.18), and the slopes of nine of the 14 objects are flat (alpha > -0.5). Most objects have an unresolved flat-spectrum core, which coincides with the optical Gaia position. The extended emission is generally steep-spectrum, has a low brightness temperature (< 10^7 K), and is displaced from the optical core (the Gaia position) by ~ 5-100 pc. The VLBA core flux is tightly correlated with the X-ray flux, and follows a radio to X-ray luminosity relation of log L_R/L_X = -6, for all objects with a black hole mass log M_BH/M_Sun < 8.5. The flatness of the core emission implies a compact source size (< 0.1 pc), which likely originates from the accretion disk corona. The mas-scale extended emission is optically thin and of clumpy structure, and is likely produced by an outflow from the center. Radio observations at higher frequencies can further test the accretion disk coronal emission interpretation for the core emission in RQQ.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.1093/mnras/stad2289",
  "journal_ref": null,
  "arxiv_id": "2307.13599",
  "pdf_url": null,
  "comment": "Accepted for publication in MNRAS",
  "num_versions": null,
  "size_before_bytes": 6644762,
  "size_after_bytes": 222778
}