{
  "title": "Impact of Transportation Network Companies on Labor Supply and Wages for Taxi Drivers",
  "authors": [
    "Lu Ling",
    "Xinwu Qian",
    "Satish V. Ukkusuri"
  ],
  "submission_date": "2023-07-25T16:23:12+00:00",
  "revised_dates": [],
  "abstract": "While the growth of TNCs took a substantial part of ridership and asset value away from the traditional taxi industry, existing taxi market policy regulations and planning models remain to be reexamined, which requires reliable estimates of the sensitivity of labor supply and income levels in the taxi industry. This study aims to investigate the impact of TNCs on the labor supply of the taxi industry, estimate wage elasticity, and understand the changes in taxi drivers' work preferences. We introduce the wage decomposition method to quantify the effects of TNC trips on taxi drivers' work hours over time, based on taxi and TNC trip record data from 2013 to 2018 in New York City. The data are analyzed to evaluate the changes in overall market performances and taxi drivers' work behavior through statistical analyses, and our results show that the increase in TNC trips not only decreases the income level of taxi drivers but also discourages their willingness to work. We find that 1% increase in TNC trips leads to 0.28% reduction in the monthly revenue of the yellow taxi industry and 0.68% decrease in the monthly revenue of the green taxi industry in recent years. More importantly, we report that the work behavior of taxi drivers shifts from the widely accepted neoclassical standard behavior to the reference-dependent preference (RDP) behavior, which signifies a persistent trend of loss in labor supply for the taxi market and hints at the collapse of taxi industry if the growth of TNCs continues. In addition, we observe that yellow and green taxi drivers present different work preferences over time. Consistently increasing RDP behavior is found among yellow taxi drivers. Green taxi drivers were initially revenue maximizers but later turned into income targeting strategy",
  "categories": [
    "stat.AP",
    "econ.GN",
    "physics.soc-ph"
  ],
  "primary_category": "stat.AP",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13620",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1602260,
  "size_after_bytes": 230341
}