{
  "title": "Robust iterative method for symmetric quantum signal processing in all parameter regimes",
  "authors": [
    "Yulong Dong",
    "Lin Lin",
    "Hongkang Ni",
    "Jiasu Wang"
  ],
  "submission_date": "2023-07-24T01:45:12+00:00",
  "revised_dates": [],
  "abstract": "This paper addresses the problem of solving nonlinear systems in the context of symmetric quantum signal processing (QSP), a powerful technique for implementing matrix functions on quantum computers. Symmetric QSP focuses on representing target polynomials as products of matrices in SU(2) that possess symmetry properties. We present a novel Newton's method tailored for efficiently solving the nonlinear system involved in determining the phase factors within the symmetric QSP framework. Our method demonstrates rapid and robust convergence in all parameter regimes, including the challenging scenario with ill-conditioned Jacobian matrices, using standard double precision arithmetic operations. For instance, solving symmetric QSP for a highly oscillatory target function $α\\cos(1000 x)$ (polynomial degree $\\approx 1433$) takes $6$ iterations to converge to machine precision when $α=0.9$, and the number of iterations only increases to $18$ iterations when $α=1-10^{-9}$ with a highly ill-conditioned Jacobian matrix. Leveraging the matrix product states the structure of symmetric QSP, the computation of the Jacobian matrix incurs a computational cost comparable to a single function evaluation. Moreover, we introduce a reformulation of symmetric QSP using real-number arithmetics, further enhancing the method's efficiency. Extensive numerical tests validate the effectiveness and robustness of our approach, which has been implemented in the QSPPACK software package.",
  "categories": [
    "quant-ph",
    "math.NA"
  ],
  "primary_category": "quant-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12468",
  "pdf_url": null,
  "comment": "22 pages, 14 figures",
  "num_versions": null,
  "size_before_bytes": 3351000,
  "size_after_bytes": 124898
}