{
  "title": "Large-scale universality in quantum reaction-diffusion from Keldysh field theory",
  "authors": [
    "Federico Gerbino",
    "Igor Lesanovsky",
    "Gabriele Perfetto"
  ],
  "submission_date": "2023-07-27T15:36:49+00:00",
  "revised_dates": [
    "2023-08-21T14:50:29+00:00",
    "2024-06-29T14:14:00+00:00"
  ],
  "abstract": "We consider the quantum reaction-diffusion dynamics in $d$ spatial dimensions of a Fermi gas subject to binary annihilation reactions $A+A \\to \\emptyset$. These systems display collective nonequilibrium long-time behavior, which is signalled by an algebraic decay of the particle density. Building on the Keldysh formalism, we devise a field theoretical approach for the reaction-limited regime, where annihilation reactions are scarce. By means of a perturbative expansion of the dissipative interaction, we derive a description in terms of a large-scale universal kinetic equation. Our approach shows how the time-dependent generalized Gibbs ensemble assumption, which is often employed for treating low-dimensional nonequilibrium systems, emerges from systematic diagrammatics. It also allows to exactly compute -- for arbitrary spatial dimension -- the decay exponent of the particle density. The latter is based on the large-scale description of the quantum dynamics and it differs from the mean-field prediction even in dimension larger than one. We moreover consider spatially inhomogeneous setups involving an external potential. In confined systems the density decay is accelerated towards the mean-field algebraic behavior, while for deconfined scenarios the power-law decay is replaced by a slower non-algebraic decay.",
  "categories": [
    "cond-mat.stat-mech",
    "cond-mat.quant-gas"
  ],
  "primary_category": "cond-mat.stat-mech",
  "doi": "10.1103/PhysRevB.109.L220304",
  "journal_ref": "Physical Review B, 109(22), L220304 (2024)",
  "arxiv_id": "2307.14945",
  "pdf_url": "https://arxiv.org/pdf/2307.14945v3",
  "comment": "8+10 pages, 3+2 figures for main text and Supplemental Material respectively",
  "num_versions": null,
  "size_before_bytes": 3019006,
  "size_after_bytes": 532112
}