{
  "title": "Electronic and Spin-Orbit Properties of hBN Encapsulated Bilayer Graphene",
  "authors": [
    "Klaus Zollner",
    "Eike Icking",
    "Jaroslav Fabian"
  ],
  "submission_date": "2023-07-21T16:52:31+00:00",
  "revised_dates": [
    "2023-09-27T00:19:00+00:00"
  ],
  "abstract": "Van der Waals (vdW) heterostructures consisting of Bernal bilayer graphene (BLG) and hexagonal boron nitride (hBN) are investigated. By performing first-principles calculations we capture the essential BLG band structure features for several stacking and encapsulation scenarios. A low-energy model Hamiltonian, comprising orbital and spin-orbit coupling (SOC) terms, is employed to reproduce the hBN-modified BLG dispersion, spin splittings, and spin expectation values. Most important, the hBN layers open an orbital gap in the BLG spectrum, which can range from zero to tens of meV, depending on the precise stacking arrangement of the individual atoms. Therefore, large local band gap variations may arise in experimentally relevant moiré structures. Moreover, the SOC parameters are small (few to tens of $μ$eV), just as in bare BLG, but are markedly proximity modified by the hBN layers. Especially when BLG is encapsulated by monolayers of hBN, such that inversion symmetry is restored, the orbital gap and spin splittings of the bands vanish. In addition, we show that a transverse electric field mainly modifies the potential difference between the graphene layers, which perfectly correlates with the orbital gap for fields up to about 1~V/nm. Moreover, the layer-resolved Rashba couplings are tunable by $\\sim 5~μ$eV per V/nm. Finally, by investigating twisted BLG/hBN structures, with twist angles between 6$^{\\circ}$ -- 20$^{\\circ}$, we find that the global band gap increases linearly with the twist angle. The extrapolated $0^{\\circ}$ band gap is about 23~meV and results roughly from the average of the stacking-dependent local band gaps. Our investigations give new insights into proximity spin physics of hBN/BLG heterostructures, which should be useful for interpreting experiments on extended as well as confined (quantum dot) systems.",
  "categories": [
    "cond-mat.mes-hall"
  ],
  "primary_category": "cond-mat.mes-hall",
  "doi": "10.1103/PhysRevB.108.125126",
  "journal_ref": "Phys. Rev. B 108, 125126 (2023)",
  "arxiv_id": "2307.11697",
  "pdf_url": null,
  "comment": "16 pages, 9 figures, 7 tables",
  "num_versions": null,
  "size_before_bytes": 7241143,
  "size_after_bytes": 943324
}