{
  "title": "DisguisOR: Holistic Face Anonymization for the Operating Room",
  "authors": [
    "Lennart Bastian",
    "Tony Danjun Wang",
    "Tobias Czempiel",
    "Benjamin Busam",
    "Nassir Navab"
  ],
  "submission_date": "2023-07-26T15:10:54+00:00",
  "revised_dates": [],
  "abstract": "Purpose: Recent advances in Surgical Data Science (SDS) have contributed to an increase in video recordings from hospital environments. While methods such as surgical workflow recognition show potential in increasing the quality of patient care, the quantity of video data has surpassed the scale at which images can be manually anonymized. Existing automated 2D anonymization methods under-perform in Operating Rooms (OR), due to occlusions and obstructions. We propose to anonymize multi-view OR recordings using 3D data from multiple camera streams. Methods: RGB and depth images from multiple cameras are fused into a 3D point cloud representation of the scene. We then detect each individual's face in 3D by regressing a parametric human mesh model onto detected 3D human keypoints and aligning the face mesh with the fused 3D point cloud. The mesh model is rendered into every acquired camera view, replacing each individual's face. Results: Our method shows promise in locating faces at a higher rate than existing approaches. DisguisOR produces geometrically consistent anonymizations for each camera view, enabling more realistic anonymization that is less detrimental to downstream tasks. Conclusion: Frequent obstructions and crowding in operating rooms leaves significant room for improvement for off-the-shelf anonymization methods. DisguisOR addresses privacy on a scene level and has the potential to facilitate further research in SDS.",
  "categories": [
    "cs.CV"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14241",
  "pdf_url": null,
  "comment": "Accepted at IPCAI 2023; 21 pages, 11 figures",
  "num_versions": null,
  "size_before_bytes": 11627356,
  "size_after_bytes": 248513
}