{
  "title": "Supernova Emission of Secretly Interacting Neutrino Fluid: Theoretical Foundations",
  "authors": [
    "Damiano F. G. Fiorillo",
    "Georg Raffelt",
    "Edoardo Vitagliano"
  ],
  "submission_date": "2023-07-27T18:00:06+00:00",
  "revised_dates": [
    "2024-01-11T16:14:26+00:00"
  ],
  "abstract": "Neutrino-neutrino scattering could have a large secret component that would turn neutrinos within a supernova (SN) core into a self-coupled fluid. Neutrino transport within the SN core, emission from its surface, expansion into space, and the flux spectrum and time structure at Earth might all be affected. We examine these questions from first principles. First, diffusive transport differs only by a modified spectral average of the interaction rate. We next study the fluid energy transfer between a hot and a cold blackbody surface in plane-parallel and spherical geometry. The key element is the decoupling process within the radiating bodies, which themselves are taken to be isothermal. For a zero-temperature cold plate, mimicking radiation into free space by the hot plate, the energy flux is 3--4\\% smaller than the usual Stefan-Boltzmann Law. The fluid energy density just outside the hot plate is numerically 0.70 of the standard case, the outflow velocity is the speed of sound $v_s=c/\\sqrt{3}$, conspiring to a nearly unchanged energy flux. Our results provide the crucial boundary condition for the expansion of the self-interacting fluid into space, assuming an isothermal neutrino sphere. We also derive a dynamical solution, assuming the emission suddenly begins at some instant. A neutrino front expands in space with luminal speed, whereas the outflow velocity at the radiating surface asymptotically approaches $v_s$ from above. Asymptotically, one thus recovers the steady-state emission found in the two-plate model. A sudden end to neutrino emission leads to a fireball with constant thickness equal to the duration of neutrino emission.",
  "categories": [
    "hep-ph",
    "astro-ph.HE"
  ],
  "primary_category": "hep-ph",
  "doi": "10.1103/PhysRevD.109.023017",
  "journal_ref": null,
  "arxiv_id": "2307.15122",
  "pdf_url": "https://arxiv.org/pdf/2307.15122v2",
  "comment": "Version accepted at PRD, with revised notation; 20 pages, 8 figures",
  "num_versions": null,
  "size_before_bytes": 7229901,
  "size_after_bytes": 372748
}