{
  "title": "SafeSteps: Learning Safer Footstep Planning Policies for Legged Robots via Model-Based Priors",
  "authors": [
    "Shafeef Omar",
    "Lorenzo Amatucci",
    "Victor Barasuol",
    "Giulio Turrisi",
    "Claudio Semini"
  ],
  "submission_date": "2023-07-24T10:10:24+00:00",
  "revised_dates": [
    "2023-10-13T00:17:05+00:00",
    "2023-11-28T01:30:17+00:00",
    "2025-01-30T01:40:12+00:00"
  ],
  "abstract": "We present a footstep planning policy for quadrupedal locomotion that is able to directly take into consideration a-priori safety information in its decisions. At its core, a learning process analyzes terrain patches, classifying each landing location by its kinematic feasibility, shin collision, and terrain roughness. This information is then encoded into a small vector representation and passed as an additional state to the footstep planning policy, which furthermore proposes only safe footstep location by applying a masked variant of the Proximal Policy Optimization algorithm. The performance of the proposed approach is shown by comparative simulations and experiments on an electric quadruped robot walking in different rough terrain scenarios. We show that violations of the above safety conditions are greatly reduced both during training and the successive deployment of the policy, resulting in an inherently safer footstep planner. Furthermore, we show how, as a byproduct, fewer reward terms are needed to shape the behavior of the policy, which in return is able to achieve both better final performances and sample efficiency.",
  "categories": [
    "cs.RO"
  ],
  "primary_category": "cs.RO",
  "doi": "10.1109/Humanoids57100.2023.10375218",
  "journal_ref": "2023 IEEE-RAS 22nd International Conference on Humanoid Robots (Humanoids), pp. 1-8",
  "arxiv_id": "2307.12664",
  "pdf_url": null,
  "comment": "Accepted for publication at the 2023 IEEE-RAS International Conference on Humanoid Robots (Humanoids)",
  "num_versions": null,
  "size_before_bytes": 37714965,
  "size_after_bytes": 1341915
}