{
  "title": "SAKSHI: Decentralized AI Platforms",
  "authors": [
    "Suma Bhat",
    "Canhui Chen",
    "Zerui Cheng",
    "Zhixuan Fang",
    "Ashwin Hebbar",
    "Sreeram Kannan",
    "Ranvir Rana",
    "Peiyao Sheng",
    "Himanshu Tyagi",
    "Pramod Viswanath",
    "Xuechao Wang"
  ],
  "submission_date": "2023-07-31T10:48:56+00:00",
  "revised_dates": [],
  "abstract": "Large AI models (e.g., Dall-E, GPT4) have electrified the scientific, technological and societal landscape through their superhuman capabilities. These services are offered largely in a traditional web2.0 format (e.g., OpenAI's GPT4 service). As more large AI models proliferate (personalizing and specializing to a variety of domains), there is a tremendous need to have a neutral trust-free platform that allows the hosting of AI models, clients receiving AI services efficiently, yet in a trust-free, incentive compatible, Byzantine behavior resistant manner. In this paper we propose SAKSHI, a trust-free decentralized platform specifically suited for AI services. The key design principles of SAKSHI are the separation of the data path (where AI query and service is managed) and the control path (where routers and compute and storage hosts are managed) from the transaction path (where the metering and billing of services are managed over a blockchain). This separation is enabled by a \"proof of inference\" layer which provides cryptographic resistance against a variety of misbehaviors, including poor AI service, nonpayment for service, copying of AI models. This is joint work between multiple universities (Princeton University, University of Illinois at Urbana-Champaign, Tsinghua University, HKUST) and two startup companies (Witness Chain and Eigen Layer).",
  "categories": [
    "cs.CR"
  ],
  "primary_category": "cs.CR",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16562",
  "pdf_url": "https://arxiv.org/pdf/2307.16562v1",
  "comment": "23 pages, 9 figures",
  "num_versions": null,
  "size_before_bytes": 816283,
  "size_after_bytes": 51192
}