{
  "title": "Subtraction games in more than one dimension",
  "authors": [
    "Urban Larsson",
    "Indrajit Saha",
    "Makoto Yokoo"
  ],
  "submission_date": "2023-07-23T23:55:12+00:00",
  "revised_dates": [
    "2023-09-08T00:29:06+00:00",
    "2024-01-04T01:25:17+00:00",
    "2024-01-17T02:21:01+00:00"
  ],
  "abstract": "This paper concerns two-player alternating play combinatorial games (Conway 1976) in the normal-play convention, i.e. last move wins. Specifically, we study impartial vector subtraction games on tuples of nonnegative integers (Golomb 1966), with finite subtraction sets. In case of two move rulesets we find a complete solution, via a certain $\\mathcal{P}$-to-$\\mathcal{P}$ principle (where $\\mathcal{P}$ means that the previous player wins). Namely $x \\in \\mathcal{P}$ if and only if $x +a +b \\in \\mathcal{P}$, where $a$ and $b$ are the two move options. Flammenkamp 1997 observed that, already in one dimension, rulesets with three moves can be hard to analyze, and still today his related conjecture remains open. Here, we solve instances of rulesets with three moves in two dimensions, and conjecture that they all have regular outcomes. Through several computer visualizations of outcomes of multi-move two-dimensional rulesets, we observe that they tend to partition the game board into periodic mosaics on very few regions/segments, which can depend on the number of moves in a ruleset. For example, we have found a five-move ruleset with an outcome segmentation into six semi-infinite slices. In this spirit, we develop a coloring automaton that generalizes the $\\mathcal{P}$-to-$\\mathcal{P}$ principle. Given an initial set of colored positions, it quickly paints the $\\mathcal{P}$-positions in segments of the game board. Moreover, we prove that two-dimensional rulesets have row/column eventually periodic outcomes. We pose open problems on the generic hardness of two-dimensional rulesets; several regularity conjectures are provided, but we also conjecture that not all rulesets have regular outcomes.",
  "categories": [
    "math.CO"
  ],
  "primary_category": "math.CO",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12458",
  "pdf_url": null,
  "comment": "40 pages, 28 figures. Comments are welcome",
  "num_versions": null,
  "size_before_bytes": 86237742,
  "size_after_bytes": 1679081
}