{
  "title": "Improving image quality of sparse-view lung tumor CT images with U-Net",
  "authors": [
    "Annika Ries",
    "Tina Dorosti",
    "Johannes Thalhammer",
    "Daniel Sasse",
    "Andreas Sauter",
    "Felix Meurer",
    "Ashley Benne",
    "Tobias Lasser",
    "Franz Pfeiffer",
    "Florian Schaff",
    "Daniela Pfeiffer"
  ],
  "submission_date": "2023-07-28T12:03:55+00:00",
  "revised_dates": [
    "2023-09-21T11:49:41+00:00",
    "2023-09-28T13:22:20+00:00",
    "2024-02-14T15:42:49+00:00"
  ],
  "abstract": "Background: We aimed at improving image quality (IQ) of sparse-view computed tomography (CT) images using a U-Net for lung metastasis detection and determining the best tradeoff between number of views, IQ, and diagnostic confidence.\n  Methods: CT images from 41 subjects aged 62.8 $\\pm$ 10.6 years (mean $\\pm$ standard deviation), 23 men, 34 with lung metastasis, 7 healthy, were retrospectively selected (2016-2018) and forward projected onto 2,048-view sinograms. Six corresponding sparse-view CT data subsets at varying levels of undersampling were reconstructed from sinograms using filtered backprojection with 16, 32, 64, 128, 256, and 512 views. A dual-frame U-Net was trained and evaluated for each subsampling level on 8,658 images from 22 diseased subjects. A representative image per scan was selected from 19 subjects (12 diseased, 7 healthy) for a single-blinded multireader study. These slices, for all levels of subsampling, with and without U-Net postprocessing, were presented to three readers. IQ and diagnostic confidence were ranked using predefined scales. Subjective nodule segmentation was evaluated using sensitivity and Dice similarity coefficient (DSC); clustered Wilcoxon signed-rank test was used.\n  Results: The 64-projection sparse-view images resulted in 0.89 sensitivity and 0.81 DSC, while their counterparts, postprocessed with the U-Net, had improved metrics (0.94 sensitivity and 0.85 DSC) (p = 0.400). Fewer views led to insufficient IQ for diagnosis. For increased views, no substantial discrepancies were noted between sparse-view and postprocessed images.\n  Conclusions: Projection views can be reduced from 2,048 to 64 while maintaining IQ and the confidence of the radiologists on a satisfactory level.",
  "categories": [
    "cs.CV",
    "physics.med-ph"
  ],
  "primary_category": "cs.CV",
  "doi": "10.1186/s41747-024-00450-4",
  "journal_ref": "Eur Radiol Exp 8, 54 (2024)",
  "arxiv_id": "2307.15506",
  "pdf_url": "https://arxiv.org/pdf/2307.15506v4",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 7367982,
  "size_after_bytes": 204396
}