{
  "title": "Improved Solution Search Performance of Constrained MOEA/D Hybridizing Directional Mating and Local Mating",
  "authors": [
    "Masahiro Kanazaki",
    "Takeharu Toyoda"
  ],
  "submission_date": "2023-07-24T15:32:53+00:00",
  "revised_dates": [],
  "abstract": "In this study, we propose an improvement to the direct mating method, a constraint handling approach for multi-objective evolutionary algorithms, by hybridizing it with local mating. Local mating selects another parent from the feasible solution space around the initially selected parent. The direct mating method selects the other parent along the optimal direction in the objective space after the first parent is selected, even if it is infeasible. It shows better exploration performance for constraint optimization problems with coupling NSGA-II, but requires several individuals along the optimal direction. Due to the lack of better solutions dominated by the optimal direction from the first parent, direct mating becomes difficult as the generation proceeds. To address this issue, we propose a hybrid method that uses local mating to select another parent from the neighborhood of the first selected parent, maintaining diversity around good solutions and helping the direct mating process. We evaluate the proposed method on three mathematical problems with unique Pareto fronts and two real-world applications. We use the generation histories of the averages and standard deviations of the hypervolumes as the performance evaluation criteria. Our investigation results show that the proposed method can solve constraint multi-objective problems better than existing methods while maintaining high diversity.",
  "categories": [
    "cs.NE",
    "cs.CE"
  ],
  "primary_category": "cs.NE",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13013",
  "pdf_url": null,
  "comment": "Revised paper presented at ISMSI2023, 9pages, 8 figures (Online)",
  "num_versions": null,
  "size_before_bytes": 463610,
  "size_after_bytes": 48025
}