{
  "title": "Redundancy-aware unsupervised rankings for collections of gene sets",
  "authors": [
    "Chiara Balestra",
    "Carlo Maj",
    "Emmanuel Müller",
    "Andreas Mayr"
  ],
  "submission_date": "2023-07-30T09:39:42+00:00",
  "revised_dates": [],
  "abstract": "The biological roles of gene sets are used to group them into collections. These collections are often characterized by being high-dimensional, overlapping, and redundant families of sets, thus precluding a straightforward interpretation and study of their content. Bioinformatics looked for solutions to reduce their dimension or increase their intepretability. One possibility lies in aggregating overlapping gene sets to create larger pathways, but the modified biological pathways are hardly biologically justifiable. We propose to use importance scores to rank the pathways in the collections studying the context from a set covering perspective. The proposed Shapley values-based scores consider the distribution of the singletons and the size of the sets in the families; Furthermore, a trick allows us to circumvent the usual exponential complexity of Shapley values' computation. Finally, we address the challenge of including a redundancy awareness in the obtained rankings where, in our case, sets are redundant if they show prominent intersections.\n  The rankings can be used to reduce the dimension of collections of gene sets, such that they show lower redundancy and still a high coverage of the genes. We further investigate the impact of our selection on Gene Sets Enrichment Analysis. The proposed method shows a practical utility in bioinformatics to increase the interpretability of the collections of gene sets and a step forward to include redundancy into Shapley values computations.",
  "categories": [
    "q-bio.QM",
    "cs.GT",
    "cs.LG"
  ],
  "primary_category": "q-bio.QM",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16182",
  "pdf_url": "https://arxiv.org/pdf/2307.16182v1",
  "comment": "arXiv admin note: substantial text overlap with arXiv:2207.12184",
  "num_versions": null,
  "size_before_bytes": 2657494,
  "size_after_bytes": 892027
}