{
  "title": "Electronic structure and lattice dynamics of 1T-VSe$_2$: origin of the 3D-CDW",
  "authors": [
    "Josu Diego",
    "D. Subires",
    "A. H. Said",
    "D. A. Chaney",
    "A. Korshunov",
    "G. Garbarino",
    "F. Diekmann",
    "K. Mahatha",
    "V. Pardo",
    "J. Strempfer",
    "Pablo J. Bereciartua Perez",
    "S. Francoual",
    "C. Popescu",
    "M. Tallarida",
    "J. Dai",
    "Raffaello Bianco",
    "Lorenzo Monacelli",
    "Matteo Calandra",
    "A. Bosak",
    "Francesco Mauri",
    "K. Rossnagel",
    "Adolfo O. Fumega",
    "Ion Errea",
    "S. Blanco-Canosa"
  ],
  "submission_date": "2023-07-28T08:38:26+00:00",
  "revised_dates": [],
  "abstract": "In order to characterize in detail the charge density wave (CDW) transition of 1$T$-VSe$_2$, its electronic structure and lattice dynamics are comprehensively studied by means of x-ray diffraction, angle resolved photoemission (ARPES), diffuse and inelastic x-ray scattering (IXS), and state-of-the-art first principles density functional theory calculations. Resonant elastic x-ray scattering (REXS) does not show any resonant enhancement at either V or Se K-edges, indicating that the CDW peak describes a purely structural modulation of the electronic ordering. ARPES identifies (i) a pseudogap at T$>$T$_{CDW}$, which leads to a depletion of the density of states in the $ML-M'L'$ plane at T$<$T$_{CDW}$, and (ii) anomalies in the electronic dispersion reflecting a sizable impact of phonons on it. A diffuse scattering precursor, characteristic of soft phonons, is observed at room temperature (RT) and leads to the full collapse of the low-energy phonon ($ω_1$) with propagation vector (0.25 0 -0.3) r.l.u. We show that the frequency and linewidth of this mode are anisotropic in momentum space, reflecting the momentum dependence of the electron-phonon interaction (EPI), hence demonstrating that the origin of the CDW is, to a much larger extent, due to the momentum dependence EPI with a small contribution from nesting. The pressure dependence of the $ω_1$ soft mode remains nearly constant up to 13 GPa at RT, with only a modest softening before the transition to the high-pressure monoclinic $C2/m$ phase. The wide set of experimental data are well captured by our state-of-the art first-principles anharmonic calculations with the inclusion of van der Waals (vdW) corrections in the exchange-correlation functional. The description of the electronics and dynamics of VSe$_2$ reported here adds important pieces of information to the understanding of the electronic modulations of TMDs.",
  "categories": [
    "cond-mat.str-el"
  ],
  "primary_category": "cond-mat.str-el",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15392",
  "pdf_url": "https://arxiv.org/pdf/2307.15392v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 12322555,
  "size_after_bytes": 1336286
}