{
  "title": "Fast Searching The Densest Subgraph And Decomposition With Local Optimality",
  "authors": [
    "Yugao Zhu",
    "Shenghua Liu",
    "Wenjie Feng",
    "Xueqi Cheng"
  ],
  "submission_date": "2023-07-29T12:20:49+00:00",
  "revised_dates": [
    "2023-08-07T09:13:01+00:00",
    "2023-08-11T12:51:43+00:00",
    "2023-10-29T15:38:02+00:00"
  ],
  "abstract": "Densest Subgraph Problem (DSP) is an important primitive problem with a wide range of applications, including fraud detection, community detection and DNA motif discovery. Edge-based density is one of the most common metrics in DSP. Although a maximum flow algorithm can exactly solve it in polynomial time, the increasing amount of data and the high complexity of algorithms motivate scientists to find approximation algorithms. Among these, its duality of linear programming derives several iterative algorithms including Greedy++, Frank-Wolfe and FISTA which redistribute edge weights to find the densest subgraph, however, these iterative algorithms vibrate around the optimal solution, which are not satisfactory for fast convergence. We propose our main algorithm Locally Optimal Weight Distribution (LOWD) to distribute the remaining edge weights in a locally optimal operation to converge to the optimal solution monotonically. Theoretically, we show that it will reach the optimal state of a specific linear programming which is called locally-dense decomposition. Besides, we show that it is not necessary to consider most of the edges in the original graph. Therefore, we develop a pruning algorithm using a modified Counting Sort to prune graphs by removing unnecessary edges and nodes, and then we can search the densest subgraph in a much smaller graph.",
  "categories": [
    "cs.DB"
  ],
  "primary_category": "cs.DB",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15969",
  "pdf_url": "https://arxiv.org/pdf/2307.15969v4",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 10552060,
  "size_after_bytes": 1710531
}