{
  "title": "Self-Supervised Learning of Gait-Based Biomarkers",
  "authors": [
    "R. James Cotton",
    "J. D. Peiffer",
    "Kunal Shah",
    "Allison DeLillo",
    "Anthony Cimorelli",
    "Shawana Anarwala",
    "Kayan Abdou",
    "Tasos Karakostas"
  ],
  "submission_date": "2023-07-30T21:04:17+00:00",
  "revised_dates": [],
  "abstract": "Markerless motion capture (MMC) is revolutionizing gait analysis in clinical settings by making it more accessible, raising the question of how to extract the most clinically meaningful information from gait data. In multiple fields ranging from image processing to natural language processing, self-supervised learning (SSL) from large amounts of unannotated data produces very effective representations for downstream tasks. However, there has only been limited use of SSL to learn effective representations of gait and movement, and it has not been applied to gait analysis with MMC. One SSL objective that has not been applied to gait is contrastive learning, which finds representations that place similar samples closer together in the learned space. If the learned similarity metric captures clinically meaningful differences, this could produce a useful representation for many downstream clinical tasks. Contrastive learning can also be combined with causal masking to predict future timesteps, which is an appealing SSL objective given the dynamical nature of gait. We applied these techniques to gait analyses performed with MMC in a rehabilitation hospital from a diverse clinical population. We find that contrastive learning on unannotated gait data learns a representation that captures clinically meaningful information. We probe this learned representation using the framework of biomarkers and show it holds promise as both a diagnostic and response biomarker, by showing it can accurately classify diagnosis from gait and is responsive to inpatient therapy, respectively. We ultimately hope these learned representations will enable predictive and prognostic gait-based biomarkers that can facilitate precision rehabilitation through greater use of MMC to quantify movement in rehabilitation.",
  "categories": [
    "cs.CV"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": "Ambient Inteligence for Healthcare workshop at MICCAI 2023",
  "arxiv_id": "2307.16321",
  "pdf_url": "https://arxiv.org/pdf/2307.16321v1",
  "comment": "Accepted to Ambient Inteligence for Healthcare workshop at MICCAI 2023",
  "num_versions": null,
  "size_before_bytes": 1285135,
  "size_after_bytes": 142528
}