{
  "title": "VarSim: A Fast Process Variation-aware Thermal Modeling Methodology Using Green's Functions",
  "authors": [
    "Hameedah Sultan",
    "Smruti R. Sarangi"
  ],
  "submission_date": "2023-07-22T16:29:08+00:00",
  "revised_dates": [],
  "abstract": "Despite temperature rise being a first-order design constraint, traditional thermal estimation techniques have severe limitations in modeling critical aspects affecting the temperature in modern-day chips. Existing thermal modeling techniques often ignore the effects of parameter variation, which can lead to significant errors. Such methods also ignore the dependence of conductivity on temperature and its variation. Leakage power is also incorporated inadequately by state-of-the-art techniques. Thermal modeling is a process that has to be repeated at least thousands of times in the design cycle, and hence speed is of utmost importance.\n  To overcome these limitations, we propose VarSim, an ultrafast thermal simulator based on Green's functions. Green's functions have been shown to be faster than the traditional finite difference and finite element-based approaches but have rarely been employed in thermal modeling. Hence we propose a new Green's function-based method to capture the effects of leakage power as well as process variation analytically. We provide a closed-form solution for the Green's function considering the effects of variation on the process, temperature, and thermal conductivity. In addition, we propose a novel way of dealing with the anisotropicity introduced by process variation by splitting the Green's functions into shift-variant and shift-invariant components. Since our solutions are analytical expressions, we were able to obtain speedups that were several orders of magnitude over and above state-of-the-art proposals with a mean absolute error limited to 4% for a wide range of test cases. Furthermore, our method accurately captures the steady-state as well as the transient variation in temperature.",
  "categories": [
    "cs.AR"
  ],
  "primary_category": "cs.AR",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12119",
  "pdf_url": null,
  "comment": "15 pages",
  "num_versions": null,
  "size_before_bytes": 5889113,
  "size_after_bytes": 1354590
}