{
  "title": "Regularized Mask Tuning: Uncovering Hidden Knowledge in Pre-trained Vision-Language Models",
  "authors": [
    "Kecheng Zheng",
    "Wei Wu",
    "Ruili Feng",
    "Kai Zhu",
    "Jiawei Liu",
    "Deli Zhao",
    "Zheng-Jun Zha",
    "Wei Chen",
    "Yujun Shen"
  ],
  "submission_date": "2023-07-27T17:56:05+00:00",
  "revised_dates": [
    "2023-08-06T14:05:38+00:00"
  ],
  "abstract": "Prompt tuning and adapter tuning have shown great potential in transferring pre-trained vision-language models (VLMs) to various downstream tasks. In this work, we design a new type of tuning method, termed as regularized mask tuning, which masks the network parameters through a learnable selection. Inspired by neural pathways, we argue that the knowledge required by a downstream task already exists in the pre-trained weights but just gets concealed in the upstream pre-training stage. To bring the useful knowledge back into light, we first identify a set of parameters that are important to a given downstream task, then attach a binary mask to each parameter, and finally optimize these masks on the downstream data with the parameters frozen. When updating the mask, we introduce a novel gradient dropout strategy to regularize the parameter selection, in order to prevent the model from forgetting old knowledge and overfitting the downstream data. Experimental results on 11 datasets demonstrate the consistent superiority of our method over previous alternatives. It is noteworthy that we manage to deliver 18.73% performance improvement compared to the zero-shot CLIP via masking an average of only 2.56% parameters. Furthermore, our method is synergistic with most existing parameter-efficient tuning methods and can boost the performance on top of them. Project page can be found here (https://wuw2019.github.io/R-AMT/).",
  "categories": [
    "cs.CV"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15049",
  "pdf_url": "https://arxiv.org/pdf/2307.15049v2",
  "comment": "Accepted at ICCV 2023",
  "num_versions": null,
  "size_before_bytes": 9051036,
  "size_after_bytes": 616260
}