{
  "title": "Rapid localization and inference on compact binary coalescences with the Advanced LIGO-Virgo-KAGRA gravitational-wave detector network",
  "authors": [
    "Soichiro Morisaki",
    "Rory Smith",
    "Leo Tsukada",
    "Surabhi Sachdev",
    "Simon Stevenson",
    "Colm Talbot",
    "Aaron Zimmerman"
  ],
  "submission_date": "2023-07-25T10:01:38+00:00",
  "revised_dates": [],
  "abstract": "We present a rapid parameter estimation framework for compact binary coalescence (CBC) signals observed by the LIGO-Virgo-KAGRA (LVK) detector network. The goal of our framework is to enable optimal source localization of binary neutron star (BNS) signals in low latency, as well as improve the overall scalability of full CBC parameter estimation analyses. Our framework is based on the reduced order quadrature (ROQ) technique, and resolves its shortcomings by utilizing multiple ROQ bases in a single parameter estimation run. We have also developed sets of compact ROQ bases for various waveform models, IMRPhenomD, IMRPhenomPv2, IMRPhenomPv2$\\_$NRTidalv2, and IMRPhenomXPHM. We benchmark our framework with hundreds of simulated observations of BNS signals by the LIGO-Virgo detector network, and demonstrate that it provides accurate and unbiased estimates on BNS source location, with a median analysis time of $6$ minutes. The median searched area is reduced by around 30$\\%$ compared to estimates produced by BAYESTAR: from $21.8\\,\\mathrm{deg^2}$ to $16.6\\,\\mathrm{deg^2}$. Our framework also enables detailed parameter estimation taking into account gravitational-wave higher multipole moments, the tidal deformation of colliding objects, and detector calibration errors of amplitude and phase with the time scale of hours. Our rapid parameter estimation technique has been implemented in one of the LVK parameter estimation engines, BILBY, and is being employed by the automated parameter estimation analysis of the LVK alert system.",
  "categories": [
    "gr-qc",
    "astro-ph.HE",
    "astro-ph.IM"
  ],
  "primary_category": "gr-qc",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13380",
  "pdf_url": null,
  "comment": "19 pages, 9 figures",
  "num_versions": null,
  "size_before_bytes": 1936552,
  "size_after_bytes": 167573
}