{
  "title": "Modal Abstractions for Virtualizing Memory Addresses",
  "authors": [
    "Ismail Kuru",
    "Colin S. Gordon"
  ],
  "submission_date": "2023-07-26T19:20:03+00:00",
  "revised_dates": [
    "2023-08-15T00:24:29+00:00",
    "2024-09-17T00:44:18+00:00",
    "2025-09-05T00:06:58+00:00"
  ],
  "abstract": "Operating system kernels employ virtual memory subsystems, which use a CPU's memory management units (MMUs) to virtualize the addresses of memory regions Operating systems manipulate these virtualized memory mappings to isolate untrusted processes, restrict which memory is accessible to different processes, hide memory limits from user programs, ensure process isolation, implement demand-paging and copy-on-write behaviors for performance and resource controls.\n  Virtual memory management (VMM) code is a critical piece of general-purpose OS kernels, but verification of this functionality is challenging due to the complexity of the hardware interface. In this paper, we introduce a modal abstraction to describe the truth of assertions relative to a specific virtual address space: [r]P indicating that P holds in the virtual address space rooted at r. Such modal assertions allow different address spaces to refer to each other, enabling complete verification of instruction sequences manipulating multiple address spaces. Using them effectively requires working with other assertions, such as points-to assertions in our separation logic, as relative to a given address space. We therefore define virtual points-to relations, which mimic hardware address translation, relative to a page table root. We demonstrate our approach with challenging fragments of VMM code showing that our approach handles examples beyond what prior work can address, including reasoning about a sequence of instructions as it changes address spaces. All definitions and theorems mentioned in this paper including the operational model of a RISC-like fragment of x86-64, a simple language run on this operational model, and a logic as an instantiation of the Iris framework are mechanized inside Coq.",
  "categories": [
    "cs.PL"
  ],
  "primary_category": "cs.PL",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14471",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 8304508,
  "size_after_bytes": 5312416
}