{
  "title": "MORE: Measurement and Correlation Based Variational Quantum Circuit for Multi-classification",
  "authors": [
    "Jindi Wu",
    "Tianjie Hu",
    "Qun Li"
  ],
  "submission_date": "2023-07-21T19:33:10+00:00",
  "revised_dates": [],
  "abstract": "Quantum computing has shown considerable promise for compute-intensive tasks in recent years. For instance, classification tasks based on quantum neural networks (QNN) have garnered significant interest from researchers and have been evaluated in various scenarios. However, the majority of quantum classifiers are currently limited to binary classification tasks due to either constrained quantum computing resources or the need for intensive classical post-processing. In this paper, we propose an efficient quantum multi-classifier called MORE, which stands for measurement and correlation based variational quantum multi-classifier. MORE adopts the same variational ansatz as binary classifiers while performing multi-classification by fully utilizing the quantum information of a single readout qubit. To extract the complete information from the readout qubit, we select three observables that form the basis of a two-dimensional Hilbert space. We then use the quantum state tomography technique to reconstruct the readout state from the measurement results. Afterward, we explore the correlation between classes to determine the quantum labels for classes using the variational quantum clustering approach. Next, quantum label-based supervised learning is performed to identify the mapping between the input data and their corresponding quantum labels. Finally, the predicted label is determined by its closest quantum label when using the classifier. We implement this approach using the Qiskit Python library and evaluate it through extensive experiments on both noise-free and noisy quantum systems. Our evaluation results demonstrate that MORE, despite using a simple ansatz and limited quantum resources, achieves advanced performance.",
  "categories": [
    "quant-ph",
    "cs.LG"
  ],
  "primary_category": "quant-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11875",
  "pdf_url": null,
  "comment": "IEEE International Conference on Quantum Computing and Engineering (QCE23)",
  "num_versions": null,
  "size_before_bytes": 1831696,
  "size_after_bytes": 378119
}