{
  "title": "Measuring the Temperature of Starspots from Multi-Filter Photometry",
  "authors": [
    "Maria C. Schutte",
    "Leslie Hebb",
    "John P. Wisniewski",
    "Caleb I. Canas",
    "Jessica E. Libby-Roberts",
    "Andrea S. J. Lin",
    "Paul Robertson",
    "Gudmundur Stefansson"
  ],
  "submission_date": "2023-07-29T15:57:01+00:00",
  "revised_dates": [],
  "abstract": "Using simultaneous multi-filter observations during the transit of an exoplanet around a K dwarf star, we determine the temperature of a starspot through modeling the radius and position with wavelength-dependent spot contrasts. We model the spot using the starspot modeling program STarSPot (STSP), which uses the transiting companion as a knife-edge probe of the stellar surface. The contrast of the spot, i.e. the ratio of the integrated flux of a darker spot region to the star's photosphere, is calculated for a range of filters and spot temperatures. We demonstrate this technique using simulated data of HAT-P-11, a K dwarf (T = 4780 K) with well-modeled starspot properties for which we obtained simultaneous multi-filter transits using LCO's MuSCAT3 instrument on the 2-meter telescope at Haleakala Observatory which allows for simultaneous, multi-filter, diffuser assisted high-precision photometry. We determine the average (i.e. a combination of penumbra and umbra) spot temperature for HAT-P-11's spot complexes is 4500 K $\\pm$ 100 K using this technique. We also find for our set of filters that comparing the SDSS g' and i' filters maximizes the signal difference caused by a large spot in the transit. Thus, this technique allows for the determination of the average spot temperature using only one spot occultation in transit and can provide simultaneous information on the spot temperature and spot properties.",
  "categories": [
    "astro-ph.SR",
    "astro-ph.EP"
  ],
  "primary_category": "astro-ph.SR",
  "doi": "10.3847/1538-3881/ace59c",
  "journal_ref": null,
  "arxiv_id": "2307.16015",
  "pdf_url": "https://arxiv.org/pdf/2307.16015v1",
  "comment": "14 pages, 9 figures, accepted to AJ",
  "num_versions": null,
  "size_before_bytes": 17396608,
  "size_after_bytes": 367954
}