{
  "title": "Part-level Scene Reconstruction Affords Robot Interaction",
  "authors": [
    "Zeyu Zhang",
    "Lexing Zhang",
    "Zaijin Wang",
    "Ziyuan Jiao",
    "Muzhi Han",
    "Yixin Zhu",
    "Song-Chun Zhu",
    "Hangxin Liu"
  ],
  "submission_date": "2023-07-31T06:10:23+00:00",
  "revised_dates": [
    "2023-08-01T02:17:58+00:00"
  ],
  "abstract": "Existing methods for reconstructing interactive scenes primarily focus on replacing reconstructed objects with CAD models retrieved from a limited database, resulting in significant discrepancies between the reconstructed and observed scenes. To address this issue, our work introduces a part-level reconstruction approach that reassembles objects using primitive shapes. This enables us to precisely replicate the observed physical scenes and simulate robot interactions with both rigid and articulated objects. By segmenting reconstructed objects into semantic parts and aligning primitive shapes to these parts, we assemble them as CAD models while estimating kinematic relations, including parent-child contact relations, joint types, and parameters. Specifically, we derive the optimal primitive alignment by solving a series of optimization problems, and estimate kinematic relations based on part semantics and geometry. Our experiments demonstrate that part-level scene reconstruction outperforms object-level reconstruction by accurately capturing finer details and improving precision. These reconstructed part-level interactive scenes provide valuable kinematic information for various robotic applications; we showcase the feasibility of certifying mobile manipulation planning in these interactive scenes before executing tasks in the physical world.",
  "categories": [
    "cs.RO"
  ],
  "primary_category": "cs.RO",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16420",
  "pdf_url": "https://arxiv.org/pdf/2307.16420v2",
  "comment": "IROS 2023 paper",
  "num_versions": null,
  "size_before_bytes": 78074300,
  "size_after_bytes": 604710
}