{
  "title": "Quarkonium transport in strongly coupled plasmas",
  "authors": [
    "Govert Nijs",
    "Bruno Scheihing-Hitschfeld",
    "Xiaojun Yao"
  ],
  "submission_date": "2023-07-21T18:36:41+00:00",
  "revised_dates": [],
  "abstract": "Suppression of open heavy flavors and quarkonia in heavy-ion collisions is among the most informative probes of the quark-gluon plasma. Interpreting the full wealth of data obtained from the collision events requires a precise understanding of the evolution of heavy quarks and quarkonia as they propagate through the nearly thermal and strongly coupled plasma. Systematic theoretical studies of quarkonium time evolution in the QGP in the regime where the temperature of the QGP is much smaller than the inverse of quarkonium size have only been carried out in the past few years. Such calculations require the evaluation of a gauge-invariant correlator of chromoelectric fields dressed with Wilson lines, which is similar to, but different from, the correlation used to define the well-known arXiv:hep-ph/0605199 heavy quark diffusion coefficient. The origin of this difference has been explained in arXiv:2107.03945, arXiv:2205.04477, arXiv:2306.13127. Here we show the results of the calculation of the analogous correlator in strongly coupled $\\mathcal{N}=4$ SYM using the AdS/CFT correspondence at a finite temperature arXiv:2304.03298. While it resembles the open heavy quark case, it has some crucial differences that highlight the relevance of quantum color correlations. We will also discuss the results for the quarkonium transport coefficients obtained from this correlator, thereby establishing the first analytic results at strong coupling in this context. We find that they vanish in the strong coupling limit for an $\\mathcal{N}=4$ SYM plasma with a large number of colors.",
  "categories": [
    "hep-ph",
    "nucl-th"
  ],
  "primary_category": "hep-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11850",
  "pdf_url": null,
  "comment": "6 pages, 2 figures. Contribution to the proceedings of the 11th International Conference on Hard and Electromagnetic Probes of High Energy Nuclear Collisions (Hard Probes 2023)",
  "num_versions": null,
  "size_before_bytes": 147777,
  "size_after_bytes": 43065
}