{
  "title": "Rethinking loss of available work and Gouy-Stodola theorem",
  "authors": [
    "Yaodong Tu",
    "Gang Chen"
  ],
  "submission_date": "2023-07-29T18:09:44+00:00",
  "revised_dates": [],
  "abstract": "Exergy represents the maximum useful work possible when a system at a specific state reaches equilibrium with the environmental dead state at temperature To. Correspondingly, the exergy difference between two states is the maximum work output when the system changes from one state to the other, assuming that during the processes, the system exchanges heat reversibly with the environment. If the process involves irreversibility, the Guoy-Stodola theorem states that the exergy destruction equals the entropy generated during the process multiplied by To. The exergy concept and the Gouy-Stodola theorem are widely used to optimize processes or systems, even when they are not directly connected to the environment. In the past, questions have been raised on if To is the proper temperature to use in calculating the exergy destruction. Here, we start from the first and the second laws of thermodynamics to unambiguously show that the useful energy loss (UEL) of a system or process should equal to the entropy generation multiplied by an equivalent temperature associated with the entropy rejected out of the entire system. For many engineering systems and processes, this entropy rejection temperature can be easily calculated as the ratio of the changes of the enthalpy and entropy of the fluid stream carrying the entropy out, which we call the state-change temperature. The UEL is unambiguous and independent of the environmental dead state, and it should be used for system optimization rather than the exergy destruction.",
  "categories": [
    "cond-mat.stat-mech",
    "physics.class-ph"
  ],
  "primary_category": "cond-mat.stat-mech",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16041",
  "pdf_url": "https://arxiv.org/pdf/2307.16041v1",
  "comment": "28 pages, 4 figures",
  "num_versions": null,
  "size_before_bytes": 796747,
  "size_after_bytes": 485370
}