{
  "title": "A survey on deep learning in medical image registration: new technologies, uncertainty, evaluation metrics, and beyond",
  "authors": [
    "Junyu Chen",
    "Yihao Liu",
    "Shuwen Wei",
    "Zhangxing Bian",
    "Shalini Subramanian",
    "Aaron Carass",
    "Jerry L. Prince",
    "Yong Du"
  ],
  "submission_date": "2023-07-28T15:22:34+00:00",
  "revised_dates": [
    "2023-09-12T13:56:09+00:00",
    "2024-04-30T20:13:05+00:00",
    "2024-11-01T15:13:01+00:00"
  ],
  "abstract": "Deep learning technologies have dramatically reshaped the field of medical image registration over the past decade. The initial developments, such as regression-based and U-Net-based networks, established the foundation for deep learning in image registration. Subsequent progress has been made in various aspects of deep learning-based registration, including similarity measures, deformation regularizations, network architectures, and uncertainty estimation. These advancements have not only enriched the field of image registration but have also facilitated its application in a wide range of tasks, including atlas construction, multi-atlas segmentation, motion estimation, and 2D-3D registration. In this paper, we present a comprehensive overview of the most recent advancements in deep learning-based image registration. We begin with a concise introduction to the core concepts of deep learning-based image registration. Then, we delve into innovative network architectures, loss functions specific to registration, and methods for estimating registration uncertainty. Additionally, this paper explores appropriate evaluation metrics for assessing the performance of deep learning models in registration tasks. Finally, we highlight the practical applications of these novel techniques in medical imaging and discuss the future prospects of deep learning-based image registration.",
  "categories": [
    "eess.IV",
    "cs.CV"
  ],
  "primary_category": "eess.IV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15615",
  "pdf_url": "https://arxiv.org/pdf/2307.15615v4",
  "comment": "Accepted to Medical Image Analysis ((c) MedIA). A list of open-sourced code from the papers reviewed has been organized and is available at https://bit.ly/3QgFJ9z",
  "num_versions": null,
  "size_before_bytes": 19879597,
  "size_after_bytes": 2810062
}