{
  "title": "A high-resolution radio study of the L1551 IRS 5 and L1551 NE jets",
  "authors": [
    "A. Feeney-Johansson",
    "S. J. D. Purser",
    "T. P. Ray",
    "C. Carrasco-González",
    "A. Rodríguez-Kamenetzky",
    "J. Eislöffel",
    "J. Lim",
    "R. Galván-Madrid",
    "S. Lizano",
    "L. F. Rodríguez",
    "H. Shang",
    "P. Ho",
    "M. Hoare"
  ],
  "submission_date": "2023-07-24T12:37:03+00:00",
  "revised_dates": [
    "2023-09-13T13:30:23+00:00"
  ],
  "abstract": "Using observations with e-MERLIN and the VLA, together with archival data from ALMA, we obtain high-resolution radio images of two binary YSOs: L1551 IRS 5 and L1551 NE, covering a wide range of frequencies from 5 - 336 GHz, and resolving emission from the radio jet on scales of only ~15 au. By comparing these observations to those from a previous epoch, it is shown that there is a high degree of variability in the free-free emission from the jets of these sources. In particular, the northern component of L1551 IRS 5 shows a remarkable decline in flux density of a factor of ~5, suggesting that the free-free emission of this source has almost disappeared. By fitting the spectra of the sources, the ionised mass-loss rates of the jets are derived and it is shown that there is significant variability of up to a factor of ~6 on timescales of ~20 years. Using radiative transfer modelling, we also obtained a model image for the jet of the southern component of L1551 IRS 5 to help study the inner region of the ionised high-density jet. The findings favour the X-wind model launched from a very small innermost region.",
  "categories": [
    "astro-ph.SR",
    "astro-ph.GA",
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.SR",
  "doi": "10.1051/0004-6361/202346737",
  "journal_ref": "A&A 677, A97 (2023)",
  "arxiv_id": "2307.12746",
  "pdf_url": null,
  "comment": "13 pages, 7 figures, accepted for publication in A&A",
  "num_versions": null,
  "size_before_bytes": 3230556,
  "size_after_bytes": 1562088
}