{
  "title": "LCPOM: Precise Reconstruction of Polarized Optical Microscopy Images of Liquid Crystals",
  "authors": [
    "Chuqiao Chen",
    "Viviana Palacio-Betancur",
    "Sepideh Norouzi",
    "Pablo F. Zubieta Rico",
    "Monirosadat Sadati",
    "Stuart J. Rowan",
    "Juan J. de Pablo"
  ],
  "submission_date": "2023-07-22T00:00:06+00:00",
  "revised_dates": [],
  "abstract": "When viewed with a cross-polarized optical microscope (POM), liquid crystals display interference colors and complex patterns that depend on the material's microscopic orientation. That orientation can be manipulated by application of external fields, which provides the basis for applications in optical display and sensing technologies. The color patterns themselves have a high information content. Traditionally, however, calculations of the optical appearance of liquid crystals have been performed by assuming that a single-wavelength light source is employed, and reported in a monochromatic scale. In this work, the original Jones matrix method is extended to calculate the colored images that arise when a liquid crystal is exposed to a multi-wavelength source. By accounting for the material properties, the visible light spectrum and the CIE color matching functions, we demonstrate that the proposed approach produces colored POM images that are in quantitative agreement with experimental data. Results are presented for a variety of systems, including radial, bipolar, and cholesteric droplets, where results of simulations are compared to experimental microscopy images. The effects of droplet size, topological defect structure, and droplet orientation are examined systematically. The technique introduced here generates images that can be directly compared to experiments, thereby facilitating machine learning efforts aimed at interpreting LC microscopy images, and paving the way for the inverse design of materials capable of producing specific internal microstructures in response to external stimuli.",
  "categories": [
    "cond-mat.soft",
    "physics.comp-ph"
  ],
  "primary_category": "cond-mat.soft",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11944",
  "pdf_url": null,
  "comment": "12 pages, 5 figures (main text). 6 pages, 6 figures (appendices)",
  "num_versions": null,
  "size_before_bytes": 10837195,
  "size_after_bytes": 108431
}