{
  "title": "Uncertainty-aware Unsupervised Multi-Object Tracking",
  "authors": [
    "Kai Liu",
    "Sheng Jin",
    "Zhihang Fu",
    "Ze Chen",
    "Rongxin Jiang",
    "Jieping Ye"
  ],
  "submission_date": "2023-07-28T09:03:06+00:00",
  "revised_dates": [
    "2023-12-20T15:08:11+00:00"
  ],
  "abstract": "Without manually annotated identities, unsupervised multi-object trackers are inferior to learning reliable feature embeddings. It causes the similarity-based inter-frame association stage also be error-prone, where an uncertainty problem arises. The frame-by-frame accumulated uncertainty prevents trackers from learning the consistent feature embedding against time variation. To avoid this uncertainty problem, recent self-supervised techniques are adopted, whereas they failed to capture temporal relations. The interframe uncertainty still exists. In fact, this paper argues that though the uncertainty problem is inevitable, it is possible to leverage the uncertainty itself to improve the learned consistency in turn. Specifically, an uncertainty-based metric is developed to verify and rectify the risky associations. The resulting accurate pseudo-tracklets boost learning the feature consistency. And accurate tracklets can incorporate temporal information into spatial transformation. This paper proposes a tracklet-guided augmentation strategy to simulate tracklets' motion, which adopts a hierarchical uncertainty-based sampling mechanism for hard sample mining. The ultimate unsupervised MOT framework, namely U2MOT, is proven effective on MOT-Challenges and VisDrone-MOT benchmark. U2MOT achieves a SOTA performance among the published supervised and unsupervised trackers.",
  "categories": [
    "cs.CV"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15409",
  "pdf_url": "https://arxiv.org/pdf/2307.15409v2",
  "comment": "Accepted by International Conference on Computer Vision (ICCV) 2023. Code is available at https://github.com/alibaba/u2mot/",
  "num_versions": null,
  "size_before_bytes": 12326730,
  "size_after_bytes": 288957
}