{
  "title": "First-Principles Approach for Coupled Quantum Dynamics of Electrons and Protons in Heterogeneous Systems",
  "authors": [
    "Jianhang Xu",
    "Ruiyi Zhou",
    "Tao E. Li",
    "Volker Blum",
    "Sharon Hammes-Schiffer",
    "Yosuke Kanai"
  ],
  "submission_date": "2023-07-28T14:58:10+00:00",
  "revised_dates": [
    "2023-11-03T18:50:51+00:00"
  ],
  "abstract": "The coupled quantum dynamics of electrons and protons is ubiquitous in many dynamical processes involving light-matter interaction, such as solar energy conversion in chemical systems and photosynthesis. A first-principles description of such nuclear-electronic quantum dynamics requires not only the time-dependent treatment of nonequilibrium electron dynamics but also that of quantum protons. Quantum mechanical correlation between electrons and protons adds further complexity to such coupled dynamics. Here we extend real-time nuclear-electronic orbital time-dependent density functional theory (RT-NEO-TDDFT) to periodic systems and perform first-principles simulations of coupled quantum dynamics of electrons and protons in complex heterogeneous systems. The process studied is electronically excited state intramolecular proton transfer of o-hydroxybenzaldehyde in water and at a silicon (111) semiconductor-molecule interface. These simulations illustrate how environments such as hydrogen-bonding water molecules and an extended material surface impact the dynamical process on the atomistic level. Depending on how the molecule is chemisorbed on the surface, excited state electron transfer from the molecule to the semiconductor surface can inhibit ultrafast proton transfer within the molecule. This work elucidates how heterogeneous environments influence the balance between the quantum mechanical proton transfer and excited electron dynamics. The periodic RT-NEO-TDDFT approach is applicable to a wide range of other photoinduced heterogeneous processes.",
  "categories": [
    "physics.chem-ph",
    "physics.comp-ph"
  ],
  "primary_category": "physics.chem-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15598",
  "pdf_url": "https://arxiv.org/pdf/2307.15598v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1997831,
  "size_after_bytes": 126225
}