{
  "title": "Prevalence of two-dimensional photonic topology",
  "authors": [
    "Ali Ghorashi",
    "Sachin Vaidya",
    "Mikael Rechtsman",
    "Wladimir Benalcazar",
    "Marin Soljačić",
    "Thomas Christensen"
  ],
  "submission_date": "2023-07-28T17:50:38+00:00",
  "revised_dates": [],
  "abstract": "The topological characteristics of photonic crystals have been the subject of intense research in recent years. Despite this, the basic question of whether photonic band topology is rare or abundant -- i.e., its relative prevalence -- remains unaddressed. Here, we determine the prevalence of stable, fragile, and higher-order photonic topology in the 11 two-dimensional crystallographic symmetry settings that admit diagnosis of one or more of these phenomena by symmetry analysis. Our determination is performed on the basis of a data set of 550000 randomly sampled, two-tone photonic crystals, spanning 11 symmetry settings and 5 dielectric contrasts, and examined in both transverse electric (TE) and magnetic (TM) polarizations. We report the abundance of nontrivial photonic topology in the presence of time-reversal symmetry and find that stable, fragile, and higher-order topology are generally abundant. Below the first band gap, which is of primary experimental interest, we find that stable topology is more prevalent in the TE polarization than the TM; is only weakly, but monotonically, dependent on dielectric contrast; and that fragile topology is near-absent. In the absence of time-reversal symmetry, nontrivial Chern phases are also abundant in photonic crystals with 2-, 4-, and 6-fold rotational symmetries but comparatively rare in settings with only 3-fold symmetry. Our results elucidate the interplay of symmetry, dielectric contrast, electromagnetic polarization, and time-reversal breaking in engendering topological photonic phases and may inform general design principles for their experimental realization.",
  "categories": [
    "cond-mat.mes-hall",
    "physics.optics"
  ],
  "primary_category": "cond-mat.mes-hall",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15701",
  "pdf_url": "https://arxiv.org/pdf/2307.15701v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1406705,
  "size_after_bytes": 122301
}