{
  "title": "Coexistence of Superconductivity and ferromagnetism in high entropy carbide ceramics",
  "authors": [
    "Huchen Shu",
    "Wei Zhong",
    "Jiajia Feng",
    "Hongyang Zhao",
    "Fang Hong",
    "Binbin Yue"
  ],
  "submission_date": "2023-07-31T06:47:12+00:00",
  "revised_dates": [],
  "abstract": "Generally, the superconductivity was expected to be absent in magnetic systems, but this reception was disturbed by unconventional superconductors, such as cuprates, iron-based superconductors and recently discovered nickelate, since their superconductivity is proposed to be related to the electron-electron interaction mediated by the spin fluctuation. However, the coexistence of superconductivity and magnetism is still rare in conventional superconductors. In this work, we reported the coexistence of these two quantum orderings in high entropy carbide ceramics (Mo0.2Nb0.2Ta0.2V0.2W0.2)C0.9, (Ta0.25Ti0.25Nb0.25Zr0.25)C, and they are expected to be conventional superconductors. Clear magnetic hysteresis loop was observed in these high entropy carbides, indicating a ferromagnetic ground state. A sharp superconducting transition is observed in (Mo0.2Nb0.2Ta0.2V0.2W0.2)C0.9 with a Tc of 3.4 K and upper critical field of ~3.35 T. Meanwhile, superconductivity is suppressed to some extent and zero-resistance state disappears in (Ta0.25Ti0.25Nb0.25Zr0.25)C, in which stronger magnetism is presented. The upper critical field of (Ta0.25Ti0.25Nb0.25Zr0.25)C is only ~1.5 T, though they show higher transition temperature near 5.7 K. The ferromagnetism stems from the carbon vacancies which occurs often during the high temperature synthesis process. This work not just demonstrate the observation of superconductivity in high entropy carbide ceramics, but also provide alternative exotic platform to study the correlation between superconductivity and magnetism, and is of great benefit for the design of multifunctional electronic devices.",
  "categories": [
    "cond-mat.supr-con",
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.supr-con",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16438",
  "pdf_url": "https://arxiv.org/pdf/2307.16438v1",
  "comment": "16 pages, 5 figures, 1 table. Suggestion and comments are welcome",
  "num_versions": null,
  "size_before_bytes": 1713211,
  "size_after_bytes": 989926
}