{
  "title": "Cosmological baryon spread and impact on matter clustering in CAMELS",
  "authors": [
    "Matthew Gebhardt",
    "Daniel Anglés-Alcázar",
    "Josh Borrow",
    "Shy Genel",
    "Francisco Villaescusa-Navarro",
    "Yueying Ni",
    "Christopher Lovell",
    "Daisuke Nagai",
    "Romeel Davé",
    "Federico Marinacci",
    "Mark Vogelsberger",
    "Lars Hernquist"
  ],
  "submission_date": "2023-07-21T18:04:40+00:00",
  "revised_dates": [],
  "abstract": "We quantify the cosmological spread of baryons relative to their initial neighboring dark matter distribution using thousands of state-of-the-art simulations from the Cosmology and Astrophysics with MachinE Learning Simulations (CAMELS) project. We show that dark matter particles spread relative to their initial neighboring distribution owing to chaotic gravitational dynamics on spatial scales comparable to their host dark matter halo. In contrast, gas in hydrodynamic simulations spreads much further from the initial neighboring dark matter owing to feedback from supernovae (SNe) and Active Galactic Nuclei (AGN). We show that large-scale baryon spread is very sensitive to model implementation details, with the fiducial \\textsc{SIMBA} model spreading $\\sim$40\\% of baryons $>$1\\,Mpc away compared to $\\sim$10\\% for the IllustrisTNG and \\textsc{ASTRID} models. Increasing the efficiency of AGN-driven outflows greatly increases baryon spread while increasing the strength of SNe-driven winds can decrease spreading due to non-linear coupling of stellar and AGN feedback. We compare total matter power spectra between hydrodynamic and paired $N$-body simulations and demonstrate that the baryonic spread metric broadly captures the global impact of feedback on matter clustering over variations of cosmological and astrophysical parameters, initial conditions, and galaxy formation models. Using symbolic regression, we find a function that reproduces the suppression of power by feedback as a function of wave number ($k$) and baryonic spread up to $k \\sim 10\\,h$\\,Mpc$^{-1}$ while highlighting the challenge of developing models robust to variations in galaxy formation physics implementation.",
  "categories": [
    "astro-ph.GA",
    "astro-ph.CO"
  ],
  "primary_category": "astro-ph.GA",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11832",
  "pdf_url": null,
  "comment": "17 pages, 15 figures",
  "num_versions": null,
  "size_before_bytes": 14524854,
  "size_after_bytes": 435581
}