{
  "title": "Investigating the Impact of Variables on Handover Performance in 5G Ultra-Dense Networks",
  "authors": [
    "Donglin Wang",
    "Anjie Qiu",
    "Qiuheng Zhou",
    "Sanket Partani",
    "Hans D. Schotten"
  ],
  "submission_date": "2023-07-26T12:31:39+00:00",
  "revised_dates": [],
  "abstract": "The advent of 5G New Radio (NR) technology has revolutionized the landscape of wireless communication, offering various enhancements such as elevated system capacity, improved spectrum efficiency, and higher data transmission rates. To achieve these benefits, 5G has implemented the Ultra-Dense Network (UDN) architecture, characterized by the deployment of numerous small general Node B (gNB) units. While this approach boosts system capacity and frequency reuse, it also raises concerns such as increased signal interference, longer handover times, and higher handover failure rates. To address these challenges, the critical factor of Time to Trigger (TTT) in handover management must be accurately determined. Furthermore, the density of gNBs has a significant impact on handover performance. This study provides a comprehensive analysis of 5G handover management. Through the development and utilization of a downlink system-level simulator, the effects of various TTT values and gNB densities on 5G handover were evaluated, taking into consideration the movement of Traffic Users (TUs) with varying velocities. Simulation results showed that the handover performance can be optimized by adjusting the TTT under different gNB densities, providing valuable insights into the proper selection of TTT, UDN, and TU velocity to enhance 5G handover performance.",
  "categories": [
    "cs.NI",
    "eess.SY"
  ],
  "primary_category": "cs.NI",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14152",
  "pdf_url": null,
  "comment": "6 pages, 6 figures, Eucnc 2023 Gothenburg, Sweden. arXiv admin note: text overlap with arXiv:2301.08053",
  "num_versions": null,
  "size_before_bytes": 927436,
  "size_after_bytes": 44510
}