{
  "title": "Backsplash galaxies and their impact on galaxy evolution: a three-stage, four-type perspective",
  "authors": [
    "Andrés N. Ruiz",
    "Héctor J. Martínez",
    "Valeria Coenda",
    "Hernán Muriel",
    "Sofía A. Cora",
    "Martín de los Rios",
    "Cristian A. Vega-Martínez"
  ],
  "submission_date": "2023-07-24T18:00:04+00:00",
  "revised_dates": [],
  "abstract": "We study the population of backsplash galaxies at $z=0$ in the outskirts of massive, isolated clusters of galaxies taken from the MDPL2-SAG semi-analytic catalogue. We consider four types of backsplash galaxies according to whether they are forming stars or passive at three stagesin their lifetimes: before entering the cluster, during their first incursion through the cluster, and after they exit the cluster. We analyse several geometric, dynamic, and astrophysical aspects of the four types at the three stages. Galaxies that form stars at all stages account for the majority of the backsplash population ($58\\%$) and have stellar masses typically below $M_\\star\\sim 3\\times 10^{10} h^{-1}{\\rm M}_\\odot$ that avoid the innermost cluster's regions and are only mildly affected by it. In a similar mass range, galaxies that become passive after exiting the cluster ($26\\%$) follow orbits characterised by small pericentric distance and a strong deflection by the cluster potential well while suffering a strong loss of both dark matter and gas content. Only a small fraction of our sample ($4\\%$) become passive while orbiting inside the cluster. These galaxies have experienced heavy pre-processing and the cluster's tidal stripping and ram pressure provide the final blow to their star formation. Finally, galaxies that are passive before entering the cluster for the first time ($12\\%$) are typically massive and are not affected significantly by the cluster. Using the bulge/total mass ratio as a proxy for morphology, we find that a single incursion through a cluster do not result in significant morphological changes in all four types.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.1093/mnras/stad2267",
  "journal_ref": null,
  "arxiv_id": "2307.13037",
  "pdf_url": null,
  "comment": "Accepted for publication in MNRAS. Comments are welcome",
  "num_versions": null,
  "size_before_bytes": 953700,
  "size_after_bytes": 274692
}