{
  "title": "Robustness Verification of Deep Neural Networks using Star-Based Reachability Analysis with Variable-Length Time Series Input",
  "authors": [
    "Neelanjana Pal",
    "Diego Manzanas Lopez",
    "Taylor T Johnson"
  ],
  "submission_date": "2023-07-26T02:15:11+00:00",
  "revised_dates": [],
  "abstract": "Data-driven, neural network (NN) based anomaly detection and predictive maintenance are emerging research areas. NN-based analytics of time-series data offer valuable insights into past behaviors and estimates of critical parameters like remaining useful life (RUL) of equipment and state-of-charge (SOC) of batteries. However, input time series data can be exposed to intentional or unintentional noise when passing through sensors, necessitating robust validation and verification of these NNs. This paper presents a case study of the robustness verification approach for time series regression NNs (TSRegNN) using set-based formal methods. It focuses on utilizing variable-length input data to streamline input manipulation and enhance network architecture generalizability. The method is applied to two data sets in the Prognostics and Health Management (PHM) application areas: (1) SOC estimation of a Lithium-ion battery and (2) RUL estimation of a turbine engine. The NNs' robustness is checked using star-based reachability analysis, and several performance measures evaluate the effect of bounded perturbations in the input on network outputs, i.e., future outcomes. Overall, the paper offers a comprehensive case study for validating and verifying NN-based analytics of time-series data in real-world applications, emphasizing the importance of robustness testing for accurate and reliable predictions, especially considering the impact of noise on future outcomes.",
  "categories": [
    "cs.LG",
    "cs.AI",
    "cs.CY",
    "cs.NE"
  ],
  "primary_category": "cs.LG",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13907",
  "pdf_url": null,
  "comment": "Under Review, 26 Pages, 14 figures, 2 tables",
  "num_versions": null,
  "size_before_bytes": 1579766,
  "size_after_bytes": 184265
}