{
  "title": "Fundamental causal bounds of quantum random access memories",
  "authors": [
    "Yunfei Wang",
    "Yuri Alexeev",
    "Liang Jiang",
    "Frederic T. Chong",
    "Junyu Liu"
  ],
  "submission_date": "2023-07-25T12:40:48+00:00",
  "revised_dates": [],
  "abstract": "Quantum devices should operate in adherence to quantum physics principles. Quantum random access memory (QRAM), a fundamental component of many essential quantum algorithms for tasks such as linear algebra, data search, and machine learning, is often proposed to offer $\\mathcal{O}(\\log N)$ circuit depth for $\\mathcal{O}(N)$ data size, given $N$ qubits. However, this claim appears to breach the principle of relativity when dealing with a large number of qubits in quantum materials interacting locally. In our study we critically explore the intrinsic bounds of rapid quantum memories based on causality, employing the relativistic quantum field theory and Lieb-Robinson bounds in quantum many-body systems. In this paper, we consider a hardware-efficient QRAM design in hybrid quantum acoustic systems. Assuming clock cycle times of approximately $10^{-3}$ seconds and a lattice spacing of about 1 micrometer, we show that QRAM can accommodate up to $\\mathcal{O}(10^7)$ logical qubits in 1 dimension, $\\mathcal{O}(10^{15})$ to $\\mathcal{O}(10^{20})$ in various 2D architectures, and $\\mathcal{O}(10^{24})$ in 3 dimensions. We contend that this causality bound broadly applies to other quantum hardware systems. Our findings highlight the impact of fundamental quantum physics constraints on the long-term performance of quantum computing applications in data science and suggest potential quantum memory designs for performance enhancement.",
  "categories": [
    "quant-ph",
    "cs.AI",
    "cs.LG",
    "stat.ML"
  ],
  "primary_category": "quant-ph",
  "doi": "10.1038/s41534-024-00848-3",
  "journal_ref": "NPJ Quantum Information (2024) 10:71",
  "arxiv_id": "2307.13460",
  "pdf_url": null,
  "comment": "8+24=32 pages, many figures",
  "num_versions": null,
  "size_before_bytes": 3554391,
  "size_after_bytes": 108726
}