{
  "title": "Phase Matching for Out-of-Distribution Generalization",
  "authors": [
    "Chengming Hu",
    "Yeqian Du",
    "Rui Wang",
    "Hao Chen",
    "Congcong Zhu"
  ],
  "submission_date": "2023-07-24T08:51:49+00:00",
  "revised_dates": [
    "2023-08-01T00:45:03+00:00",
    "2023-08-02T00:29:32+00:00",
    "2023-08-09T00:04:14+00:00",
    "2023-09-18T00:14:29+00:00",
    "2024-08-29T00:17:13+00:00"
  ],
  "abstract": "The Fourier transform, an explicit decomposition method for visual signals, has been employed to explain the out-of-distribution generalization behaviors of Deep Neural Networks (DNNs). Previous studies indicate that the amplitude spectrum is susceptible to the disturbance caused by distribution shifts, whereas the phase spectrum preserves highly-structured spatial information that is crucial for robust visual representation learning. Inspired by this insight, this paper is dedicated to clarifying the relationships between Domain Generalization (DG) and the frequency components. Specifically, we provide distribution analysis and empirical experiments for the frequency components. Based on these observations, we propose a Phase Matching approach, termed PhaMa, to address DG problems. To this end, PhaMa introduces perturbations on the amplitude spectrum and establishes spatial relationships to match the phase components with patch contrastive learning. Experiments on multiple benchmarks demonstrate that our proposed method achieves state-of-the-art performance in domain generalization and out-of-distribution robustness tasks. Beyond vanilla analysis and experiments, we further clarify the relationships between the Fourier components and DG problems by introducing a Fourier-based Structural Causal Model (SCM).",
  "categories": [
    "cs.CV"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12622",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 38945442,
  "size_after_bytes": 518739
}