{
  "title": "Universal Upper End of the Stellar Initial Mass Function in the Young and Compact LEGUS clusters",
  "authors": [
    "Dooseok Escher Jung",
    "Daniela Calzetti",
    "Matteo Messa",
    "Mark Heyer",
    "Mattia Sirressi",
    "Sean T. Linden",
    "Angela Adamo",
    "Rupali Chandar",
    "Michele Cignoni",
    "David O. Cook",
    "Clare L. Dobbs",
    "Bruce G. Elmegreen",
    "Aaron S. Evans",
    "Michele Fumagalli",
    "John S. Gallagher",
    "Deidre A. Hunter",
    "Kelsey E. Johnson",
    "Robert C. Kennicutt",
    "Mark R. Krumholz",
    "Daniel Schaerer",
    "Elena Sabbi",
    "Linda J. Smith",
    "Monica Tosi",
    "Aida Wofford"
  ],
  "submission_date": "2023-07-28T22:36:57+00:00",
  "revised_dates": [],
  "abstract": "We investigate the variation in the upper end of stellar initial mass function (uIMF) in 375 young and compact star clusters in five nearby galaxies within $\\sim 5$ Mpc. All the young stellar clusters (YSCs) in the sample have ages $\\lesssim 4$ Myr and masses above 500 $M_{\\odot}$, according to standard stellar models. The YSC catalogs were produced from Hubble Space Telescope images obtained as part of the Legacy ExtraGalactic UV Survey (LEGUS) Hubble treasury program. They are used here to test whether the uIMF is universal or changes as a function of the cluster's stellar mass. We perform this test by measuring the H$α$ luminosity of the star clusters as a proxy for their ionizing photon rate, and charting its trend as a function of cluster mass. Large cluster numbers allow us to mitigate the stochastic sampling of the uIMF. The advantage of our approach relative to previous similar attempts is the use of cluster catalogs that have been selected independently of the presence of H$α$ emission, thus removing a potential sample bias. We find that the uIMF, as traced by the H$α$ emission, shows no dependence on cluster mass, suggesting that the maximum stellar mass that can be produced in star clusters is universal, in agreement with previous findings.",
  "categories": [
    "astro-ph.GA",
    "astro-ph.SR"
  ],
  "primary_category": "astro-ph.GA",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15831",
  "pdf_url": "https://arxiv.org/pdf/2307.15831v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 2006657,
  "size_after_bytes": 581685
}