{
  "title": "Building-road Collaborative Extraction from Remotely Sensed Images via Cross-Interaction",
  "authors": [
    "Haonan Guo",
    "Xin Su",
    "Chen Wu",
    "Bo Du",
    "Liangpei Zhang"
  ],
  "submission_date": "2023-07-23T08:02:37+00:00",
  "revised_dates": [],
  "abstract": "Buildings are the basic carrier of social production and human life; roads are the links that interconnect social networks. Building and road information has important application value in the frontier fields of regional coordinated development, disaster prevention, auto-driving, etc. Mapping buildings and roads from very high-resolution (VHR) remote sensing images have become a hot research topic. However, the existing methods often ignore the strong spatial correlation between roads and buildings and extract them in isolation. To fully utilize the complementary advantages between buildings and roads, we propose a building-road collaborative extraction method based on multi-task and cross-scale feature interaction to improve the accuracy of both tasks in a complementary way. A multi-task interaction module is proposed to interact information across tasks and preserve the unique information of each task, which tackle the seesaw phenomenon in multitask learning. By considering the variation in appearance and structure between buildings and roads, a cross-scale interaction module is designed to automatically learn the optimal reception field for different tasks. Compared with many existing methods that train each task individually, the proposed collaborative extraction method can utilize the complementary advantages between buildings and roads by the proposed inter-task and inter-scale feature interactions, and automatically select the optimal reception field for different tasks. Experiments on a wide range of urban and rural scenarios show that the proposed algorithm can achieve building-road extraction with outstanding performance and efficiency.",
  "categories": [
    "cs.CV",
    "cs.AI"
  ],
  "primary_category": "cs.CV",
  "doi": "10.1109/TGRS.2024.3383057",
  "journal_ref": "IEEE Transactions on Geoscience and Remote Sensing",
  "arxiv_id": "2307.12256",
  "pdf_url": null,
  "comment": "IEEE Transactions on Geoscience and Remote Sensing",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}