{
  "title": "Rupture Dynamics of Cascading Earthquakes in a Multiscale Fracture Network",
  "authors": [
    "Kadek Hendrawan Palgunadi",
    "Alice-Agnes Gabriel",
    "Dmitry Igor Garagash",
    "Thomas Ulrich",
    "Paul Martin Mai"
  ],
  "submission_date": "2023-07-26T14:50:17+00:00",
  "revised_dates": [],
  "abstract": "Fault-damage zones comprise multiscale fracture networks that may slip dynamically and interact with the main fault during earthquake rupture. Using 3D dynamic rupture simulations and scale-dependent fracture energy, we examine dynamic interactions of more than 800 intersecting multiscale fractures surrounding a listric fault, emulating a major fault and its damage zone. We investigate ten distinct orientations of maximum horizontal stress, probing the conditions necessary for sustained slip within the fracture network or activating the main fault. Additionally, we assess the feasibility of nucleating dynamic rupture earthquake cascades from a distant fracture and investigate the sensitivity of fracture network cascading rupture to the effective normal stress level. We model either pure cascades or main fault rupture with limited off-fault slip. We find that cascading ruptures within the fracture network are dynamically feasible under certain conditions, including: (i) the state-evolutional distance scales with fracture and fault size, (ii) favorable relative pre-stress of fractures within the ambient stress field, and (iii) close proximity of fractures. We find that cascading rupture within the fracture network discourages rupture on the main fault. Our simulations suggest that favorable relative pre-stress fractures within a fault damage zone may lead to cascading earthquake rupture reaching off-fault moment magnitudes up to $Mw \\approx 5.6$, shadowing the main fault slip. Our findings offer fundamental insights into physical processes governing cascading earthquake dynamic rupture within multiscale fracture networks. Our results have implications for the seismic hazard of naturally activated fracture or fault networks and earthquakes induced in geo-energy exploitation activities.",
  "categories": [
    "physics.geo-ph"
  ],
  "primary_category": "physics.geo-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14229",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 36654774,
  "size_after_bytes": 2943393
}