{
  "title": "Mask-guided Data Augmentation for Multiparametric MRI Generation with a Rare Hepatocellular Carcinoma",
  "authors": [
    "Karen Sanchez",
    "Carlos Hinojosa",
    "Kevin Arias",
    "Henry Arguello",
    "Denis Kouame",
    "Olivier Meyrignac",
    "Adrian Basarab"
  ],
  "submission_date": "2023-07-30T20:41:58+00:00",
  "revised_dates": [],
  "abstract": "Data augmentation is classically used to improve the overall performance of deep learning models. It is, however, challenging in the case of medical applications, and in particular for multiparametric datasets. For example, traditional geometric transformations used in several applications to generate synthetic images can modify in a non-realistic manner the patients' anatomy. Therefore, dedicated image generation techniques are necessary in the medical field to, for example, mimic a given pathology realistically. This paper introduces a new data augmentation architecture that generates synthetic multiparametric (T1 arterial, T1 portal, and T2) magnetic resonance images (MRI) of massive macrotrabecular subtype hepatocellular carcinoma with their corresponding tumor masks through a generative deep learning approach. The proposed architecture creates liver tumor masks and abdominal edges used as input in a Pix2Pix network for synthetic data creation. The method's efficiency is demonstrated by training it on a limited multiparametric dataset of MRI triplets from $89$ patients with liver lesions to generate $1,000$ synthetic triplets and their corresponding liver tumor masks. The resulting Frechet Inception Distance score was $86.55$. The proposed approach was among the winners of the 2021 data augmentation challenge organized by the French Society of Radiology.",
  "categories": [
    "eess.IV",
    "cs.CV",
    "cs.LG"
  ],
  "primary_category": "eess.IV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16314",
  "pdf_url": "https://arxiv.org/pdf/2307.16314v1",
  "comment": "Accepted at IEEE ISBI 2023",
  "num_versions": null,
  "size_before_bytes": 20009938,
  "size_after_bytes": 72236
}