{
  "title": "ExWarp: Extrapolation and Warping-based Temporal Supersampling for High-frequency Displays",
  "authors": [
    "Akanksha Dixit",
    "Yashashwee Chakrabarty",
    "Smruti R. Sarangi"
  ],
  "submission_date": "2023-07-24T08:32:27+00:00",
  "revised_dates": [],
  "abstract": "High-frequency displays are gaining immense popularity because of their increasing use in video games and virtual reality applications. However, the issue is that the underlying GPUs cannot continuously generate frames at this high rate -- this results in a less smooth and responsive experience. Furthermore, if the frame rate is not synchronized with the refresh rate, the user may experience screen tearing and stuttering. Previous works propose increasing the frame rate to provide a smooth experience on modern displays by predicting new frames based on past or future frames. Interpolation and extrapolation are two widely used algorithms that predict new frames. Interpolation requires waiting for the future frame to make a prediction, which adds additional latency. On the other hand, extrapolation provides a better quality of experience because it relies solely on past frames -- it does not incur any additional latency. The simplest method to extrapolate a frame is to warp the previous frame using motion vectors; however, the warped frame may contain improperly rendered visual artifacts due to dynamic objects -- this makes it very challenging to design such a scheme. Past work has used DNNs to get good accuracy, however, these approaches are slow. This paper proposes Exwarp -- an approach based on reinforcement learning (RL) to intelligently choose between the slower DNN-based extrapolation and faster warping-based methods to increase the frame rate by 4x with an almost negligible reduction in the perceived image quality.",
  "categories": [
    "cs.GR",
    "cs.AR",
    "cs.CV",
    "cs.LG"
  ],
  "primary_category": "cs.GR",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12607",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 2081661,
  "size_after_bytes": 1487553
}