{
  "title": "On the 'Loose' Constraint from IceCube Neutrino Non-Detection of GRB 230307A",
  "authors": [
    "Xin-Ying Song"
  ],
  "submission_date": "2023-07-31T10:27:36+00:00",
  "revised_dates": [
    "2023-08-01T01:21:11+00:00",
    "2023-08-06T12:00:35+00:00",
    "2023-08-11T06:24:29+00:00",
    "2023-10-02T03:08:08+00:00",
    "2023-10-12T02:36:51+00:00",
    "2023-11-20T12:07:53+00:00"
  ],
  "abstract": "The recent extremely bright gamma-ray burst (GRB), GRB 230307A from a binary neutron star merger may offer a good probe for the production of GRB-neutrinos. Within the constraint from IceCube neutrino non-detection, the limits for key physical parameters of this burst are extracted in different scenarios including the fireball, Poynting-flux-dominated (PFD) and hybrid jet. Different from the former nearby `monsters' and due to its smaller isotropic equivalent radiated energy ($E_{γ,\\rm iso}\\sim4\\times10^{52}$ erg), the constraint seems loose if non-thermal neutrinos produced from photomeson interactions are the only consideration. However, a quasi-thermal neutrino emission from hadronuclear processes is constrained in this neutron-rich post-merger environment, and the upper limit of the allowed nucleon loading factor is about a few. Based on this, a discussion is presented on the possible prompt emission mechanism and jet composition for GRB 230307A in the context of multi-messenger astrophysics. It is worth noting that till now no GRB-neutrinos have been ever detected, even for the two brightest nearby GRBs ever observed (GRB 221009A and GRB 230307A) which have different dissipation mechanisms.",
  "categories": [
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.HE",
  "doi": "10.3847/1538-4357/ad02ef",
  "journal_ref": "The Astrophysical Journal, 958:133 (11pp), 2023 December 1",
  "arxiv_id": "2307.16547",
  "pdf_url": "https://arxiv.org/pdf/2307.16547v7",
  "comment": "Published in ApJ 958,133;accepted for publication in ApJ on Oct. 11; 13 pages, 3 figures. submitted on 2023.08.11. Minor revision according to the reviwer's suggestions on Oct. 02",
  "num_versions": null,
  "size_before_bytes": 29952411,
  "size_after_bytes": 3470005
}