{
  "title": "Constraining a companion of the galactic center black hole, Sgr A*",
  "authors": [
    "Clifford M. Will",
    "Smadar Naoz",
    "Aurélien Hees",
    "Alexandria Tucker",
    "Eric Zhang",
    "Tuan Do",
    "Andrea Ghez"
  ],
  "submission_date": "2023-07-31T13:26:44+00:00",
  "revised_dates": [
    "2023-12-11T21:17:29+00:00"
  ],
  "abstract": "We use 23 years of astrometric and radial velocity data on the orbit of the star S0-2 to constrain a hypothetical intermediate-mass black hole orbiting the massive black hole Sgr A* at the Galactic center. The data place upper limits on variations of the orientation of the stellar orbit (inclination, nodal angle, and pericenter) at levels between 0.02 and 0.07 degrees per year. We use a combination of analytic estimates and full numerical integrations of the orbit of S0-2 in the presence of a black-hole binary. For a companion IMBH whose semi-major axis $a_c$ is larger than that of S0-2 (1020 a.u.), we find that in the region between 1000 and 4000 a.u., a companion black hole with mass $m_c$ between $10^3$ and $10^5 M_\\odot$ is excluded, with a boundary behaving as $a_c \\sim m_c^{1/3}$. For a companion with $a_c < 1020$ a.u., we find that a black hole with mass between $10^3$ and $10^5 \\, M_\\odot$ is again excluded, with a boundary behaving as $a_c \\sim m_c^{-1/2}$. These bounds arise from quadrupolar perturbations of the orbit of S0-2. However, significantly stronger bounds on the mass of an inner companion arise from the fact that the location of S0-2 is measured relative to the bright emission of Sgr A*. As a consequence, that separation is perturbed by the ``wobble'' of Sgr A* about the center of mass between it and the companion, leading to ``apparent'' perturbations of S0-2's orbit that also include a dipole component. The result is a set of bounds as small as $400 \\, M_\\odot$ at 200 a.u.; the numerical simulations suggest a bound from these effects varying as $a_c \\sim m_c^{-1}$. We compare and contrast our results with those from a recent analysis by the GRAVITY collaboration.",
  "categories": [
    "astro-ph.GA",
    "astro-ph.HE",
    "gr-qc"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.3847/1538-4357/ad09b3",
  "journal_ref": "Astrophys. J. 959, 58 (2023)",
  "arxiv_id": "2307.16646",
  "pdf_url": "https://arxiv.org/pdf/2307.16646v2",
  "comment": "9 pages, 4 figures; minor revisions to agree with published version",
  "num_versions": null,
  "size_before_bytes": 770485,
  "size_after_bytes": 136207
}