{
  "title": "Detection of a strong ~2.5 Hz modulation in the Newly Discovered Millisecond Pulsar MAXI J1816-195",
  "authors": [
    "P. P. Li",
    "L. Tao",
    "L. Zhang",
    "Q. C. Bu",
    "J. L. Qu",
    "L. Ji",
    "P. J. Wang",
    "Y. P. Chen",
    "S. Zhang",
    "R. C. Ma",
    "Z. X. Yang",
    "W. T. Ye",
    "S. J. Zhao",
    "Q. C. Zhao",
    "Y. Huang",
    "X. Ma",
    "E. L. Qiao",
    "S. M. Jia",
    "S. N. Zhang"
  ],
  "submission_date": "2023-07-26T04:22:33+00:00",
  "revised_dates": [],
  "abstract": "MAXI J181-195 is a newly discovered accreting millisecond X-ray pulsar that went outburst in June 2022. Through timing analysis with NICER and NuSTAR observations, we find a transient modulation at ~2.5 Hz during the decay period of MAXI J1816-195. The modulation is strongly correlated with a spectral hardening, and its fractional rms amplitude increases with energy. These results suggest that the modulation is likely to be produced in an unstable corona. In addition, the presence of the modulation during thermonuclear bursts indicates that it may originate from a disk-corona where the optical depth is likely the main factor affecting the modulation, rather than temperature. Moreover, we find significant reflection features in the spectra observed simultaneously by NICER and NuSTAR, including a relativistically broadened Fe-K line around 6-7 keV, and a Compton hump in the 10-30 keV energy band. The radius of the inner disc is constrained to be Rin = (1.04-1.23) RISCO based on reflection modeling of the broadband spectra. Assuming that the inner disc is truncated at the magnetosphere radius, we estimate that the magnetic field strength is < 4.67 * 10e8 G.",
  "categories": [
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.HE",
  "doi": "10.1093/mnras/stad2286",
  "journal_ref": null,
  "arxiv_id": "2307.13955",
  "pdf_url": null,
  "comment": "12 pages, 13 figures",
  "num_versions": null,
  "size_before_bytes": 12838745,
  "size_after_bytes": 249035
}