{
  "title": "Blockchain inspired secure and reliable data exchange architecture for cyber-physical healthcare system 4.0",
  "authors": [
    "Mohit Kumar",
    "Hritu Raj",
    "Nisha Chaurasia",
    "Sukhpal Singh Gill"
  ],
  "submission_date": "2023-06-28T14:47:59+00:00",
  "revised_dates": [],
  "abstract": "A cyber-physical system is considered to be a collection of strongly coupled communication systems and devices that poses numerous security trials in various industrial applications including healthcare. The security and privacy of patient data is still a big concern because healthcare data is sensitive and valuable, and it is most targeted over the internet. Moreover, from the industrial perspective, the cyber-physical system plays a crucial role in the exchange of data remotely using sensor nodes in distributed environments. In the healthcare industry, Blockchain technology offers a promising solution to resolve most securities-related issues due to its decentralized, immutability, and transparency properties. In this paper, a blockchain-inspired secure and reliable data exchange architecture is proposed in the cyber-physical healthcare industry 4.0. The proposed system uses the BigchainDB, Tendermint, Inter-Planetary-File-System (IPFS), MongoDB, and AES encryption algorithms to improve Healthcare 4.0. Furthermore, blockchain-enabled secure healthcare architecture for accessing and managing the records between Doctors and Patients is introduced. The development of a blockchain-based Electronic Healthcare Record (EHR) exchange system is purely patient-centric, which means the entire control of data is in the owner's hand which is backed by blockchain for security and privacy. Our experimental results reveal that the proposed architecture is robust to handle more security attacks and can recover the data if 2/3 of nodes are failed. The proposed model is patient-centric, and control of data is in the patient's hand to enhance security and privacy, even system administrators can't access data without user permission.",
  "categories": [
    "cs.CR",
    "cs.DC"
  ],
  "primary_category": "cs.CR",
  "doi": "10.1016/j.iotcps.2023.05.006",
  "journal_ref": "Internet of Things and Cyber-Physical Systems, Volume 3, 2023, Pages 309-322",
  "arxiv_id": "2307.13603",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}