{
  "title": "Leading two-loop corrections to the Higgs di-photon decay in the Inert Doublet Model",
  "authors": [
    "Masashi Aiko",
    "Johannes Braathen",
    "Shinya Kanemura"
  ],
  "submission_date": "2023-07-27T16:14:46+00:00",
  "revised_dates": [
    "2024-10-25T10:00:03+00:00",
    "2025-05-10T09:18:34+00:00"
  ],
  "abstract": "Leading two-loop contributions to the di-photon decay of the Higgs boson are evaluated for the first time in the Inert Doublet Model (IDM). We employ for this calculation the Higgs low-energy theorem, meaning that we obtain corrections to the Higgs decay process by taking Higgs-field derivatives of the leading two-loop contributions to the photon self-energy. Specifically, we have included corrections involving inert BSM Higgs bosons and gauge bosons, as well as external-leg contributions involving inert scalars, gauge bosons and fermions. Our calculation has been performed with a full on-shell renormalization, and in the gauge-less limit. Moreover, we performed two independent calculations, using the background-field method and the pinch technique, in order to apply the Higgs low-energy theorem consistently, and found full agreement between the two calculations. We investigate our results numerically in two scenarios of the IDM: one with a light dark matter (DM) candidate (Higgs resonance scenario), and another with all additional scalars heavy (heavy Higgs scenario). In both cases, we find that the inclusion of two-loop corrections qualitatively modifies the behavior of the decay width, compared with the one-loop ($i.e.$ leading) order, and that they increase the deviation from the Standard Model. Furthermore, we demonstrate that the inclusion of the newly-computed two-loop corrections is essential to reliably interpret the observation or non-observation of a deviation in the Higgs di-photon decay width at current and future colliders.",
  "categories": [
    "hep-ph"
  ],
  "primary_category": "hep-ph",
  "doi": "10.1140/epjc/s10052-025-14184-z",
  "journal_ref": "Eur.Phys.J.C 85 (2025) 5, 489",
  "arxiv_id": "2307.14976",
  "pdf_url": "https://arxiv.org/pdf/2307.14976v3",
  "comment": "20 pages, 6 figures; v2: major revision and extension of the calculation; v3: matches version published in EPJC",
  "num_versions": null,
  "size_before_bytes": 1214329,
  "size_after_bytes": 646186
}