{
  "title": "Entanglement of weighted graphs uncovers transitions in variable-range interacting models",
  "authors": [
    "Debkanta Ghosh",
    "Keshav Das Agarwal",
    "Pritam Halder",
    "Aditi Sen De"
  ],
  "submission_date": "2023-07-21T17:53:46+00:00",
  "revised_dates": [
    "2025-01-28T01:38:08+00:00"
  ],
  "abstract": "The cluster state acquired by evolving the nearest-neighbor (NN) Ising model from a completely separable state is the resource for measurement-based quantum computation. Instead of an NN system, a variable-range power law interacting Ising model can generate a genuine multipartite entangled (GME) weighted graph state (WGS) that may reveal intrinsic characteristics of the evolving Hamiltonian. We establish that the pattern of generalized geometric measure (GGM) in the evolved state with an arbitrary number of qubits is sensitive to fall-off rates and the range of interactions of the evolving Hamiltonian. We report that the time-derivative and time-averaged GGM at a particular time can detect the transition points present in the fall-off rates of the interaction strength, separating different regions, namely long-range, quasi-local and local ones in one- and two-dimensional lattices with deformation. Moreover, we illustrate that in the quasi-local and local regimes, there exists a minimum coordination number in the evolving Ising model for a fixed total number of qubits which can mimic the GGM of the long-range model. In order to achieve a finite-size subsystem from the entire system, we design a local measurement strategy that allows a WGS of an arbitrary number of qubits to be reduced to a local unitarily equivalent WGS having fewer qubits with modified weights.",
  "categories": [
    "quant-ph",
    "cond-mat.quant-gas",
    "cond-mat.str-el"
  ],
  "primary_category": "quant-ph",
  "doi": "10.1103/PhysRevA.110.022431",
  "journal_ref": "Phys. Rev. A 110, 022431 (2024)",
  "arxiv_id": "2307.11739",
  "pdf_url": null,
  "comment": "v1: 14 pages, 9 figures, v2: close to publish version",
  "num_versions": null,
  "size_before_bytes": 4476038,
  "size_after_bytes": 341603
}