{
  "title": "Probing the variations in the timing of the Sun's polar magnetic field reversals through observations and surface flux transport simulations",
  "authors": [
    "Elena M. Golubeva",
    "Akash Biswas",
    "Anna I. Khlystova",
    "Pawan Kumar",
    "Bidya Binay Karak"
  ],
  "submission_date": "2023-07-25T12:33:44+00:00",
  "revised_dates": [],
  "abstract": "The polar field reversal is a crucial process in the cyclic evolution of the large-scale magnetic field of the Sun.Various important characteristics of a solar cycle, such as its duration and strength, and also the cycle predictability, are determined by the polar field reversal time. While the regular measurements of solar magnetic field have been accumulated for more than half a century, there is no consensus in the heliophysics community concerning the interpretation of the Sun's polar field measurements and especially the determination of polar field reversal time. There exists a severe problem of non-reproducibility in the reported results even from studies of the same observational dataset, and this causes an obstacle to make more accurate forecasts of solar cycle. Here, we analyze the solar magnetograms from four instruments for the last four cycles, to provide a more correct interpretation of the polar field observations and to find more accurate time of the reversals. We show the absence of triple (multipolar) reversals in Cycles 21 - 24, significant variations in the time interval between reversals in the hemispheres and in the time interval between a reversal and a cycle beginning. In order to understand the origin of the reversal time variation, we perform Surface Flux Transport (SFT) simulations and find out that the presence of the 'anomalous' bipolar magnetic regions (BMRs) in different phases of a cycle can cause cycle-to-cycle variations of the reversal time within the similar range found in observations.",
  "categories": [
    "astro-ph.SR",
    "physics.space-ph"
  ],
  "primary_category": "astro-ph.SR",
  "doi": "10.1093/mnras/stad2254",
  "journal_ref": null,
  "arxiv_id": "2307.13452",
  "pdf_url": null,
  "comment": "Accepted for publication in MNRAS",
  "num_versions": null,
  "size_before_bytes": 2714308,
  "size_after_bytes": 78752
}