{
  "title": "S$^3$: Social-network Simulation System with Large Language Model-Empowered Agents",
  "authors": [
    "Chen Gao",
    "Xiaochong Lan",
    "Zhihong Lu",
    "Jinzhu Mao",
    "Jinghua Piao",
    "Huandong Wang",
    "Depeng Jin",
    "Yong Li"
  ],
  "submission_date": "2023-07-27T16:24:56+00:00",
  "revised_dates": [
    "2023-10-19T13:57:31+00:00",
    "2025-06-03T23:11:27+00:00"
  ],
  "abstract": "Social network simulation plays a crucial role in addressing various challenges within social science. It offers extensive applications such as state prediction, phenomena explanation, and policy-making support, among others. In this work, we harness the formidable human-like capabilities exhibited by large language models (LLMs) in sensing, reasoning, and behaving, and utilize these qualities to construct the S$^3$ system (short for $\\textbf{S}$ocial network $\\textbf{S}$imulation $\\textbf{S}$ystem). Adhering to the widely employed agent-based simulation paradigm, we employ prompt engineering and prompt tuning techniques to ensure that the agent's behavior closely emulates that of a genuine human within the social network. Specifically, we simulate three pivotal aspects: emotion, attitude, and interaction behaviors. By endowing the agent in the system with the ability to perceive the informational environment and emulate human actions, we observe the emergence of population-level phenomena, including the propagation of information, attitudes, and emotions. We conduct an evaluation encompassing two levels of simulation, employing real-world social network data. Encouragingly, the results demonstrate promising accuracy. This work represents an initial step in the realm of social network simulation empowered by LLM-based agents. We anticipate that our endeavors will serve as a source of inspiration for the development of simulation systems within, but not limited to, social science.",
  "categories": [
    "cs.SI"
  ],
  "primary_category": "cs.SI",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14984",
  "pdf_url": "https://arxiv.org/pdf/2307.14984v3",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 807796,
  "size_after_bytes": 256309
}