{
  "title": "Fast but multi-partisan: Bursts of communication increase opinion diversity in the temporal Deffuant model",
  "authors": [
    "Fatemeh Zarei",
    "Yerali Gandica",
    "Luis Enrique Correa Rocha"
  ],
  "submission_date": "2023-07-28T15:17:03+00:00",
  "revised_dates": [],
  "abstract": "Human interactions create social networks forming the backbone of societies. Individuals adjust their opinions by exchanging information through social interactions. Two recurrent questions are whether social structures promote opinion polarisation or consensus in societies and whether polarisation can be avoided, particularly on social media. In this paper, we hypothesise that not only network structure but also the timings of social interactions regulate the emergence of opinion clusters. We devise a temporal version of the Deffuant opinion model where pairwise interactions follow temporal patterns and show that burstiness alone is sufficient to refrain from consensus and polarisation by promoting the reinforcement of local opinions. Individuals self-organise into a multi-partisan society due to network clustering, but the diversity of opinion clusters further increases with burstiness, particularly when individuals have low tolerance and prefer to adjust to similar peers. The emergent opinion landscape is well-balanced regarding clusters' size, with a small fraction of individuals converging to extreme opinions. We thus argue that polarisation is more likely to emerge in social media than offline social networks because of the relatively low social clustering observed online. Counter-intuitively, strengthening online social networks by increasing social redundancy may be a venue to reduce polarisation and promote opinion diversity.",
  "categories": [
    "physics.soc-ph",
    "cs.MA",
    "econ.GN",
    "physics.pop-ph"
  ],
  "primary_category": "physics.soc-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15614",
  "pdf_url": "https://arxiv.org/pdf/2307.15614v1",
  "comment": "9 pages, 6 figures. Comments (e.g. missing references, suggestions, ...) are welcomed",
  "num_versions": null,
  "size_before_bytes": 2184175,
  "size_after_bytes": 116358
}