{
  "title": "Revisiting the Electrified Pt(111)/Water Interfaces through an Affordable Double-Reference ab-initio Approach",
  "authors": [
    "Jack Jon Hinsch",
    "Assil Bouzid",
    "Jordan Clive Barker",
    "Jessica Jein White",
    "Fabien Mortier",
    "Huijun Zhao",
    "Yun Wang"
  ],
  "submission_date": "2023-07-24T00:48:37+00:00",
  "revised_dates": [],
  "abstract": "The electrified solid-liquid interface plays an essential role in many renewable energy-related applications, including hydrogen production and utilization. Limitations in computational modelling of the electrified solid-liquid interface have held back the understanding of its properties at the atomic-scale level. In this study, we applied the grand canonical density functional theory (GC-DFT) combined with a hybrid implicit/explicit solvation model to reinvestigate the widely studied electrified platinum-water interface affordably. The calculated double layer capacitances of the Pt(111)-water interface over the applied bias potential closely match the experimental and previous theoretical data from expensive ab-initio molecular dynamics simulations. The structural analysis of the interface models reveals that the applied bias potential can significantly affect the Pt(111)-water atomic interface configurations. The orientation of the water molecules next to the Pt(111) surface is vital for correctly describing the potential of zero charge (PZC) and capacitance. Additionally, the GC-DFT results confirm that the absorption of the hydrogen atom under applied bias potential can significantly affect the electrified interfacial properties. The presented affordable GC-DFT approach, therefore, offers an efficient and accurate means to enhance the understanding of electrified solid-liquid interfaces.",
  "categories": [
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": "10.1021/acs.jpcc.3c05425",
  "journal_ref": "J. Phys. Chem. C. (2023)",
  "arxiv_id": "2307.12462",
  "pdf_url": null,
  "comment": "24 pages, 7 figures, supporting information, A published version is available",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}