{
  "title": "Highly-mass-loaded hot galactic winds are unstable to cool filament formation",
  "authors": [
    "Dustin D. Nguyen",
    "Todd A. Thompson",
    "Evan E. Schneider",
    "Ashley P. Tarrant"
  ],
  "submission_date": "2023-07-21T22:31:37+00:00",
  "revised_dates": [],
  "abstract": "When cool clouds are ram-pressure accelerated by a hot supersonic galactic wind, some of the clouds may be shredded by hydrodynamical instabilities and incorporated into the hot flow. Recent one-dimensional steady-state calculations show how cool cloud entrainment directly affects the bulk thermodynamics, kinematics, and observational characteristics of the hot gas. In particular, mass-loading decelerates the hot flow and changes its entropy. Here, we investigate the stability of planar and spherical mass-loaded hot supersonic flows using both perturbation analysis and three-dimensional time-dependent radiative hydrodynamical simulations. We show that mass-loading is stable over a broad range of parameters and that the 1D time-steady analytic solutions exactly reproduce the 3D time-dependent calculations, provided that the flow does not decelerate sufficiently to become subsonic. For higher values of the mass-loading, the flow develops a sonic point and becomes thermally unstable, rapidly cooling and forming elongated dense cometary filaments. We explore the mass-loading parameters required to reach a sonic point and the radiative formation of these filaments. For certain approximations, we can derive simple analytic criteria. In general a mass-loading rate similar to the initial mass outflow rate is required. In this sense, the destruction of small cool clouds by a hot flow may ultimately spontaneously generate fast cool filaments, as observed in starburst superwinds. Lastly, we find that the kinematics of filaments is sensitive to the slope of the mass-loading function. Filaments move faster than the surrounding wind if mass-loading is over long distances whereas filaments move slower than their surroundings if mass-loading is abrupt.",
  "categories": [
    "astro-ph.GA",
    "physics.flu-dyn"
  ],
  "primary_category": "astro-ph.GA",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11930",
  "pdf_url": null,
  "comment": "12 pages, 15 figures, submitted to MNRAS (21 July 2023)",
  "num_versions": null,
  "size_before_bytes": 10946366,
  "size_after_bytes": 356823
}