{
  "title": "Photometric calibration of the Stellar Abundance and Galactic Evolution Survey (SAGES): Nanshan One-meter Wide-field Telescope g, r, and i band imaging data",
  "authors": [
    "Kai Xiao",
    "Haibo Yuan",
    "Bowen Huang",
    "Shuai Xu",
    "Jie Zheng",
    "Chun Li",
    "Zhou Fan",
    "Wei Wang",
    "Gang Zhao",
    "Guojie Feng",
    "Xuan Zhang",
    "Jinzhong Liu",
    "Ruoyi Zhang",
    "Lin Yang",
    "Yu Zhang",
    "Chunhai Bai",
    "Hubiao Niu",
    "Esamdin Ali",
    "Lu Ma"
  ],
  "submission_date": "2023-07-25T04:03:55+00:00",
  "revised_dates": [],
  "abstract": "In this paper, a total of approximately 2.6 million dwarfs were constructed as standard stars, with an accuracy of about 0.01-0.02 mag for each band, by combining spectroscopic data from the Large Sky Area Multi-Object Fiber Spectroscopic Telescope Data Release 7, photometric data from the corrected Gaia Early Data Release 3, and photometric metallicities. Using the spectroscopy based stellar color regression method (SCR method) and the photometric-based SCR method (SCR' method), we performed the relative calibration of the Nanshan One-meter Wide-field Telescope imaging data. Based on the corrected Pan-STARRS DR1 photometry, the absolute calibration was also performed. In the photometric calibration process, we analyzed the dependence of the calibration zero points on different images (observation time), different gates of the CCD detector, and different CCD positions. We found that the stellar flat and the relative gain between different gates depend on time. The amplitude of gain variation in three channels is approximately 0.5%-0.7% relative to the other channel, with a maximum value of 4%. In addition, significant spatial variations of the stellar flat fitting residual are found and corrected. Using repeated sources in the adjacent images, we checked and discovered internal consistency of about 1-2 mmag in all the filters. Using the PS1 magnitudes synthesized by Gaia DR3 BP/RP spectra by the synthetic photometry method, we found that the photometric calibration uniformity is about 1-2 mmag for all the bands, at a spatial resolution of 1.3 degree. A detailed comparison between the spectroscopy-based SCR and photometric-based SCR method magnitude offsets was performed, and we achieved an internal consistency precision of about 2 mmag or better with resolutions of 1.3 degree for all the filters. Which is mainly from the position-dependent errors of the E(B-V) used in SCR' method.",
  "categories": [
    "astro-ph.SR",
    "astro-ph.GA",
    "astro-ph.IM"
  ],
  "primary_category": "astro-ph.SR",
  "doi": "10.1360/TB-2023-0052",
  "journal_ref": null,
  "arxiv_id": "2307.13238",
  "pdf_url": null,
  "comment": "15 pages in Chinese language, 8 figures, Chinese Science Bulletin accepted and published online (https://www.sciengine.com/CSB/doi/10.1360/TB-2023-0052), see main results in Figures 6, 7 and 8",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}