{
  "title": "Biological Modelling with Nonlocal Advection Diffusion Equations",
  "authors": [
    "Kevin J Painter",
    "Thomas Hillen",
    "Jonathan R Potts"
  ],
  "submission_date": "2023-07-26T10:39:20+00:00",
  "revised_dates": [],
  "abstract": "The employment of nonlocal PDE models to describe biological aggregation and other phenomena has gained considerable traction in recent years. For cell populations, these methods grant a means of accommodating essential elements such as cell adhesion, critical to the development and structure of tissues. For animals, they can be used to describe how the nearby presence of conspecifics and/or heterospecifics influence movement behaviour. In this review, we will focus on classes of biological movement models in which the advective (or directed) component to motion is governed by an integral term that accounts for how the surrounding distribution(s) of the population(s) impact on a member's movement. We recount the fundamental motivation for these models: the intrinsic capacity of cell populations to self-organise and spatially sort within tissues; the wide-ranging tendency of animals towards spatial structuring, from the formations of herds and swarms to territorial segregation. We examine the derivation of these models from an individual level, illustrating in the process methods that allow models to be connected to data. We explore a growing analytical literature, including methods of stability and bifurcation analysis, and existence results. We conclude with a short section that lays out some future challenges and connections to the modelling of sociological phenomena including opinion dynamics.",
  "categories": [
    "q-bio.QM"
  ],
  "primary_category": "q-bio.QM",
  "doi": "10.1142/S0218202524400025",
  "journal_ref": "Mathematical Models and Methods in Applied Sciences 34 (1), 57-107 (2024)",
  "arxiv_id": "2307.14396",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 14856408,
  "size_after_bytes": 482584
}