{
  "title": "Collective Excitations of Self-Gravitating Bose-Einstein Condensates: Breathing Mode and Appearance of Anisotropy under Self-Gravity",
  "authors": [
    "Kenta Asakawa",
    "Hideki Ishihara",
    "Makoto Tsubota"
  ],
  "submission_date": "2023-07-26T08:01:12+00:00",
  "revised_dates": [
    "2023-11-30T01:12:39+00:00",
    "2024-10-03T00:39:34+00:00"
  ],
  "abstract": "We investigate the collective mode of a self-gravitating Bose-Einstein condensate (BEC) described by the Gross-Pitaevskii-Poisson (GPP) equations. The self-gravitating BEC has garnered considerable attention in cosmology and astrophysics, being proposed as a plausible candidate for dark matter. Our inquiry delves into the breathing and anisotropic collective modes by numerically solving the GPP equations and using the variational method. The breathing mode demonstrates a reduction in period with increasing total mass due to the density dependence of the self-gravitating BEC, attributed to the density-dependent nature of self-gravitating BECs, aligning quantitatively with our analytical findings. Additionally, we investigate an anisotropic collective mode in which the quadrupole mode intertwines with the breathing mode. The period of the quadrupole mode exhibits similar total mass dependence to that of the breathing mode. The characteristics of these periods differ from those of a conventional BEC confined by an external potential. Despite the differences in density dependence, the ratio of their periods equals that of the BEC confined by an isotropic harmonic potential. Furthermore, an extension of the variational method to a spheroidal configuration enables the isolation of solely the quadrupole mode from the anisotropic collective mode.",
  "categories": [
    "cond-mat.quant-gas"
  ],
  "primary_category": "cond-mat.quant-gas",
  "doi": "10.1093/ptep/ptae078",
  "journal_ref": "Prog. Theor. Exp. Phys. 063J01(2024)",
  "arxiv_id": "2307.14018",
  "pdf_url": null,
  "comment": "28 pages, 10 figures",
  "num_versions": null,
  "size_before_bytes": 27249922,
  "size_after_bytes": 259102
}