{
  "title": "EmphasisChecker: A Tool for Guiding Chart and Caption Emphasis",
  "authors": [
    "Dae Hyun Kim",
    "Seulgi Choi",
    "Juho Kim",
    "Vidya Setlur",
    "Maneesh Agrawala"
  ],
  "submission_date": "2023-07-25T23:12:27+00:00",
  "revised_dates": [
    "2024-01-23T01:19:53+00:00"
  ],
  "abstract": "Recent work has shown that when both the chart and caption emphasize the same aspects of the data, readers tend to remember the doubly-emphasized features as takeaways; when there is a mismatch, readers rely on the chart to form takeaways and can miss information in the caption text. Through a survey of 280 chart-caption pairs in real-world sources (e.g., news media, poll reports, government reports, academic articles, and Tableau Public), we find that captions often do not emphasize the same information in practice, which could limit how effectively readers take away the authors' intended messages. Motivated by the survey findings, we present EmphasisChecker, an interactive tool that highlights visually prominent chart features as well as the features emphasized by the caption text along with any mismatches in the emphasis. The tool implements a time-series prominent feature detector based on the Ramer-Douglas-Peucker algorithm and a text reference extractor that identifies time references and data descriptions in the caption and matches them with chart data. This information enables authors to compare features emphasized by these two modalities, quickly see mismatches, and make necessary revisions. A user study confirms that our tool is both useful and easy to use when authoring charts and captions.",
  "categories": [
    "cs.HC"
  ],
  "primary_category": "cs.HC",
  "doi": "10.1109/TVCG.2023.3327150",
  "journal_ref": "IEEE Transactions on Visualization and Computer Graphics, vol. 30, no. 1, pp. 120-130, 2024",
  "arxiv_id": "2307.13858",
  "pdf_url": null,
  "comment": "IEEE VIS 2023",
  "num_versions": null,
  "size_before_bytes": 81290349,
  "size_after_bytes": 56767493
}