{
  "title": "Effects of Coronal Magnetic Field Configuration on Particle Acceleration and Release during the Ground Level Enhancement Events in Solar Cycle 24",
  "authors": [
    "Wenlong Liu",
    "Xiangliang Kong",
    "Fan Guo",
    "Lulu Zhao",
    "Shiwei Feng",
    "Feiyu Yu",
    "Zelong Jiang",
    "Yao Chen",
    "Joe Giacalone"
  ],
  "submission_date": "2023-07-23T00:37:58+00:00",
  "revised_dates": [],
  "abstract": "Ground level enhancements (GLEs) are extreme solar energetic particle (SEP) events that are of particular importance in space weather. In solar cycle 24, two GLEs were recorded on 2012 May 17 (GLE 71) and 2017 September 10 (GLE 72), respectively, by a range of advanced modern instruments. Here we conduct a comparative analysis of the two events by focusing on the effects of large-scale magnetic field configuration near active regions on particle acceleration and release. Although the active regions both located near the western limb, temporal variations of SEP intensities and energy spectra measured in-situ display different behaviors at early stages. By combining a potential field model, we find the CME in GLE 71 originated below the streamer belt, while in GLE 72 near the edge of the streamer belt. We reconstruct the CME shock fronts with an ellipsoid model based on nearly simultaneous coronagraph images from multi-viewpoints, and further derive the 3D shock geometry at the GLE onset. The highest-energy particles are primarily accelerated in the shock-streamer interaction regions, i.e., likely at the nose of the shock in GLE 71 and the eastern flank in GLE 72, due to quasi-perpendicular shock geometry and confinement of closed fields. Subsequently, they are released to the field lines connecting to near-Earth spacecraft when the shocks move through the streamer cusp region. This suggests that magnetic structures in the corona, especially shock-streamer interactions, may have played an important role in the acceleration and release of the highest-energy particles in the two events.",
  "categories": [
    "astro-ph.SR",
    "physics.space-ph"
  ],
  "primary_category": "astro-ph.SR",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12191",
  "pdf_url": null,
  "comment": "Accepted for publication in ApJ",
  "num_versions": null,
  "size_before_bytes": 5912343,
  "size_after_bytes": 422128
}