{
  "title": "Scaling transition of active turbulence from two to three dimensions",
  "authors": [
    "Da Wei",
    "Yaochen Yang",
    "Xuefeng Wei",
    "Ramin Golestanian",
    "Ming Li",
    "Fanlong Meng",
    "Yi Peng"
  ],
  "submission_date": "2023-07-28T01:24:49+00:00",
  "revised_dates": [],
  "abstract": "Turbulent flows are observed in low-Reynolds active fluids. They are intrinsically different from the classical inertial turbulence and behave distinctively in two- and three-dimensions. Understanding the behaviors of this new type of turbulence and their dependence on the system dimensionality is a fundamental challenge in non-equilibrium physics. We experimentally measure flow structures and energy spectra of bacterial turbulence between two large parallel plates spaced by different heights $H$. The turbulence exhibits three regimes as H increases, resulting from the competition of bacterial length, vortex size and H. This is marked by two critical heights ($H_0$ and $H_1$) and a $H^{0.5}$ scaling law of vortex size in the large-$H$ limit. Meanwhile, the spectra display distinct universal scaling laws in quasi-two-dimensional (2D) and three-dimensional (3D) regimes, independent of bacterial activity, length and $H$, whereas scaling exponents exhibit transitions in the crossover. To understand the scaling laws, we develop a hydrodynamic model using image systems to represent the effect of no-slip confining boundaries. This model predicts universal 1 and -4 scaling on large and small length scales, respectively, and -2 and -1 on intermediate length scales in 2D and 3D, respectively, which are consistent with the experimental results. Our study suggests a framework for investigating the effect of dimensionality on non-equilibrium self-organized systems.",
  "categories": [
    "cond-mat.soft",
    "physics.bio-ph",
    "physics.flu-dyn"
  ],
  "primary_category": "cond-mat.soft",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15720",
  "pdf_url": "https://arxiv.org/pdf/2307.15720v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 6378723,
  "size_after_bytes": 1490348
}