{
  "title": "Second-generation protoplanetary discs around evolved binaries: a high-resolution polarimetric view with SPHERE/IRDIS",
  "authors": [
    "Kateryna Andrych",
    "Devika Kamath",
    "Jacques Kluska",
    "Hans Van Winckel",
    "Steve Ertel",
    "Akke Corporaal"
  ],
  "submission_date": "2023-07-31T12:00:13+00:00",
  "revised_dates": [],
  "abstract": "Binary post-asymptotic giant branch (post-AGB) stars are products of a poorly understood binary interaction process that occurs during the AGB phase. These systems comprise of a post-AGB primary star, a main-sequence secondary companion and a stable circumbinary disc. Studying the structure and properties of these circumbinary discs is crucial for gaining insight into the binary interaction process that governs post-AGB binaries as well as comprehending the disc's creation, evolution, and its interaction with the post-AGB binary system. We aim to use near-infrared polarimetric imaging to investigate the morphology and potential substructures of circumbinary discs around eight representative post-AGB binary stars. To achieve this, we performed polarimetric differential imaging in H and Y bands using the high-angular resolution capabilities of the European Southern Observatory-Very Large Telescope/SPHERE-Infra-Red Dual-beam Imaging and Spectroscopy instrument. We resolved the extended circumbinary disc structure for a diverse sample of eight post-AGB binary systems. Our analysis provided the first estimates of the disc scale-height for two of the systems: IW Car and IRAS 15469-5311. We also investigated the morphological differences between the full discs (with the inner rim at the dust sublimation radius) and transition discs (which are expected to have larger inner cavities), as well as similarities to protoplanetary disks around young stellar objects. We found that the transition discs displayed a more intricate and asymmetric configuration. Surprisingly, no correlation was found between the over-resolved flux in near-IR interferometric data and the polarimetric observations, suggesting that scattering of light on the disc surface may not be the primary cause of the observed over-resolved flux component.",
  "categories": [
    "astro-ph.SR"
  ],
  "primary_category": "astro-ph.SR",
  "doi": "10.1093/mnras/stad1968",
  "journal_ref": "MNRAS, 524, 4168 (2023)",
  "arxiv_id": "2307.16598",
  "pdf_url": "https://arxiv.org/pdf/2307.16598v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 18519047,
  "size_after_bytes": 335189
}