{
  "title": "Gleam: An RDMA-accelerated Multicast Protocol for Datacenter Networks",
  "authors": [
    "Wenxue Li",
    "Junyi Zhang",
    "Gaoxiong Zeng",
    "Yufei Liu",
    "Zilong Wang",
    "Chaoliang Zeng",
    "Pengpeng Zhou",
    "Qiaoling Wang",
    "Kai Chen"
  ],
  "submission_date": "2023-07-26T09:54:47+00:00",
  "revised_dates": [
    "2023-08-01T00:08:04+00:00"
  ],
  "abstract": "RDMA has been widely adopted for high-speed datacenter networks. However, native RDMA merely supports one-to-one reliable connection, which mismatches various applications with group communication patterns (e.g., one-to-many). While there are some multicast enhancements to address it, they all fail to simultaneously achieve optimal multicast forwarding and fully unleash the distinguished RDMA capabilities.\n  In this paper, we present Gleam, an RDMA-accelerated multicast protocol that simultaneously supports optimal multicast forwarding, efficient utilization of the prominent RDMA capabilities, and compatibility with the commodity RNICs. At its core, Gleam re-purposes the existing RDMA RC logic with careful switch coordination as an efficient multicast transport. Gleam performs the one-to-many connection maintenance and many-to-one feedback aggregation, based on an extended multicast forwarding table structure, to achieve integration between standard RC logic and in-fabric multicast. We implement a fully functional Gleam prototype. With extensive testbed experiments and simulations, we demonstrate Gleam's significant improvement in accelerating multicast communication of realistic applications. For instance, Gleam achieves 2.9X lower communication time of an HPC benchmark application and 2.7X higher data replication throughput.",
  "categories": [
    "cs.NI"
  ],
  "primary_category": "cs.NI",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14074",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1908682,
  "size_after_bytes": 313843
}