{
  "title": "FedDRL: A Trustworthy Federated Learning Model Fusion Method Based on Staged Reinforcement Learning",
  "authors": [
    "Leiming Chen",
    "Weishan Zhang",
    "Cihao Dong",
    "Sibo Qiao",
    "Ziling Huang",
    "Yuming Nie",
    "Zhaoxiang Hou",
    "Chee Wei Tan"
  ],
  "submission_date": "2023-07-25T17:24:32+00:00",
  "revised_dates": [
    "2024-01-17T02:58:29+00:00",
    "2024-01-23T01:33:01+00:00",
    "2024-03-20T00:54:04+00:00"
  ],
  "abstract": "Traditional federated learning uses the number of samples to calculate the weights of each client model and uses this fixed weight value to fusion the global model. However, in practical scenarios, each client's device and data heterogeneity leads to differences in the quality of each client's model. Thus the contribution to the global model is not wholly determined by the sample size. In addition, if clients intentionally upload low-quality or malicious models, using these models for aggregation will lead to a severe decrease in global model accuracy. Traditional federated learning algorithms do not address these issues. To solve this probelm, we propose FedDRL, a model fusion approach using reinforcement learning based on a two staged approach. In the first stage, Our method could filter out malicious models and selects trusted client models to participate in the model fusion. In the second stage, the FedDRL algorithm adaptively adjusts the weights of the trusted client models and aggregates the optimal global model. We also define five model fusion scenarios and compare our method with two baseline algorithms in those scenarios. The experimental results show that our algorithm has higher reliability than other algorithms while maintaining accuracy.",
  "categories": [
    "cs.LG",
    "cs.AI"
  ],
  "primary_category": "cs.LG",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13716",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 180612274,
  "size_after_bytes": 379207
}