{
  "title": "How Magnetic Erosion Affects the Drag-Based Kinematics of Fast Coronal Mass Ejections",
  "authors": [
    "Sotiris Stamkos",
    "Spiros Patsourakos",
    "Angelos Vourlidas",
    "Ioannis A. Daglis"
  ],
  "submission_date": "2023-07-23T16:45:51+00:00",
  "revised_dates": [],
  "abstract": "In order to advance our understanding of the dynamic interactions between coronal mass ejections (CMEs) and the magnetized solar wind, we investigate the impact of magnetic erosion on the well-known aerodynamic drag force acting on CMEs traveling faster than the ambient solar wind. In particular, we start by generating empirical relationships for the basic physical parameters of CMEs that conserve their mass and magnetic flux. Furthermore, we examine the impact of the virtual mass on the equation of motion by studying a variable-mass system. We next implement magnetic reconnection into CME propagation, which erodes part of the CME magnetic flux and outer-shell mass, on the drag acting on CMEs, and we determine its impact on their time and speed of arrival at 1 AU. Depending on the strength of the magnetic erosion, the leading edge of the magnetic structure can reach near-Earth space up to $\\approx$ three hours later, compared to the non-eroded case. Therefore, magnetic erosion may have a significant impact on the propagation of fast CMEs and on predictions of their arrivals at 1 AU. Finally, the modeling indicates that eroded CMEs may experience a significant mass decrease. Since such a decrease is not observed in the corona, the initiation distance of erosion may lie beyond the field-of-view of coronagraphs (i.e. 30 $\\mathrm{R_{\\odot}}$).",
  "categories": [
    "astro-ph.SR",
    "physics.space-ph"
  ],
  "primary_category": "astro-ph.SR",
  "doi": "10.1007/s11207-023-02178-7",
  "journal_ref": "Solar Physics 298, 88 (2023)",
  "arxiv_id": "2307.12370",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 2467366,
  "size_after_bytes": 310369
}