{
  "title": "The NANOGrav 12.5-Year Data Set: Dispersion Measure Mis-Estimation with Varying Bandwidths",
  "authors": [
    "Sofia Valentina Sosa Fiscella",
    "Michael T. Lam",
    "Zaven Arzoumanian",
    "Harsha Blumer",
    "Paul R. Brook",
    "H. Thankful Cromartie",
    "Megan E. DeCesar",
    "Paul B. Demorest",
    "Timothy Dolch",
    "Justin A. Ellis",
    "Robert D. Ferdman",
    "Elizabeth C. Ferrara",
    "Emmanuel Fonseca",
    "Nate Garver-Daniels",
    "Peter A. Gentile",
    "Deborah C. Good",
    "Megan L. Jones",
    "Duncan R. Lorimer",
    "Jing Luo",
    "Ryan S. Lynch",
    "Maura A. McLaughlin",
    "Cherry Ng",
    "David J. Nice",
    "Timothy T. Pennucci",
    "Nihan S. Pol",
    "Scott M. Ransom",
    "Renee Spiewak",
    "Ingrid H. Stairs",
    "Kevin Stovall",
    "Joseph K. Swiggum",
    "Sarah J. Vigeland"
  ],
  "submission_date": "2023-07-25T04:33:32+00:00",
  "revised_dates": [
    "2023-08-01T00:24:34+00:00"
  ],
  "abstract": "Noise characterization for pulsar-timing applications accounts for interstellar dispersion by assuming a known frequency-dependence of the delay it introduces in the times of arrival (TOAs). However, calculations of this delay suffer from mis-estimations due to other chromatic effects in the observations. The precision in modeling dispersion is dependent on the observed bandwidth. In this work, we calculate the offsets in infinite-frequency TOAs due to mis-estimations in the modeling of dispersion when using varying bandwidths at the Green Bank Telescope. We use a set of broadband observations of PSR J1643-1224, a pulsar with an excess of chromatic noise in its timing residuals. We artificially restricted these observations to a narrowband frequency range, then used both data sets to calculate residuals with a timing model that does not include short-scale dispersion variations. By fitting the resulting residuals to a dispersion model, and comparing the ensuing fitted parameters, we quantify the dispersion mis-estimations. Moreover, by calculating the autocovariance function of the parameters we obtained a characteristic timescale over which the dispersion mis-estimations are correlated. For PSR J1643-1224, which has one of the highest dispersion measures (DM) in the NANOGrav pulsar timing array, we find that the infinite-frequency TOAs suffer from a systematic offset of ~22 microseconds due to DM mis-estimations, with correlations over ~1 month. For lower-DM pulsars, the offset is ~7 microseconds. This error quantification can be used to provide more robust noise modeling in NANOGrav's data, thereby increasing sensitivity and improving parameter estimation in gravitational wave searches.",
  "categories": [
    "astro-ph.HE",
    "astro-ph.GA",
    "astro-ph.IM"
  ],
  "primary_category": "astro-ph.HE",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13248",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 8853048,
  "size_after_bytes": 985876
}