{
  "title": "Ni-O-Ag catalyst enables 103-m$^2$ artificial photosynthesis with >16% solar-to-chemical energy conversion efficiency",
  "authors": [
    "Yaguang Li",
    "Fanqi Meng",
    "Qixuan Wu",
    "Dachao Yuan",
    "Haixiao Wang",
    "Bang Liu",
    "Junwei Wang",
    "Xingyuan San",
    "Lin Gu",
    "Shufang Wang",
    "Qingbo Meng"
  ],
  "submission_date": "2023-07-24T13:31:50+00:00",
  "revised_dates": [],
  "abstract": "Herein, NiO nanosheets supported with Ag single atoms are synthesized for photothermal CO2 hydrogenation to achieve 1065 mmol g$^{-1}$ h$^{-1}$ of CO production rate under 1 sun irradiation, revealing the unparalleled weak sunlight driven reverse water-gas shift reaction (RWGS) activity. This performance is attributed to the coupling effect of Ag-O-Ni sites to enhance the hydrogenation of CO$_2$ and weaken the CO adsorption, resulting in 1434 mmol g$^{-1}$ h$^{-1}$ of CO yield at 300$^\\circ$ C, surpassing any low-temperature RWGS performances ever reported. Building on this, we integrated the 2D Ni$_1$Ag$_{0.02}$O$_1$ supported photothermal RWGS with commercial photovoltaic electrolytic water splitting, leading to the realization of 103 m$^2$ scale artificial photosynthesis system (CO$_2$+H$_2$$\\to$CO+H$_2$O) with a daily CO yield of 18.70 m$^3$, a photochemical energy conversion efficiency of >16%, over 90% H$_2$ ultilization efficiency, outperforming other types of artificial photosynthesis. The results of this research chart a promising course for designing practical, natural sunlight-driven artificial photosynthesis systems and highly efficient platinum-free CO$_2$ hydrogenation catalysts. This work is a significant step towards harnessing solar energy more efficiently and sustainably, opening exciting possibilities for future research and development in this area.",
  "categories": [
    "cond-mat.mtrl-sci",
    "physics.chem-ph"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12783",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}