{
  "title": "A Discontinuous Galerkin Finite Element Model for Compound Flood Simulations",
  "authors": [
    "Chayanon Wichitrnithed",
    "Eirik Valseth",
    "Ethan J. Kubatko",
    "Younghun Kang",
    "Mackenzie Hudson",
    "Clint Dawson"
  ],
  "submission_date": "2023-07-26T17:05:18+00:00",
  "revised_dates": [
    "2023-11-07T01:06:34+00:00",
    "2024-05-27T00:37:12+00:00"
  ],
  "abstract": "Recent tropical cyclones, e.g., Hurricane Harvey (2017), have lead to significant rainfall and resulting runoff with accompanying flooding. When the runoff interacts with storm surge, the resulting floods can be greatly amplified and lead to effects that cannot be modeled by simple superposition of its distinctive sources. In an effort to develop accurate numerical simulations of runoff, surge, and compounding floods, we develop a local discontinuous Galerkin method for modified shallow water equations. In this modification, nonzero sources to the continuity equation are included to incorporate rainfall into the model using parametric rainfall models from literature as well as hindcast data. The discontinuous Galerkin spatial discretization is accompanied with a strong stability preserving explicit Runge Kutta time integrator. Hence, temporal stability is ensured through the CFL condition and we exploit the embarrassingly parallel nature of the developed method using MPI parallelization. We demonstrate the capabilities of the developed method though a sequence of physically relevant numerical tests, including small scale test cases based on laboratory measurements and large scale experiments with Hurricane Harvey in the Gulf of Mexico. The results highlight the conservation properties and robustness of the developed method and show the potential of compound flood modeling using our approach.",
  "categories": [
    "cs.CE",
    "physics.comp-ph"
  ],
  "primary_category": "cs.CE",
  "doi": "10.1016/j.cma.2023.116707",
  "journal_ref": null,
  "arxiv_id": "2307.14302",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 59442773,
  "size_after_bytes": 658090
}