{
  "title": "Unraveling Quantum Coherences Mediating Primary Charge Transfer Processes in Photosystem II Reaction Center",
  "authors": [
    "Ajay Jha",
    "Pan-Pan Zhang",
    "Vandana Tiwari",
    "Lipeng Chen",
    "Michael Thorwart",
    "R. J. Dwayne Miller",
    "Hong-Guang Duan"
  ],
  "submission_date": "2023-07-24T13:56:23+00:00",
  "revised_dates": [],
  "abstract": "Photosystem II (PSII) reaction center is a unique protein-chromophore complex that is capable of efficiently separating electronic charges across the membrane after photoexcitation. In the PSII reaction center, the primary energy- and charge-transfer (CT) processes occur on comparable ultrafast timescales, which makes it extremely challenging to understand the fundamental mechanism responsible for the near-unity quantum efficiency of the transfer. Here, we elucidate the role of quantum coherences in the ultrafast energy and CT in the PSII reaction center by performing two-dimensional (2D) electronic spectroscopy at the cryogenic temperature of 20 K, which captures the distinct underlying quantum coherences. Specifically, we uncover the electronic and vibrational coherences along with their lifetimes during the primary ultrafast processes of energy and CT. We also examine the functional role of the observed quantum coherences. To gather further insight, we construct a structure-based excitonic model that provided evidence for coherent energy and CT at low temperature in the 2D electronic spectra. The principles, uncovered by this combination of experimental and theoretical analyses, could provide valuable guidelines for creating artificial photosystems with exploitation of system-bath coupling and control of coherences to optimize the photon conversion efficiency to specific functions.",
  "categories": [
    "physics.chem-ph",
    "cond-mat.other",
    "quant-ph"
  ],
  "primary_category": "physics.chem-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12805",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 4079882,
  "size_after_bytes": 900543
}