{
  "title": "Fluctuations in the active Dyson Brownian motion and the overdamped Calogero-Moser model",
  "authors": [
    "Leo Touzo",
    "Pierre Le Doussal",
    "Gregory Schehr"
  ],
  "submission_date": "2023-07-26T17:16:52+00:00",
  "revised_dates": [
    "2024-11-08T01:26:20+00:00"
  ],
  "abstract": "Recently, we introduced the active Dyson Brownian motion model (DBM), in which $N$ run-and-tumble particles interact via a logarithmic repulsive potential in the presence of a harmonic well. We found that in a broad range of parameters the density of particles converges at large $N$ to the Wigner semi-circle law, as in the passive case. In this paper, we provide an analytical support for this numerical observation, by studying the fluctuations of the positions of the particles in the nonequilibrium stationary state of the active DBM, in the regime of weak noise and large persistence time. In this limit, we obtain an analytical expression for the covariance between the particle positions for any $N$ from the exact inversion of the Hessian matrix of the system. We show that, when the number of particles is large $N \\gg 1$, the covariance matrix takes scaling forms that we compute explicitly both in the bulk and at the edge of the support of the semi-circle. In the bulk, the covariance scales as $N^{-1}$, while at the edge, it scales as $N^{-2/3}$. Remarkably, we find that these results can be transposed directly to an equilibrium model, the overdamped Calogero-Moser model in the low temperature limit, providing an analytical confirmation of the numerical results by Agarwal, Kulkarni and Dhar. For this model, our method also allows us to obtain the equilibrium two-time correlations and their dynamical scaling forms both in the bulk and at the edge. Our predictions at the edge are reminiscent of a recent result in the mathematics literature by Gorin and Kleptsyn on the (passive) DBM. That result can be recovered by the present methods, and also, as we show, using the stochastic Airy operator. Finally, our analytical predictions are confirmed by precise numerical simulations, in a wide range of parameters.",
  "categories": [
    "cond-mat.stat-mech",
    "cond-mat.soft",
    "math-ph"
  ],
  "primary_category": "cond-mat.stat-mech",
  "doi": "10.1103/PhysRevE.109.014136",
  "journal_ref": "Phys. Rev. E 109, 014136 (2024)",
  "arxiv_id": "2307.14306",
  "pdf_url": null,
  "comment": "36 pages, 13 figures. New results added (e.g. anomalous diffusion and linear statistics) not included in published version. Accepted for publication in Phys. Rev. E",
  "num_versions": null,
  "size_before_bytes": 2035427,
  "size_after_bytes": 407763
}