{
  "title": "Multidimensional Simulations of Core Convection",
  "authors": [
    "Daniel Lecoanet",
    "Philipp V. F. Edelmann"
  ],
  "submission_date": "2023-07-28T18:00:00+00:00",
  "revised_dates": [],
  "abstract": "The cores of main sequence intermediate- and high-mass stars are convective. Mixing at the radiative-convective boundary, waves excited by the convection, and magnetic fields generated by convective dynamos all influence the main sequence and post-main sequence evolution of these stars. These effects must be understood to accurately model the structure and evolution of intermediate- and high-mass stars. Unfortunately, there are many challenges in simulating core convection due to the wide range of temporal and spatial scales, as well as many important physics effects. In this review, we describe the latest numerical strategies to address these challenges. We then describe the latest state-of-the-art simulations of core convection, summarizing their main findings. These simulations have led to important insights into many of the processes associated with core convection. Two outstanding problems with multidimensional simulations are, 1. it is not always straightforward to extrapolate from simulation parameters to the parameters of real stars; and 2. simulations using different methods sometimes appear to arrive at contradictory results. To address these issues, next generation simulations of core convection must address how their results depend on stellar luminosity, dimensionality, and turbulence intensity. Furthermore, code comparison projects will be essential to establish robust parameterizations that will become the new standard in stellar modeling.",
  "categories": [
    "astro-ph.SR"
  ],
  "primary_category": "astro-ph.SR",
  "doi": "10.3390/galaxies11040089",
  "journal_ref": null,
  "arxiv_id": "2307.15730",
  "pdf_url": "https://arxiv.org/pdf/2307.15730v1",
  "comment": "invited review in the Galaxies special issue, \"The Structure and Evolution of Stars\"",
  "num_versions": null,
  "size_before_bytes": 5133835,
  "size_after_bytes": 473327
}