{
  "title": "Generation and Life Cycle of Solar Spicules",
  "authors": [
    "Hamid Saleem",
    "Zain H. Saleem"
  ],
  "submission_date": "2023-07-26T17:46:56+00:00",
  "revised_dates": [
    "2023-08-01T00:42:50+00:00",
    "2024-04-02T00:59:17+00:00"
  ],
  "abstract": "Physical mechanism for the creation of solar spicules is proposed with three stages of their life cycle. It is assumed that at stage-I, the density hump is formed locally in the xy-plane in lower chromosphere in the presence of temperature gradients of electrons and ions along z-axis (the vertical direction). In this region, the density structure of quasi-neutral $(n_i\\simeq n_e=n)$ plasma after taking birth is accelerated in the vertical direction due to the thermal force ${\\bf F}_{th} \\propto \\nabla n(x,y,t) \\times (\\nabla T_e + \\nabla T_i)$. The exact time-dependent analytical solution of two fluid plasma equations is presented assuming that density is maximum at the center and decays away from it gradually. The two dimensional (2D) density structure is created as a step function $H(t)$ in time at bottom of the chromosphere and consequently the vertical plasma velocity turns out to be the ramp function of time $R(t)=t H(t)$ whereas the source term $S(x,y,t)$ for the density follows the delta function $δ(t)$ form. The upward acceleration ${\\bf a}=a(x,y)\\hat{z}$ produced in this density structure is greater than the downward constant solar acceleration $-{\\bf g}_\\odot$ in the chromosphere. In the transition region (TR), the temperature gradients are steeper; therefore, the upward acceleration increases in magnitude $g_\\odot << a$ and the density hump spends lesser time there. This is stage-II of its life cycle. In stage-III, the density structure enters into corona where the gradients of temperatures vanish and the structure decelerates to zero velocity under the action of the solar gravitational force.",
  "categories": [
    "astro-ph.SR",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.SR",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14328",
  "pdf_url": null,
  "comment": "15 pages, 4 figs, 1 Table. Accepted in The Astrophysics Journal",
  "num_versions": null,
  "size_before_bytes": 3688312,
  "size_after_bytes": 757681
}