{
  "title": "Topological transition from nodal to nodeless Zeeman splitting in altermagnets",
  "authors": [
    "Rafael M. Fernandes",
    "Vanuildo S. de Carvalho",
    "Turan Birol",
    "Rodrigo G. Pereira"
  ],
  "submission_date": "2023-07-23T17:13:37+00:00",
  "revised_dates": [
    "2023-08-22T00:51:55+00:00",
    "2023-10-09T00:05:17+00:00",
    "2024-01-04T01:27:14+00:00"
  ],
  "abstract": "In an altermagnet, the symmetry that relates configurations with flipped magnetic moments is a rotation. This makes it qualitatively different from a ferromagnet, where no such symmetry exists, or a collinear antiferromagnet, where this symmetry is a lattice translation. In this paper, we investigate the impact of the crystalline environment, enabled by the spin-orbit coupling, on the magnetic and electronic properties of an altermagnet. We find that, because each component of the magnetization acquires its own angular dependence, the Zeeman splitting of the bands has symmetry-protected nodal lines residing on mirror planes of the crystal. Upon crossing the Fermi surface, these nodal lines give rise to pinch points that behave as single or double type-II Weyl nodes. We show that an external magnetic field perpendicular to these mirror planes can only move the nodal lines, such that a critical field value is necessary to collapse the nodes and make the Weyl pinch points annihilate. This unveils the topological nature of the transition from a nodal to a nodeless Zeeman splitting of the bands. We also classify the altermagnetic states of common crystallographic point groups in the presence of spin-orbit coupling, revealing that a broad family of magnetic orthorhombic perovskites can realize altermagnetism.",
  "categories": [
    "cond-mat.mes-hall",
    "cond-mat.mtrl-sci",
    "cond-mat.str-el"
  ],
  "primary_category": "cond-mat.mes-hall",
  "doi": "10.1103/PhysRevB.109.024404",
  "journal_ref": "Phys. Rev. B 109, 024404 (2024)",
  "arxiv_id": "2307.12380",
  "pdf_url": null,
  "comment": "revised manuscript accepted for publication as an Editors' Suggestion in PRB",
  "num_versions": null,
  "size_before_bytes": 38884943,
  "size_after_bytes": 629285
}