{
  "title": "Constraining white dwarf mass and magnetic field strength of a new intermediate polar through X-ray observations",
  "authors": [
    "Benjamin Vermette",
    "Ciro Salcedo",
    "Kaya Mori",
    "Julian Gerber",
    "Kyung Duk Yoon",
    "Gabriel Bridges",
    "Charles J. Hailey",
    "Frank Haberl",
    "Jaesub Hong",
    "Jonathan Grindlay",
    "Gabriele Ponti",
    "Gavin Ramsay"
  ],
  "submission_date": "2023-07-21T21:18:37+00:00",
  "revised_dates": [
    "2023-07-26T00:25:46+00:00"
  ],
  "abstract": "We report a broad-band analysis of a Galactic X-ray source, CXOGBS J174517.0-321356 (J1745), with a 614-second periodicity. Chandra discovered the source in the direction of the Galactic Bulge. Gong (2022) proposed J1745 was either an intermediate polar (IP) with a mass of ~1 $M_{\\odot}$, or an ultra-compact X-ray binary (UCXB). By jointly fitting XMM-Newton and NuSTAR spectra, we rule out a UCXB origin. We have developed a physically realistic model that considers finite magnetosphere radius, X-ray absorption from the pre-shock region, and reflection from the WD surface to determine the IP properties, especially its WD mass. To assess systematic errors on WD mass measurement, we consider a broad range of specific accretion rates ($\\dot{m}$ = 0.6 - 44 g\\cm$^2$\\s) based on the uncertain source distance (d = 3-8 kpc) and fractional accretion area (f = 0.001-0.025). Our model properly implements the fitted accretion column height in the X-ray reflection model and accounts for the underestimated mass accretion rate due to the (unobserved) soft X-ray blackbody and cyclotron cooling emissions. We found that the lowest accretion rate of $\\dot{m}$ = 0.6 g\\cm$^2$\\s, which corresponds to the nearest source distance and maximum f value, yield the WD mass of $(0.92\\pm0.08) M_{\\odot}$. However, if the accretion rate is $\\dot{m}$ > ~3 g\\cm$^2$\\s, the WD mass is robustly measured to be $(0.81\\pm0.06) M_{\\odot}$, nearly independent of $\\dot{m}$. The derived WD mass range is consistent with the mean WD mass of nearby IPs. Assuming spin equilibrium between the WD and accretion disk, we constrained the WD magnetic field to B > ~7 MG, indicating that it could be a highly magnetized IP. Our analysis presents the most comprehensive methodology for constraining the WD mass and B-field of an IP by consolidating the effects of cyclotron cooling, finite magnetospheric radius, and accretion column height.",
  "categories": [
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.HE",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11910",
  "pdf_url": null,
  "comment": "19 pages, 6 figures, Accepted to ApJ",
  "num_versions": null,
  "size_before_bytes": 22881508,
  "size_after_bytes": 1343352
}