{
  "title": "Revisiting the mass of open clusters with \\emph{Gaia} data",
  "authors": [
    "Anderson Almeida",
    "Hektor Monteiro",
    "Wilton S. Dias"
  ],
  "submission_date": "2023-07-27T20:24:43+00:00",
  "revised_dates": [],
  "abstract": "The publication of the \\emph{Gaia} catalogue and improvements in methods to determine memberships and fundamental parameters of open clusters has led to major advances in recent years. However, important parameters such as the masses of these objects, although being studied mostly in some isolated cases, have not been addressed in large homogeneous samples based on \\emph{Gaia} data, taking into account details such as binary fractions. Consequently, relevant aspects such as the existence of mass segregation were not adequately studied. Within this context, in this work, we introduce a new method to determine individual stellar masses, including an estimation for the ones in binary systems. This method allows us to study the mass of open clusters, as well as the mass functions of the binary star populations. We validate the method and its efficiency and characterize uncertainties using a grid of synthetic clusters with predetermined parameters. We highlight the application of the method to the Pleiades cluster, showing that the results obtained agree with the current consensus in the literature as well as recent \\emph{Gaia} data. We then applied the procedure to a sample of 773 open clusters with fundamental parameters determined using \\emph{Gaia Early Data Release 3 (eDR3)} data, obtaining their masses. Subsequently, we investigated the relation between the masses and other fundamental parameters of the clusters. Among the results, we found no significant evidence that clusters in our sample lose and segregate mass with age.",
  "categories": [
    "astro-ph.GA",
    "astro-ph.SR"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.1093/mnras/stad2291",
  "journal_ref": null,
  "arxiv_id": "2307.15182",
  "pdf_url": "https://arxiv.org/pdf/2307.15182v1",
  "comment": "26 pages, 17 figures, accepted for publication in Monthly Notices of the Royal Astronomical Society",
  "num_versions": null,
  "size_before_bytes": 4116364,
  "size_after_bytes": 463262
}