{
  "title": "Magnetic fields & rotation periods of M dwarfs from SPIRou spectra",
  "authors": [
    "J. -F. Donati",
    "L. T. Lehmann",
    "P. I. Cristofari",
    "P. Fouqué",
    "C. Moutou",
    "P. Charpentier",
    "M. Ould-Elhkim",
    "A. Carmona",
    "X. Delfosse",
    "E. Artigau",
    "S. H. P. Alencar",
    "C. Cadieux",
    "L. Arnold",
    "P. Petit",
    "J. Morin",
    "T. Forveille",
    "R. Cloutier",
    "R. Doyon",
    "G. Hébrard",
    "the SLS collaboration"
  ],
  "submission_date": "2023-07-26T13:44:23+00:00",
  "revised_dates": [],
  "abstract": "We present near-infrared spectropolarimetric observations of a sample of 43 weakly- to moderately-active M dwarfs, carried with SPIRou at the Canada-France-Hawaii Telescope in the framework of the SPIRou Legacy Survey from early 2019 to mid 2022. We use the 6700 circularly polarised spectra collected for this sample to investigate the longitudinal magnetic field and its temporal variations for all sample stars, from which we diagnose, through quasi-periodic Gaussian process regression, the periodic modulation and longer-term fluctuations of the longitudinal field. We detect the large-scale field for 40 of our 43 sample stars, and infer a reliable or tentative rotation period for 38 of them, using a Bayesian framework to diagnose the confidence level at which each rotation period is detected. We find rotation periods ranging from 14 to over 60d for the early-M dwarfs, and from 70 to 200d for most mid- and late-M dwarfs (potentially up to 430d for one of them). We also find that the strength of the detected large-scale fields does not decrease with increasing period or Rossby number for the slowly rotating dwarfs of our sample as it does for higher-mass, more active stars, suggesting that these magnetic fields may be generated through a different dynamo regime than those of more rapidly rotating stars. We also show that the large-scale fields of most sample stars evolve on long timescales, with some of them globally switching sign as stars progress on their putative magnetic cycles.",
  "categories": [
    "astro-ph.SR"
  ],
  "primary_category": "astro-ph.SR",
  "doi": "10.1093/mnras/stad2301",
  "journal_ref": null,
  "arxiv_id": "2307.14190",
  "pdf_url": null,
  "comment": "MNRAS, in press (25 pages, 15 figures, 3 tables)",
  "num_versions": null,
  "size_before_bytes": 6132190,
  "size_after_bytes": 6126453
}