{
  "title": "Generalizable data-driven turbulence closure modeling on unstructured grids with differentiable physics",
  "authors": [
    "Hojin Kim",
    "Varun Shankar",
    "Venkatasubramanian Viswanathan",
    "Romit Maulik"
  ],
  "submission_date": "2023-07-25T14:27:49+00:00",
  "revised_dates": [
    "2024-11-26T01:06:30+00:00",
    "2025-11-12T01:07:25+00:00"
  ],
  "abstract": "Differentiable physical simulators are proving to be valuable tools for developing data-driven models for computational fluid dynamics (CFD). In particular, these simulators enable end-to-end training of machine learning (ML) models embedded within CFD solvers. This paradigm enables novel algorithms which combine the generalization power and low cost of physics-based simulations with the flexibility and automation of deep learning methods. In this study, we introduce a framework for embedding deep learning models within a finite element solver for incompressible Navier-Stokes equations, specifically applying this approach to learn a subgrid-scale (SGS) closure with a graph neural network (GNN). We first demonstrate the feasibility of the approach on flow over a two-dimensional backward-facing step, using it as a proof of concept to show that solver-consistent training produces stable and physically meaningful closures. Then, we extend this to a turbulent flow over a three-dimensional backward-facing step. In this setting, the GNN-based closure not only attains low prediction errors, but also recovers key turbulence statistics and preserves multiscale turbulent structures. We further demonstrate that the closure can be identified in data-limited learning scenarios as well. Overall, the proposed end-to-end learning paradigm offers a viable pathway toward physically consistent and generalizable data-driven SGS modeling on complex and unstructured domains.",
  "categories": [
    "physics.flu-dyn",
    "cs.LG"
  ],
  "primary_category": "physics.flu-dyn",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13533",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 106386251,
  "size_after_bytes": 590529
}