{
  "title": "On-sky speckle nulling through a single-mode fiber with the Keck Planet Imager and Characterizer",
  "authors": [
    "Yinzi Xin",
    "Jerry W. Xuan",
    "Dimitri Mawet",
    "Jason Wang",
    "Garreth Ruane",
    "Daniel Echeverri",
    "Nemanja Jovanovic",
    "Clarissa Do Ó",
    "Michael Fitzgerald",
    "Katelyn Horstman",
    "Chih-Chun Hsu",
    "Joshua Liberman",
    "Ronald A. López",
    "Caprice L. Phillips",
    "Bin B. Ren",
    "Jean-Baptiste Ruffio",
    "Ben Sappey"
  ],
  "submission_date": "2023-07-21T20:31:08+00:00",
  "revised_dates": [
    "2025-04-03T00:05:52+00:00"
  ],
  "abstract": "The Keck Planet Imager and Characterizer (KPIC) is an instrument at the Keck II telescope that enables high-resolution spectroscopy of directly imaged exoplanets and substellar companions. KPIC uses single-mode fibers to couple the adaptive optics system to Keck's near-infrared spectrometer (NIRSPEC). However, KPIC's sensitivity at small separations is limited by the leakage of stellar light into the fiber. Speckle nulling uses a deformable mirror to destructively interfere starlight with itself, a technique typically used to reduce stellar signal on a focal-plane imaging detector. We present the first on-sky demonstration of speckle nulling through an optical fiber with KPIC, using NIRSPEC to collect exposures that measure speckle phase for quasi-real-time wavefront control while also serving as science data. We repeat iterations of measurement and correction, each using at least 5 exposures. We show a decrease in the on-sky leaked starlight by a factor of 2.6 to 2.8 in the targeted spectral order, at a spatial separation of 2.0 λ/D in K-band. This corresponds to an estimated factor of 2.6 to 2.8 decrease in the required exposure time to reach a given SNR, relative to conventional KPIC observations. The performance of speckle nulling is limited by instability in the speckle phase: when the loop is opened, the null-depth degrades by a factor of 2 on the timescale of a single phase measurement, which would limit the suppression that can be achieved. Future work includes exploring gradient-descent methods, which may be faster and thereby able to achieve deeper nulls. In the meantime, the speckle nulling algorithm demonstrated in this work can be used to decrease stellar leakage and improve the signal-to-noise of science observations.",
  "categories": [
    "astro-ph.IM"
  ],
  "primary_category": "astro-ph.IM",
  "doi": "10.1117/1.JATIS.9.3.035001",
  "journal_ref": "Journal of Astronomical Telescopes, Instruments, and Systems, Vol. 9, Issue 3, 035001 (August 2023)",
  "arxiv_id": "2307.11893",
  "pdf_url": null,
  "comment": "18 pages, 4 figures",
  "num_versions": null,
  "size_before_bytes": 6871030,
  "size_after_bytes": 182626
}