{
  "title": "The multiplicity of massive stars in the Scorpius OB1 association through high-contrast imaging",
  "authors": [
    "Tinne Pauwels",
    "Maddalena Reggiani",
    "Hugues Sana",
    "Alan Rainot",
    "Kaitlin Kratter"
  ],
  "submission_date": "2023-07-25T13:50:25+00:00",
  "revised_dates": [],
  "abstract": "One of the most remarkable properties of massive stars is that almost all of them are found in binaries or higher-order multiple systems. Observations that cover the full companion mass ratio and separation regime are essential to constrain massive star and binary formation theories. We used VLT/SPHERE to characterise the multiplicity properties of 20 OB stars in the active star-forming region Sco OB1. We simultaneously observed with the IFS and IRDIS instruments, obtaining high-contrast imaging observations that cover a field of view of 1\".73 x 1\".73 in YJH bands and 11\" x 12\".5 in $K_1$ and $K_2$ bands, respectively, corresponding to a separation range between $\\sim$200 and 9000 AU. The observations reach contrast magnitudes down to $ΔK_1 \\sim 13$, allowing us to detect companions at the stellar-substellar boundary. In total, we detect 789 sources, most of which are likely background or foreground objects. We obtain SPHERE companion fractions of $2.3 \\pm 0.4$ and $4.2 \\pm 0.8$ for O- and B-type stars, respectively. Including all previously detected companions, we find a total multiplicity fraction of $0.89\\pm0.07$ for our sample in the range of $\\sim$0-12000 AU. In conclusion, SPHERE explores an as of yet uncharted territory of companions around massive stars, which is crucial to ultimately improve our understanding of massive star and binary formation.",
  "categories": [
    "astro-ph.SR",
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.SR",
  "doi": "10.1051/0004-6361/202245324",
  "journal_ref": "A&A 678, A172 (2023)",
  "arxiv_id": "2307.13500",
  "pdf_url": null,
  "comment": "19 pages, 10 figures, accepted for publication in A&A",
  "num_versions": null,
  "size_before_bytes": 44084029,
  "size_after_bytes": 382596
}