{
  "title": "Lagrangian statistics of dense emulsions",
  "authors": [
    "Ivan Girotto",
    "Andrea Scagliarini",
    "Roberto Benzi",
    "Federico Toschi"
  ],
  "submission_date": "2023-07-26T13:22:25+00:00",
  "revised_dates": [],
  "abstract": "The dynamics of dense stabilized emulsions presents a rich phenomenology including chaotic emulsification, non-Newtonian rheology and ageing dynamics at rest. Macroscopic rheology results from the complex droplet microdynamics and, in turn, droplet dynamics is influenced by macroscopic flows via the competing action of hydrodynamic and interfacial stresses, giving rise to a complex tangle of elastoplastic effects, diffusion, breakups and coalescence events. This tight multiscale coupling, together with the daunting challenge of experimentally investigating droplets under flow, hindered the understanding of dense emulsions dynamics. We present results from 3D numerical simulations of dense stabilised emulsions, resolving the shape and dynamics of individual droplets, along with the macroscopic flows. We investigate droplet dispersion statistics, measuring probability density functions (PDF) of droplet displacements and velocities, changing the concentration, in the stirred and ageing regimes. We provide the first measurements ever, in concentrated emulsions, of the relative droplet-droplet separations PDF and of the droplet acceleration PDF, which becomes strongly non-Gaussian as the volume fraction is increased above the jamming point. Cooperative effects, arising when droplets are in contact, are argued to be responsible of the anomalous superdiffusive behaviour of the mean square displacement and of the pair separation at long times, in both the stirred and in the ageing regimes. This superdiffusive behaviour is reflected in a non-Gaussian pair separation PDF, whose analytical form is investigated, in the ageing regime, by means of theoretical arguments. This work paves the way to developing a connection between Lagrangian dynamics and rheology in dense stabilised emulsions.",
  "categories": [
    "cond-mat.soft",
    "physics.flu-dyn"
  ],
  "primary_category": "cond-mat.soft",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14184",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1866118,
  "size_after_bytes": 82868
}