{
  "title": "A global colour mosaic of Mars from Mars Express HRSC high altitude observations",
  "authors": [
    "G. G. Michael",
    "D. Tirsch",
    "K. -D. Matz",
    "W. Zuschneid",
    "E. Hauber",
    "K. Gwinner",
    "S. Walter",
    "R. Jaumann",
    "T. Roatsch",
    "F. Postberg",
    "J. Liu"
  ],
  "submission_date": "2023-07-26T15:05:37+00:00",
  "revised_dates": [],
  "abstract": "The ever-changing transparency of the Martian atmosphere hinders the determination of absolute surface colour from spacecraft images. While individual high-resolution images from low orbit reveal numerous colour details of the geology, the colour variation between images caused by scattering off atmospheric dust can easily be of greater magnitude. The construction of contiguous large-scale mosaics has thus required a strategy to suppress the influence of scattering, often a form of high-pass filtering, which limits their ability to convey colour variation information over distances greater than the dimensions of single images. Here we use a dedicated high altitude observation campaign with the Mars Express High Resolution Stereo Camera (HRSC) (Neukum and Jaumann, 2004; Jaumann et al., 2007), applying a novel iterative method to construct a globally self-consistent colour model. We apply the model to colour-reference a high-altitude mosaic incor-porating long-range colour variation information. Using only the relative colour information internal to individual images, the influence of absolute image to image colour changes caused by scattering is minimised, while the model enables col-our variations across image boundaries to be self-consistently reconstructed. The resulting mosaic shows a level of colour detail comparable to single images, while maintaining continuity of colour features over much greater distances, thereby increasing the utility of HRSC colour images in the tracing and analysis of martian surface structures.",
  "categories": [
    "astro-ph.EP"
  ],
  "primary_category": "astro-ph.EP",
  "doi": "10.1016/j.icarus.2024.116350",
  "journal_ref": "Icarus, 425, 116350 (2025)",
  "arxiv_id": "2307.14238",
  "pdf_url": null,
  "comment": "Published in Icarus (accepted 27.10.2024)",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}