{
  "title": "Mixbiotic society measures: Comparison of organizational structures based on communication simulation",
  "authors": [
    "Takeshi Kato",
    "Jyunichi Miyakoshi",
    "Tadayuki Matsumura",
    "Yasuyuki Kudo",
    "Ryuji Mine",
    "Hiroyuki Mizuno",
    "Yasuo Deguchi"
  ],
  "submission_date": "2023-07-28T04:23:13+00:00",
  "revised_dates": [],
  "abstract": "The philosophical world has proposed the concept of \"mixbiotic society,\" in which individuals with freedom and diverse values mix and mingle to recognize their respective \"fundamental incapability\" each other and sublimate into solidarity, toward solving the issues of social isolation and fragmentation. Based on this concept, the mixbiotic society measures have been proposed to evaluate dynamic communication patterns with reference to classification in cellular automata and particle reaction-diffusion that simulate living phenomena. In this paper, we applied these measures to five typologies of organizational structure (Red: impulsive, Amber: adaptive, Orange: achievement, Green: pluralistic, and Teal: evolutionary) and evaluated their features. Specifically, we formed star, tree, tree+jumpers, tree+more jumpers, and small-world type networks corresponding to each of five typologies, conducted communication simulations on these networks, and calculated values for mixbiotic society measures. The results showed that Teal organization has the highest value of the mixism measure among mixbiotic society measures, i.e., it balances similarity (mixing) and dissimilarity (mingling) in communication, and is living and mixbiotic between order and chaos. Measures other than mixism showed that in Teal organization, information is not concentrated in a central leader and that communication takes place among various members. This evaluation of organizational structures shows that the mixbiotic society measures is also useful for assessing organizational change. In the future, these measures will be used not only in business organizations, but also in digital democratic organizations and platform cooperatives in conjunction with information technology.",
  "categories": [
    "cs.SI",
    "cs.CY"
  ],
  "primary_category": "cs.SI",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15297",
  "pdf_url": "https://arxiv.org/pdf/2307.15297v1",
  "comment": "25 pages, 6 figures",
  "num_versions": null,
  "size_before_bytes": 1043992,
  "size_after_bytes": 642268
}