{
  "title": "Polarimetry and Astrometry of NIR Flares as Event Horizon Scale, Dynamical Probes for the Mass of Sgr A*",
  "authors": [
    "The GRAVITY Collaboration",
    "R. Abuter",
    "N. Aimar",
    "P. Amaro Seoane",
    "A. Amorim",
    "M. Bauböck",
    "J. P. Berger",
    "H. Bonnet",
    "G. Bourdarot",
    "W. Brandner",
    "V. Cardoso",
    "Y. Clénet",
    "R. Davies",
    "P. T. de Zeeuw",
    "J. Dexter",
    "A. Drescher",
    "A. Eckart",
    "F. Eisenhauer",
    "H. Feuchtgruber",
    "G. Finger",
    "N. M. Förster Schreiber",
    "A. Foschi",
    "P. Garcia",
    "F. Gao",
    "Z. Gelles",
    "E. Gendron",
    "R. Genzel",
    "S. Gillessen",
    "M. Hartl",
    "X. Haubois",
    "F. Haussmann",
    "G. Heißel",
    "T. Henning",
    "S. Hippler",
    "M. Horrobin",
    "L. Jochum",
    "L. Jocou",
    "A. Kaufer",
    "P. Kervella",
    "S. Lacour",
    "V. Lapeyrère",
    "J. -B. Le Bouquin",
    "P. Léna",
    "D. Lutz",
    "F. Mang",
    "N. More",
    "T. Ott",
    "T. Paumard",
    "K. Perraut",
    "G. Perrin",
    "O. Pfuhl",
    "S. Rabien",
    "D. C. Ribeiro",
    "M. Sadun Bordoni",
    "S. Scheithauer",
    "J. Shangguan",
    "T. Shimizu",
    "J. Stadler",
    "O. Straub",
    "C. Straubmeier",
    "E. Sturm",
    "L. J. Tacconi",
    "F. Vincent",
    "S. von Fellenberg",
    "F. Widmann",
    "M. Wielgus",
    "E. Wieprecht",
    "E. Wiezorrek",
    "J. Woillez"
  ],
  "submission_date": "2023-07-21T18:00:12+00:00",
  "revised_dates": [
    "2023-09-06T13:30:20+00:00"
  ],
  "abstract": "We present new astrometric and polarimetric observations of flares from Sgr A* obtained with GRAVITY, the near-infrared interferometer at ESO's Very Large Telescope Interferometer (VLTI), bringing the total sample of well-covered astrometric flares to four and polarimetric ones to six, where we have for two flares good coverage in both domains. All astrometric flares show clockwise motion in the plane of the sky with a period of around an hour, and the polarization vector rotates by one full loop in the same time. Given the apparent similarities of the flares, we present a common fit, taking into account the absence of strong Doppler boosting peaks in the light curves and the EHT-measured geometry. Our results are consistent with and significantly strengthen our model from 2018: We find that a) the combination of polarization period and measured flare radius of around nine gravitational radii ($9 R_g \\approx 1.5 R_{ISCO}$, innermost stable circular orbit) is consistent with Keplerian orbital motion of hot spots in the innermost accretion zone. The mass inside the flares' radius is consistent with the $4.297 \\times 10^6 \\; \\text{M}_\\odot$ measured from stellar orbits at several thousand $R_g$. This finding and the diameter of the millimeter shadow of Sgr A* thus support a single black hole model. Further, b) the magnetic field configuration is predominantly poloidal (vertical), and the flares' orbital plane has a moderate inclination with respect to the plane of the sky, as shown by the non-detection of Doppler-boosting and the fact that we observe one polarization loop per astrometric loop. Moreover, c) both the position angle on sky and the required magnetic field strength suggest that the accretion flow is fueled and controlled by the winds of the massive, young stars of the clockwise stellar disk 1-5 arcsec from Sgr A*, in agreement with recent simulations.",
  "categories": [
    "astro-ph.GA",
    "astro-ph.HE",
    "gr-qc"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.1051/0004-6361/202347416",
  "journal_ref": "A&A 677, L10 (2023)",
  "arxiv_id": "2307.11821",
  "pdf_url": null,
  "comment": "10 pages, 12 figures. Accepted for publication in A&A",
  "num_versions": null,
  "size_before_bytes": 5098728,
  "size_after_bytes": 397433
}