{
  "title": "Knowledge Graph Enhanced Intelligent Tutoring System Based on Exercise Representativeness and Informativeness",
  "authors": [
    "Linqing Li",
    "Zhifeng Wang"
  ],
  "submission_date": "2023-07-15T08:36:34+00:00",
  "revised_dates": [],
  "abstract": "Presently, knowledge graph-based recommendation algorithms have garnered considerable attention among researchers. However, these algorithms solely consider knowledge graphs with single relationships and do not effectively model exercise-rich features, such as exercise representativeness and informativeness. Consequently, this paper proposes a framework, namely the Knowledge-Graph-Exercise Representativeness and Informativeness Framework, to address these two issues. The framework consists of four intricate components and a novel cognitive diagnosis model called the Neural Attentive cognitive diagnosis model. These components encompass the informativeness component, exercise representation component, knowledge importance component, and exercise representativeness component. The informativeness component evaluates the informational value of each question and identifies the candidate question set that exhibits the highest exercise informativeness. Furthermore, the skill embeddings are employed as input for the knowledge importance component. This component transforms a one-dimensional knowledge graph into a multi-dimensional one through four class relations and calculates skill importance weights based on novelty and popularity. Subsequently, the exercise representativeness component incorporates exercise weight knowledge coverage to select questions from the candidate question set for the tested question set. Lastly, the cognitive diagnosis model leverages exercise representation and skill importance weights to predict student performance on the test set and estimate their knowledge state. To evaluate the effectiveness of our selection strategy, extensive experiments were conducted on two publicly available educational datasets. The experimental results demonstrate that our framework can recommend appropriate exercises to students, leading to improved student performance.",
  "categories": [
    "cs.CY",
    "cs.LG"
  ],
  "primary_category": "cs.CY",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15076",
  "pdf_url": "https://arxiv.org/pdf/2307.15076v1",
  "comment": "31 pages, 6 figures",
  "num_versions": null,
  "size_before_bytes": 3486391,
  "size_after_bytes": 1627253
}