{
  "title": "Experimental study of a cryogenic power supply for superconducting DC devices",
  "authors": [
    "Lauro Ferreira",
    "Yasmine Baazizi",
    "Simon Meunier",
    "Tanguy Phulpin",
    "Richard Beljio",
    "Frédéric Trillaud",
    "Tian-Yong Gong",
    "Gustavo Henn",
    "Loïc Quéval"
  ],
  "submission_date": "2023-07-20T08:54:57+00:00",
  "revised_dates": [],
  "abstract": "Although a superconductor has no DC losses, a superconducting system does have significant losses, especially when it comes to power supply. Here, we study two different power supply systems. The first, a conventional one, consists of a transformer and a diode bridge operating at room temperature, plus current leads that allow the current to flow from the room-temperature medium to the cryogenic medium. The second consists of a transformer with a superconducting secondary winding, combined with a diode bridge operating at cryogenic temperature, thus dispensing with the need for current leads. We are experimentally comparing the performance of conventional and superconducting transformers, as well as the performance of a diode bridge at ambient and cryogenic temperatures. Our results indicate that the prototype superconducting transformer developed has lower winding resistance and secondary leakage inductance than the conventional transformer. In addition, we found that only certain diodes are suitable for operation at cryogenic temperatures. Finally, the diode bridge made from adapted diodes shows reduced losses at cryogenic temperature. This experimental work is the first step towards the realization of a complete power supply system for a superconducting device.",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15713",
  "pdf_url": "https://arxiv.org/pdf/2307.15713v1",
  "comment": "in French language, Symposium de Genie Electrique (SGE 2023), Jul 2023, Lille, France",
  "num_versions": null,
  "size_before_bytes": 879809,
  "size_after_bytes": 528533
}