{
  "title": "Approaching the standard quantum limit of a Rydberg-atom microwave electrometer",
  "authors": [
    "Hai-Tao Tu",
    "Kai-Yu Liao",
    "Guo-Dong He",
    "Yi-Fei Zhu",
    "Si-Yuan Qiu",
    "Hao Jiang",
    "Wei Huang",
    "Wu Bian",
    "Hui Yan",
    "Shi-Liang Zhu"
  ],
  "submission_date": "2023-07-28T15:26:45+00:00",
  "revised_dates": [
    "2023-07-31T03:24:05+00:00",
    "2023-11-13T08:12:54+00:00"
  ],
  "abstract": "The development of a microwave electrometer with inherent uncertainty approaching its ultimate limit carries both fundamental and technological significance. Recently, the Rydberg electrometer has garnered considerable attention due to its exceptional sensitivity, small-size, and broad tunability. This specific quantum sensor utilizes low-entropy laser beams to detect disturbances in atomic internal states, thereby circumventing the intrinsic thermal noise encountered by its classical counterparts. However, due to the thermal motion of atoms, the advanced Rydberg-atom microwave electrometer falls considerably short of the standard quantum limit by over three orders of magnitude. In this study, we utilize an optically thin medium with approximately 5.2e5 laser-cooled atoms to implement heterodyne detection. By mitigating a variety of noises and strategically optimizing the parameters of the Rydberg electrometer, our study achieves an electric-field sensitivity of 10.0 nV/cm/Hz^1/2 at a 100 Hz repetition rate, reaching a factor of 2.6 above the standard quantum limit and a minimum detectable field of 540 pV/cm. We also provide an in-depth analysis of noise mechanisms and determine optimal parameters to bolster the performance of Rydberg-atom sensors. Our work provides insights into the inherent capacities and limitations of Rydberg electrometers, while offering superior sensitivity for detecting weak microwave signals in numerous applications.",
  "categories": [
    "quant-ph",
    "physics.atom-ph"
  ],
  "primary_category": "quant-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15617",
  "pdf_url": "https://arxiv.org/pdf/2307.15617v3",
  "comment": "12 pages",
  "num_versions": null,
  "size_before_bytes": 4508652,
  "size_after_bytes": 187488
}