{
  "title": "Timely Target Tracking: Distributed Updating in Cognitive Radar Networks",
  "authors": [
    "William W. Howard",
    "Anthony F. Martone",
    "R. Michael Buehrer"
  ],
  "submission_date": "2023-07-24T16:59:40+00:00",
  "revised_dates": [
    "2023-07-26T00:26:38+00:00",
    "2023-11-06T01:23:23+00:00",
    "2024-03-05T01:54:22+00:00"
  ],
  "abstract": "Cognitive radar networks (CRNs) are capable of optimizing operating parameters in order to provide actionable information to an operator or secondary system. CRNs have been proposed to answer the need for low-cost devices tracking potentially large numbers of targets in geographically diverse regions. Networks of small-scale devices have also been shown to outperform legacy, large scale, high price, single-device installations. In this work, we consider a CRN tracking multiple targets with a goal of providing information which is both fresh and accurate to a measurement fusion center (FC). We show that under a constraint on the update rate of each radar node, the network is able to utilize Age of Information (AoI) metrics to maximize the resource utilization and minimize error per track. Since information freshness is critical to decision-making, this structure enables a CRN to provide the highest-quality information possible to a downstream system or operator. We discuss centralized and distributed approaches to solving this problem, taking into account the quality of node observations, the maneuverability of each target, and a limit on the rate at which any node may provide updates to the FC. We present a centralized AoI-inspired node selection metric, where a FC requests updates from specific nodes. We compare this against several alternative techniques. Further, we provide a distributed approach which utilizes the Age of Incorrect Information (AoII) metric, allowing each independent node to provide updates according to the targets it can observe. We provide mathematical analysis of the rate limits defined for the centralized and distributed approaches, showing that they are equivalent. We conclude with numerical simulations demonstrating that the performance of the algorithms exceeds that of alternative approaches, both in resource utilization and in tracking performance.",
  "categories": [
    "eess.SY"
  ],
  "primary_category": "eess.SY",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12936",
  "pdf_url": null,
  "comment": "15 pages, double column, 14 figures",
  "num_versions": null,
  "size_before_bytes": 18708453,
  "size_after_bytes": 488985
}