{
  "title": "Hubble constant from the cluster-lensed quasar system SDSS J1004+4112: investigation of the lens model dependence",
  "authors": [
    "Yuting Liu",
    "Masamune Oguri",
    "Shuo Cao"
  ],
  "submission_date": "2023-07-27T13:12:27+00:00",
  "revised_dates": [
    "2023-10-10T10:42:07+00:00"
  ],
  "abstract": "As a fundamental parameter for modern cosmology, the Hubble constant $H_0$ is experiencing a serious crisis. In this paper, we explore an independent approach to measure $H_0$ based on the time-delay cosmography with strong gravitational lensing of a quasar by a galaxy cluster. Specifically we focus on the strong lensing system SDSS J1004+4112 with the maximum image separation of 14.62$''$, the first system of a quasar lensed by a galaxy cluster with five multiple images. Incorporating the latest time-delay measurements, we investigate the lens model dependence from the combination of 16 different lens mass models. We find that the lens model dependence is indeed large, with the combined measurement of the Hubble constant of $H_0=67.5^{+14.5}_{-8.9}km/s/Mpc$ that is obtained by summing posteriors of the Hubble constant from the 16 models with equal weighting. Interestingly, our results show that the value of Hubble constant decreases as the complexity of the perturbation around the lens increases, although weighting based on positional errors of quasar images does not significantly improve the $H_0$ constraint. We find that the 16 different mass models predict largely different shapes of the lensed quasar host galaxy as well as other lensed galaxies behind the cluster. By selecting two mass models that best reproduces those shapes, the constraint on the Hubble constant is significantly tightened to $H_0=59.1^{+3.6}_{-3.5}km/s/Mpc$. While we caution that our analysis still does not fully explore all the possible mass model uncertainty, our results highlight the importance of including as many constraints as possible such as extended shapes of lensed galaxies for obtaining tight constraints on the Hubble constant from cluster-lensed quasar lens systems.",
  "categories": [
    "astro-ph.CO"
  ],
  "primary_category": "astro-ph.CO",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14833",
  "pdf_url": "https://arxiv.org/pdf/2307.14833v2",
  "comment": "12 pages, 5 figures, 3 tables. Accepted for publication in PRD",
  "num_versions": null,
  "size_before_bytes": 7315804,
  "size_after_bytes": 310381
}