{
  "title": "Neural-Based Test Oracle Generation: A Large-scale Evaluation and Lessons Learned",
  "authors": [
    "Soneya Binta Hossain",
    "Antonio Filieri",
    "Matthew B. Dwyer",
    "Sebastian Elbaum",
    "Willem Visser"
  ],
  "submission_date": "2023-07-29T16:34:56+00:00",
  "revised_dates": [
    "2023-08-25T22:26:59+00:00"
  ],
  "abstract": "Defining test oracles is crucial and central to test development, but manual construction of oracles is expensive. While recent neural-based automated test oracle generation techniques have shown promise, their real-world effectiveness remains a compelling question requiring further exploration and understanding. This paper investigates the effectiveness of TOGA, a recently developed neural-based method for automatic test oracle generation by Dinella et al. TOGA utilizes EvoSuite-generated test inputs and generates both exception and assertion oracles. In a Defects4j study, TOGA outperformed specification, search, and neural-based techniques, detecting 57 bugs, including 30 unique bugs not detected by other methods. To gain a deeper understanding of its applicability in real-world settings, we conducted a series of external, extended, and conceptual replication studies of TOGA.\n  In a large-scale study involving 25 real-world Java systems, 223.5K test cases, and 51K injected faults, we evaluate TOGA's ability to improve fault-detection effectiveness relative to the state-of-the-practice and the state-of-the-art. We find that TOGA misclassifies the type of oracle needed 24% of the time and that when it classifies correctly around 62% of the time it is not confident enough to generate any assertion oracle. When it does generate an assertion oracle, more than 47% of them are false positives, and the true positive assertions only increase fault detection by 0.3% relative to prior work. These findings expose limitations of the state-of-the-art neural-based oracle generation technique, provide valuable insights for improvement, and offer lessons for evaluating future automated oracle generation methods.",
  "categories": [
    "cs.SE"
  ],
  "primary_category": "cs.SE",
  "doi": "10.1145/3611643.3616265",
  "journal_ref": null,
  "arxiv_id": "2307.16023",
  "pdf_url": "https://arxiv.org/pdf/2307.16023v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 3336608,
  "size_after_bytes": 1461867
}