{
  "title": "Rocky sub-Neptunes formed by pebble accretion: Rain of rocks from polluted envelopes",
  "authors": [
    "Allona Vazan",
    "Chris W. Ormel"
  ],
  "submission_date": "2023-07-27T07:58:16+00:00",
  "revised_dates": [],
  "abstract": "Sub-Neptune planets formed in the protoplanetary disk accreted hydrogen-helium (H,He) envelopes. Planet formation models of sub-Neptunes formed by pebble accretion result in small rocky cores surrounded by polluted H,He envelopes where most of the rock (silicate) is in vapor form at the end of the formation phase. This vapor is expected to condense and rain-out as the planet cools. In this Letter we examine the timescale for the rainout and its effect on the thermal evolution. We calculate the thermal and structural evolution of a 10 Earth masses planet formed by pebble accretion, taking into account material redistribution from silicate rainout (condensation and settling) and from convective mixing. We find that the duration of the rainout in sub-Neptunes is on Gyr timescale and varies with envelope mass: planets with envelopes below 0.75 Earth mass rainout into a core-envelope structure in less than 1 Gyr, while planets in excess of 0.75 Earth mass of H,He preserve some of their envelope pollution for billions of years. The energy released by the rainout inflates the radius with respect to planets that start out from a plain core-envelope structure. This inflation would result in estimates of the H,He contents of observed exoplanets based on the standard core-envelope structure to be too high.We identify a number of planets in the exoplanet census where rainout may operate, which would result in their H,He contents to be overestimated by up to a factor two. Future accurate age measurements by the PLATO mission may allow the identification of planets formed with polluted envelopes.",
  "categories": [
    "astro-ph.EP"
  ],
  "primary_category": "astro-ph.EP",
  "doi": "10.1051/0004-6361/202346574",
  "journal_ref": "A&A 676, L8 (2023)",
  "arxiv_id": "2307.14674",
  "pdf_url": "https://arxiv.org/pdf/2307.14674v1",
  "comment": "accepted to A&A Letters",
  "num_versions": null,
  "size_before_bytes": 1879796,
  "size_after_bytes": 135936
}