{
  "title": "Self-supervised Few-shot Learning for Semantic Segmentation: An Annotation-free Approach",
  "authors": [
    "Sanaz Karimijafarbigloo",
    "Reza Azad",
    "Dorit Merhof"
  ],
  "submission_date": "2023-07-26T18:33:30+00:00",
  "revised_dates": [],
  "abstract": "Few-shot semantic segmentation (FSS) offers immense potential in the field of medical image analysis, enabling accurate object segmentation with limited training data. However, existing FSS techniques heavily rely on annotated semantic classes, rendering them unsuitable for medical images due to the scarcity of annotations. To address this challenge, multiple contributions are proposed: First, inspired by spectral decomposition methods, the problem of image decomposition is reframed as a graph partitioning task. The eigenvectors of the Laplacian matrix, derived from the feature affinity matrix of self-supervised networks, are analyzed to estimate the distribution of the objects of interest from the support images. Secondly, we propose a novel self-supervised FSS framework that does not rely on any annotation. Instead, it adaptively estimates the query mask by leveraging the eigenvectors obtained from the support images. This approach eliminates the need for manual annotation, making it particularly suitable for medical images with limited annotated data. Thirdly, to further enhance the decoding of the query image based on the information provided by the support image, we introduce a multi-scale large kernel attention module. By selectively emphasizing relevant features and details, this module improves the segmentation process and contributes to better object delineation. Evaluations on both natural and medical image datasets demonstrate the efficiency and effectiveness of our method. Moreover, the proposed approach is characterized by its generality and model-agnostic nature, allowing for seamless integration with various deep architectures. The code is publicly available at \\href{https://github.com/mindflow-institue/annotation_free_fewshot}{\\textcolor{magenta}{GitHub}}.",
  "categories": [
    "cs.CV"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14446",
  "pdf_url": null,
  "comment": "MICCAI 2023 workshop PRIME",
  "num_versions": null,
  "size_before_bytes": 2478145,
  "size_after_bytes": 148414
}