{
  "title": "A versatile platform for gas-phase molecular polaritonics",
  "authors": [
    "Adam D. Wright",
    "Jane C. Nelson",
    "Marissa L. Weichman"
  ],
  "submission_date": "2023-07-21T21:10:58+00:00",
  "revised_dates": [],
  "abstract": "Strong cavity coupling of gas-phase molecules will enable studies of benchmark chemical processes under strong light-matter interactions with a high level of experimental control and no solvent effects. We recently demonstrated the formation of gas-phase molecular polaritons by strongly coupling the bright $ν_3$, $J=3 \\rightarrow 4$ rovibrational transitions of methane (CH$_4$) to a Fabry-Pérot optical cavity mode inside a cryogenic buffer gas cell. Here, we further explore the flexible capabilities of this infrastructure. We show that we can greatly increase the collective coupling strength of the molecular ensemble to the cavity by increasing the intracavity CH$_4$ number density. In doing so, we can tune from the single-mode coupling regime to the multimode coupling regime in which many nested polaritonic states arise as the Rabi splitting approaches the cavity mode spacing. We explore polariton formation for cavity geometries of varying length, finesse, and mirror radius of curvature. We also report a proof-of-principle demonstration of rovibrational gas-phase polariton formation at room temperature. This experimental flexibility affords a great degree of control over the properties of molecular polaritons and opens up a wider range of simple molecular processes to future interrogation under strong cavity-coupling. We anticipate that ongoing work in gas-phase polaritonics will facilitate convergence between experimental results and theoretical models of cavity-altered chemistry and physics.",
  "categories": [
    "physics.chem-ph",
    "physics.optics"
  ],
  "primary_category": "physics.chem-ph",
  "doi": "10.1063/5.0170326",
  "journal_ref": "J. Chem. Phys. 159, 164202 (2023)",
  "arxiv_id": "2307.11907",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}