{
  "title": "Constraining the PG 1553+113 binary hypothesis: interpreting hints of a new, 22-year period",
  "authors": [
    "Sagar Adhikari",
    "Pablo Penil",
    "John Ryan Westernacher-Schneider",
    "Alberto Dominguez",
    "Marco Ajello",
    "Sara Buson",
    "Alba Rico",
    "Jonathan Zrake"
  ],
  "submission_date": "2023-07-21T16:50:46+00:00",
  "revised_dates": [
    "2024-04-17T00:22:10+00:00"
  ],
  "abstract": "PG 1553+113 is a well-known blazar exhibiting evidence of a $\\sim\\! 2.2$-yr quasi-periodic oscillation (QPO) in radio, optical, X-ray, and $γ$-ray bands. Since QPO mechanisms often predict multiple QPOs, we search for a second QPO in its historical optical light curve covering a century of observations. Despite challenging data quality issues, we find hints of a $21.8 \\pm 4.7$ yr oscillation. On its own, this $\\sim\\! 22$-yr period has a modest statistical significance of $1.6σ$ when accounting for the look-elsewhere effect. However, the joint significance of both the $2.2$- and $22$-yr periods arising from colored noise alone is $\\sim 3.6σ$. The next peak of the 22-yr oscillation is predicted to occur around July 2025. We find that such a $\\sim\\,$10:1 relation between two periods can arise in the gas dynamics of a plausible supermassive black hole binary model of PG 1553+113. While the 22-yr QPO is preliminary, an interpretation of PG 1553+113's two QPOs in this binary model suggests that the binary engine has a mass ratio $\\gtrsim 0.2$, an eccentricity $\\lesssim 0.1$, and accretes from a disk with characteristic aspect ratio $\\sim 0.03$. The putative binary radiates nHz gravitational waves, but the amplitude is $\\sim10-100$ times too low for detection by foreseeable pulsar timing arrays.",
  "categories": [
    "astro-ph.HE",
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.HE",
  "doi": "10.3847/1538-4357/ad310a",
  "journal_ref": null,
  "arxiv_id": "2307.11696",
  "pdf_url": null,
  "comment": "20 pages, 15 figures, 1 table",
  "num_versions": null,
  "size_before_bytes": 3449967,
  "size_after_bytes": 953324
}