{
  "title": "Evaluating the Impact of Numerology and Retransmission on 5G NR V2X Communication at A System-Level Simulation",
  "authors": [
    "Donglin Wang",
    "Pranav Balasaheb Mohite",
    "Qiuheng Zhou",
    "Anjie Qiu",
    "Hans D. Schotten"
  ],
  "submission_date": "2023-07-26T12:38:21+00:00",
  "revised_dates": [],
  "abstract": "In recent years, Vehicle-to-Everything (V2X) communication opens an ample amount of opportunities to increase the safety of drivers and passengers and improve traffic efficiency which enables direct communication between vehicles. The Third Generation Partnership Project (3GPP) has specified a 5G New Radio (NR) Sidelink (SL) PC5 interface for supporting Cellular V2X (C-V2X) communication in Release 16 in 2017. 5G NR V2X communication is expected to provide high reliability, extra-low latency, and a high data rate for vehicular networks. In this paper, the newly introduced features of 5G NR standards like flexible numerology, variable Subcarrier Spacing (SCS), and allocated Physical Resource Blocks (PRBs) have been inspected in 5G NR V2X communications. Moreover, the 5G NR V2X data packet will be distributed to all nearby User Equipment (UE) by the Transmitter (Tx). However, there may be instances where certain UEs fail to receive the data packets in a single transmission. Unfortunately, the SL Tx lacks a feedback channel to verify if the Receivers (Rxs) have received the information. To meet the stringent reliability and latency requirements of C-V2X communication, we suggest and assess a retransmission scheme along with a scheme that incorporates varying resource allocations for retransmission in NR V2X communication. The effect of retransmission schemes on NR V2X communication systems has been detected.",
  "categories": [
    "eess.SY"
  ],
  "primary_category": "eess.SY",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14158",
  "pdf_url": null,
  "comment": "7 pages, 5 figures, 3 tables",
  "num_versions": null,
  "size_before_bytes": 719897,
  "size_after_bytes": 49083
}