{
  "title": "Neuromorphic Neuromodulation: Towards the next generation of on-device AI-revolution in electroceuticals",
  "authors": [
    "Luis Fernando Herbozo Contreras",
    "Nhan Duy Truong",
    "Jason K. Eshraghian",
    "Zhangyu Xu",
    "Zhaojing Huang",
    "Armin Nikpour",
    "Omid Kavehei"
  ],
  "submission_date": "2023-07-24T01:53:51+00:00",
  "revised_dates": [
    "2023-07-31T00:16:42+00:00"
  ],
  "abstract": "Neuromodulation techniques have emerged as promising approaches for treating a wide range of neurological disorders, precisely delivering electrical stimulation to modulate abnormal neuronal activity. While leveraging the unique capabilities of artificial intelligence (AI) holds immense potential for responsive neurostimulation, it appears as an extremely challenging proposition where real-time (low-latency) processing, low power consumption, and heat constraints are limiting factors. The use of sophisticated AI-driven models for personalized neurostimulation depends on back-telemetry of data to external systems (e.g. cloud-based medical mesosystems and ecosystems). While this can be a solution, integrating continuous learning within implantable neuromodulation devices for several applications, such as seizure prediction in epilepsy, is an open question. We believe neuromorphic architectures hold an outstanding potential to open new avenues for sophisticated on-chip analysis of neural signals and AI-driven personalized treatments. With more than three orders of magnitude reduction in the total data required for data processing and feature extraction, the high power- and memory-efficiency of neuromorphic computing to hardware-firmware co-design can be considered as the solution-in-the-making to resource-constraint implantable neuromodulation systems. This perspective introduces the concept of Neuromorphic Neuromodulation, a new breed of closed-loop responsive feedback system. It highlights its potential to revolutionize implantable brain-machine microsystems for patient-specific treatment",
  "categories": [
    "cs.AR"
  ],
  "primary_category": "cs.AR",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12471",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 26526187,
  "size_after_bytes": 432602
}