{
  "title": "Plasmon thermal conductivity of thin Au and Ag films",
  "authors": [
    "Dong-min Kim",
    "Jeongmin Nam",
    "Bong Jae Lee"
  ],
  "submission_date": "2023-07-27T02:43:11+00:00",
  "revised_dates": [],
  "abstract": "We investigated the thermal conductivity of surface plasmon polaritons (SPPs) propagating along thin Au and Ag films on a SiO$_2$ substrate with a Ti adhesive layer. To determine the propagation length and skin depth of SPPs along Au and Ag thin films, we numerically solved the dispersion relation while considering the size effect of the permittivity of metal. Additionally, we derived the spatial distribution of SPPs along the film thickness to analyze the effect of the Ti adhesive layer on the plasmon thermal conductivity of Au and Ag thin films. Our theoretical predictions revealed a decrease of approximately 30\\% in plasmon thermal conductivity when considering the size effect of the permittivity of thin metal films. Furthermore, this causes the film thickness at which maximum thermal conductivity occurs to increase by about 30\\%. Taking these factors into account, we calculated the optimal thickness of Au and Ag films, along with Ti adhesive layers, on SiO$_2$ substrates to be approximately 20 nm. By fabricating a sample with the optimal thickness of Au and Ag films, we experimentally demonstrated that the plasmon thermal conductivity of Au and Ag films can be as high as about 20\\% of their electron contribution. This research will broaden the thermal design applications of ballistic thermal transport by SPPs propagating along thin metal coatings in microelectronics.",
  "categories": [
    "physics.app-ph"
  ],
  "primary_category": "physics.app-ph",
  "doi": "10.1103/PhysRevB.108.205418",
  "journal_ref": "Physical Review B 108, 205418, 2023",
  "arxiv_id": "2307.14595",
  "pdf_url": "https://arxiv.org/pdf/2307.14595v1",
  "comment": "5 figures",
  "num_versions": null,
  "size_before_bytes": 1059003,
  "size_after_bytes": 71096
}