{
  "title": "Entropic sampling in frustrated magnets: role of self-intersecting spaces",
  "authors": [
    "Alwyn Jose Raja",
    "R. Ganesh"
  ],
  "submission_date": "2023-07-29T07:21:24+00:00",
  "revised_dates": [
    "2024-04-01T15:12:24+00:00"
  ],
  "abstract": "Frustrated magnets typically possess a large space of classical ground states. If this degeneracy is not protected by symmetry, thermal fluctuations may `select' certain states via order-by-disorder. In this article, we examine a precursor effect where all ground states are sampled, but with different weights. Geometry plays a key role in determining the weight distribution and its behaviour. We demonstrate this with two examples -- both clusters with four spins coupled by XY interactions. In the first, the classical ground states form a smooth space. In the second, they form a self-intersecting non-manifold space. Ground state sampling is very different in these two cases. We first consider the microcanonical ensemble picture, where fluctuations conserve energy. Phase space arguments suggest that the first model exhibits energy-independent probabilities. The second shows a dramatic energy-dependence with relative probability increasing as $ε^{-1/2}$, where $ε$ is the energy of the system. We simulate low-energy dynamics in both models, confirming the expected behaviour. We next consider the canonical ensemble, where the first model produces temperature-independent probabilities. In the second, relative probability rises sharply as $T^{-1/2}$, where $T$ is the temperature. Our results bring out a classical analogue of order-by-singularity, a mechanism that has been recently proposed in the context of quantum spin clusters. The sampling of classical orders is qualitatively different in systems with self-intersecting ground state spaces. It grows at low energies and becomes singular as $ε\\rightarrow 0$ (microcanonical ensemble) or $T\\rightarrow 0$ (canonical ensemble). We discuss relevance for disordered phases in macroscopic magnets, particularly for spiral liquids.",
  "categories": [
    "cond-mat.str-el",
    "cond-mat.stat-mech"
  ],
  "primary_category": "cond-mat.str-el",
  "doi": null,
  "journal_ref": "Phys. Rev. B 109, 144401 (2024)",
  "arxiv_id": "2307.15918",
  "pdf_url": "https://arxiv.org/pdf/2307.15918v2",
  "comment": "10 pages, 8 figures",
  "num_versions": null,
  "size_before_bytes": 9229859,
  "size_after_bytes": 126617
}