{
  "title": "Simplified Concrete Dropout -- Improving the Generation of Attribution Masks for Fine-grained Classification",
  "authors": [
    "Dimitri Korsch",
    "Maha Shadaydeh",
    "Joachim Denzler"
  ],
  "submission_date": "2023-07-27T13:01:49+00:00",
  "revised_dates": [],
  "abstract": "Fine-grained classification is a particular case of a classification problem, aiming to classify objects that share the visual appearance and can only be distinguished by subtle differences. Fine-grained classification models are often deployed to determine animal species or individuals in automated animal monitoring systems. Precise visual explanations of the model's decision are crucial to analyze systematic errors. Attention- or gradient-based methods are commonly used to identify regions in the image that contribute the most to the classification decision. These methods deliver either too coarse or too noisy explanations, unsuitable for identifying subtle visual differences reliably. However, perturbation-based methods can precisely identify pixels causally responsible for the classification result. Fill-in of the dropout (FIDO) algorithm is one of those methods. It utilizes the concrete dropout (CD) to sample a set of attribution masks and updates the sampling parameters based on the output of the classification model. A known problem of the algorithm is a high variance in the gradient estimates, which the authors have mitigated until now by mini-batch updates of the sampling parameters. This paper presents a solution to circumvent these computational instabilities by simplifying the CD sampling and reducing reliance on large mini-batch sizes. First, it allows estimating the parameters with smaller mini-batch sizes without losing the quality of the estimates but with a reduced computational effort. Furthermore, our solution produces finer and more coherent attribution masks. Finally, we use the resulting attribution masks to improve the classification performance of a trained model without additional fine-tuning of the model.",
  "categories": [
    "cs.CV"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14825",
  "pdf_url": "https://arxiv.org/pdf/2307.14825v1",
  "comment": "Accepted at the German Conference on Pattern Recognition 2023 (GCPR 2023)",
  "num_versions": null,
  "size_before_bytes": 4256258,
  "size_after_bytes": 109272
}