{
  "title": "Proof-of-Federated-Learning-Subchain: Free Partner Selection Subchain Based on Federated Learning",
  "authors": [
    "Boyang Li",
    "Bingyu Shen",
    "Qing Lu",
    "Taeho Jung",
    "Yiyu Shi"
  ],
  "submission_date": "2023-07-30T23:39:58+00:00",
  "revised_dates": [],
  "abstract": "The continuous thriving of the Blockchain society motivates research in novel designs of schemes supporting cryptocurrencies. Previously multiple Proof-of-Deep-Learning(PoDL) consensuses have been proposed to replace hashing with useful work such as deep learning model training tasks. The energy will be more efficiently used while maintaining the ledger. However deep learning models are problem-specific and can be extremely complex. Current PoDL consensuses still require much work to realize in the real world. In this paper, we proposed a novel consensus named Proof-of-Federated-Learning-Subchain(PoFLSC) to fill the gap. We applied a subchain to record the training, challenging, and auditing activities and emphasized the importance of valuable datasets in partner selection. We simulated 20 miners in the subchain to demonstrate the effectiveness of PoFLSC. When we reduce the pool size concerning the reservation priority order, the drop rate difference in the performance in different scenarios further exhibits that the miner with a higher Shapley Value (SV) will gain a better opportunity to be selected when the size of the subchain pool is limited. In the conducted experiments, the PoFLSC consensus supported the subchain manager to be aware of reservation priority and the core partition of contributors to establish and maintain a competitive subchain.",
  "categories": [
    "cs.LG",
    "cs.AI",
    "cs.CR"
  ],
  "primary_category": "cs.LG",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16342",
  "pdf_url": "https://arxiv.org/pdf/2307.16342v1",
  "comment": "7 pages, 7 figures",
  "num_versions": null,
  "size_before_bytes": 2015868,
  "size_after_bytes": 349462
}