{
  "title": "Evaluation of several explanations of the strong X-ray polarization of the black hole X-ray binary 4U 1630-47",
  "authors": [
    "Henric Krawczynski",
    "Yajie Yuan",
    "Alexander Y. Chen",
    "Kun Hu",
    "Nicole Rodriguez Cavero",
    "Sohee Chun",
    "Ephraim Gau",
    "James F. Steiner",
    "Michal Dovčiak"
  ],
  "submission_date": "2023-07-24T21:43:57+00:00",
  "revised_dates": [
    "2024-10-11T01:21:19+00:00"
  ],
  "abstract": "The Imaging X-ray Polarimetry Explorer (IXPE) observations of the X-ray binary 4U 1630-47 in the high soft state revealed high linear polarization degrees (PDs) rising from 6% at 2 keV to 10% at 8 keV. We discuss in this letter three different mechanisms that impact the polarization of the observed X-rays: the reflection of gravitationally lensed emission by the accretion disk, reprocessing of the emission in outflowing plasma, and electron and ion anisotropies in the accretion disk atmosphere. We conducted detailed raytracing studies to evaluate the impact of the reflection of strongly gravitationally lensed emission on the PDs. Although the reflected emission can produce high PDs in the high-energy tail of the thermal emission component, we do not find models that describe the PDs and are consistent with independent estimates of the source distance. We discuss the energetics of another proposed mechanism: the emission or scattering of the X-rays in mildly relativistically moving plasma outflows. We argue that these models are disfavored as they require large mechanical luminosities on the order of, or even exceeding the Eddington Luminosity. We investigated the impact of electron and ion anisotropies, but find that their impact on the observed PDs are likely negligible. We conclude with a discussion of all three effects and avenues for future research.",
  "categories": [
    "astro-ph.HE",
    "gr-qc"
  ],
  "primary_category": "astro-ph.HE",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13141",
  "pdf_url": null,
  "comment": "11 pages and 5 figures, Astrophysical Journal Letters, in press",
  "num_versions": null,
  "size_before_bytes": 1232185,
  "size_after_bytes": 761680
}