{
  "title": "Multimodal Document Analytics for Banking Process Automation",
  "authors": [
    "Christopher Gerling",
    "Stefan Lessmann"
  ],
  "submission_date": "2023-07-21T18:29:04+00:00",
  "revised_dates": [
    "2023-11-28T01:23:47+00:00"
  ],
  "abstract": "Traditional banks face increasing competition from FinTechs in the rapidly evolving financial ecosystem. Raising operational efficiency is vital to address this challenge. Our study aims to improve the efficiency of document-intensive business processes in banking. To that end, we first review the landscape of business documents in the retail segment. Banking documents often contain text, layout, and visuals, suggesting that document analytics and process automation require more than plain natural language processing (NLP). To verify this and assess the incremental value of visual cues when processing business documents, we compare a recently proposed multimodal model called LayoutXLM to powerful text classifiers (e.g., BERT) and large language models (e.g., GPT) in a case study related to processing company register extracts. The results confirm that incorporating layout information in a model substantially increases its performance. Interestingly, we also observed that more than 75% of the best model performance (in terms of the F1 score) can be achieved with as little as 30% of the training data. This shows that the demand for data labeled data to set up a multi-modal model can be moderate, which simplifies real-world applications of multimodal document analytics. Our study also sheds light on more specific practices in the scope of calibrating a multimodal banking document classifier, including the need for fine-tuning. In sum, the paper contributes original empirical evidence on the effectiveness and efficiency of multi-model models for document processing in the banking business and offers practical guidance on how to unlock this potential in day-to-day operations.",
  "categories": [
    "cs.CL",
    "cs.AI",
    "cs.CV",
    "q-fin.CP"
  ],
  "primary_category": "cs.CL",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11845",
  "pdf_url": null,
  "comment": "A Preprint",
  "num_versions": null,
  "size_before_bytes": 1465478,
  "size_after_bytes": 269830
}