{
  "title": "Two-stage random sequential adsorption of discorectangles and disks on a two-dimensional surface",
  "authors": [
    "Nikolai Lebovka",
    "Mykhaylo Petryk",
    "Mykhailo Tatochenko",
    "Nikolai Vygornitskii"
  ],
  "submission_date": "2023-07-25T05:04:43+00:00",
  "revised_dates": [],
  "abstract": "The different variants of two-stage random sequential adsorption (RSA) models for packing of disks and discorectangles on a two-dimensional (2D) surface were investigated. In the SD model, the discorectangles were first deposited and then the disks were added. In the DS model, the disks were first deposited and then discorectangles were added. At the first stage the particles were deposited up to the selected concentration and at the final (second) stage the particles were deposited up to the saturated (jamming) state. The main parameters of the models were the concentration of particles deposited at the first stage, aspect ratio of the discorectangles $\\varepsilon$ (length to diameter of ratio $\\varepsilon=l/d$) and disk diameter $D$. All distances were measured using the value of $d$ as a unit of measurement of linear dimensions, the disk diameter was varied in the interval $D \\in [1-10]$, and the aspect ratio value was varied in the interval $\\varepsilon\\in [1-50]$. The dependencies of the jamming coverage of particles deposited at the second stage versus the parameters of the models were analyzed. The presence of first deposited particles for both models regulated the maximum possible disk diameter, $D_{max}$ (SD model) or the maximum aspect ratio, $\\varepsilon_{max}$ (DS model). This behavior was explained by the deposition of particles in the second stage into triangular (SD model) or elongated (DS model) pores formed by particles deposited at the first stage. The percolation connectivity of disks (SD model) and discorectangles (DS model) for the particles with a hard core and a soft shell structure was analyzed. The disconnectedness was ensured by overlapping of soft shells. The dependencies of connectivity versus the parameters of SD and DS models were also analyzed.",
  "categories": [
    "cond-mat.stat-mech"
  ],
  "primary_category": "cond-mat.stat-mech",
  "doi": "10.1103/PhysRevE.108.024109",
  "journal_ref": null,
  "arxiv_id": "2307.13258",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 4636428,
  "size_after_bytes": 87913
}