{
  "title": "Efficient Reduced Order Quadrature Construction Algorithms for Fast Gravitational Wave Inference",
  "authors": [
    "Gonzalo Morras",
    "Jose Francisco Nuno Siles",
    "Juan Garcia-Bellido"
  ],
  "submission_date": "2023-07-31T12:36:11+00:00",
  "revised_dates": [],
  "abstract": "Reduced Order Quadrature (ROQ) methods can greatly reduce the computational cost of Gravitational Wave (GW) likelihood evaluations, and therefore greatly speed up parameter estimation analyses, which is a vital part to maximize the science output of advanced GW detectors. In this paper, we do an in-depth study of ROQ techniques applied to GW data analysis and present novel algorithms to enhance different aspects of the ROQ bases construction. We improve upon previous ROQ construction algorithms allowing for more efficient bases in regions of parameter space that were previously challenging. In particular, we use singular value decomposition (SVD) methods to characterize the waveform space and choose a reduced order basis close to optimal and also propose improved methods for empirical interpolation node selection, greatly reducing the error added by the empirical interpolation model. To demonstrate the effectiveness of our algorithms, we construct multiple ROQ bases ranging in duration from 4s to 256s for compact binary coalescence (CBC) waveforms including precession and higher order modes. We validate these bases by performing likelihood error tests and P-P tests and explore the speed up they induce both theoretically and empirically with positive results. Furthermore, we conduct end-to-end parameter estimation analyses on several confirmed GW events, showing the validity of our approach in real GW data.",
  "categories": [
    "gr-qc",
    "astro-ph.CO",
    "astro-ph.HE",
    "astro-ph.IM"
  ],
  "primary_category": "gr-qc",
  "doi": "10.1103/PhysRevD.108.123025",
  "journal_ref": "Phys. Rev. D 108, 123025 (2023)",
  "arxiv_id": "2307.16610",
  "pdf_url": "https://arxiv.org/pdf/2307.16610v1",
  "comment": "21 pages, 9 figures",
  "num_versions": null,
  "size_before_bytes": 1631731,
  "size_after_bytes": 195155
}