{
  "title": "Stabilization and Dissipative Information Transfer of a Superconducting Kerr-Cat Qubit",
  "authors": [
    "Ufuk Korkmaz",
    "Deniz Türkpençe"
  ],
  "submission_date": "2023-07-23T11:28:52+00:00",
  "revised_dates": [],
  "abstract": "Today, the competition to build a quantum computer continues, and the number of qubits in hardware is increasing rapidly. However, the quantum noise that comes with this process reduces the performance of algorithmic applications, so alternative ways in quantum computer architecture and implementation of algorithms are discussed on the one hand. One of these alternative ways is the hybridization of the circuit-based quantum computing model with the dissipative-based computing model. Here, the goal is to apply the part of the algorithm that provides the quantum advantage with the quantum circuit model, and the remaining part with the dissipative model, which is less affected by noise. This scheme is of importance to quantum machine learning algorithms that involve highly repetitive processes and are thus susceptible to noise. In this study, we examine dissipative information transfer to a qubit model called Cat-Qubit. This model is especially important for the dissipative-based version of the binary quantum classification, which is the basic processing unit of quantum machine learning algorithms. On the other hand, Cat-Qubit architecture, which has the potential to easily implement activation-like functions in artificial neural networks due to its rich physics, also offers an alternative hardware opportunity for quantum artificial neural networks. Numerical calculations exhibit successful transfer of quantum information from reservoir qubits by a repeated-interactions-based dissipative scheme.",
  "categories": [
    "quant-ph"
  ],
  "primary_category": "quant-ph",
  "doi": "10.17694/bajece.1211876",
  "journal_ref": null,
  "arxiv_id": "2307.12298",
  "pdf_url": null,
  "comment": "8 pages, 5 figures",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}