{
  "title": "Ultrafast measurements of mode-specific deformation potentials of Bi$_2$Te$_3$ and Bi$_2$Se$_3$",
  "authors": [
    "Yijing Huang",
    "José D. Querales-Flores",
    "Samuel W. Teitelbaum",
    "Jiang Cao",
    "Thomas Henighan",
    "Hanzhe Liu",
    "Mason Jiang",
    "Gilberto De la Peña",
    "Viktor Krapivin",
    "Johann Haber",
    "Takahiro Sato",
    "Matthieu Chollet",
    "Diling Zhu",
    "Tetsuo Katayama",
    "Robert Power",
    "Meabh Allen",
    "Costel R. Rotundu",
    "Trevor P. Bailey",
    "Ctirad Uher",
    "Mariano Trigo",
    "Patrick S. Kirchmann",
    "Éamonn D. Murray",
    "Zhi-Xun Shen",
    "Ivana Savic",
    "Stephen Fahy",
    "Jonathan A. Sobota",
    "David A. Reis"
  ],
  "submission_date": "2023-07-22T17:36:44+00:00",
  "revised_dates": [],
  "abstract": "Quantifying electron-phonon interactions for the surface states of topological materials can provide key insights into surface-state transport, topological superconductivity, and potentially how to manipulate the surface state using a structural degree of freedom. We perform time-resolved x-ray diffraction (XRD) and angle-resolved photoemission (ARPES) measurements on Bi$_2$Te$_3$ and Bi$_2$Se$_3$, following the excitation of coherent A$_{1g}$ optical phonons. We extract and compare the deformation potentials coupling the surface electronic states to local A$_{1g}$-like displacements in these two materials using the experimentally determined atomic displacements from XRD and electron band shifts from ARPES.We find the coupling in Bi$_2$Te$_3$ and Bi$_2$Se$_3$ to be similar and in general in agreement with expectations from density functional theory. We establish a methodology that quantifies the mode-specific electron-phonon coupling experimentally, allowing detailed comparison to theory. Our results shed light on fundamental processes in topological insulators involving electron-phonon coupling.",
  "categories": [
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12132",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 11562160,
  "size_after_bytes": 126437
}