{
  "title": "Joint Ultra-wideband Characterization of Azimuth, Elevation and Time of Arrival with Toric Arrays",
  "authors": [
    "Alejandro Ramírez-Arroyo",
    "Antonio Alex-Amor",
    "Rubén Medina",
    "Pablo Padilla",
    "Juan F. Valenzuela-Valdés"
  ],
  "submission_date": "2023-07-24T10:43:35+00:00",
  "revised_dates": [
    "2024-03-26T01:05:23+00:00"
  ],
  "abstract": "In this paper, we present an analytical framework for the joint characterization of the 3D direction of arrival (DoA), i.e., azimuth and elevation components, and time of arrival (ToA) in multipath environments. The analytical framework is based on the use of nearly frequency-invariant beamformers (FIB) formed by toric arrays. The frequency response of the toric array is expanded as a series of phase modes, which leads to azimuth-time and elevation-time diagrams from which the 3D DoA and the ToA of the incoming waves can be extracted over a wide bandwidth. Firstly, we discuss some practical considerations, advantages and limitations of using the analytical method. Subsequently, we perform a parametric study to analyze the influence of the method parameters on the quality of the estimation. The method is tested in single-path and multipath mm-wave environments over a large bandwidth. The results show that the proposed method improves the quality of the estimation, i.e., decreases the level of the artifacts, compared to other state-of-art FIB approaches based on the use of single/concentric circular and elliptical arrays.",
  "categories": [
    "eess.SP"
  ],
  "primary_category": "eess.SP",
  "doi": "10.1109/TWC.2024.3377539",
  "journal_ref": "A. Ramirez-Arroyo, A. Alex-Amor, R. Medina, P. Padilla and J. F. Valenzuela-Valdes, \"Joint Ultra-wideband Characterization of Azimuth, Elevation and Time of Arrival with Toric Arrays,\" in IEEE Transactions on Wireless Communications, 2024",
  "arxiv_id": "2307.12683",
  "pdf_url": null,
  "comment": "Published in IEEE Transactions on Wireless Communications",
  "num_versions": null,
  "size_before_bytes": 53654641,
  "size_after_bytes": 144562
}