{
  "title": "Ro-vibrational Spectroscopy of CI Tau -- Evidence of a Multi-Component Eccentric Disk Induced by a Planet",
  "authors": [
    "Janus Kozdon",
    "Sean Brittain",
    "Jeffrey Fung",
    "Josh Kern",
    "Stanley Jensen",
    "John Carr",
    "Joan Najita",
    "Andrea Banzatti"
  ],
  "submission_date": "2023-07-24T18:00:02+00:00",
  "revised_dates": [
    "2023-09-08T00:32:02+00:00"
  ],
  "abstract": "CI Tau is currently the only T Tauri star with an inner protoplanetary disk that hosts a planet, CI Tau b, that has been detected by a radial velocity survey. This provides the unique opportunity to study disk features that were imprinted by that planet. We present multi-epoch spectroscopic data, taken with NASA IRTF in 2022, of the ${}^{12}$CO and hydrogen Pf$β$ line emissions spanning 9 consecutive nights, which is the proposed orbital period of CI Tau b. We find that the star's accretion rate varied according to that 9~d period, indicative of companion driven accretion. Analysis of the ${}^{12}$CO emission lines reveals that the disk can be described with an inner and outer component spanning orbital radii 0.05-0.13~au and 0.15-1.5~au, respectively. Both components have eccentricities of about 0.05 and arguments of periapses that are oppositely aligned. We present a proof-of-concept hydrodynamic simulation that shows a massive companion on a similarly eccentric orbit can recreate a similar disk structure. Our results allude to such a companion being located around an orbital distance of 0.14~au. However, this planet's orbital parameters may be inconsistent with those of CI Tau b whose high eccentricity is likely not compatible with the low disk eccentricities inferred by our model.",
  "categories": [
    "astro-ph.EP",
    "astro-ph.SR"
  ],
  "primary_category": "astro-ph.EP",
  "doi": "10.3847/1538-3881/ace903",
  "journal_ref": null,
  "arxiv_id": "2307.13029",
  "pdf_url": null,
  "comment": "Accepted to AJ",
  "num_versions": null,
  "size_before_bytes": 6748231,
  "size_after_bytes": 360342
}