{
  "title": "On the characteristics of natural hydraulic dampers: An image-based approach to study the fluid flow behaviour inside the human meniscal tissue",
  "authors": [
    "J. Waghorne",
    "F. P. Bonomo",
    "A. Rabbani",
    "D. Bell",
    "O. Barrera"
  ],
  "submission_date": "2023-07-24T18:19:39+00:00",
  "revised_dates": [],
  "abstract": "The meniscal tissue is a layered material with varying properties influenced by collagen content and arrangement. Understanding the relationship between structure and properties is crucial for disease management, treatment development, and biomaterial design. The internal layer of the meniscus is softer and more deformable than the outer layers, thanks to interconnected collagen channels that guide fluid flow. To investigate these relationships, we propose a novel approach that combines Computational Fluid Dynamics (CFD) with Image Analysis (CFD-IA). We analyze fluid flow in the internal architecture of the human meniscus across a range of inlet velocities (0.1mm/s to 1.6m/s) using high-resolution 3D micro-computed tomography scans. Statistical correlations are observed between architectural parameters (tortuosity, connectivity, porosity, pore size) and fluid flow parameters (Re number distribution, permeability). Some channels exhibit Re values of 1400 at an inlet velocity of 1.6m/s, and a transition from Darcy's regime to a non-Darcian regime occurs around an inlet velocity of 0.02m/s. Location-dependent permeability ranges from 20-32 Darcy. Regression modelling reveals a strong correlation between fluid velocity and tortuosity at high inlet velocities, as well as with channel diameter at low inlet velocities. At higher inlet velocities, flow paths deviate more from the preferential direction, resulting in a decrease in the concentration parameter by an average of 0.4. This research provides valuable insights into the fluid flow behaviour within the meniscus and its structural influences.",
  "categories": [
    "cs.CE",
    "cs.CV",
    "physics.data-an",
    "physics.flu-dyn",
    "physics.med-ph"
  ],
  "primary_category": "cs.CE",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13060",
  "pdf_url": null,
  "comment": "20 Pages, 5 Figures",
  "num_versions": null,
  "size_before_bytes": 29702317,
  "size_after_bytes": 107429
}