{
  "title": "Graph Neural Networks For Mapping Variables Between Programs -- Extended Version",
  "authors": [
    "Pedro Orvalho",
    "Jelle Piepenbrock",
    "Mikoláš Janota",
    "Vasco Manquinho"
  ],
  "submission_date": "2023-07-24T16:14:32+00:00",
  "revised_dates": [
    "2023-08-01T00:11:18+00:00"
  ],
  "abstract": "Automated program analysis is a pivotal research domain in many areas of Computer Science -- Formal Methods and Artificial Intelligence, in particular. Due to the undecidability of the problem of program equivalence, comparing two programs is highly challenging. Typically, in order to compare two programs, a relation between both programs' sets of variables is required. Thus, mapping variables between two programs is useful for a panoply of tasks such as program equivalence, program analysis, program repair, and clone detection. In this work, we propose using graph neural networks (GNNs) to map the set of variables between two programs based on both programs' abstract syntax trees (ASTs). To demonstrate the strength of variable mappings, we present three use-cases of these mappings on the task of program repair to fix well-studied and recurrent bugs among novice programmers in introductory programming assignments (IPAs). Experimental results on a dataset of 4166 pairs of incorrect/correct programs show that our approach correctly maps 83% of the evaluation dataset. Moreover, our experiments show that the current state-of-the-art on program repair, greatly dependent on the programs' structure, can only repair about 72% of the incorrect programs. In contrast, our approach, which is solely based on variable mappings, can repair around 88.5%.",
  "categories": [
    "cs.SE",
    "cs.AI",
    "cs.LG"
  ],
  "primary_category": "cs.SE",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13014",
  "pdf_url": null,
  "comment": "Extended version of \"Graph Neural Networks For Mapping Variables Between Programs\", paper accepted at ECAI 2023. Github: https://github.com/pmorvalho/ecai23-GNNs-for-mapping-variables-between-programs. 11 pages, 5 figures, 4 tables and 3 listings",
  "num_versions": null,
  "size_before_bytes": 1400892,
  "size_after_bytes": 869237
}