{
  "title": "On the proximity between the wave dynamics of the integrable focusing nonlinear Schrödinger equation and its non-integrable generalizations",
  "authors": [
    "Dirk Hennig",
    "Nikos I. Karachalios",
    "Dionyssios Mantzavinos",
    "Jesus Cuevas-Maraver",
    "Ioannis G. Stratis"
  ],
  "submission_date": "2023-07-31T05:18:26+00:00",
  "revised_dates": [],
  "abstract": "The question of whether features and behaviors that are characteristic to completely integrable systems persist in the transition to non-integrable settings is a central one in the field of nonlinear dispersive equations. In this work, we investigate this topic in the context of focusing nonlinear Schrödinger (NLS) equations. In particular, we consider non-integrable counterparts of the (integrable) focusing cubic NLS equation, which are distinct generalizations of cubic NLS and involve a broad class of nonlinearities, with the cases of power and saturable nonlinearities serving as illustrative examples. This is a notably different direction from the one explored in other works, where the non-integrable models considered are only small perturbations of the integrable one. We study the Cauchy problem on the real line for both vanishing and non-vanishing boundary conditions at infinity and quantify the proximity of solutions between the integrable and non-integrable models via estimates in appropriate metrics as well as pointwise. These results establish that the distance of solutions grows at most linearly with respect to time, while the growth rate of each solution is chiefly controlled by the size of the initial data and the nonlinearity parameters. A major implication of these closeness estimates is that integrable dynamics emerging from small initial conditions may persist in the non-integrable setting for significantly long times. In the case of zero boundary conditions at infinity, this persistence includes soliton and soliton collision dynamics, while in the case of nonzero boundary conditions at infinity, it establishes the nonlinear behavior of the non-integrable models at the early stages of the ubiquitous phenomenon of modulational instability. For this latter and more challenging type of boundary conditions, ... (full abstract in article)",
  "categories": [
    "nlin.PS",
    "math-ph",
    "math.AP",
    "physics.flu-dyn",
    "physics.optics"
  ],
  "primary_category": "nlin.PS",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16408",
  "pdf_url": "https://arxiv.org/pdf/2307.16408v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 5887032,
  "size_after_bytes": 202198
}