{
  "title": "Controlled tempering of lipid concentration and microbubble shrinkage as a possible mechanism for fine-tuning microbubble size and shell properties",
  "authors": [
    "Intesar O. Zalloum",
    "Amin Jafari Sojahrood",
    "Ali A. Paknahad",
    "Michael C. Kolios",
    "Scott S. H. Tsai",
    "Raffi Karshafian"
  ],
  "submission_date": "2023-07-25T22:21:01+00:00",
  "revised_dates": [],
  "abstract": "The acoustic response of microbubbles (MBs) depends on their resonance frequency, which is dependent on MB size and shell properties. Monodisperse MBs with tunable shell properties are thus desirable for optimizing and controlling MB behavior in acoustics applications. By utilizing a novel microfluidic method that uses lipid concentration to control MB shrinkage, we generate monodisperse MBs of four different initial diameters at three lipid concentrations (5.6, 10.0, and 16.0 mg/mL) in the aqueous phase. Following shrinkage, we measure MB resonance frequency and determine its shell stiffness and viscosity. The study demonstrates that we can generate monodisperse MBs of specific sizes and tunable shell properties by controlling MB initial diameter and aqueous phase lipid concentration. Our results indicate that the resonance frequency increases by 180-210% with increasing lipid concentration (from 5.6 to 16.0 mg/mL) while bubble diameter is kept constant. Results depict that the resonance frequency increases by ~195% with increasing lipid concentration from 5.6 to 16.0 mg/mL, for ~11 um final diameter MBs. Additionally, we find that the resonance frequency decreases by ~275% with increasing MB final diameter from 5 to 12um, when we use a lipid concentration of 5.6 mg/mL. We also determine that MB shell viscosity and stiffness increase with increasing lipid concentration and MB final diameter, and the level of change depends on the degree of shrinkage experienced by MB. Specifically, we find that by increasing the concentration of lipids from 5.6 to 16.0 mg/mL, the shell stiffness and viscosity of ~11 um final diameter MBs increase by ~400% and ~200 %, respectively. This study demonstrates the feasibility of fine-tuning the MB acoustic response to ultrasound by tailoring MB initial diameter and lipid concentration.",
  "categories": [
    "physics.app-ph",
    "cond-mat.soft",
    "physics.flu-dyn"
  ],
  "primary_category": "physics.app-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13836",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}