{
  "title": "Navigating the Web of Misinformation: A Framework for Misinformation Domain Detection Using Browser Traffic",
  "authors": [
    "Mayana Pereira",
    "Kevin Greene",
    "Nilima Pisharody",
    "Rahul Dodhia",
    "Jacob N. Shapiro",
    "Juan Lavista"
  ],
  "submission_date": "2023-07-24T23:59:10+00:00",
  "revised_dates": [],
  "abstract": "The proliferation of misinformation and propaganda is a global challenge, with profound effects during major crises such as the COVID-19 pandemic and the Russian invasion of Ukraine. Understanding the spread of misinformation and its social impacts requires identifying the news sources spreading false information. While machine learning (ML) techniques have been proposed to address this issue, ML models have failed to provide an efficient implementation scenario that yields useful results. In prior research, the precision of deployment in real traffic deteriorates significantly, experiencing a decrement up to ten times compared to the results derived from benchmark data sets. Our research addresses this gap by proposing a graph-based approach to capture navigational patterns and generate traffic-based features which are used to train a classification model. These navigational and traffic-based features result in classifiers that present outstanding performance when evaluated against real traffic. Moreover, we also propose graph-based filtering techniques to filter out models to be classified by our framework. These filtering techniques increase the signal-to-noise ratio of the models to be classified, greatly reducing false positives and the computational cost of deploying the model. Our proposed framework for the detection of misinformation domains achieves a precision of 0.78 when evaluated in real traffic. This outcome represents an improvement factor of over ten times over those achieved in previous studies.",
  "categories": [
    "cs.SI"
  ],
  "primary_category": "cs.SI",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13180",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1512927,
  "size_after_bytes": 119541
}