{
  "title": "Large amplitude dust-acoustic solitary waves and double layers in nonthermal warm complex plasmas",
  "authors": [
    "N. Alam",
    "A. Mannan",
    "A. A. Mamun"
  ],
  "submission_date": "2023-07-31T13:13:54+00:00",
  "revised_dates": [],
  "abstract": "Using a Sagdeev pseudopotential approach where the nonlinear structures are stationary in a comoving frame, the arbitrary or large amplitude dust-acoustic solitary waves and double layers have been studied in dusty plasmas containing warm positively charged dust and nonthermal distributed electrons and ions. Depending on the values of the critical Mach number, which varies with the plasma parameter, both supersonic and subsonic dust-acoustic solitary waves are found. It is found that our plasma system under consideration supports both positive and negative supersonic solitary waves, and only positive subsonic solitary waves and negative double layers. The parametric regimes for the existence of subsonic and supersonic dust-acoustic waves and how the polarity of solitary waves changes with plasma parameters are shown. It is observed that the solitary waves and double layers solution exist at the values of Mach number around its critical Mach number. The basic properties (amplitude, width, speed, etc.) of the solitary pulses and double layers are significantly modified by the plasma parameters (viz. ion to positive dust number density ratio, ion to electron temperature ratio, nonthermal parameter, positive dust temperature to ion temperature ratio, etc.). The applications of our present work in space environments (viz. cometary tails, Earth's mesosphere, Jupiter's magnetosphere, etc.) and laboratory devices, where nonthermal ions and electrons species along with positively charged dust species have been observed, are briefly discussed.",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16635",
  "pdf_url": "https://arxiv.org/pdf/2307.16635v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 254927,
  "size_after_bytes": 37119
}