{
  "title": "BubbleML: A Multi-Physics Dataset and Benchmarks for Machine Learning",
  "authors": [
    "Sheikh Md Shakeel Hassan",
    "Arthur Feeney",
    "Akash Dhruv",
    "Jihoon Kim",
    "Youngjoon Suh",
    "Jaiyoung Ryu",
    "Yoonjin Won",
    "Aparna Chandramowlishwaran"
  ],
  "submission_date": "2023-07-27T04:47:05+00:00",
  "revised_dates": [
    "2023-08-25T03:17:29+00:00"
  ],
  "abstract": "In the field of phase change phenomena, the lack of accessible and diverse datasets suitable for machine learning (ML) training poses a significant challenge. Existing experimental datasets are often restricted, with limited availability and sparse ground truth data, impeding our understanding of this complex multiphysics phenomena. To bridge this gap, we present the BubbleML Dataset \\footnote{\\label{git_dataset}\\url{https://github.com/HPCForge/BubbleML}} which leverages physics-driven simulations to provide accurate ground truth information for various boiling scenarios, encompassing nucleate pool boiling, flow boiling, and sub-cooled boiling. This extensive dataset covers a wide range of parameters, including varying gravity conditions, flow rates, sub-cooling levels, and wall superheat, comprising 79 simulations. BubbleML is validated against experimental observations and trends, establishing it as an invaluable resource for ML research. Furthermore, we showcase its potential to facilitate exploration of diverse downstream tasks by introducing two benchmarks: (a) optical flow analysis to capture bubble dynamics, and (b) operator networks for learning temperature dynamics. The BubbleML dataset and its benchmarks serve as a catalyst for advancements in ML-driven research on multiphysics phase change phenomena, enabling the development and comparison of state-of-the-art techniques and models.",
  "categories": [
    "cs.LG",
    "cs.AI",
    "cs.CE",
    "cs.DC"
  ],
  "primary_category": "cs.LG",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14623",
  "pdf_url": "https://arxiv.org/pdf/2307.14623v2",
  "comment": "Submitted to Neurips Datasets and Benchmarks Track 2023",
  "num_versions": null,
  "size_before_bytes": 11574365,
  "size_after_bytes": 241419
}