{
  "title": "The Subtle Effects of Mergers on Star Formation in Nearby Galaxies",
  "authors": [
    "Yang A. Li",
    "Luis C. Ho",
    "Jinyi Shangguan"
  ],
  "submission_date": "2023-07-25T12:41:27+00:00",
  "revised_dates": [],
  "abstract": "Interactions and mergers play an important role in regulating the physical properties of galaxies, such as their morphology, gas content, and star formation rate (SFR). Controversy exists as to the degree to which these events, even gas-rich major mergers, enhance star formation activity. We study merger pairs selected from a sample of massive ($M_* \\ge 10^{10}\\,M_\\odot$), low-redshift ($z = 0.01-0.11$) galaxies located in the Stripe 82 region of the Sloan Digital Sky Survey, using stellar masses, SFRs, and total dust masses derived from a new set of uniformly measured panchromatic photometry and spectral energy distribution analysis. The dust masses, when converted to equivalent total atomic and molecular hydrogen, probe gas masses as low as $\\sim 10^{8.5}\\,M_\\odot$. Our measurements delineate a bimodal distribution on the $M_{\\rm gas}-M_*$ plane: the gas-rich, star-forming galaxies that trace the well-studied gas mass main sequence, and passive galaxies that occupy a distinct, gas-poor regime. These two populations, in turn, map into a bimodal distribution on the relation between SFR and gas mass surface density. Among low-redshift galaxies, galaxy mergers, including those that involve gas-rich and nearly equal-mass galaxies, exert a minimal impact on their SFR, specific SFR, or star formation efficiency. Starbursts are rare. The star formation efficiency of gas-rich, minor mergers even appears suppressed. This study stresses the multiple, complex factors that influence the evolution of the gas and its ability to form stars in mergers.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.3847/1538-4357/acdddb",
  "journal_ref": null,
  "arxiv_id": "2307.13462",
  "pdf_url": null,
  "comment": "19 pages, 9 figures",
  "num_versions": null,
  "size_before_bytes": 1087661,
  "size_after_bytes": 354998
}