{
  "title": "Decoding ChatGPT: A Taxonomy of Existing Research, Current Challenges, and Possible Future Directions",
  "authors": [
    "Shahab Saquib Sohail",
    "Faiza Farhat",
    "Yassine Himeur",
    "Mohammad Nadeem",
    "Dag Øivind Madsen",
    "Yashbir Singh",
    "Shadi Atalla",
    "Wathiq Mansoor"
  ],
  "submission_date": "2023-07-26T11:10:04+00:00",
  "revised_dates": [
    "2023-08-28T00:13:03+00:00"
  ],
  "abstract": "Chat Generative Pre-trained Transformer (ChatGPT) has gained significant interest and attention since its launch in November 2022. It has shown impressive performance in various domains, including passing exams and creative writing. However, challenges and concerns related to biases and trust persist. In this work, we present a comprehensive review of over 100 Scopus-indexed publications on ChatGPT, aiming to provide a taxonomy of ChatGPT research and explore its applications. We critically analyze the existing literature, identifying common approaches employed in the studies. Additionally, we investigate diverse application areas where ChatGPT has found utility, such as healthcare, marketing and financial services, software engineering, academic and scientific writing, research and education, environmental science, and natural language processing. Through examining these applications, we gain valuable insights into the potential of ChatGPT in addressing real-world challenges. We also discuss crucial issues related to ChatGPT, including biases and trustworthiness, emphasizing the need for further research and development in these areas. Furthermore, we identify potential future directions for ChatGPT research, proposing solutions to current challenges and speculating on expected advancements. By fully leveraging the capabilities of ChatGPT, we can unlock its potential across various domains, leading to advancements in conversational AI and transformative impacts in society.",
  "categories": [
    "cs.CL",
    "cs.CY"
  ],
  "primary_category": "cs.CL",
  "doi": "10.1016/j.jksuci.2023.101675",
  "journal_ref": "Journal of King Saud University - Computer and Information Science 2023",
  "arxiv_id": "2307.14107",
  "pdf_url": null,
  "comment": "31 pages. 8 figures and 3 tables",
  "num_versions": null,
  "size_before_bytes": 6943754,
  "size_after_bytes": 366542
}