{
  "title": "Canonical Typicality For Other Ensembles Than Micro-Canonical",
  "authors": [
    "Stefan Teufel",
    "Roderich Tumulka",
    "Cornelia Vogel"
  ],
  "submission_date": "2023-07-28T15:31:59+00:00",
  "revised_dates": [
    "2023-10-02T11:48:58+00:00",
    "2024-01-10T08:40:22+00:00",
    "2024-05-30T11:04:28+00:00"
  ],
  "abstract": "We generalize Lévy's lemma, a concentration-of-measure result for the uniform probability distribution on high-dimensional spheres, to a much more general class of measures, so-called GAP measures. For any given density matrix $ρ$ on a separable Hilbert space $\\mathcal{H}$, GAP$(ρ)$ is the most spread out probability measure on the unit sphere of $\\mathcal{H}$ that has density matrix $ρ$ and thus forms the natural generalization of the uniform distribution. We prove concentration-of-measure whenever the largest eigenvalue $\\|ρ\\|$ of $ρ$ is small. We use this fact to generalize and improve well-known and important typicality results of quantum statistical mechanics to GAP measures, namely canonical typicality and dynamical typicality. Canonical typicality is the statement that for ``most'' pure states $ψ$ of a given ensemble, the reduced density matrix of a sufficiently small subsystem is very close to a $ψ$-independent matrix. Dynamical typicality is the statement that for any observable and any unitary time-evolution, for ``most'' pure states $ψ$ from a given ensemble the (coarse-grained) Born distribution of that observable in the time-evolved state $ψ_t$ is very close to a $ψ$-independent distribution. So far, canonical typicality and dynamical typicality were known for the uniform distribution on finite-dimensional spheres, corresponding to the micro-canonical ensemble, and for rather special mean-value ensembles. Our result shows that these typicality results hold also for GAP$(ρ)$, provided the density matrix $ρ$ has small eigenvalues. Since certain GAP measures are quantum analogs of the canonical ensemble of classical mechanics, our results can also be regarded as a version of equivalence of ensembles.",
  "categories": [
    "math-ph",
    "quant-ph"
  ],
  "primary_category": "math-ph",
  "doi": "10.1007/s00023-024-01466-7",
  "journal_ref": "Annales Henri Poincaré 26: 1477-1518 (2025)",
  "arxiv_id": "2307.15624",
  "pdf_url": "https://arxiv.org/pdf/2307.15624v4",
  "comment": "44 pages LaTeX, no figures; v4 minor improvements throughout the paper",
  "num_versions": null,
  "size_before_bytes": 502109,
  "size_after_bytes": 507213
}