{
  "title": "Social Optimum Equilibrium Selection for Distributed Multi-Agent Optimization",
  "authors": [
    "Duong Nguyen",
    "Langford White",
    "Hung Nguyen"
  ],
  "submission_date": "2023-07-25T04:11:22+00:00",
  "revised_dates": [],
  "abstract": "We study the open question of how players learn to play a social optimum pure-strategy Nash equilibrium (PSNE) through repeated interactions in general-sum coordination games. A social optimum of a game is the stable Pareto-optimal state that provides a maximum return in the sum of all players' payoffs (social welfare) and always exists. We consider finite repeated games where each player only has access to its own utility (or payoff) function but is able to exchange information with other players. We develop a novel regret matching (RM) based algorithm for computing an efficient PSNE solution that could approach a desired Pareto-optimal outcome yielding the highest social welfare among all the attainable equilibria in the long run. Our proposed learning procedure follows the regret minimization framework but extends it in three major ways: (1) agents use global, instead of local, utility for calculating regrets, (2) each agent maintains a small and diminishing exploration probability in order to explore various PSNEs, and (3) agents stay with the actions that achieve the best global utility thus far, regardless of regrets. We prove that these three extensions enable the algorithm to select the stable social optimum equilibrium instead of converging to an arbitrary or cyclic equilibrium as in the conventional RM approach. We demonstrate the effectiveness of our approach through a set of applications in multi-agent distributed control, including a large-scale resource allocation game and a hard combinatorial task assignment problem for which no efficient (polynomial) solution exists.",
  "categories": [
    "cs.GT"
  ],
  "primary_category": "cs.GT",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13242",
  "pdf_url": null,
  "comment": "Appears at the 5th Games, Agents, and Incentives Workshop (GAIW 2023). Held as part of the Workshops at the AAMAS 2023 Conference",
  "num_versions": null,
  "size_before_bytes": 1283280,
  "size_after_bytes": 288438
}