{
  "title": "Remote Bio-Sensing: Open Source Benchmark Framework for Fair Evaluation of rPPG",
  "authors": [
    "Dae-Yeol Kim",
    "Eunsu Goh",
    "KwangKee Lee",
    "JongEui Chae",
    "JongHyeon Mun",
    "Junyeong Na",
    "Chae-bong Sohn",
    "Do-Yup Kim"
  ],
  "submission_date": "2023-07-24T09:35:47+00:00",
  "revised_dates": [
    "2023-08-21T00:47:31+00:00"
  ],
  "abstract": "rPPG (Remote photoplethysmography) is a technology that measures and analyzes BVP (Blood Volume Pulse) by using the light absorption characteristics of hemoglobin captured through a camera. Analyzing the measured BVP can derive various physiological signals such as heart rate, stress level, and blood pressure, which can be applied to various applications such as telemedicine, remote patient monitoring, and early prediction of cardiovascular disease. rPPG is rapidly evolving and attracting great attention from both academia and industry by providing great usability and convenience as it can measure biosignals using a camera-equipped device without medical or wearable devices. Despite extensive efforts and advances in this field, serious challenges remain, including issues related to skin color, camera characteristics, ambient lighting, and other sources of noise and artifacts, which degrade accuracy performance. We argue that fair and evaluable benchmarking is urgently required to overcome these challenges and make meaningful progress from both academic and commercial perspectives. In most existing work, models are trained, tested, and validated only on limited datasets. Even worse, some studies lack available code or reproducibility, making it difficult to fairly evaluate and compare performance. Therefore, the purpose of this study is to provide a benchmarking framework to evaluate various rPPG techniques across a wide range of datasets for fair evaluation and comparison, including both conventional non-deep neural network (non-DNN) and deep neural network (DNN) methods. GitHub URL: https://github.com/remotebiosensing/rppg",
  "categories": [
    "eess.IV",
    "cs.AI",
    "cs.CV",
    "cs.LG",
    "eess.SP"
  ],
  "primary_category": "eess.IV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12644",
  "pdf_url": null,
  "comment": "20 pages, 10 figures",
  "num_versions": null,
  "size_before_bytes": 10823632,
  "size_after_bytes": 3012667
}