{
  "title": "Designing thermoplasmonic polymersomes for photothermal therapy",
  "authors": [
    "Valentino Barbieri",
    "Javier González-Colsa",
    "Diana Matias",
    "Aroa Duro-Castano",
    "Anshu Thapa",
    "Lorena Ruiz-Perez",
    "Pablo Albella",
    "Giorgio Volpe",
    "Giuseppe Battaglia"
  ],
  "submission_date": "2023-07-30T08:19:00+00:00",
  "revised_dates": [],
  "abstract": "Polymersomes, vesicles self-assembled from amphiphilic polymers, are promising nanocarriers for the targeted intracellular delivery of therapeutics. Integrating inorganic light-absorbing materials with plasmonic properties, such as gold, into their membrane by in situ synthesis is a stepping stone to enable their use for photothermal therapy. Yet, it still needs to be determined whether the in situ synthesis of gold can produce polymersomes with thermoplasmonic properties without altering their morphology, stability, and nanocarrier functionality. Here we demonstrate that small gold nanoparticles can be controllably nucleated within biocompatible block-copolymer membranes to design hybrid polymersomes with a noteworthy thermoplasmonic response. The cumulative absorption of individual 2 nm gold nanoparticles can induce temperature increases in 10 K in dilute suspensions of hybrid polymersomes upon laser illumination. Furthermore, we develop a theoretical model to rationalize our observations and predict the thermoplasmonic response of our hybrid polymersomes. We finally demonstrate in vitro photothermal therapy of cancer cells, enhanced by the receptor-mediated endocytosis of our hybrid polymersomes. We envision that our nanotechnological platform can be translated to phenotypic cell targeting to precisely deliver effective photothermal agents.",
  "categories": [
    "cond-mat.soft",
    "cond-mat.mtrl-sci",
    "physics.bio-ph"
  ],
  "primary_category": "cond-mat.soft",
  "doi": "10.1021/acsnano.4c14093",
  "journal_ref": null,
  "arxiv_id": "2307.16165",
  "pdf_url": "https://arxiv.org/pdf/2307.16165v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 2059992,
  "size_after_bytes": 1224414
}