{
  "title": "5d SCFTs and their non-supersymmetric cousins",
  "authors": [
    "Mohammad Akhond",
    "Masazumi Honda",
    "Francesco Mignosa"
  ],
  "submission_date": "2023-07-25T18:00:00+00:00",
  "revised_dates": [
    "2023-08-03T00:12:14+00:00",
    "2023-10-18T00:20:39+00:00",
    "2023-10-20T00:14:22+00:00",
    "2023-12-18T01:11:45+00:00",
    "2024-01-31T14:34:45+00:00"
  ],
  "abstract": "We consider generalisations of the recently proposed supersymmetry breaking deformation of the 5d rank-1 $E_1$ superconformal field theory to higher rank. We generalise the arguments to theories which admit a mass deformation leading to gauge theories coupled to matter hypermultiplets at low energies. These theories have a richer space of non-supersymmetric deformations, due to the existence of a larger global symmetry. We show that there is a one-to-one correspondence between the non-SUSY deformations of the gauge theory and their $(p,q)$ 5-brane web. We comment on the (in)stability of these deformations both from the gauge theory and the 5-brane web point of view. UV duality plays a key role in our analysis, fixing the effective Chern-Simons level for the background vector multiplets, together with their complete prepotential. We partially classify super-Yang-Mills theories known to enjoy UV dualities which show a phase transition where different phases are separated by a jump of Chern-Simons levels of both a perturbative and an instantonic global symmetry. When this transition can be reached by turning on a non-supersymmetric deformation of the UV superconformal field theory, it can be a good candidate to host a 5d non-supersymmetric CFT. We also discuss consistency of the proposed phase diagram with the 't Hooft anomalies of the models that we analyse.",
  "categories": [
    "hep-th"
  ],
  "primary_category": "hep-th",
  "doi": "10.21468/SciPostPhys.16.1.036",
  "journal_ref": "SciPost Phys. 16, 036 (2024)",
  "arxiv_id": "2307.13724",
  "pdf_url": null,
  "comment": "Minor revision",
  "num_versions": null,
  "size_before_bytes": 1354055,
  "size_after_bytes": 1283545
}