{
  "title": "Astrometry in crowded fields towards the Galactic Bulge",
  "authors": [
    "Alonso Luna",
    "Tommaso Marchetti",
    "Marina Rejkuba",
    "Dante Minniti",
    "."
  ],
  "submission_date": "2023-07-25T17:45:37+00:00",
  "revised_dates": [],
  "abstract": "The astrometry towards the Galactic Bulge is hampered by high stellar crowding and patchy extinction. This effect is particularly severe for optical surveys such as Gaia. In this study, we assess the consistency of proper motions (PMs) between optical (Gaia DR3) and near-infrared (VIRAC2) catalogues in comparison with PMs measured with the Hubble Space Telescope (HST) in several crowded fields towards the Galactic Bulge and in Galactic globular clusters. Assuming that the PMs are well characterised, the uncertainty-normalised PM differences between pairs of catalogues are expected to follow a normal distribution. A deviation from a normal distribution defines the inflation factor $r$. Multiplying the PM uncertainties by $r$ brings the Gaia (VIRAC2) PMs into a $1σ$ agreement with HST PMs. The factor $r$ has a dependence on stellar surface density and for the brightest stars in our sample (G<18), there is a strong dependence on G-band magnitude. Assuming that the HST PMs are well determined and free from systematic errors, we find that Gaia DR3 PM uncertainties are better characterised, having r<1.5, in fields under 200 Gaia DR3 sources per arcmin$^2$, and are underestimated by up to a factor of 4 in fields with more than 300 Gaia DR3 sources per arcmin$^2$. For the most crowded fields in VIRAC2, the PM uncertainties are underestimated by a factor of 1.1 up to 1.5, with a dependence on J-band magnitude. In all fields, the brighter sources have the larger $r$ value. At the faint end (G>19), $r$ is close to 1, meaning that the PMs already fully agree with the HST measurements within $1σ$. In the crowded fields with both catalogues in common, VIRAC2 PMs agree with HST PMs and do not need an inflation factor for their uncertainties. Given the depth and completeness of VIRAC2 in such fields, it is an ideal complement to Gaia DR3 for proper motion studies towards the Galactic Bulge.",
  "categories": [
    "astro-ph.GA",
    "astro-ph.IM",
    "astro-ph.SR"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.1051/0004-6361/202346257",
  "journal_ref": "A&A 677, A185 (2023)",
  "arxiv_id": "2307.13719",
  "pdf_url": null,
  "comment": "Accepted for publication in A&A. 11 pages (+6 in Appendix), 9 figures (+18 in Appendix), 4 tables",
  "num_versions": null,
  "size_before_bytes": 2827975,
  "size_after_bytes": 96601
}