{
  "title": "Identifying Lyα emitter candidates with Random Forest: learning from galaxies in CANDELS survey",
  "authors": [
    "L. Napolitano",
    "L. Pentericci",
    "A. Calabrò",
    "P. Santini",
    "M. Castellano",
    "P. Cassata",
    "J. P. U. Fynbo",
    "I. Jung",
    "D. Kashino",
    "S. Mascia",
    "M. Mignoli"
  ],
  "submission_date": "2023-07-21T18:00:05+00:00",
  "revised_dates": [],
  "abstract": "The physical processes which make a galaxy a Lyman Alpha Emitter have been extensively studied for the past 25 years. However, the correlations between physical and morphological properties of galaxies and the strength of the Ly$α$ emission line are still highly debated. Therefore, we investigate the correlations between the rest-frame Ly$α$ equivalent width and stellar mass, star formation rate, dust reddening, metallicity, age, half-light semi-major axis, Sérsic index and projected axis ratio in a sample of 1578 galaxies in the redshift range $2 \\leq z \\leq 7.9$ from the GOODS-S, UDS and COSMOS fields. From the large sample of Ly$α$ emitters (LAEs) in the dataset we find that LAEs are typically common main sequence star forming galaxies which show stellar mass $ \\leq 10^9 \\text{M}_{\\odot}$, star formation rate $ \\leq 10^{0.5} \\text{M}_{\\odot}/\\text{yr}$, $E(B-V) \\leq 0.2$ and half-light semi-major axis $\\leq 1 \\text{kpc}$. Building on these findings we develop a new method based on Random Forest (i.e. a Machine Learning classifier) in order to select galaxies which have the highest probability of being Ly$α$ emitters. When applied to a population in the redshift range $z \\in [2.5, 4.5]$, our classifier holds a $(80 \\pm 2)\\%$ accuracy and $(73 \\pm 4)\\%$ precision. At higher redshifts ($z \\in [4.5, 6]$), we obtain a $73\\%$ accuracy and a $80\\%$ precision. These results highlight it is possible to overcome the current limitations in assembling large samples of LAEs by making informed predictions that can be used for planning future large scale spectroscopic surveys.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.1051/0004-6361/202347026",
  "journal_ref": "A&A 677, A138 (2023)",
  "arxiv_id": "2307.11818",
  "pdf_url": null,
  "comment": "Accepted for publication in the 4. Extragalactic astronomy section of Astronomy & Astrophysics, 13 pages, 13 figures",
  "num_versions": null,
  "size_before_bytes": 2703271,
  "size_after_bytes": 1135392
}