{
  "title": "Weak production of $η$ mesons induced by $ν_μ(\\barν_μ)$ at MicroBooNE energies",
  "authors": [
    "A. Fatima",
    "M. Sajjad Athar",
    "S. K. Singh"
  ],
  "submission_date": "2023-07-24T11:02:15+00:00",
  "revised_dates": [
    "2023-09-22T00:23:31+00:00"
  ],
  "abstract": "We have studied neutral and charged current (anti)neutrino induced $η$ production off the free nucleon target at MicroBooNE energies, in the light of recent results reported by the MicroBooNE collaboration for the total $η$ production cross section. This study has been made using a theoretical model in which the weak hadronic current receives contribution from the nonresonant Born terms as well as from the resonance excitations. The Born terms are obtained using the SU(3) symmetric chiral model, used earlier in the study of $K-$meson production. The contribution from the resonance terms is considered from the excitation of five nucleon resonances viz. $S_{11}(1535)$, $S_{11}(1650)$, $P_{11}(1710)$, $P_{11}(1880)$, and $S_{11}(1895)$. To fix the parameters of the vector current interaction, this model is first used to study the electromagnetic production of $η$ mesons induced by real and virtual photons, and the theoretical results have been compared with the data from the MAINZ and JLab experiments. The partially conserved axial-vector current hypothesis and generalized Goldberger-Treiman relation are used to fix the parameters of the axial-vector current interaction. The results are presented for the total cross section for the neutral and charged current induced $η$ production, ratio of the cross sections for the charged current to neutral current, MicroBooNE flux averaged cross section $\\langle σ\\rangle$, $\\left \\langle \\frac{dσ}{dQ^2} \\right\\rangle$ and $\\left\\langle \\frac{dσ}{dp_η} \\right\\rangle$, which may be useful in the future analysis of MicroBooNE as well as other accelerator and atmospheric neutrino experiments being performed in the ${\\cal O}$(1)~GeV energy region.",
  "categories": [
    "hep-ph",
    "hep-ex"
  ],
  "primary_category": "hep-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12686",
  "pdf_url": null,
  "comment": "Physical Review D (in press). arXiv admin note: substantial text overlap with arXiv:2211.08830",
  "num_versions": null,
  "size_before_bytes": 1642466,
  "size_after_bytes": 143459
}