{
  "title": "Evaluating the Ripple Effects of Knowledge Editing in Language Models",
  "authors": [
    "Roi Cohen",
    "Eden Biran",
    "Ori Yoran",
    "Amir Globerson",
    "Mor Geva"
  ],
  "submission_date": "2023-07-24T17:52:46+00:00",
  "revised_dates": [
    "2023-12-21T01:43:41+00:00"
  ],
  "abstract": "Modern language models capture a large body of factual knowledge. However, some facts can be incorrectly induced or become obsolete over time, resulting in factually incorrect generations. This has led to the development of various editing methods that allow updating facts encoded by the model. Evaluation of these methods has primarily focused on testing whether an individual fact has been successfully injected, and if similar predictions for other subjects have not changed. Here we argue that such evaluation is limited, since injecting one fact (e.g. ``Jack Depp is the son of Johnny Depp'') introduces a ``ripple effect'' in the form of additional facts that the model needs to update (e.g.``Jack Depp is the sibling of Lily-Rose Depp''). To address this issue, we propose a novel set of evaluation criteria that consider the implications of an edit on related facts. Using these criteria, we then construct RippleEdits, a diagnostic benchmark of 5K factual edits, capturing a variety of types of ripple effects. We evaluate prominent editing methods on RippleEdits, showing that current methods fail to introduce consistent changes in the model's knowledge. In addition, we find that a simple in-context editing baseline obtains the best scores on our benchmark, suggesting a promising research direction for model editing.",
  "categories": [
    "cs.CL"
  ],
  "primary_category": "cs.CL",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12976",
  "pdf_url": null,
  "comment": "Accepted for publication in Transactions of the Association for Computational Linguistics (TACL), 2024. Author's final version",
  "num_versions": null,
  "size_before_bytes": 2777006,
  "size_after_bytes": 457388
}