{
  "title": "First results from the JWST Early Release Science Program Q3D: Powerful quasar-driven galactic scale outflow at $z=3$",
  "authors": [
    "Andrey Vayner",
    "Nadia L. Zakamska",
    "Yuzo Ishikawa",
    "Swetha Sankar",
    "Dominika Wylezalek",
    "David S. N. Rupke",
    "Sylvain Veilleux",
    "Caroline Bertemes",
    "Jorge K. Barrera-Ballesteros",
    "Hsiao-Wen Chen",
    "Nadiia Diachenko",
    "Andy D. Goulding",
    "Jenny E. Greene",
    "Kevin N. Hainline",
    "Fred Hamann",
    "Timothy Heckman",
    "Sean D. Johnson",
    "Hui Xian Grace Lim",
    "Weizhe Liu",
    "Dieter Lutz",
    "Nora Lutzgendorf",
    "Vincenzo Mainieri",
    "Ryan McCrory",
    "Grey Murphree",
    "Nicole P. H. Nesvadba",
    "Patrick Ogle",
    "Eckhard Sturm",
    "Lillian Whitesell"
  ],
  "submission_date": "2023-07-25T18:20:17+00:00",
  "revised_dates": [],
  "abstract": "Quasar-driven galactic outflows are a major driver of the evolution of massive galaxies. We report observations of a powerful galactic-scale outflow in a $z=3$ extremely red, intrinsically luminous ($L_{\\rm bol}\\simeq 5\\times 10^{47}$erg s$^{-1}$) quasar SDSSJ1652+1728 with the Near Infrared Spectrograph (NIRSpec) on board JWST. We analyze the kinematics of rest-frame optical emission lines and identify the quasar-driven outflow extending out to $\\sim 10$ kpc from the quasar with a velocity offset of ($v_{r}=\\pm 500$ km s$^{-1}$) and high velocity dispersion (FWHM$=700-2400$ km s$^{-1}$). Due to JWST's unprecedented surface brightness sensitivity in the near-infrared -- we unambiguously show that the powerful high velocity outflow in an extremely red quasar (ERQ) encompasses a large swath of the host galaxy's interstellar medium (ISM). Using the kinematics and dynamics of optical emission lines, we estimate the mass outflow rate -- in the warm ionized phase alone -- to be at least $2300\\pm1400$ $M_{\\odot}$ yr$^{-1}$. We measure a momentum flux ratio between the outflow and the quasar accretion disk of $\\sim$1 on kpc scale, indicating that the outflow was likely driven in a relatively high ($>10^{23}$cm$^{-2}$) column density environment through radiation pressure on dust grains. We find a coupling efficiency between the bolometric luminosity of the quasar and the outflow of 0.1$\\%$, matching the theoretical prediction of the minimum coupling efficiency necessary for negative quasar feedback. The outflow has sufficient energetics to drive the observed turbulence seen in shocked regions of the quasar host galaxy, likely directly responsible for prolonging the time it takes for gas to cool efficiently.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13751",
  "pdf_url": null,
  "comment": "14 pages, 7 figures, 1 table, submitted for publication in ApJ",
  "num_versions": null,
  "size_before_bytes": 4550261,
  "size_after_bytes": 1535855
}