{
  "title": "Approximation and Generalization Capacities of Parametrized Quantum Circuits for Functions in Sobolev Spaces",
  "authors": [
    "Alberto Manzano",
    "David Dechant",
    "Jordi Tura",
    "Vedran Dunjko"
  ],
  "submission_date": "2023-07-27T11:43:08+00:00",
  "revised_dates": [
    "2023-11-07T14:17:27+00:00",
    "2025-03-05T16:31:10+00:00"
  ],
  "abstract": "Parametrized quantum circuits (PQC) are quantum circuits which consist of both fixed and parametrized gates. In recent approaches to quantum machine learning (QML), PQCs are essentially ubiquitous and play the role analogous to classical neural networks. They are used to learn various types of data, with an underlying expectation that if the PQC is made sufficiently deep, and the data plentiful, the generalization error will vanish, and the model will capture the essential features of the distribution. While there exist results proving the approximability of square-integrable functions by PQCs under the $L^2$ distance, the approximation for other function spaces and under other distances has been less explored. In this work we show that PQCs can approximate the space of continuous functions, $p$-integrable functions and the $H^k$ Sobolev spaces under specific distances. Moreover, we develop generalization bounds that connect different function spaces and distances. These results provide a theoretical basis for different applications of PQCs, for example for solving differential equations. Furthermore, they provide us with new insight on the role of the data normalization in PQCs and of loss functions which better suit the specific needs of the users.",
  "categories": [
    "quant-ph"
  ],
  "primary_category": "quant-ph",
  "doi": "10.22331/q-2025-03-10-1658",
  "journal_ref": "Quantum 9, 1658 (2025)",
  "arxiv_id": "2307.14792",
  "pdf_url": "https://arxiv.org/pdf/2307.14792v3",
  "comment": "21 pages, 5 figures",
  "num_versions": null,
  "size_before_bytes": 577023,
  "size_after_bytes": 543882
}