{
  "title": "Equilibrium Condensation from Chondritic Porous IDP Enriched Vapor: Implications for Mercury and Enstatite Chondrite Origins",
  "authors": [
    "Denton S. Ebel",
    "Conel M. O'D. Alexander"
  ],
  "submission_date": "2023-07-28T18:41:31+00:00",
  "revised_dates": [],
  "abstract": "The origin of Mercury's anomalous core and low FeO surface mineralogy are outstanding questions in planetary science. Mercury's composition may result from cosmochemical controls on the precursor solids that accreted to form Mercury. High temperatures and enrichment in solid condensates are likely conditions near the midplane of the inner solar protoplanetary disk. Silicate liquids similar to the liquids quenched in ferromagnesian chondrules are thermodynamically stable in oxygen-rich systems that are highly enriched in dust of CI-chondrite composition. In contrast, the solids surviving into the orbit of Mercury's accretion zone were probably similar to highly unequilibrated, anhydrous, interstellar organic- and presolar grain-bearing chondritic, porous interplanetary dust particles (C-IDPs). Chemical systems enriched in an assumed C-IDP composition dust produce condensates (solid + liquid assemblages in equilibrium with vapor) with super-chondritic atomic Fe/Si ratios at high temperatures, approaching 50% of that estimated for bulk Mercury. Sulfur behaves as a refractory element, but at lower temperatures, in these chemical systems. Stable minerals are FeO-poor, and include CaS and MgS, species found in enstatite chondrites. Disk gradients in volatile compositions of planetary and asteroidal precursors can explain Mercury's anomalous composition, as well as enstatite chondrite and aubrite parent body compositions. This model predicts high sulfur content, and very low FeO content of Mercury's surface rocks.",
  "categories": [
    "astro-ph.EP"
  ],
  "primary_category": "astro-ph.EP",
  "doi": "10.1016/j.pss.2011.07.017",
  "journal_ref": "Planetary and Space Sciences 59: 1888-1894 (2011)",
  "arxiv_id": "2307.15763",
  "pdf_url": "https://arxiv.org/pdf/2307.15763v1",
  "comment": "17 pages, 5 figures, 1 table",
  "num_versions": null,
  "size_before_bytes": 273898,
  "size_after_bytes": 169429
}