{
  "title": "Thermo-mechanical level-set topology optimization of a load carrying battery pack for electric aircraft",
  "authors": [
    "Alexandre T. R. Guibert",
    "Murtaza Bookwala",
    "Ashley Cronk",
    "Y. Shirley Meng",
    "H. Alicia Kim"
  ],
  "submission_date": "2023-07-31T09:37:23+00:00",
  "revised_dates": [],
  "abstract": "A persistent challenge with the development of electric vertical take-off and landing vehicles (eVTOL) to meet flight power and energy demands is the mass of the load and thermal management systems for batteries. One possible strategy to overcome this problem is to employ optimization techniques to obtain a lightweight battery pack while satisfying structural and thermal requirements. In this work, a structural battery pack with high-energy-density cylindrical cells is optimized using the level-set topology optimization method. The heat generated by the batteries is predicted using a high-fidelity electrochemical model for a given eVTOL flight profile. The worst-case scenario for the battery's heat generation is then considered as a source term in the weakly coupled steady-state thermomechanical finite element model used for optimization. The objective of the optimization problem is to minimize the weighted sum of thermal compliance and structural compliance subjected to a volume constraint. The methodology is demonstrated with numerical examples for different sets of weights. The optimized results due to different weights are compared, discussed, and evaluated with thermal and structural performance indicators. The optimized pack topologies are subjected to a transient thermal finite element analysis to assess the battery pack's thermal response.",
  "categories": [
    "math.OC",
    "math.AP"
  ],
  "primary_category": "math.OC",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16521",
  "pdf_url": "https://arxiv.org/pdf/2307.16521v1",
  "comment": "AeroBest 2023 II ECCOMAS Thematic Conference on Multidisciplinary Design Optimization of Aerospace Systems",
  "num_versions": null,
  "size_before_bytes": 1692805,
  "size_after_bytes": 74326
}