{
  "title": "A flexible class of priors for orthonormal matrices with basis function-specific structure",
  "authors": [
    "Joshua S. North",
    "Mark D. Risser",
    "F. Jay Breidt"
  ],
  "submission_date": "2023-07-25T16:28:28+00:00",
  "revised_dates": [
    "2024-05-27T00:03:15+00:00"
  ],
  "abstract": "Statistical modeling of high-dimensional matrix-valued data motivates the use of a low-rank representation that simultaneously summarizes key characteristics of the data and enables dimension reduction. Low-rank representations commonly factor the original data into the product of orthonormal basis functions and weights, where each basis function represents an independent feature of the data. However, the basis functions in these factorizations are typically computed using algorithmic methods that cannot quantify uncertainty or account for basis function correlation structure a priori. While there exist Bayesian methods that allow for a common correlation structure across basis functions, empirical examples motivate the need for basis function-specific dependence structure. We propose a prior distribution for orthonormal matrices that can explicitly model basis function-specific structure. The prior is used within a general probabilistic model for singular value decomposition to conduct posterior inference on the basis functions while accounting for measurement error and fixed effects. We discuss how the prior specification can be used for various scenarios and demonstrate favorable model properties through synthetic data examples. Finally, we apply our method to two-meter air temperature data from the Pacific Northwest, enhancing our understanding of the Earth system's internal variability.",
  "categories": [
    "stat.ME"
  ],
  "primary_category": "stat.ME",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13627",
  "pdf_url": null,
  "comment": "43 pages, 14 figures",
  "num_versions": null,
  "size_before_bytes": 21158101,
  "size_after_bytes": 308328
}