{
  "title": "An Intent Taxonomy of Legal Case Retrieval",
  "authors": [
    "Yunqiu Shao",
    "Haitao Li",
    "Yueyue Wu",
    "Yiqun Liu",
    "Qingyao Ai",
    "Jiaxin Mao",
    "Yixiao Ma",
    "Shaoping Ma"
  ],
  "submission_date": "2023-07-25T07:27:32+00:00",
  "revised_dates": [],
  "abstract": "Legal case retrieval is a special Information Retrieval~(IR) task focusing on legal case documents. Depending on the downstream tasks of the retrieved case documents, users' information needs in legal case retrieval could be significantly different from those in Web search and traditional ad-hoc retrieval tasks. While there are several studies that retrieve legal cases based on text similarity, the underlying search intents of legal retrieval users, as shown in this paper, are more complicated than that yet mostly unexplored. To this end, we present a novel hierarchical intent taxonomy of legal case retrieval. It consists of five intent types categorized by three criteria, i.e., search for Particular Case(s), Characterization, Penalty, Procedure, and Interest. The taxonomy was constructed transparently and evaluated extensively through interviews, editorial user studies, and query log analysis. Through a laboratory user study, we reveal significant differences in user behavior and satisfaction under different search intents in legal case retrieval. Furthermore, we apply the proposed taxonomy to various downstream legal retrieval tasks, e.g., result ranking and satisfaction prediction, and demonstrate its effectiveness. Our work provides important insights into the understanding of user intents in legal case retrieval and potentially leads to better retrieval techniques in the legal domain, such as intent-aware ranking strategies and evaluation methodologies.",
  "categories": [
    "cs.IR",
    "cs.CL"
  ],
  "primary_category": "cs.IR",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13298",
  "pdf_url": null,
  "comment": "28 pages, work in process",
  "num_versions": null,
  "size_before_bytes": 2360950,
  "size_after_bytes": 458148
}