{
  "title": "Train Once, Use Flexibly: A Modular Framework for Multi-Aspect Neural News Recommendation",
  "authors": [
    "Andreea Iana",
    "Goran Glavaš",
    "Heiko Paulheim"
  ],
  "submission_date": "2023-07-29T22:40:59+00:00",
  "revised_dates": [
    "2024-04-16T14:33:21+00:00",
    "2024-09-20T17:53:41+00:00"
  ],
  "abstract": "Recent neural news recommenders (NNRs) extend content-based recommendation (1) by aligning additional aspects (e.g., topic, sentiment) between candidate news and user history or (2) by diversifying recommendations w.r.t. these aspects. This customization is achieved by ``hardcoding`` additional constraints into the NNR's architecture and/or training objectives: any change in the desired recommendation behavior thus requires retraining the model with a modified objective. This impedes widespread adoption of multi-aspect news recommenders. In this work, we introduce MANNeR, a modular framework for multi-aspect neural news recommendation that supports on-the-fly customization over individual aspects at inference time. With metric-based learning as its backbone, MANNeR learns aspect-specialized news encoders and then flexibly and linearly combines the resulting aspect-specific similarity scores into different ranking functions, alleviating the need for ranking function-specific retraining of the model. Extensive experimental results show that MANNeR consistently outperforms state-of-the-art NNRs on both standard content-based recommendation and single- and multi-aspect customization. Lastly, we validate that MANNeR's aspect-customization module is robust to language and domain transfer.",
  "categories": [
    "cs.IR"
  ],
  "primary_category": "cs.IR",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16089",
  "pdf_url": "https://arxiv.org/pdf/2307.16089v3",
  "comment": "Accepted at the 2024 Conference on Empirical Methods in Natural Language Processing (EMNLP 2024)",
  "num_versions": null,
  "size_before_bytes": 37663666,
  "size_after_bytes": 655481
}