{
  "title": "Minimal chaotic models from the Volterra gyrostat",
  "authors": [
    "Ashwin K Seshadri",
    "S Lakshmivarahan"
  ],
  "submission_date": "2023-07-23T14:12:42+00:00",
  "revised_dates": [
    "2023-10-19T00:15:32+00:00"
  ],
  "abstract": "Low-order models obtained through Galerkin projection of several physically important systems (e.g., Rayleigh-Bénard convection, mid-latitude quasi-geostrophic dynamics, and vorticity dynamics) appear in the form of coupled gyrostats. Forced dissipative chaos is an important phenomenon in these models, and this paper introduces and identifies 'minimal chaotic models' (MCMs), in the sense of having the fewest external forcing and linear dissipation terms, for the class of models arising from an underlying gyrostat core. The identification of MCMs reveals common conditions for chaos across a wide variety of physical systems. It is shown here that a critical distinction is whether the gyrostat core (without forcing or dissipation) conserves energy, depending on whether the sum of the quadratic coefficients is zero. The paper demonstrates that, for the energy-conserving condition of the gyrostat core, the requirement of a characteristic pair of fixed points that repel the chaotic flow dictates placement of forcing and dissipation in the minimal chaotic models. In contrast if the core does not conserve energy, the forcing can be arranged in additional ways for chaos to appear in the subclasses where linear feedbacks render fewer invariants in the gyrostat core. In all cases, the linear mode must experience dissipation for chaos to arise. The Volterra gyrostat presents a clear example where the arrangement of fixed points circumscribes more complex dynamics.",
  "categories": [
    "physics.flu-dyn",
    "math.DS",
    "nlin.CD",
    "physics.ao-ph"
  ],
  "primary_category": "physics.flu-dyn",
  "doi": "10.1016/j.physd.2023.133948",
  "journal_ref": null,
  "arxiv_id": "2307.12337",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 4628661,
  "size_after_bytes": 296772
}