{
  "title": "The Fagnano Triangle Patrolling Problem",
  "authors": [
    "Konstantinos Georgiou",
    "Somnath Kundu",
    "Pawel Pralat"
  ],
  "submission_date": "2023-07-24T22:39:39+00:00",
  "revised_dates": [
    "2024-04-16T01:04:28+00:00",
    "2025-02-10T01:12:52+00:00",
    "2025-07-01T00:28:00+00:00",
    "2025-07-22T01:24:03+00:00",
    "2025-10-01T13:32:34+00:00"
  ],
  "abstract": "We investigate a combinatorial optimization problem that involves patrolling the edges of an acute triangle using a unit-speed agent. The goal is to minimize the maximum (1-gap) idle time of any edge, which is defined as the time gap between consecutive visits to that edge. This problem has roots in a centuries-old optimization problem posed by Fagnano in 1775, who sought to determine the inscribed triangle of an acute triangle with the minimum perimeter. It is well-known that the orthic triangle, giving rise to a periodic and cyclic trajectory obeying the laws of geometric optics, is the optimal solution to Fagnano's problem. Such trajectories are known as Fagnano orbits, or more generally as billiard trajectories. We demonstrate that the orthic triangle is also an optimal solution to the patrolling problem.\n  Our main contributions pertain to new connections between billiard trajectories and optimal patrolling schedules in combinatorial optimization. In particular, as an artifact of our arguments, we introduce a novel 2-gap patrolling problem that seeks to minimize the visitation time of objects every three visits. We prove that there exist infinitely many well-structured billiard-type optimal trajectories for this problem, including the orthic trajectory, which has the special property of minimizing the visitation time gap between any two consecutively visited edges. Complementary to that, we also examine the cost of dynamic, sub-optimal trajectories to the 1-gap patrolling optimization problem. These trajectories result from a greedy algorithm and can be implemented by a computationally primitive mobile agent.",
  "categories": [
    "cs.DM"
  ],
  "primary_category": "cs.DM",
  "doi": "10.46298/dmtcs.13421",
  "journal_ref": "Discrete Mathematics & Theoretical Computer Science, vol. 27:3, Discrete Algorithms (September 25, 2025) dmtcs:13421",
  "arxiv_id": "2307.13153",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1439384,
  "size_after_bytes": 777843
}