{
  "title": "Analog programming of CMOS-compatible Al$_2$O$_3$/TiO$_\\textrm{2-x}$ memristor at 4.2 K after metal-insulator transition suppression by cryogenic reforming",
  "authors": [
    "Pierre-Antoine Mouny",
    "Raphaël Dawant",
    "Bastien Galaup",
    "Serge Ecoffey",
    "Michel Pioro-Ladrière",
    "Yann Beilliard",
    "Dominique Drouin"
  ],
  "submission_date": "2023-07-28T13:03:05+00:00",
  "revised_dates": [],
  "abstract": "The exploration of memristors' behavior at cryogenic temperatures has become crucial due to the growing interest in quantum computing and cryogenic electronics. In this context, our study focuses on the characterization at cryogenic temperatures (4.2 K) of TiO$_\\textrm{2-x}$-based memristors fabricated with a CMOS-compatible etch-back process. We demonstrate a so-called cryogenic reforming (CR) technique performed at 4.2 K to overcome the well-known metal-insulator transition (MIT) which limits the analog behavior of memristors at low temperatures. This cryogenic reforming process was found to be reproducible and led to a durable suppression of the MIT. This process allowed to reduce by approximately 20% the voltages required to perform DC resistive switching at 4.2 K. Additionally, conduction mechanism studies of memristors before and after cryogenic reforming from 4.2 K to 300 K revealed different behaviors above 100 K, indicating a potential change in the conductive filament stoichiometry. The reformed devices exhibit a conductance level that is 50 times higher than ambient-formed memristor, and the conduction drop between 300 K and 4.2 K is 100 times smaller, indicating the effectiveness of the reforming process. More importantly, CR enables analog programming at 4.2 K with typical read voltages. Suppressing the MIT improved the analog switching dynamics of the memristor leading to approximately 250% larger on/off ratios during long-term depression (LTD)/long-term potentiation (LTP) resistance tuning. This enhancement opens up the possibility of using TiO$_{\\textrm{2-x}}$-based memristors to be used as synapses in neuromorphic computing at cryogenic temperatures.",
  "categories": [
    "physics.app-ph",
    "cs.ET"
  ],
  "primary_category": "physics.app-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15538",
  "pdf_url": "https://arxiv.org/pdf/2307.15538v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 2653440,
  "size_after_bytes": 863561
}