{
  "title": "A Schrödinger Equation for Evolutionary Dynamics",
  "authors": [
    "Vi D. Ao",
    "Duy V. Tran",
    "Kien T. Pham",
    "Duc M. Nguyen",
    "Huy D. Tran",
    "Tuan K. Do",
    "Van H. Do",
    "Trung V. Phan"
  ],
  "submission_date": "2023-07-29T18:17:28+00:00",
  "revised_dates": [
    "2023-09-01T01:46:13+00:00"
  ],
  "abstract": "We establish an analogy between the Fokker-Planck equation describing evolutionary landscape dynamics and the Schrödinger equation which characterizes quantum mechanical particles, showing how a population with multiple genetic traits evolves analogously to a wavefunction under a multi-dimensional energy potential in imaginary time. Furthermore, we discover within this analogy that the stationary population distribution on the landscape corresponds exactly to the ground-state wavefunction. This mathematical equivalence grants entry to a wide range of analytical tools developed by the quantum mechanics community, such as the Rayleigh-Ritz variational method and the Rayleigh-Schrödinger perturbation theory, allowing us to not only make reasonable quantitative assessments but also explore fundamental biological inquiries. We demonstrate the effectiveness of these tools by estimating the population success on landscapes where precise answers are elusive, and unveiling the ecological consequences of stress-induced mutagenesis -- a prevalent evolutionary mechanism in pathogenic and neoplastic systems. We show that, even in a unchanging environment, a sharp mutational burst resulting from stress can always be advantageous, while a gradual increase only enhances population size when the number of relevant evolving traits is limited. Our interdisciplinary approach offers novel insights, opening up new avenues for deeper understanding and predictive capability regarding the complex dynamics of evolving populations.",
  "categories": [
    "q-bio.PE",
    "physics.bio-ph"
  ],
  "primary_category": "q-bio.PE",
  "doi": "10.3390/quantum5040042",
  "journal_ref": "Quantum Rep. 2023, 5(4), 659-682",
  "arxiv_id": "2307.16044",
  "pdf_url": "https://arxiv.org/pdf/2307.16044v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 2015327,
  "size_after_bytes": 203627
}