{
  "title": "Physics-Informed Neural Networks for Parametric Compressible Euler Equations",
  "authors": [
    "Simon Wassing",
    "Stefan Langer",
    "Philipp Bekemeyer"
  ],
  "submission_date": "2023-07-26T08:53:38+00:00",
  "revised_dates": [
    "2024-01-30T01:42:32+00:00"
  ],
  "abstract": "The numerical approximation of solutions to the compressible Euler and Navier-Stokes equations is a crucial but challenging task with relevance in various fields of science and engineering. Recently, methods from deep learning have been successfully employed for solving partial differential equations by incorporating the equations into a loss function that is minimized during the training of a neural network. This approach yields a so-called physics-informed neural network. It is not based upon classical discretizations, such as finite-volume or finite-element schemes, and can even address parametric problems in a straightforward manner. This has raised the question, whether physics-informed neural networks may be a viable alternative to conventional methods for computational fluid dynamics. In this article we introduce an adaptive artificial viscosity reduction procedure for physics-informed neural networks enabling approximate parametric solutions for forward problems governed by the stationary two-dimensional Euler equations in sub- and supersonic conditions. To the best of our knowledge, this is the first time that the concept of artificial viscosity in physics-informed neural networks is successfully applied to a complex system of conservation laws in more than one dimension. Moreover, we highlight the unique ability of this method to solve forward problems in a continuous parameter space. The presented methodology takes the next step of bringing physics-informed neural networks closer towards realistic compressible flow applications.",
  "categories": [
    "physics.flu-dyn",
    "physics.comp-ph"
  ],
  "primary_category": "physics.flu-dyn",
  "doi": "10.1016/j.compfluid.2023.106164",
  "journal_ref": "C.&Fl. 270 (2024)",
  "arxiv_id": "2307.14045",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 52280043,
  "size_after_bytes": 205110
}