{
  "title": "Unsupervised Deep Learning-based Pansharpening with Jointly-Enhanced Spectral and Spatial Fidelity",
  "authors": [
    "Matteo Ciotola",
    "Giovanni Poggi",
    "Giuseppe Scarpa"
  ],
  "submission_date": "2023-07-26T17:25:28+00:00",
  "revised_dates": [],
  "abstract": "In latest years, deep learning has gained a leading role in the pansharpening of multiresolution images. Given the lack of ground truth data, most deep learning-based methods carry out supervised training in a reduced-resolution domain. However, models trained on downsized images tend to perform poorly on high-resolution target images. For this reason, several research groups are now turning to unsupervised training in the full-resolution domain, through the definition of appropriate loss functions and training paradigms. In this context, we have recently proposed a full-resolution training framework which can be applied to many existing architectures.\n  Here, we propose a new deep learning-based pansharpening model that fully exploits the potential of this approach and provides cutting-edge performance. Besides architectural improvements with respect to previous work, such as the use of residual attention modules, the proposed model features a novel loss function that jointly promotes the spectral and spatial quality of the pansharpened data. In addition, thanks to a new fine-tuning strategy, it improves inference-time adaptation to target images. Experiments on a large variety of test images, performed in challenging scenarios, demonstrate that the proposed method compares favorably with the state of the art both in terms of numerical results and visual output. Code is available online at https://github.com/matciotola/Lambda-PNN.",
  "categories": [
    "eess.IV",
    "cs.AI",
    "cs.CV",
    "cs.LG"
  ],
  "primary_category": "eess.IV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14403",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 7298144,
  "size_after_bytes": 1800425
}