{
  "title": "$ \\mathrm{Sr}_{4}\\mathrm{Al}_{2}\\mathrm{O}_{7}$: A New Sacrificial Layer with High Water Dissolution Rate for the Synthesis of Freestanding Oxide Membranes",
  "authors": [
    "Leyan Nian",
    "Haoying Sun",
    "Zhichao Wang",
    "Duo Xu",
    "Hao Bo",
    "Shengjun",
    "Yan",
    "Yueying Li",
    "Jian Zhou",
    "Yu Deng",
    "Yufeng Hao",
    "Yuefeng Nie"
  ],
  "submission_date": "2023-07-27T02:06:18+00:00",
  "revised_dates": [],
  "abstract": "Freestanding perovskite oxide membranes have drawn great attention recently since they offer exceptional structural tunability and stacking ability, providing new opportunities in fundamental research and potential device applications in silicon-based semiconductor technology. Among different types of sacrificial layers, the $ \\mathrm{(Ca, Sr, Ba)}_{3}\\mathrm{Al}_{2}\\mathrm{O}_{6}$ compounds are most widely used since they can be dissolved in water and prepare high-quality perovskite oxide membranes with clean and sharp surfaces and interfaces. However, the typical transfer process takes a long time (up to hours) in obtaining millimeter-size freestanding membranes, let alone realize wafer-scale samples with high yield. Here, we introduce a new member of the $ \\mathrm{SrO-}\\mathrm{Al}_{2}\\mathrm{O}_{3}$ family,$ \\mathrm{Sr}_{4}\\mathrm{Al}_{2}\\mathrm{O}_{7},$, and demonstrate its high dissolution rate, about 10 times higher than that of $ \\mathrm{Sr}_{3}\\mathrm{Al}_{2}\\mathrm{O}_{6}$. The high-dissolution-rate of $ \\mathrm{Sr}_{4}\\mathrm{Al}_{2}\\mathrm{O}_{7}$ is most likely related to the more discrete Al-O networks and higher concentration of water-soluble Sr-O species in this compound. Our work significantly facilitates the preparation of freestanding membranes and sheds light on the integration of multifunctional perovskite oxides in practical electronic devices.",
  "categories": [
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14584",
  "pdf_url": "https://arxiv.org/pdf/2307.14584v1",
  "comment": "11 pages,4 figures",
  "num_versions": null,
  "size_before_bytes": 967286,
  "size_after_bytes": 562375
}