{
  "title": "Proximal Galerkin: A structure-preserving finite element method for pointwise bound constraints",
  "authors": [
    "Brendan Keith",
    "Thomas M. Surowiec"
  ],
  "submission_date": "2023-07-23T22:12:20+00:00",
  "revised_dates": [
    "2023-07-27T00:23:26+00:00",
    "2023-09-04T00:21:50+00:00",
    "2023-10-20T00:05:46+00:00",
    "2023-10-26T00:04:52+00:00",
    "2024-08-16T00:34:44+00:00",
    "2024-12-18T02:06:07+00:00"
  ],
  "abstract": "The proximal Galerkin finite element method is a high-order, low-iteration complexity, nonlinear numerical method that preserves the geometric and algebraic structure of point-wise bound constraints in infinite-dimensional function spaces. This paper introduces the proximal Galerkin method and applies it to solve free boundary problems, enforce discrete maximum principles, and develop a scalable, mesh-independent algorithm for optimal design with pointwise bound constraints. This paper also introduces the latent variable proximal point (LVPP) algorithm, from which the proximal Galerkin method derives.\n  When analyzing the classical obstacle problem, we discover that the underlying variational inequality can be replaced by a sequence of second-order partial differential equations (PDEs) that are readily discretized and solved with, e.g., the proximal Galerkin method. Throughout this work, we arrive at several contributions that may be of independent interest. These include (1) a semilinear PDE we refer to as the entropic Poisson equation; (2) an algebraic/geometric connection between high-order positivity-preserving discretizations and certain infinite-dimensional Lie groups; and (3) a gradient-based, bound-preserving algorithm for two-field, density-based topology optimization. The complete proximal Galerkin methodology combines ideas from nonlinear programming, functional analysis, tropical algebra, and differential geometry and can potentially lead to new synergies among these areas as well as within variational and numerical analysis. This work is accompanied by open-source implementations of our methods to facilitate reproduction and broader adoption.",
  "categories": [
    "math.NA",
    "math.OC"
  ],
  "primary_category": "math.NA",
  "doi": "10.1007/s10208-024-09681-8",
  "journal_ref": "Found. Comput. Math. (2024)",
  "arxiv_id": "2307.12444",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 125236015,
  "size_after_bytes": 3651247
}