{
  "title": "A Constraint Enforcement Deep Reinforcement Learning Framework for Optimal Energy Storage Systems Dispatch",
  "authors": [
    "Shengren Hou",
    "Edgar Mauricio Salazar Duque",
    "Peter Palensky",
    "Pedro P. Vergara"
  ],
  "submission_date": "2023-07-26T17:12:04+00:00",
  "revised_dates": [],
  "abstract": "The optimal dispatch of energy storage systems (ESSs) presents formidable challenges due to the uncertainty introduced by fluctuations in dynamic prices, demand consumption, and renewable-based energy generation. By exploiting the generalization capabilities of deep neural networks (DNNs), deep reinforcement learning (DRL) algorithms can learn good-quality control models that adaptively respond to distribution networks' stochastic nature. However, current DRL algorithms lack the capabilities to enforce operational constraints strictly, often even providing unfeasible control actions. To address this issue, we propose a DRL framework that effectively handles continuous action spaces while strictly enforcing the environments and action space operational constraints during online operation. Firstly, the proposed framework trains an action-value function modeled using DNNs. Subsequently, this action-value function is formulated as a mixed-integer programming (MIP) formulation enabling the consideration of the environment's operational constraints. Comprehensive numerical simulations show the superior performance of the proposed MIP-DRL framework, effectively enforcing all constraints while delivering high-quality dispatch decisions when compared with state-of-the-art DRL algorithms and the optimal solution obtained with a perfect forecast of the stochastic variables.",
  "categories": [
    "eess.SY",
    "cs.LG",
    "math.OC"
  ],
  "primary_category": "eess.SY",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14304",
  "pdf_url": null,
  "comment": "This paper has been submitted to a publication in a journal. This corresponds to the submitted version. After acceptance, it may be removed depending on the journal's requirements for copyright",
  "num_versions": null,
  "size_before_bytes": 4124717,
  "size_after_bytes": 113784
}