{
  "title": "Constraints on dark matter and astrophysics from tomographic $γ$-ray cross-correlations",
  "authors": [
    "Anya Paopiamsap",
    "David Alonso",
    "Deaglan J. Bartlett",
    "Maciej Bilicki"
  ],
  "submission_date": "2023-07-27T14:11:53+00:00",
  "revised_dates": [
    "2024-05-09T14:34:48+00:00"
  ],
  "abstract": "We study the cross-correlation between maps of the unresolved $γ$-ray background constructed from the 12-year data release of the Fermi Large-Area Telescope, and the overdensity of galaxies in the redshift range $z\\lesssim0.4$ as measured by the 2MASS Photometric Redshift survey and the WISE-SuperCOSMOS photometric survey. A signal is detected at the $8-10σ$ level, which we interpret in terms of both astrophysical $γ$-ray sources, and WIMP dark matter decay and annihilation. The sensitivity achieved allows us to characterise the energy and redshift dependence of the signal, and we show that the latter is incompatible with a pure dark matter origin. We thus use our measurement to place an upper bound on the WIMP decay rate and the annihilation cross-section, finding constraints that are competitive with those found in other analyses. Our analysis is based on the extraction of clean model-independent observables that can then be used to constrain arbitrary astrophysical and particle physics models. In this sense we produce measurements of the $γ$-ray emissivity as a function of redshift and rest-frame energy $ε$, and of a quantity $F(ε)$ encapsulating all WIMP parameters relevant for dark matter decay or annihilation. We make these measurements, together with a full account of their statistical uncertainties, publicly available.",
  "categories": [
    "astro-ph.CO",
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.CO",
  "doi": "10.1103/PhysRevD.109.103517",
  "journal_ref": null,
  "arxiv_id": "2307.14881",
  "pdf_url": "https://arxiv.org/pdf/2307.14881v2",
  "comment": "27 pages, 13 figures. Data and code available in https://github.com/anyabua/FermiX",
  "num_versions": null,
  "size_before_bytes": 6016410,
  "size_after_bytes": 1041611
}