{
  "title": "Weyl-invariant scalar-tensor gravities from purely metric theories",
  "authors": [
    "Giorgos Anastasiou",
    "Ignacio J. Araya",
    "Avik Chakraborty"
  ],
  "submission_date": "2023-07-25T14:26:23+00:00",
  "revised_dates": [
    "2023-09-21T00:07:17+00:00",
    "2023-12-12T01:10:47+00:00"
  ],
  "abstract": "We describe a method to generate scalar-tensor theories with Weyl symmetry, starting from arbitrary purely metric higher derivative gravity theories. The method consists in the definition of a conformally-invariant metric $\\hat{g}_{μν}$, that is a rank (0,2)-tensor constructed out of the metric tensor and the scalar field. This new object has zero conformal weight and is given by $φ^{2/Δ}g_{μν}$, where ($-Δ$) is the conformal dimension of the scalar. As $g_{μν}$ has conformal dimension of 2, the resulting tensor is trivially a conformal invariant. Then, the generated scalar-tensor theory, which we call the Weyl uplift of the original purely metric theory, is obtained by replacing the metric by $\\hat{g}_{μν}$ in the action that defines the original theory. This prescription allowed us to define the Weyl uplift of theories with terms of higher order in the Riemannian curvature. Furthermore, the prescription for scalar-tensor theories coming from terms that have explicit covariant derivatives in the Lagrangian is discussed. The same mechanism can also be used for the derivation of the equations of motion of the scalar-tensor theory from the original field equations in the Einstein frame. Applying this method of Weyl uplift allowed us to reproduce the known result for the conformal scalar coupling to Lovelock gravity and to derive that of Einsteinian cubic gravity. Finally, we show that the renormalization of the theory given by the conformal scalar coupling to Einstein-Anti-de Sitter gravity originates from the Weyl uplift of the original renormalized theory, which is relevant in the framework of conformal renormalization.",
  "categories": [
    "hep-th",
    "gr-qc"
  ],
  "primary_category": "hep-th",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13531",
  "pdf_url": null,
  "comment": "20 pages, typos fixed",
  "num_versions": null,
  "size_before_bytes": 560714,
  "size_after_bytes": 562479
}