{
  "title": "End-to-end Remote Sensing Change Detection of Unregistered Bi-temporal Images for Natural Disasters",
  "authors": [
    "Guiqin Zhao",
    "Lianlei Shan",
    "Weiqiang Wang"
  ],
  "submission_date": "2023-07-27T18:04:45+00:00",
  "revised_dates": [
    "2023-08-16T13:15:03+00:00"
  ],
  "abstract": "Change detection based on remote sensing images has been a prominent area of interest in the field of remote sensing. Deep networks have demonstrated significant success in detecting changes in bi-temporal remote sensing images and have found applications in various fields. Given the degradation of natural environments and the frequent occurrence of natural disasters, accurately and swiftly identifying damaged buildings in disaster-stricken areas through remote sensing images holds immense significance. This paper aims to investigate change detection specifically for natural disasters. Considering that existing public datasets used in change detection research are registered, which does not align with the practical scenario where bi-temporal images are not matched, this paper introduces an unregistered end-to-end change detection synthetic dataset called xBD-E2ECD. Furthermore, we propose an end-to-end change detection network named E2ECDNet, which takes an unregistered bi-temporal image pair as input and simultaneously generates the flow field prediction result and the change detection prediction result. It is worth noting that our E2ECDNet also supports change detection for registered image pairs, as registration can be seen as a special case of non-registration. Additionally, this paper redefines the criteria for correctly predicting a positive case and introduces neighborhood-based change detection evaluation metrics. The experimental results have demonstrated significant improvements.",
  "categories": [
    "cs.CV"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15128",
  "pdf_url": "https://arxiv.org/pdf/2307.15128v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1024412,
  "size_after_bytes": 98814
}