{
  "title": "A fundamental plane of black hole accretion at millimetre wavelengths",
  "authors": [
    "Ilaria Ruffa",
    "Timothy A. Davis",
    "Jacob S. Elford",
    "Martin Bureau",
    "Michele Cappellari",
    "Jindra Gensior",
    "Daryl Haggard",
    "Satoru Iguchi",
    "Federico Lelli",
    "Fu-Heng Liang",
    "Lijie Liu",
    "Marc Sarzi",
    "Thomas G. Williams",
    "Hengyue Zhang"
  ],
  "submission_date": "2023-07-26T00:24:59+00:00",
  "revised_dates": [
    "2023-11-07T01:49:51+00:00"
  ],
  "abstract": "We report the discovery of the ``mm fundamental plane of black-hole accretion'', which is a tight correlation between the nuclear 1 mm luminosity ($L_{\\rm ν, mm}$), the intrinsic $2$ -- $10$~keV X-ray luminosity ($L_{\\rm X,2-10}$) and the supermassive black hole (SMBH) mass ($M_{\\rm BH}$) with an intrinsic scatter ($σ_{\\rm int}$) of $0.40$ dex. The plane is found for a sample of 48 nearby galaxies, most of which are low-luminosity active galactic nuclei (LLAGN). Combining these sources with a sample of high-luminosity (quasar-like) nearby AGN, we find that the plane still holds. We also find that $M_{\\rm BH}$ correlates with $L_{\\rm ν, mm}$ at a highly significant level, although such correlation is less tight than the mm fundamental plane ($σ_{\\rm int}=0.51$ dex). Crucially, we show that spectral energy distribution (SED) models for both advection-dominated accretion flows (ADAFs) and compact jets can explain the existence of these relations, which are not reproduced by the standard torus-thin accretion disc models usually associated to quasar-like AGN. The ADAF models reproduces the observed relations somewhat better than those for compact jets, although neither provides a perfect prediction. Our findings thus suggest that radiatively-inefficient accretion processes such as those in ADAFs or compact (and thus possibly young) jets may play a key role in both low- and high-luminosity AGN. This mm fundamental plane also offers a new, rapid method to (indirectly) estimate SMBH masses.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13872",
  "pdf_url": null,
  "comment": "9 pages, 5 figures",
  "num_versions": null,
  "size_before_bytes": 1783495,
  "size_after_bytes": 1346703
}