{
  "title": "Thermodynamic Topology and Photon Spheres in the Hyperscaling violating black holes",
  "authors": [
    "Jafar Sadeghi",
    "Mohammad Ali S. Afshar",
    "Saeed Noori Gashti",
    "Mohammad Reza Alipour"
  ],
  "submission_date": "2023-07-24T15:13:04+00:00",
  "revised_dates": [
    "2023-12-27T01:42:42+00:00"
  ],
  "abstract": "It was shown that a standard ring of light can be imagined outside the event horizon for stationary rotating four-dimensional black holes with axial symmetry using the topological method\\cite{001,002}. Based on this concept, in this paper, we investigate the topological charge and the conditions of existence of the photon sphere (PS) for a hyperscaling violation (HSV) black hole with various values of the parameters of this model. Then, after carrying out a detailed analysis, we show the conventional topological classes viz $Q=-1$ for the mentioned black hole and $Q=0$ for the naked singularities. \\textit{Also, we propose a new topological class for naked singularities (Q=+1) with respect to $z\\geq1$. We also determined that $z\\geq2$, it either shows a naked singularity form with total topological charge $+1$ or has no solution. Therefore, we have the black hole solution only in $1\\leq z<2$}. Then, we will use two different methods, namely the temperature (Duan's topological current $Φ$-mapping theory) and the generalized Helmholtz free energy method, to study the topological classes of our black hole. We discuss the critical and zero points (topological charges and topological numbers) for different parameters of hyperscaling violating black holes, such as ($z, \\overlineθ$) and other free parameters, and study their thermodynamic topology. We observe that for a given value of the parameters $1\\leq z<2$, $\\overlineθ$, and other free parameters, there exist two total topological charges $(Q_{total}=-1, 0)$ with the same phase structure for the $T$ method and total topological numbers $(W=+1)$ for the generalized Helmholtz free energy method. Additionally, we summarize the results for each study as photon sphere, temperature, and generalized Helmholtz free energy in some figures and tables. Finally, we compare our findings with other related studies in the literature.",
  "categories": [
    "gr-qc",
    "hep-th"
  ],
  "primary_category": "gr-qc",
  "doi": "10.1016/j.astropartphys.2023.102920",
  "journal_ref": "Astropart.Phys. 156 (2024) 102920",
  "arxiv_id": "2307.12873",
  "pdf_url": null,
  "comment": "40 pages, 21 figures and 12 tables. Accepted for publication in Astroparticle Physics",
  "num_versions": null,
  "size_before_bytes": 10185264,
  "size_after_bytes": 141839
}