{
  "title": "Automotive Object Detection via Learning Sparse Events by Spiking Neurons",
  "authors": [
    "Hu Zhang",
    "Yanchen Li",
    "Luziwei Leng",
    "Kaiwei Che",
    "Qian Liu",
    "Qinghai Guo",
    "Jianxing Liao",
    "Ran Cheng"
  ],
  "submission_date": "2023-07-24T15:47:21+00:00",
  "revised_dates": [
    "2023-09-08T00:26:08+00:00",
    "2023-09-11T00:19:01+00:00",
    "2024-05-03T00:23:22+00:00",
    "2024-06-12T00:21:08+00:00"
  ],
  "abstract": "Event-based sensors, distinguished by their high temporal resolution of 1 $\\mathrmμ\\text{s}$ and a dynamic range of 120 $\\text{dB}$, stand out as ideal tools for deployment in fast-paced settings like vehicles and drones. Traditional object detection techniques that utilize Artificial Neural Networks (ANNs) face challenges due to the sparse and asynchronous nature of the events these sensors capture. In contrast, Spiking Neural Networks (SNNs) offer a promising alternative, providing a temporal representation that is inherently aligned with event-based data. This paper explores the unique membrane potential dynamics of SNNs and their ability to modulate sparse events. We introduce an innovative spike-triggered adaptive threshold mechanism designed for stable training. Building on these insights, we present a specialized spiking feature pyramid network (SpikeFPN) optimized for automotive event-based object detection. Comprehensive evaluations demonstrate that SpikeFPN surpasses both traditional SNNs and advanced ANNs enhanced with attention mechanisms. Evidently, SpikeFPN achieves a mean Average Precision (mAP) of 0.477 on the GEN1 Automotive Detection (GAD) benchmark dataset, marking significant increases over the selected SNN baselines. Moreover, the efficient design of SpikeFPN ensures robust performance while optimizing computational resources, attributed to its innate sparse computation capabilities. Source codes are publicly accessible at https://github.com/EMI-Group/spikefpn.",
  "categories": [
    "cs.CV"
  ],
  "primary_category": "cs.CV",
  "doi": "10.1109/TCDS.2024.3410371",
  "journal_ref": null,
  "arxiv_id": "2307.12900",
  "pdf_url": null,
  "comment": "IEEE Transactions on Cognitive and Developmental Systems",
  "num_versions": null,
  "size_before_bytes": 11513397,
  "size_after_bytes": 1098290
}