{
  "title": "Spin-orbit contribution to radiative losses for spinning binaries with aligned spins",
  "authors": [
    "Donato Bini",
    "Andrea Geralico",
    "Piero Rettegno"
  ],
  "submission_date": "2023-07-24T10:20:09+00:00",
  "revised_dates": [
    "2023-09-04T00:23:34+00:00"
  ],
  "abstract": "We compute the leading order contribution to radiative losses in the case of spinning binaries with aligned spins due to their spin-orbit interaction. The orbital average along hyperboliclike orbits is taken through an appropriate spin-orbit modification to the quasi-Keplerian parametrization for nonspinning bodies, which maintains the same functional form, but with spin-dependent orbital elements. We perform consistency checks with existing PN-based and PM-based results. In the former case, we compare our expressions for both radiated energy and angular momentum with those obtained in [JHEP \\textbf{04}, 154 (2022)] by applying the boundary-to-bound correspondence to known results for ellipticlike orbits, finding agreement. The linear momentum loss is instead newly computed here. In the latter case, we also find agreement with the low-velocity limit of recent calculations of the total radiated energy, angular momentum and linear momentum in the framework of an extension of the worldline quantum field theory approach to the classical scattering of spinning bodies at the leading post-Minkowskian order [Phys. Rev. Lett. \\textbf{128}, no.1, 011101 (2022), Phys. Rev. D \\textbf{106}, no.4, 044013 (2022)]. We get exact expressions of the radiative losses in terms of the orbital elements, even if they are at the leading post-Newtonian order, so that their expansion for large values of the eccentricity parameter (or equivalently of the impact parameter) provides higher-order terms in the corresponding post-Minkowskian expansion, which can be useful for future crosschecks of other approaches.",
  "categories": [
    "gr-qc"
  ],
  "primary_category": "gr-qc",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12670",
  "pdf_url": null,
  "comment": "10 pages, no figures, revtex macros; v2 minimal text modifications",
  "num_versions": null,
  "size_before_bytes": 109994,
  "size_after_bytes": 109996
}