{
  "title": "Electronic transport computation in thermoelectric materials: From ab initio scattering rates to nanostructures",
  "authors": [
    "Neophytos Neophytou",
    "Pankaj Priyadarshi",
    "Zhen Li",
    "Patrizio Graziosi"
  ],
  "submission_date": "2023-07-25T20:08:44+00:00",
  "revised_dates": [],
  "abstract": "Over the last two decades a plethora of new thermoelectric materials, their alloys, and their nanostructures were synthesized. The ZT figure of merit, which quantifies the thermoelectric efficiency of these materials increased from values of unity to values consistently beyond two across material families. At the same time, the ability to identify and optimize such materials, has stressed the need for advanced numerical tools for computing electronic transport in materials with arbitrary bandstructure complexity, multiple scattering mechanisms, and a large degree of nanostructuring. Many computational methods have been developed, the majority of which utilize the Boltzmann transport equation (BTE) formalism, spanning from fully ab initio to empirical treatment, with varying degree of computational expense and accuracy. In this paper we describe a suitable computational process that we have recently developed specifically for thermoelectric materials. The method consists of three independent software packages that we have developed and: 1) begins from ab initio calculation of the electron-phonon scattering rates, 2) to then be used within a Boltzmann transport simulator, and 3) calculated quantities from BTE are then passed on to a Monte Carlo simulator to examine electronic transport in highly nanostructured material configurations. The method we describe is computationally significantly advantageous compared to current fully ab initio and existing Monte Carlo methods, but with a similar degree of accuracy, thus making it truly enabling in understanding and assessing thermoelectric transport in complex band, nanostructured materials.",
  "categories": [
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": "10.1007/s10825-023-02075-z",
  "journal_ref": "Journal of Computational Electronics, 2023",
  "arxiv_id": "2307.13800",
  "pdf_url": null,
  "comment": "39 pages, 9 figures",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}