{
  "title": "Dissipation-enabled bosonic Hamiltonian learning via new information-propagation bounds",
  "authors": [
    "Tim Möbus",
    "Andreas Bluhm",
    "Matthias C. Caro",
    "Albert H. Werner",
    "Cambyse Rouzé"
  ],
  "submission_date": "2023-07-27T17:35:07+00:00",
  "revised_dates": [],
  "abstract": "Reliable quantum technology requires knowledge of the dynamics governing the underlying system. This problem of characterizing and benchmarking quantum devices or experiments in continuous time is referred to as the Hamiltonian learning problem. In contrast to multi-qubit systems, learning guarantees for the dynamics of bosonic systems have hitherto remained mostly unexplored. For $m$-mode Hamiltonians given as polynomials in annihilation and creation operators with modes arranged on a lattice, we establish a simple moment criterion in terms of the particle number operator which ensures that learning strategies from the finite-dimensional setting extend to the bosonic setting, requiring only coherent states and heterodyne detection on the experimental side. We then propose an enhanced procedure based on added dissipation that even works if the Hamiltonian time evolution violates this moment criterion: With high success probability it learns all coefficients of the Hamiltonian to accuracy $\\varepsilon$ using a total evolution time of $\\mathcal{O}(\\varepsilon^{-2}\\log(m))$. Our protocol involves the experimentally reachable resources of projected coherent state preparation, dissipative regularization akin to recent quantum error correction schemes involving cat qubits stabilized by a nonlinear multi-photon driven dissipation process, and heterodyne measurements. As a crucial step in our analysis, we establish our moment criterion and a new Lieb-Robinson type bound for the evolution generated by an arbitrary bosonic Hamiltonian of bounded degree in the annihilation and creation operators combined with photon-driven dissipation. Our work demonstrates that a broad class of bosonic Hamiltonians can be efficiently learned from simple quantum experiments, and our bosonic Lieb-Robinson bound may independently serve as a versatile tool for studying evolutions on continuous variable systems.",
  "categories": [
    "quant-ph",
    "math-ph"
  ],
  "primary_category": "quant-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15026",
  "pdf_url": "https://arxiv.org/pdf/2307.15026v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 245244,
  "size_after_bytes": 247452
}