{
  "title": "Active and passive microrheology with large tracers in hard colloids",
  "authors": [
    "Francisco Orts",
    "Manuel Maier",
    "Matthias Fuchs",
    "Gloria Ortega",
    "Ester M. Garzón",
    "Antonio M. Puertas"
  ],
  "submission_date": "2023-07-29T09:26:00+00:00",
  "revised_dates": [],
  "abstract": "The dynamics of a tracer particle in a bath of quasi-hard colloidal spheres is studied by Langevin dynamics simulations and mode coupling theory (MCT); the tracer radius is varied from equal to up to 7 times larger than the bath particles radius. In the simulations, two cases are considered: freely diffusing tracer (passive microrheology) and tracer pulled with a constant force (active microrheology). Both cases are connected by linear response theory for all tracer sizes. It links both the stationary and transient regimes of the pulled tracer (for low forces) with the equilibrium correlation functions; the velocity of the pulled tracer and its displacement are obtained from the velocity auto-correlation function and the mean squared displacement, respectively. The MCT calculations give insight into the physical mechanisms: At short times, the tracer rattles in its cage of neighbours, with the frequency increasing linearly with the tracer radius asymptotically. The long-time tracer diffusion coefficient from passive microrheology, which agrees with the inverse friction coefficient from the active case, arises from the transport of transverse momentum around the tracer. It can be described with the Brinkman equation for the transverse flow field obtained in extension of MCT, but cannot be recovered from the MCT kernel coupling to densities only. The dynamics of the bath particles is also studied; for the unforced tracer the dynamics is unaffected, irrespective of the distance from the tracer. When the tracer is pulled, the velocity field in the bath decays with the distance from the tracer as 1/r3, as predicted by the Brinkman model, but different from the case of a Newtonian fluid.",
  "categories": [
    "cond-mat.soft"
  ],
  "primary_category": "cond-mat.soft",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15939",
  "pdf_url": "https://arxiv.org/pdf/2307.15939v1",
  "comment": "14 pages",
  "num_versions": null,
  "size_before_bytes": 348954,
  "size_after_bytes": 75650
}