{
  "title": "Audio-Visual Segmentation by Exploring Cross-Modal Mutual Semantics",
  "authors": [
    "Chen Liu",
    "Peike Li",
    "Xingqun Qi",
    "Hu Zhang",
    "Lincheng Li",
    "Dadong Wang",
    "Xin Yu"
  ],
  "submission_date": "2023-07-31T12:56:30+00:00",
  "revised_dates": [
    "2023-08-01T01:40:17+00:00"
  ],
  "abstract": "The audio-visual segmentation (AVS) task aims to segment sounding objects from a given video. Existing works mainly focus on fusing audio and visual features of a given video to achieve sounding object masks. However, we observed that prior arts are prone to segment a certain salient object in a video regardless of the audio information. This is because sounding objects are often the most salient ones in the AVS dataset. Thus, current AVS methods might fail to localize genuine sounding objects due to the dataset bias. In this work, we present an audio-visual instance-aware segmentation approach to overcome the dataset bias. In a nutshell, our method first localizes potential sounding objects in a video by an object segmentation network, and then associates the sounding object candidates with the given audio. We notice that an object could be a sounding object in one video but a silent one in another video. This would bring ambiguity in training our object segmentation network as only sounding objects have corresponding segmentation masks. We thus propose a silent object-aware segmentation objective to alleviate the ambiguity. Moreover, since the category information of audio is unknown, especially for multiple sounding sources, we propose to explore the audio-visual semantic correlation and then associate audio with potential objects. Specifically, we attend predicted audio category scores to potential instance masks and these scores will highlight corresponding sounding instances while suppressing inaudible ones. When we enforce the attended instance masks to resemble the ground-truth mask, we are able to establish audio-visual semantics correlation. Experimental results on the AVS benchmarks demonstrate that our method can effectively segment sounding objects without being biased to salient objects.",
  "categories": [
    "cs.SD",
    "cs.CV",
    "eess.AS"
  ],
  "primary_category": "cs.SD",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16620",
  "pdf_url": "https://arxiv.org/pdf/2307.16620v2",
  "comment": "This paper has been received by ACM MM 23",
  "num_versions": null,
  "size_before_bytes": 4314046,
  "size_after_bytes": 632048
}