{
  "title": "Prevalence and Associated Factors of Human Papillomavirus Infection among Iraqi Women",
  "authors": [
    "Maitham G. Yousif",
    "Fadhil G. Al-Amran",
    "Alaa M. Sadeq",
    "Nasser Ghaly Yousif"
  ],
  "submission_date": "2023-07-27T12:25:42+00:00",
  "revised_dates": [],
  "abstract": "Human papillomavirus (HPV) is a significant public health concern, as it is a leading cause of cervical cancer in women. However, data on the prevalence of HPV infection among Iraqi women is scarce. This study aimed to estimate the prevalence of HPV infection and its associated factors among Iraqi women aged 15-50 attending health centers. In this cross-sectional study, 362 female participants aged 15-50 were recruited from health centers in Iraq. Serological tests were used to screen for HPV infection. Sociodemographic information, obstetric history, and contraceptive use were collected. Pap smears were performed to assess cervical changes related to HPV infection. Of the 362 participants, 65 (17.96%) tested positive for HPV. The majority of HPV-positive women were aged 30-35 years, housewives, and belonged to lower social classes. Among HPV-positive women, 30% had abnormal Pap smears, with 55% diagnosed with cervical intraepithelial neoplasia grade 1 (CIN1), 25% with CIN2, and 15% with CIN3. Biopsy confirmed the diagnosis in 5% of cases. No significant association was found between HPV infection and contraceptive use. Most HPV-positive women were multiparous. This study reveals a considerable prevalence of HPV infection among Iraqi women attending health centers, particularly in the age group of 30-35 years and among housewives. These findings highlight the need for targeted public health interventions to increase HPV awareness, promote regular screening, and improve access to healthcare services for women, especially those from lower social classes. Further research is warranted to better understand the factors contributing to HPV transmission in Iraq and to develop effective prevention strategies.",
  "categories": [
    "q-bio.OT"
  ],
  "primary_category": "q-bio.OT",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14806",
  "pdf_url": "https://arxiv.org/pdf/2307.14806v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1135165,
  "size_after_bytes": 660900
}