{
  "title": "The nature of the X-ray sources in dwarf galaxies in nearby clusters from the KIWICS",
  "authors": [
    "Şeyda Şen",
    "Ersin Göğüş",
    "Reynier F. Peletier",
    "Nelvy Choque-Challapa",
    "Amirnezam Amiri"
  ],
  "submission_date": "2023-07-26T14:55:52+00:00",
  "revised_dates": [],
  "abstract": "We present a deep search for and analysis of X-ray sources in a sample of dwarf galaxies (M$_{r}$ < -15.5 mag) located within twelve galaxy clusters from the Kapteyn IAC WEAVE INT Cluster Survey (KIWICS) of photometric observations in the $\\textit{r}$ and $\\textit{g}$ using the Wide Field Camera (WFC) at the 2.5-m Isaac Newton telescope (INT). We first investigated the optical data, identified 2720 dwarf galaxies in all fields and determined their characteristics; namely, their colors, effective radii, and stellar masses. We then searched the $\\textit{Chandra}$ data archive for X-ray counterparts of optically detected dwarf galaxies. We found a total of 20 X-ray emitting dwarf galaxies, with X-ray flux ranging from 1.7$\\times10^{-15}$ to 4.1$\\times10^{-14}$ erg cm$^{-2}$ s$^{-1}$ and X-ray luminosities varying from 2$\\times10^{39}$ to 5.4$\\times10^{41}$ erg s$^{-1}$. Our results indicate that the X-ray luminosity of the sources in our sample is larger than the Eddington luminosity limit for a typical neutron star, even at the lowest observed levels. This leads us to conclude that the sources emitting X-rays in our sample are likely black holes. Additionally, we have employed a scaling relation between black hole and stellar mass to estimate the masses of the black holes in our sample, and have determined a range of black hole masses from 4.6$\\times10^{4}$ to 1.5$\\times10^{6}$ M$_\\odot$. Finally, we find a trend between X-ray to optical flux ratio and X-ray flux. We discuss the implications of our findings and highlight the importance of X-ray observations in studying the properties of dwarf galaxies.",
  "categories": [
    "astro-ph.GA",
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.1093/mnras/stad2288",
  "journal_ref": null,
  "arxiv_id": "2307.14230",
  "pdf_url": null,
  "comment": "Accepted for publication in MNRAS, 11 pages, 7 figures",
  "num_versions": null,
  "size_before_bytes": 5293099,
  "size_after_bytes": 238404
}