{
  "title": "Improving Semi-Supervised Semantic Segmentation with Dual-Level Siamese Structure Network",
  "authors": [
    "Zhibo Tain",
    "Xiaolin Zhang",
    "Peng Zhang",
    "Kun Zhan"
  ],
  "submission_date": "2023-07-26T03:30:28+00:00",
  "revised_dates": [
    "2024-04-18T00:12:10+00:00"
  ],
  "abstract": "Semi-supervised semantic segmentation (SSS) is an important task that utilizes both labeled and unlabeled data to reduce expenses on labeling training examples. However, the effectiveness of SSS algorithms is limited by the difficulty of fully exploiting the potential of unlabeled data. To address this, we propose a dual-level Siamese structure network (DSSN) for pixel-wise contrastive learning. By aligning positive pairs with a pixel-wise contrastive loss using strong augmented views in both low-level image space and high-level feature space, the proposed DSSN is designed to maximize the utilization of available unlabeled data. Additionally, we introduce a novel class-aware pseudo-label selection strategy for weak-to-strong supervision, which addresses the limitations of most existing methods that do not perform selection or apply a predefined threshold for all classes. Specifically, our strategy selects the top high-confidence prediction of the weak view for each class to generate pseudo labels that supervise the strong augmented views. This strategy is capable of taking into account the class imbalance and improving the performance of long-tailed classes. Our proposed method achieves state-of-the-art results on two datasets, PASCAL VOC 2012 and Cityscapes, outperforming other SSS algorithms by a significant margin. The source code is available at https://github.com/kunzhan/DSSN.",
  "categories": [
    "cs.CV",
    "cs.LG"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13938",
  "pdf_url": null,
  "comment": "ACM MM 2023",
  "num_versions": null,
  "size_before_bytes": 16291493,
  "size_after_bytes": 612053
}