{
  "title": "Relative cluster categories and Higgs categories with infinite-dimensional morphism spaces",
  "authors": [
    "Chris Fraser",
    "Bernhard Keller",
    "Yilin Wu"
  ],
  "submission_date": "2023-07-23T10:09:16+00:00",
  "revised_dates": [
    "2023-07-26T00:36:58+00:00",
    "2023-12-19T03:27:14+00:00"
  ],
  "abstract": "Cluster algebras *with coefficients* are important since they appear in nature as coordinate algebras of varieties like Grassmannians, double Bruhat cells, unipotent cells, ... . The approach of Geiss-Leclerc-Schröer often yields Frobenius exact categories which allow to categorify such cluster algebras. In previous work, the third-named author has constructed Higgs categories and relative cluster categories in the relative Jacobi-finite setting (arXiv:2109.03707). Higgs categories generalize the Frobenius categories used by Geiss-Leclerc-Schröer.\n  In this article, we construct the Higgs category and the relative cluster category in the relative Jacobi-infinite setting under suitable hypotheses. These cover for example the case of Jensen-King-Su's Grassmannian cluster category. As in the relative Jacobi-finite case, the Higgs category is no longer exact but still extriangulated in the sense of Nakaoka-Palu. We also construct a cluster character refining Plamondon's.\n  In the appendix, Chris Fraser and the second-named author categorify quasi-cluster morphisms using Frobenius categories. A recent application of this result is due to Matthew Pressland, who uses it to prove a conjecture by Muller-Speyer.",
  "categories": [
    "math.RT",
    "math.CO"
  ],
  "primary_category": "math.RT",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12279",
  "pdf_url": null,
  "comment": "44 pages, with an appendix by Chris Fraser and Bernhard Keller; v2: Corrections in abstract, references and address; v3: Corrections in abstract and references, Thm 4.14 added",
  "num_versions": null,
  "size_before_bytes": 653012,
  "size_after_bytes": 663024
}