{
  "title": "Towards Quantifying the Impact of Triaxiality on Optical Signatures of Galaxy Clusters: Weak Lensing and Galaxy Distributions",
  "authors": [
    "Shenming Fu",
    "Yuanyuan Zhang",
    "Camille Avestruz",
    "Ruben Coronel"
  ],
  "submission_date": "2023-07-21T18:08:06+00:00",
  "revised_dates": [
    "2024-04-05T00:06:18+00:00"
  ],
  "abstract": "We present observational evidence of the impact of triaxiality on radial profiles that extend to 40 Mpc from galaxy cluster centres in optical measurements. We perform a stacked profile analysis from a sample of thousands of nearly relaxed galaxy clusters from public data releases of the Dark Energy Survey (DES) and the Dark Energy Camera Legacy Survey (DECaLS). Using the central galaxy elliptical orientation angle as a proxy for galaxy cluster orientation, we measure cluster weak lensing and excess galaxy density axis-aligned profiles, extracted along the central galaxy's major or minor axes on the plane-of-the-sky. Our measurements show a $\\gtrsim2-3σ$ difference per radial bin between the normalized axis-aligned profiles. The profile difference between each axis-aligned profile and the azimuthally averaged profile ($\\sim\\pm10-20\\%$ along major/minor axis) appears inside the clusters ($\\sim0.4$ Mpc) and extends to the large-scale structure regime ($\\sim10-20$ Mpc). The magnitude of the difference appears to be relatively insensitive to cluster richness and redshift, and extends further out in the weak lensing surface mass density than in the galaxy overdensity. Looking forward, this measurement can easily be applied to other observational or simulation datasets and can inform the systematics in cluster mass modeling related to triaxiality. We expect imminent upcoming wide-area deep surveys, such as the Vera C. Rubin Observatory's Legacy Survey of Space and Time (LSST), to improve our quantification of optical signatures of cluster triaxiality.",
  "categories": [
    "astro-ph.CO"
  ],
  "primary_category": "astro-ph.CO",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11835",
  "pdf_url": null,
  "comment": "22 pages, 15 figures, 1 table; revised and accepted for publication in MNRAS",
  "num_versions": null,
  "size_before_bytes": 1688987,
  "size_after_bytes": 685863
}