{
  "title": "Exploring the AGN Accretion Disks using Continuum Reverberation Mapping",
  "authors": [
    "Vivek Kumar Jha",
    "Ravi Joshi",
    "Jayesh Saraswat",
    "Hum Chand",
    "Sudhanshu Barway",
    "Amit Kumar Mandal"
  ],
  "submission_date": "2023-07-31T10:59:52+00:00",
  "revised_dates": [],
  "abstract": "In the innermost regions of Active Galactic Nuclei (AGN), matter is understood to be flowing onto the Supermassive black hole (SMBH), which forms an accretion disk. This disk is responsible for the optical/UV continuum emission observed in the spectra of AGN. Reverberation Mapping of the accretion disk using multiple bands can yield the structure of the disk. The emission is expected to be of the black body type peaking at different wavelengths. Hence, depending on the temperature of the disk, continuous, simultaneous monitoring in multiple wavelength ranges to cover hotter inner regions and cooler outer regions can yield the structure and temperature profile of the accretion disk itself. In this study, we present initial results from our accretion disk reverberation mapping campaign targeting AGN with Super High Eddington Accreting Black Holes (SEAMBH). Our analysis on one of the sources- IRAS 04416+1215; based on the broadband observations using the Growth India telescope (GIT), reveals that the size of the accretion disk for this source, calculated by cross-correlating the continuum light curves is larger than expected from the theoretical model. We fit the light curves directly using the thin disk model available in {\\sc javelin} and find that the disk sizes are approximately 4 times larger than expected from the Shakura Sunyaev (SS) disk model. Further studies are needed to understand better the structure and physics of AGN accretion disks and their role in the evolution of galaxies.",
  "categories": [
    "astro-ph.HE",
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.HE",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16568",
  "pdf_url": "https://arxiv.org/pdf/2307.16568v1",
  "comment": "11 pages,4 Figures. Accepted for publication in the Bulletin de la Société Royale des Sciences de Liège as proceeding of the 3rd Belgo-Indian Network for Astronomy and Astrophysics (BINA) workshop, held in Bhimtal, Uttarakhand (India) on 22-24 March 2023",
  "num_versions": null,
  "size_before_bytes": 2076623,
  "size_after_bytes": 870061
}