{
  "title": "Discovery of the shell structure via break radii in the outer halo of the Milky Way",
  "authors": [
    "Dashuang Ye",
    "Cuihua Du",
    "Jianrong Shi",
    "Jun Ma"
  ],
  "submission_date": "2023-07-31T03:07:26+00:00",
  "revised_dates": [],
  "abstract": "Based on the \\textit{Gaia} DR3 RR Lyrae catalog, we use two methods to fit the density profiles with an improved broken power law, and find that there are two break radii coinciding with the two apocenter pile-ups of high-eccentricity Gaia-Sausage-Enceladus (GSE) merger. Also, there is a break caused by the Sagittarius (Sgr) stream. Combining the positions of all breaks, we briefly analyze the metallicity and its dispersion as a function of $r$ as well as its distribution in cylindrical coordinates. For the clean sample, the $z\\text{-to-}x$ ellipsoid axial ratio $q$ in $36\\,{\\rm kpc}\\,\\textless\\,r\\,\\textless\\,96\\,{\\rm kpc}$ becomes much smaller than that of the inner halo $(r\\,\\textless\\,36\\,{\\rm kpc})$, while the major axis has a large uncertainty in the region of $36-66\\,{\\rm kpc}$ and the one in the region of $66-96\\,{\\rm kpc}$ is obviously different from that dominated by the Hercules-Aquila Cloud (HAC) and the Virgo Overdensity (VOD) in the inner halo, which indicates that there is an over-density structure distributed at low zenithal angles. Finally, we found that the over-density structure in the outer halo ($r\\,\\textgreater\\,50\\,{\\rm kpc}$) is shell-shaped and relatively metal-rich compared to the outer background halo. We conclude that the shells could be the apocenter pile-ups of the high-eccentricity GSE merger, which is supported by previous numerical simulations.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.1093/mnras/stad2320",
  "journal_ref": null,
  "arxiv_id": "2307.16378",
  "pdf_url": "https://arxiv.org/pdf/2307.16378v1",
  "comment": "16 pages, 14 Figures, accepted for publication in MNRAS",
  "num_versions": null,
  "size_before_bytes": 6946842,
  "size_after_bytes": 284943
}