{
  "title": "Analyzing the Closed-Loop Performance of Detect-And-Avoid Systems",
  "authors": [
    "Ítalo Romani de Oliveira",
    "Thiago Matsumoto",
    "Aaron Mayne",
    "Antonio Gracia Berna"
  ],
  "submission_date": "2023-07-27T14:36:11+00:00",
  "revised_dates": [],
  "abstract": "Detect-And-Avoid (DAA) algorithms for unmanned air vehicles have industry standards called Minimum Operational Performance Standards (MOPS), establishing criteria to check whether they can ensure safe separation for all plausible operational conditions. However, these MOPS ensure performance for the avoidance maneuvers, which are open-loop, but not for the maneuvers that bring the air vehicles back to their intended courses, closing the control loop of the missions. In this paper, we analyze the closed-loop performance of existing DAA algorithms, by experimenting large numbers of traffic configurations with 4 aircraft in a delimited airspace.\n  We measure and analyze their rates of loss of separation and timeout events, the latter happening when a chain of maneuvers exceeds the maximum supply of energy in a vehicle. We also analyze the efficiency of the closed-loop logic, expressed as the excess fuel rate, and study the relationship between safety and efficiency in these scenarios. Our results show that the inefficiency caused by DAA algorithms is very significant in dense airspaces and that it offers ample space for improvement.\n  Performing the simulations of the closed-loop mission management logic can be highly time consuming. Despite there being Neural Network approximations of DAA logic that alleviate the computational load, none of those that we found available can properly handle cases with more than one intruder in the ownship surveillance range. Therefore, in an attempt to overcome the high computational cost of analyzing the closed-loop performance of DAA algorithms, we study the correlation between inefficiency and safety of closed-loop scenarios, and some indicators from the corresponding open-loop scenarios, such as angle of deviation and number of deviations per flight time.",
  "categories": [
    "eess.SY"
  ],
  "primary_category": "eess.SY",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14894",
  "pdf_url": "https://arxiv.org/pdf/2307.14894v1",
  "comment": "Preprint submitted to the 2023 IEEE Conference on Intelligent Transportation Systems (ITSC 2023)",
  "num_versions": null,
  "size_before_bytes": 369320,
  "size_after_bytes": 252650
}