{
  "title": "Vibrational heat-bath configuration interaction with semistochastic perturbation theory using harmonic oscillator or VSCF modals",
  "authors": [
    "Henry K. Tran",
    "Timothy C. Berkelbach"
  ],
  "submission_date": "2023-07-25T04:18:17+00:00",
  "revised_dates": [],
  "abstract": "Vibrational heat-bath configuration interaction (VHCI) -- a selected configuration interaction technique for vibrational structure theory -- has recently been developed in two independent works [J. Chem. Phys. 154, 074104 (2021); Mol. Phys. 119, e1936250 (2021)], where it was shown to provide accuracy on par with the most accurate vibrational structure methods with a low computational cost. Here, we eliminate the memory bottleneck of the second-order perturbation theory (PT2) correction using the same (semi)stochastic approach developed previously for electronic structure theory. This allows us to treat, in an unbiased manner, much larger perturbative spaces, which are necessary for high accuracy in large systems. Stochastic errors are easily controlled to be less than 1 cm$^{-1}$. We also report two other developments: (i) we propose a new heat-bath criterion and an associated exact implicit sorting algorithm for potential energy surfaces expressible as a sum of products of one-dimensional potentials; (ii) we formulate VHCI to use a vibrational self-consistent field (VSCF) reference, as opposed to the harmonic oscillator reference configuration used in previous reports. Interestingly, we find that with VSCF, the minor improvements to the accuracy are outweighed by the much higher computational cost associated with the loss of sparsity in the Hamiltonian and integrals transformations needed for matrix element evaluation.",
  "categories": [
    "physics.chem-ph"
  ],
  "primary_category": "physics.chem-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13246",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1210581,
  "size_after_bytes": 98849
}