{
  "title": "Electric Dipole Moments as Probes of $B$ Anomaly",
  "authors": [
    "Syuhei Iguro",
    "Teppei Kitahara"
  ],
  "submission_date": "2023-07-21T17:59:59+00:00",
  "revised_dates": [
    "2024-04-18T00:12:56+00:00",
    "2024-10-15T00:06:17+00:00"
  ],
  "abstract": "The measurements of the lepton flavor universality (LFU) in $\\mathcal{B}({\\bar{B}} \\to D^{(\\ast)} l \\barν)$ indicate a significant deviation from the standard model prediction at a 3-4$σ$ level, revealing a violation of the LFU ($R_{D^{(\\ast)}}$ anomaly). It is known that the $R_{D^{(\\ast)}}$ anomaly can be easily accommodated by an $SU(2)_L$-singlet vector leptoquark (LQ) coupled primarily to third-generation fermions, whose existence is further motivated by a partial gauge unification. In general, such a LQ naturally leads to additional $CP$-violating phases in the LQ interactions. In this paper, we point out that the current $R_{D^{(\\ast)}}$ anomaly prefers the $CP$-violating interaction although $\\mathcal{B}({\\bar{B}} \\to D^{(\\ast)} l\\barν)$ are $CP$-conserving observables. The $CP$-violating LQ predicts a substantial size of the bottom-quark electric dipole moment (EDM), the chromo-EDM, and also the tau-lepton EDM. Eventually at low energy, the nucleon and electron EDMs are radiatively induced. Therefore, we conclude that the $R_{D^{(\\ast)}}$ anomaly with the $SU(2)_L$-singlet vector LQ provides unique predictions: neutron and proton EDMs with opposite signs and a magnitude of $\\mathcal{O}(10^{-27})\\,e$cm, and suppressed electron EDM. Furthermore, we show that a similar EDM pattern is predicted in an $SU(2)_L$-doublet scalar LQ scenario that can accommodate the $R_{D^{(\\ast)}}$ anomaly as well. These EDM signals could serve as crucial indicators in future experiments.",
  "categories": [
    "hep-ph",
    "hep-ex"
  ],
  "primary_category": "hep-ph",
  "doi": "10.1103/PhysRevD.110.075008",
  "journal_ref": "Phys.Rev.D 110 (2024) 7, 075008",
  "arxiv_id": "2307.11751",
  "pdf_url": null,
  "comment": "12 pages, 8 figures, 1 table; v2: typos in the code fixed, discussion of scalar LQ added, references added; v3: version accepted for publication in Physical Review D",
  "num_versions": null,
  "size_before_bytes": 20623266,
  "size_after_bytes": 576078
}