{
  "title": "Local non-Gaussianities from cross-correlations between the CMB and 21-cm",
  "authors": [
    "Giorgio Orlando",
    "Thomas Flöss",
    "P. Daniel Meerburg",
    "Joseph Silk"
  ],
  "submission_date": "2023-07-27T17:53:00+00:00",
  "revised_dates": [],
  "abstract": "The 21-cm brightness temperature fluctuation from the Dark Ages ($z \\simeq 30-100$) will allow us to probe the inflationary epoch on very small scales ($>0.1 \\, \\mbox{Mpc}^{-1}$), inaccessible to cosmic microwave background experiments. Combined with the possibility to collect information from different redshift slices, the 21-cm bispectrum has the potential to significantly improve constraints on primordial non-Gaussianity. However, recent work has shown secondary effects source off-diagonal terms in the covariance matrix which can significantly affect forecasted constraints, especially in signals that peak in the squeezed configuration, such as the local bispectrum. In this paper we propose the three-point $\\langle 21-21-\\rm CMB \\rangle$ bispectrum cross-correlation as a new independent observational channel sensitive to local primordial non-Gaussianity. We find that, contrary to the 21-cm bispectrum, secondary contributions are subdominant to the primordial signal for values $f_{\\rm NL}^{\\rm loc} \\sim 1$, resulting in negligible effects from off-diagonal terms in the covariance matrix. We forecast that CMB $T$ and $E$ modes cross-correlated with an ideal cosmic variance-limited 21-cm experiment with a $0.1$ MHz frequency and $0.1$ arc-minute angular resolution could reach $f_{\\rm NL}^{\\rm loc} \\sim 6 \\times 10^{-3}$. This forecast suggests cross-correlation between CMB and 21-cm experiments could provide a viable alternative to 21-cm auto-spectra in reaching unprecedented constraints on primordial local non-Gaussianities.",
  "categories": [
    "astro-ph.CO"
  ],
  "primary_category": "astro-ph.CO",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15046",
  "pdf_url": "https://arxiv.org/pdf/2307.15046v1",
  "comment": "38 pages, 14 figures, code available at https://github.com/GiorgioOrlando/21cm_CMB_cross",
  "num_versions": null,
  "size_before_bytes": 622212,
  "size_after_bytes": 174061
}