{
  "title": "Efficient Modeling of Depolarizing Mueller BRDFs",
  "authors": [
    "Quinn Jarecki",
    "Meredith Kupinski"
  ],
  "submission_date": "2023-07-22T04:10:20+00:00",
  "revised_dates": [],
  "abstract": "Light-matter interactions within indoor environments are significantly depolarizing. Nonetheless, the relatively small polarization attributes are informative. To make use of this information, polarized-BRDF (pBRDF) models for common indoor materials are sought. Fresnel reflection and diffuse partial polarization are popular terms in pBRDF models, but the relative contribution of each is highly material-dependent and changes based on scattering geometry and albedo. An efficient pBRDF would describe these dependencies with as few parameters as possible while retaining physical significance and task-relevant information. This work compares a triply-degenerate (TD)-Mueller matrix (MM) model to measurements of 3D printed objects. In this TD-MM model, the radiometric, polarimetric, and depolarization attributes are decoupled to reduce the number of parameters. The depolarization is quantified by a single geometry-dependent parameter, four geometry-independent material constants describe the polarization properties, and our TD-MM model is normalized to unit radiance so that the BRDF is decoupled. To test an application of the TD-MM model the material constants are assumed and the geometry-dependent depolarization parameter for a red 3D printed sphere is estimated from linear Stokes images. The geometry-averaged error of the depolarization parameter is 4.2% at 662 nm (high albedo) and 11.7% at 451 nm (low albedo). Since the error is inversely proportional to albedo and depolarization, the TD-MM model is referred to as appropriate for depolarization-dominant materials. The robustness of the TD-MM model is also tested by comparing ground-truth Mueller images to extrapolations of a red 3D printed Stanford bunny under arbitrary polarized illumination.",
  "categories": [
    "physics.optics"
  ],
  "primary_category": "physics.optics",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11976",
  "pdf_url": null,
  "comment": "13 pages, 12 figures, submitted to IEEE Transactions on Image Processing",
  "num_versions": null,
  "size_before_bytes": 47924644,
  "size_after_bytes": 208865
}