{
  "title": "Thermal Sunyaev-Zeldovich measurements and cosmic infrared background leakage mitigation combining upcoming ground-based telescopes",
  "authors": [
    "Maude Charmetant",
    "Jens Erler"
  ],
  "submission_date": "2023-07-25T13:09:18+00:00",
  "revised_dates": [
    "2023-09-13T13:30:27+00:00"
  ],
  "abstract": "The Fred Young Submillimeter Telescope (FYST) and the Simons Observatory Large Aperture Telescope (SO\\ LAT) will deliver unprecedented high-resolution measurements of microwave sky emissions. Notably, one of those microwave sky emissions, the thermal Sunyaev-Zeldovich (tSZ) signal, is an essential probe for cluster astrophysics and cosmology. However, an obstacle to its measurement is contamination by the cosmic infrared background (CIB), especially at high frequencies. Our goal is to assess the detection and purity of tSZ power spectrum measurements from these two telescopes. We demonstrate that FYST's high-frequency coverage helps lower CIB contamination and improves signal detection. We simulated the various components of the microwave sky at the frequencies, sensitivities, and beam sizes of the upcoming SO LAT and FYST telescopes using full-sky Hierarchical Equal Area isoLatitude Pixelisation (HEALPix) map templates from the Websky simulations and the Python Sky Model (PySM). We used a map-based internal linear combination (ILC) and a constrained ILC (CILC) to extract the tSZ signal and compute residual noises to assess CIB contamination and signal recovery. We find that the CIB's residual noise power spectrum in the ILC-recovered tSZ is lowered by $\\sim 35\\%$ on average over the scales $\\ell \\in [500,5000]$ when SO LAT and FYST are combined compared to when SO LAT is used alone. We find that when using CILC to deproject CIB, the combined abilities of SO LAT and FYST offer a large $\\ell \\in [1800,3500]$ window in which the recovered tSZ power spectrum is not noise dominated.",
  "categories": [
    "astro-ph.CO"
  ],
  "primary_category": "astro-ph.CO",
  "doi": "10.1051/0004-6361/202245834",
  "journal_ref": "A&A 677, A87 (2023)",
  "arxiv_id": "2307.13476",
  "pdf_url": null,
  "comment": "12 pages, 9 figures, Received: 31 December 2022/Accepted: 5 June 2023 Replacement: Typo in the title, 'Themal' -> 'Thermal'",
  "num_versions": null,
  "size_before_bytes": 61840156,
  "size_after_bytes": 383817
}