{
  "title": "A Novel DDPM-based Ensemble Approach for Energy Theft Detection in Smart Grids",
  "authors": [
    "Xun Yuan",
    "Yang Yang",
    "Asif Iqbal",
    "Prosanta Gope",
    "Biplab Sikdar"
  ],
  "submission_date": "2023-07-30T07:16:56+00:00",
  "revised_dates": [
    "2023-08-03T07:00:53+00:00",
    "2024-01-13T08:00:03+00:00"
  ],
  "abstract": "Energy theft, characterized by manipulating energy consumption readings to reduce payments, poses a dual threat-causing financial losses for grid operators and undermining the performance of smart grids. Effective Energy Theft Detection (ETD) methods become crucial in mitigating these risks by identifying such fraudulent activities in their early stages. However, the majority of current ETD methods rely on supervised learning, which is hindered by the difficulty of labelling data and the risk of overfitting known attacks. To address these challenges, several unsupervised ETD methods have been proposed, focusing on learning the normal patterns from honest users, specifically the reconstruction of input. However, our investigation reveals a limitation in current unsupervised ETD methods, as they can only detect anomalous behaviours in users exhibiting regular patterns. Users with high-variance behaviours pose a challenge to these methods. In response, this paper introduces a Denoising Diffusion Probabilistic Model (DDPM)-based ETD approach. This innovative approach demonstrates impressive ETD performance on high-variance smart grid data by incorporating additional attributes correlated with energy consumption. The proposed methods improve the average ETD performance on high-variance smart grid data from below 0.5 to over 0.9 w.r.t. AUC. On the other hand, our experimental findings indicate that while the state-of-the-art ETD methods based on reconstruction error can identify ETD attacks for the majority of users, they prove ineffective in detecting attacks for certain users. To address this, we propose a novel ensemble approach that considers both reconstruction error and forecasting error, enhancing the robustness of the ETD methodology. The proposed ensemble method improves the average ETD performance on the stealthiest attacks from nearly 0 to 0.5 w.r.t. 5%-TPR.",
  "categories": [
    "cs.LG",
    "cs.AI",
    "cs.CR"
  ],
  "primary_category": "cs.LG",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16149",
  "pdf_url": "https://arxiv.org/pdf/2307.16149v3",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 36925193,
  "size_after_bytes": 250865
}