{
  "title": "Stationary equilibrium torus supported by Weyssenhoff ideal spin fluid in Schwarzschild spacetime -- I: Case of constant specific angular momentum distribution",
  "authors": [
    "Sayantani Lahiri",
    "Claus Laemmerzahl"
  ],
  "submission_date": "2023-07-30T18:01:02+00:00",
  "revised_dates": [],
  "abstract": "We consider a non-self-gravitating geometrically thick torus described by Weyssenhoff ideal spin fluid in a black hole spacetime. The Weyssenhof spin fluid shares the same symmetries of the background geometry, i,e. stationarity and axisymmetry and further describes circular orbital motion in the black hole spacetime. We further assume that assume the alignment of the spin is perpendicular to the equatorial plane. Under this setup, we determine the integrability conditions of the general relativistic momentum conservation equation of Weyssenhoff ideal spin fluid using the Frenkel spin supplementary condition. In the light of the integrability conditions, we then present stationary equilibrium solutions of the spin fluid torus with constant specific angular momentum distributions around the Schwarzschild black hole by numerically solving the general relativistic momentum conservation equation. Our study reveals that both the iso-pressure and iso-density surfaces of torus get significantly modified in comparison to the ideal fluid torus without a spin fluid, owing to the spin tensor and its coupling to the curvature of the Schwarzschild black hole. In fact, the size of the torus is also found to be enhanced (diminished) depending on positive (negative) magnitude of spin parameter $s_0$. We finally estimate the magnitude of $s_0$ by assuming the torus to be composed of spin-1/2 particles.",
  "categories": [
    "gr-qc"
  ],
  "primary_category": "gr-qc",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16292",
  "pdf_url": "https://arxiv.org/pdf/2307.16292v1",
  "comment": "15 pages, 16 figures",
  "num_versions": null,
  "size_before_bytes": 4287015,
  "size_after_bytes": 342780
}