{
  "title": "Conditional Temporal Attention Networks for Neonatal Cortical Surface Reconstruction",
  "authors": [
    "Qiang Ma",
    "Liu Li",
    "Vanessa Kyriakopoulou",
    "Joseph Hajnal",
    "Emma C. Robinson",
    "Bernhard Kainz",
    "Daniel Rueckert"
  ],
  "submission_date": "2023-07-21T19:21:42+00:00",
  "revised_dates": [],
  "abstract": "Cortical surface reconstruction plays a fundamental role in modeling the rapid brain development during the perinatal period. In this work, we propose Conditional Temporal Attention Network (CoTAN), a fast end-to-end framework for diffeomorphic neonatal cortical surface reconstruction. CoTAN predicts multi-resolution stationary velocity fields (SVF) from neonatal brain magnetic resonance images (MRI). Instead of integrating multiple SVFs, CoTAN introduces attention mechanisms to learn a conditional time-varying velocity field (CTVF) by computing the weighted sum of all SVFs at each integration step. The importance of each SVF, which is estimated by learned attention maps, is conditioned on the age of the neonates and varies with the time step of integration. The proposed CTVF defines a diffeomorphic surface deformation, which reduces mesh self-intersection errors effectively. It only requires 0.21 seconds to deform an initial template mesh to cortical white matter and pial surfaces for each brain hemisphere. CoTAN is validated on the Developing Human Connectome Project (dHCP) dataset with 877 3D brain MR images acquired from preterm and term born neonates. Compared to state-of-the-art baselines, CoTAN achieves superior performance with only 0.12mm geometric error and 0.07% self-intersecting faces. The visualization of our attention maps illustrates that CoTAN indeed learns coarse-to-fine surface deformations automatically without intermediate supervision.",
  "categories": [
    "eess.IV",
    "q-bio.NC"
  ],
  "primary_category": "eess.IV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11870",
  "pdf_url": null,
  "comment": "Accepted by the 26th International Conference on Medical Image Computing and Computer Assisted Intervention, MICCAI 2023",
  "num_versions": null,
  "size_before_bytes": 5910829,
  "size_after_bytes": 126613
}