{
  "title": "GOALS-JWST: Small neutral grains and enhanced 3.3 micron PAH emission in the Seyfert galaxy NGC 7469",
  "authors": [
    "Thomas S. -Y. Lai",
    "Lee Armus",
    "Marina Bianchin",
    "Tanio Diaz-Santos",
    "Sean T. Linden",
    "George C. Privon",
    "Hanae Inami",
    "Vivian U",
    "Thomas Bohn",
    "Aaron S. Evans",
    "Kirsten L. Larson",
    "Brandon S. Hensley",
    "J. -D. T. Smith",
    "Matthew A. Malkan",
    "Yiqing Song",
    "Sabrina Stierwalt",
    "Paul P. van der Werf",
    "Jed McKinney",
    "Susanne Aalto",
    "Victorine A. Buiten",
    "Jeff Rich",
    "Vassilis Charmandaris",
    "Philip Appleton",
    "Loreto Barcos-Munoz",
    "Torsten Boker",
    "Luke Finnerty",
    "Justin A. Kader",
    "David R. Law",
    "Michael J. I. Brown",
    "Christopher C. Hayward",
    "Justin Howell",
    "Kazushi Iwasawa",
    "Francisca Kemper",
    "Jason Marshall",
    "Joseph M. Mazzarella",
    "Francisco Muller-Sanchez",
    "Eric J. Murphy",
    "David Sanders",
    "Jason Surace"
  ],
  "submission_date": "2023-07-27T19:57:23+00:00",
  "revised_dates": [],
  "abstract": "We present James Webb Space Telescope (JWST) Near Infrared Spectrograph (NIRSpec) integral-field spectroscopy of the nearby luminous infrared galaxy, NGC 7469. We take advantage of the high spatial/spectral resolution and wavelength coverage of JWST /NIRSpec to study the 3.3 um neutral polycyclic aromatic hydrocarbon (PAH) grain emission on ~60 pc scales. We find a clear change in the average grain properties between the star-forming ring and the central AGN. Regions in the vicinity of the AGN, with [NeIII]/[NeII]>0.25, tend to have larger grain sizes and lower aliphatic-to-aromatic (3.4/3.3) ratios indicating that smaller grains are preferentially removed by photo-destruction in the vicinity of the AGN. We find an overall suppression of the total PAH emission relative to the ionized gas in the central 1 kpc region of the AGN in NGC 7469 compared to what has been observed with Spitzer on 3 kpc scales. However, the fractional 3.3 um to total PAH power is enhanced in the starburst ring, possibly due to a variety of physical effects on sub-kpc scales, including recurrent fluorescence of small grains or multiple photon absorption by large grains. Finally, the IFU data show that while the 3.3 um PAH-derived star formation rate (SFR) in the ring is 8% higher than that inferred from the [NeII] and [NeIII] emission lines, the integrated SFR derived from the 3.3 um feature would be underestimated by a factor of two due to the deficit of PAHs around the AGN, as might occur if a composite system like NGC 7469 were to be observed at high-redshift.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15169",
  "pdf_url": "https://arxiv.org/pdf/2307.15169v1",
  "comment": "14 pages, 5 figures, 2 tables, Submitted to ApJL",
  "num_versions": null,
  "size_before_bytes": 6384265,
  "size_after_bytes": 591974
}