{
  "title": "Modeling the JWST high-redshift galaxies with a general formation scenario and the consistency with the $Λ$CDM model",
  "authors": [
    "Yi-Ying Wang",
    "Lei Lei",
    "Guan-Wen Yuan",
    "Yi-Zhong Fan"
  ],
  "submission_date": "2023-07-24T02:38:12+00:00",
  "revised_dates": [
    "2023-09-13T00:18:02+00:00"
  ],
  "abstract": "Early results from the James Webb Space Telescope (JWST) observations have hinted at two traces beyond the standard cosmological framework. One is the extraordinarily high stellar masses and their density at $z=7.5\\sim9.1$, another is the unexpected abundance of ultraviolet (UV) bright galaxies at $z\\ge10$. Nevertheless, both pieces of evidence are not statistically robust yet. In this work, we construct rest-frame UV luminosity functions (LFs) based on a general formation model for these high-redshift galaxy candidates, since UV LFs always carry the information of stellar formation efficiency (SFE), initial mass function (IMF), dust attenuation, and other crucial elements for galaxy evolution. By updating the massive galaxies candidates with spectroscopic observations and exploring the parameter space of SFE, we are able to reasonably explain the cumulative stellar mass density within the redshift range of $7.5\\sim9.1$, with only one galaxy exhibiting unusual characteristics. We also reveal a potential nonmonotonic trend of SFE with the increasing redshift. At higher redshift ($z\\sim13$), bright UV LFs can be well fitted with non-dust attenuation or top-heavy IMF for Population III stars. The Population III star scenario can also naturally account for the possible dip of the peak SFE evolution curve at $z\\sim9$.",
  "categories": [
    "astro-ph.GA",
    "astro-ph.CO",
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.3847/2041-8213/acf46c",
  "journal_ref": "The Astrophysical Journal Letters, 954:L48 (10pp), 2023 September 10",
  "arxiv_id": "2307.12487",
  "pdf_url": null,
  "comment": "10 pages, 7 figures, and 2 tables. Published in ApJL",
  "num_versions": null,
  "size_before_bytes": 3407174,
  "size_after_bytes": 2023699
}