{
  "title": "Identifying acute illness phenotypes via deep temporal interpolation and clustering network on physiologic signatures",
  "authors": [
    "Yuanfang Ren",
    "Yanjun Li",
    "Tyler J. Loftus",
    "Jeremy Balch",
    "Kenneth L. Abbott",
    "Shounak Datta",
    "Matthew M. Ruppert",
    "Ziyuan Guan",
    "Benjamin Shickel",
    "Parisa Rashidi",
    "Tezcan Ozrazgat-Baslanti",
    "Azra Bihorac"
  ],
  "submission_date": "2023-07-27T21:05:23+00:00",
  "revised_dates": [],
  "abstract": "Initial hours of hospital admission impact clinical trajectory, but early clinical decisions often suffer due to data paucity. With clustering analysis for vital signs within six hours of admission, patient phenotypes with distinct pathophysiological signatures and outcomes may support early clinical decisions. We created a single-center, longitudinal EHR dataset for 75,762 adults admitted to a tertiary care center for 6+ hours. We proposed a deep temporal interpolation and clustering network to extract latent representations from sparse, irregularly sampled vital sign data and derived distinct patient phenotypes in a training cohort (n=41,502). Model and hyper-parameters were chosen based on a validation cohort (n=17,415). Test cohort (n=16,845) was used to analyze reproducibility and correlation with biomarkers. The training, validation, and testing cohorts had similar distributions of age (54-55 yrs), sex (55% female), race, comorbidities, and illness severity. Four clusters were identified. Phenotype A (18%) had most comorbid disease with higher rate of prolonged respiratory insufficiency, acute kidney injury, sepsis, and three-year mortality. Phenotypes B (33%) and C (31%) had diffuse patterns of mild organ dysfunction. Phenotype B had favorable short-term outcomes but second-highest three-year mortality. Phenotype C had favorable clinical outcomes. Phenotype D (17%) had early/persistent hypotension, high rate of early surgery, and substantial biomarker rate of inflammation but second-lowest three-year mortality. After comparing phenotypes' SOFA scores, clustering results did not simply repeat other acuity assessments. In a heterogeneous cohort, four phenotypes with distinct categories of disease and outcomes were identified by a deep temporal interpolation and clustering network. This tool may impact triage decisions and clinical decision-support under time constraints.",
  "categories": [
    "cs.LG",
    "q-bio.QM"
  ],
  "primary_category": "cs.LG",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15719",
  "pdf_url": "https://arxiv.org/pdf/2307.15719v1",
  "comment": "28 pages (79 pages incl. supp. material), 4 figures, 2 tables, 19 supplementary figures, 9 supplementary tables",
  "num_versions": null,
  "size_before_bytes": 7392550,
  "size_after_bytes": 4340369
}