{
  "title": "Event Shape Selection Method in Search of the Chiral Magnetic Effect in Heavy-ion Collisions",
  "authors": [
    "Zhiwan Xu",
    "Brian Chan",
    "Gang Wang",
    "Aihong Tang",
    "Huan Zhong Huang"
  ],
  "submission_date": "2023-07-25T19:55:40+00:00",
  "revised_dates": [
    "2023-12-07T00:33:39+00:00"
  ],
  "abstract": "The search for the chiral magnetic effect (CME) in heavy-ion collisions has been impeded by the significant background arising from the anisotropic particle emission pattern, particularly elliptic flow. To alleviate this background, the event shape selection (ESS) technique categorizes collision events according to their shapes and projects the CME observables to a class of events with minimal flow. In this study, we explore two event shape variables to classify events and two elliptic flow variables to regulate the background. Each type of variable can be calculated from either single particles or particle pairs, resulting in four combinations of event shape and elliptic flow variables. By employing a toy model and the realistic event generator, event-by-event anomalous-viscous fluid dynamics (EBE-AVFD), we discover that the elliptic flow of resonances exhibits correlations with both the background and the potential CME signal, making the resonance flow unsuitable for background control. Through the EBE-AVFD simulations of Au+Au collisions at $\\sqrt{s_{NN}} = 200$ GeV with various input scenarios, we ascertain that the optimal ESS strategy for background control entails utilizing the single-particle elliptic flow in conjunction with the event shape variable based on particle pairs.",
  "categories": [
    "nucl-th",
    "nucl-ex",
    "physics.ins-det"
  ],
  "primary_category": "nucl-th",
  "doi": "10.1016/j.physletb.2023.138367",
  "journal_ref": "Physics Letters B, Volume 848, January 2024, 138367",
  "arxiv_id": "2307.14997",
  "pdf_url": "https://arxiv.org/pdf/2307.14997v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1719470,
  "size_after_bytes": 98825
}