{
  "title": "High-speed data processing onboard sunrise chromospheric infrared spectropolarimeter for the SUNRISE III balloon telescope",
  "authors": [
    "Masahito Kubo",
    "Yukio Katsukawa",
    "David Hernández Expósito",
    "Antonio Sánchez Gómez",
    "María Balaguer Jimenéz",
    "David Orozco Suárez",
    "José M. Morales Fernández",
    "Beatriz Aparicio del Moral",
    "Antonio J. Moreno Mantas",
    "Eduardo Bailón Martínez",
    "Jose Carlos del Toro Iniesta",
    "Yusuke Kawabata",
    "Carlos Quintero Noda",
    "Takayoshi Oba",
    "Ryohtaroh T. Ishikawa",
    "Toshifumi Shimizu"
  ],
  "submission_date": "2023-07-31T10:30:48+00:00",
  "revised_dates": [],
  "abstract": "The Sunrise Chromospheric Infrared spectroPolarimeter (SCIP) has been developed for the third flight of the SUNRISE balloon-borne stratospheric solar observatory. The aim of SCIP is to reveal the evolution of three-dimensional magnetic fields in the solar photosphere and chromosphere using spectropolarimetric measurements with a polarimetric precision of 0.03\\% (1$σ$). Multiple lines in the 770 and 850 nm wavelength bands are simultaneously observed with two 2k$\\times$2k CMOS cameras at a frame rate of 31.25 Hz. Stokes profiles are calculated onboard by accumulating the images modulated by a polarization modulation unit, and then compression processes are applied to the two-dimensional maps of the Stokes profiles. This onboard data processing effectively reduces the data rate. SCIP electronics can handle large data formats at high speed. Before the implementation into the flight SCIP electronics, a performance verification of the onboard data processing was performed with synthetic SCIP data that were produced with a numerical simulation modeling the solar atmospheres. Finally, we verified that the high-speed onboard data processing was realized on ground with the flight hardware by using images illuminated by natural sunlight or an LED.",
  "categories": [
    "astro-ph.SR",
    "astro-ph.IM"
  ],
  "primary_category": "astro-ph.SR",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16551",
  "pdf_url": "https://arxiv.org/pdf/2307.16551v1",
  "comment": "31 pages, 11 figures, accepted for publication in JATIS",
  "num_versions": null,
  "size_before_bytes": 3195951,
  "size_after_bytes": 110887
}