{
  "title": "Near-inertial wave propagation between stratified and homogeneous layers",
  "authors": [
    "Hans van Haren"
  ],
  "submission_date": "2023-07-23T12:06:53+00:00",
  "revised_dates": [],
  "abstract": "The propagation of inertio-gravity waves (IGW) into the deep-sea is relevant for energy transfer to turbulence where waves break, and thus for redistribution of nutrients, oxygen and suspended matter. In constant stratification, vertical IGW-propagation is readily modelled. In varying stratification, where homogeneous layers alternate with stratified layers, transmission and reflection cause complex patterns. Half-year long moored acoustic Doppler current profiler (ADCP) observations midway between the Balearic Islands and Sardinia in the 2800-m deep Western-Mediterranean Sea occasionally demonstrate a distinct transition, between weakly stratified (N>=2f) and homogeneous (N=<f) layers, of IGW at near-inertial frequencies. Here, N denotes the buoyancy frequency and f the local inertial frequency (vertical Coriolis parameter). The transition in stratification is rather abrupt, within Deltaz=25 m and provides an amplitude-reduction of 1.3 for super-inertial motions. Simulations with non-traditional momentum equations involving the horizontal Coriolis parameter fh qualitatively confirm observed IGW-refraction. The observational area is marked by variations in hydrographic characteristics, with abundant mesoscale eddies to the south and dense-water formation to the north of the site during the previous winter. Thus, also transitions occur from deep homogeneous layers into deeper, recently formed stratified ones. Polarization spectra of shear are bound by IGW-limits related to N=f, while current-polarization to 2fh. These frequencies coincide with large-scale buoyancy frequencies independently observed in various layers using shipborne CTD-profiling.",
  "categories": [
    "physics.ao-ph"
  ],
  "primary_category": "physics.ao-ph",
  "doi": null,
  "journal_ref": "Journal of Oceanography, 2023, 79, 367-377",
  "arxiv_id": "2307.12303",
  "pdf_url": null,
  "comment": "28 pages, 9 filgures",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}