{
  "title": "RRAML: Reinforced Retrieval Augmented Machine Learning",
  "authors": [
    "Andrea Bacciu",
    "Florin Cuconasu",
    "Federico Siciliano",
    "Fabrizio Silvestri",
    "Nicola Tonellotto",
    "Giovanni Trappolini"
  ],
  "submission_date": "2023-07-24T13:51:19+00:00",
  "revised_dates": [
    "2023-07-26T00:14:17+00:00",
    "2024-04-18T00:51:17+00:00"
  ],
  "abstract": "The emergence of large language models (LLMs) has revolutionized machine learning and related fields, showcasing remarkable abilities in comprehending, generating, and manipulating human language. However, their conventional usage through API-based text prompt submissions imposes certain limitations in terms of context constraints and external source availability. To address these challenges, we propose a novel framework called Reinforced Retrieval Augmented Machine Learning (RRAML). RRAML integrates the reasoning capabilities of LLMs with supporting information retrieved by a purpose-built retriever from a vast user-provided database. By leveraging recent advancements in reinforcement learning, our method effectively addresses several critical challenges. Firstly, it circumvents the need for accessing LLM gradients. Secondly, our method alleviates the burden of retraining LLMs for specific tasks, as it is often impractical or impossible due to restricted access to the model and the computational intensity involved. Additionally we seamlessly link the retriever's task with the reasoner, mitigating hallucinations and reducing irrelevant, and potentially damaging retrieved documents. We believe that the research agenda outlined in this paper has the potential to profoundly impact the field of AI, democratizing access to and utilization of LLMs for a wide range of entities.",
  "categories": [
    "cs.CL",
    "cs.IR"
  ],
  "primary_category": "cs.CL",
  "doi": null,
  "journal_ref": "CEUR Workshop Proceedings (2023, Vol. 3537, pp. 29-37)",
  "arxiv_id": "2307.12798",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 3122887,
  "size_after_bytes": 518559
}