{
  "title": "Underluminous tidal disruptions",
  "authors": [
    "Pau Amaro Seoane"
  ],
  "submission_date": "2023-07-24T18:00:12+00:00",
  "revised_dates": [
    "2023-08-07T00:15:39+00:00",
    "2024-07-10T00:07:30+00:00"
  ],
  "abstract": "We have evidence of X-ray flares in several galaxies consistent with a a star being tidally disrupted by a supermassive black hole (MBH). If the star starts on a nearly parabolic orbit relative to the MBH, one can derive that the fallback rate follows a $t^{-5/3}$ decay. Depending on the penetration factor, $β$, a star will be torn apart differently, and relativistic effects play a role. We have modified the standard version of the smoothed-particle hydrodynamics (SPH) code {\\sc Gadget} to include a relativistic treatment of the gravitational forces between the gas particles of a main-sequence (MS) star and a MBH. We include non-spinning post-Newtonian corrections to incorpore the periapsis shift and the spin-orbit coupling up to next-to-lowest order. We find that tidal disruptions around MBHs in the relativistic cases are underluminous for values starting at $β\\gtrapprox 2.25$; i.e. the fallback curves produced in the relativistic cases are progressively lower compared to the Newtonian simulations as the penetration parameter increases. While the Newtonian cases display a total disruption, we find that all relativistic counterparts feature a survival core for penetration factors going to values as high as $12.05$. We perform a additional dynamical numerical study which shows that the geodesics of the elements in the star converge at periapsis. We confirm these findings with an analytical study of the geodesic separation equation. The luminosity of TDEs must be lower than predicted theoretically due to the fact that the star will partially survive when relativistic effects are taken into account. A survival core should consistently emerge from any TDE with $β\\gtrapprox 2.25$.",
  "categories": [
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.HE",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13043",
  "pdf_url": null,
  "comment": "Accepted for publication MNRAS. Significant improvements: (1) Added a dynamics numerical study which confirms the findings, (2) explored more SPH cases and, in particular, (3) added a relativistic analytical study of the geodesic deviation which corroborates the numerical study",
  "num_versions": null,
  "size_before_bytes": 29000286,
  "size_after_bytes": 227938
}