{
  "title": "Bayesian Rationality in Satisfaction Games",
  "authors": [
    "Langford White",
    "Oskar Rynkiewicz",
    "Duong Nguyen",
    "Hung Nguyen"
  ],
  "submission_date": "2023-07-25T04:29:22+00:00",
  "revised_dates": [],
  "abstract": "We introduce a new paradigm for game theory -- Bayesian satisfaction. This novel approach is a synthesis of the idea of Bayesian rationality introduced by Aumann, and satisfaction games. The concept of Bayesian rationality for which, in part, Robert Aumann was awarded the Nobel Prize in 2005, is concerned with players in a game acting in their own best interest given a subjective knowledge of the other players' behaviours as represented by a probability distribution. Satisfaction games have emerged in the engineering literature as a way of modelling competitive interactions in resource allocation problems where players seek to attain a specified level of utility, rather than trying to maximise utility. In this paper, we explore the relationship between optimality in Aumann's sense (correlated equilibria), and satisfaction in games. We show that correlated equilibria in a satisfaction game represent stable outcomes in which no player can increase their probability of satisfaction by unilateral deviation from the specified behaviour. Thus, we propose a whole new class of equilibrium outcomes in satisfaction games which include existing notions of equilibria in such games. Iterative algorithms for computing such equilibria based on the existing ideas of regret matching are presented and interpreted within the satisfaction framework. Numerical examples of resource allocation are presented to illustrate the behaviour of these algorithms. A notable feature of these algorithms is that they almost always find equilibrium outcomes whereas existing approaches in satisfaction games may not.",
  "categories": [
    "cs.GT"
  ],
  "primary_category": "cs.GT",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13247",
  "pdf_url": null,
  "comment": "Appears at the 14th Workshop on Optimization and Learning in Multiagent Systems Workshop (OptLearnMAS 2023). Held as part of the Workshops at the AAMAS 2023 Conference",
  "num_versions": null,
  "size_before_bytes": 1273456,
  "size_after_bytes": 266230
}