{
  "title": "Software Code Quality Measurement: Implications from Metric Distributions",
  "authors": [
    "Siyuan Jin",
    "Mianmian Zhang",
    "Yekai Guo",
    "Yuejiang He",
    "Ziyuan Li",
    "Bichao Chen",
    "Bing Zhu",
    "Yong Xia"
  ],
  "submission_date": "2023-07-22T13:55:42+00:00",
  "revised_dates": [
    "2023-08-10T00:05:44+00:00",
    "2023-10-03T00:33:20+00:00",
    "2024-01-17T02:57:08+00:00"
  ],
  "abstract": "Software code quality is a construct with three dimensions: maintainability, reliability, and functionality. Although many firms have incorporated code quality metrics in their operations, evaluating these metrics still lacks consistent standards. We categorized distinct metrics into two types: 1) monotonic metrics that consistently influence code quality; and 2) non-monotonic metrics that lack a consistent relationship with code quality. To consistently evaluate them, we proposed a distribution-based method to get metric scores. Our empirical analysis includes 36,460 high-quality open-source software (OSS) repositories and their raw metrics from SonarQube and CK. The evaluated scores demonstrate great explainability on software adoption. Our work contributes to the multi-dimensional construct of code quality and its metric measurements, which provides practical implications for consistent measurements on both monotonic and non-monotonic metrics.",
  "categories": [
    "cs.SE"
  ],
  "primary_category": "cs.SE",
  "doi": "10.1109/QRS60937.2023.00054",
  "journal_ref": "2023 IEEE 23rd International Conference on Software Quality, Reliability, and Security (QRS), Chiang Mai, Thailand, 2023, pp. 488-496",
  "arxiv_id": "2307.12082",
  "pdf_url": null,
  "comment": "The paper has been accepted for presentation at IEEE QRS 2023. Unfortunately, due to authorship limits, Mianmian Zhang, Yekai Guo, and Yuejiang He could not be included as co-authors. However, we gratefully acknowledge their valuable contributions to this work and use this arXiv version to prove their contributions",
  "num_versions": null,
  "size_before_bytes": 4748919,
  "size_after_bytes": 534800
}