{
  "title": "Data-Driven Reduced-Order Aeroelastic Modeling of Highly Flexible Aircraft by Parametric Dynamic Mode Decomposition",
  "authors": [
    "Tianyi He",
    "Weihua Su"
  ],
  "submission_date": "2023-07-26T05:20:35+00:00",
  "revised_dates": [],
  "abstract": "This paper presents a method of data-driven parametric Dynamic Mode Decomposition (p-DMD) to derive a linear parameter-varying reduced-order model (LPV-ROM) for the nonlinear aeroelasticity of highly flexible aircraft. It directly uses the data snapshots obtained at varying flight conditions, and encodes the physical understanding of the nonlinear model's polynomial dependency on flight conditions to produce a polynomial-dependent LPV-ROM. Therefore, this method can handle not only the equilibrium flight conditions but also the cases of continuously-varying flight conditions. In the numerical studies, a highly flexible cantilever wing and a slender vehicle built based on it are first studied with fixed angles of attack as the scheduling parameter. The comparisons between traditional linearization-based parametric modeling and the data-driven p-DMD modeling are performed to verify the modeling accuracy. The results demonstrate that the current p-DMD modeling method can capture the aeroelastic and flight dynamic responses of highly flexible aircraft in both time and frequency domains. In addition, the proposed p-DMD method is applied to the highly flexible aircraft in a perturbed longitudinal flight with varying angles of attack as the scheduling parameter. The nonlinear aeroelastic and flight dynamic data are compared with the simulation results of the data-driven p-DMD model. The comparison results demonstrate that it can accurately capture the non-equilibrium (or transient) aeroelastic and flight dynamic behaviors of such slender vehicles.",
  "categories": [
    "eess.SY"
  ],
  "primary_category": "eess.SY",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13960",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 16288116,
  "size_after_bytes": 297381
}