{
  "title": "Intrinsic Mixed-state Topological Order",
  "authors": [
    "Zijian Wang",
    "Zhengzhi Wu",
    "Zhong Wang"
  ],
  "submission_date": "2023-07-25T18:34:10+00:00",
  "revised_dates": [
    "2024-05-08T00:19:26+00:00",
    "2025-01-23T01:22:04+00:00"
  ],
  "abstract": "Decoherence is a major obstacle to the preparation of topological order in noisy intermediate-scale quantum devices. Here, we show that decoherence can also give rise to new types of topological order. Specifically, we construct concrete examples by proliferating fermionic anyons in the toric code via local quantum channels. The resulting mixed states retain long-range entanglement, which manifests in the nonzero topological entanglement negativity, though the topological quantum memory is destroyed by decoherence. By comparison with the gapless spin liquid in pure states, we show that the identified states represent a novel intrinsic mixed-state topological order, which has no counterpart in pure states. Through the lens of quantum anomalies of 1-form symmetries, we then provide general constructions of intrinsic mixed-state topological order and reveal the existence of nonbosonic deconfined anyons as another key feature of these novel phases. The extended meaning and characterization of deconfined excitations and their statistics in mixed states are clarified. Moreover, when these deconfined anyons have nontrivial braiding statistics, we prove that the mixed states cannot be prepared via finite-depth local quantum channels from any bipartite separable states. We further demonstrate our construction using the decohered Kitaev honeycomb model and the decohered double-semion model. In the latter case, a surprising scenario arises where decoherence gives rise to additional types of deconfined anyons.",
  "categories": [
    "quant-ph",
    "cond-mat.mes-hall",
    "cond-mat.quant-gas",
    "cond-mat.str-el"
  ],
  "primary_category": "quant-ph",
  "doi": "10.1103/PRXQuantum.6.010314",
  "journal_ref": "PRX Quantum 6, 010314 (2025)",
  "arxiv_id": "2307.13758",
  "pdf_url": null,
  "comment": "12+17 pages, 8+3 figures, published version",
  "num_versions": null,
  "size_before_bytes": 2220718,
  "size_after_bytes": 576923
}