{
  "title": "Two-dimensional optomechanical crystal resonator in gallium arsenide",
  "authors": [
    "Rhys G. Povey",
    "Ming-Han Chou",
    "Gustav Andersson",
    "Christopher R. Conner",
    "Joel Grebel",
    "Yash J. Joshi",
    "Jacob M. Miller",
    "Hong Qiao",
    "Xuntao Wu",
    "Haoxiong Yan",
    "Andrew N. Cleland"
  ],
  "submission_date": "2023-07-26T19:05:56+00:00",
  "revised_dates": [],
  "abstract": "In the field of quantum computation and communication there is a compelling need for quantum-coherent frequency conversion between microwave electronics and infra-red optics. A promising platform for this is an optomechanical crystal resonator that uses simultaneous photonic and phononic crystals to create a co-localized cavity coupling an electromagnetic mode to an acoustic mode, which then via electromechanical interactions can undergo direct transduction to electronics. The majority of work in this area has been on one-dimensional nanobeam resonators which provide strong optomechanical couplings but, due to their geometry, suffer from an inability to dissipate heat produced by the laser pumping required for operation. Recently, a quasi-two-dimensional optomechanical crystal cavity was developed in silicon exhibiting similarly strong coupling with better thermalization, but at a mechanical frequency above optimal qubit operating frequencies. Here we adapt this design to gallium arsenide, a natural thin-film single-crystal piezoelectric that can incorporate electromechanical interactions, obtaining a mechanical resonant mode at f_m ~ 4.5 GHz ideal for superconducting qubits, and demonstrating optomechanical coupling g_om/(2pi) ~ 650 kHz.",
  "categories": [
    "quant-ph"
  ],
  "primary_category": "quant-ph",
  "doi": "10.1103/PhysRevApplied.21.014015",
  "journal_ref": null,
  "arxiv_id": "2307.15087",
  "pdf_url": "https://arxiv.org/pdf/2307.15087v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 2193424,
  "size_after_bytes": 67860
}