{
  "title": "Calculating composite-particle spectra in Hamiltonian formalism and demonstration in 2-flavor QED$_{1+1\\text{d}}$",
  "authors": [
    "Etsuko Itou",
    "Akira Matsumoto",
    "Yuya Tanizaki"
  ],
  "submission_date": "2023-07-31T13:38:23+00:00",
  "revised_dates": [
    "2023-08-18T05:59:24+00:00",
    "2023-11-01T09:25:57+00:00"
  ],
  "abstract": "We consider three distinct methods to compute the mass spectrum of gauge theories in the Hamiltonian formalism: (1) correlation-function scheme, (2) one-point-function scheme, and (3) dispersion-relation scheme. The first one examines spatial correlation functions as we do in the conventional Euclidean Monte Carlo simulations. The second one uses the boundary effect to efficiently compute the mass spectrum. The third one constructs the excited states and fits their energy using the dispersion relation with selecting quantum numbers. Each method has its pros and cons, and we clarify such properties in their applications to the mass spectrum for the 2-flavor massive Schwinger model at $m/g=0.1$ and $θ=0$ using the density-matrix renormalization group (DMRG). We note that the multi-flavor Schwinger model at small mass $m$ is a strongly coupled field theory even after the bosonizations, and thus it deserves to perform the first-principles numerical calculations. All these methods mostly agree and identify the stable particles, pions $π_a$ ($J^{PG}=1^{-+}$), sigma meson $σ$ ($J^{PG}=0^{++}$), and eta meson $η$ ($J^{PG}=0^{--}$). In particular, we find that the mass of $σ$ meson is lighter than twice the pion mass, and thus $σ$ is stable against the decay process, $σ\\to ππ$. This is consistent with the analytic prediction using the WKB approximation, and, remarkably, our numerical results are so close to the WKB-based formula between the pion and sigma-meson masses, $M_σ/M_π=\\sqrt{3}$.",
  "categories": [
    "hep-lat",
    "cond-mat.str-el",
    "hep-th",
    "quant-ph"
  ],
  "primary_category": "hep-lat",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16655",
  "pdf_url": "https://arxiv.org/pdf/2307.16655v3",
  "comment": "40 pages, 16 figures, (ver2) minor improvements, (ver3) comments added",
  "num_versions": null,
  "size_before_bytes": 2823242,
  "size_after_bytes": 1619658
}