{
  "title": "Successive Pose Estimation and Beam Tracking for mmWave Vehicular Communication Systems",
  "authors": [
    "Cen Liu",
    "Guangxu Zhu",
    "Fan Liu",
    "Yuanwei Liu",
    "Kaibin Huang"
  ],
  "submission_date": "2023-07-30T03:34:24+00:00",
  "revised_dates": [
    "2023-08-05T15:05:59+00:00"
  ],
  "abstract": "The millimeter wave (mmWave) radar sensing-aided communications in vehicular mobile communication systems is investigated. To alleviate the beam training overhead under high mobility scenarios, a successive pose estimation and beam tracking (SPEBT) scheme is proposed to facilitate mmWave communications with the assistance of mmWave radar sensing. The proposed SPEBT scheme first resorts to a Fast Conservative Filtering for Efficient and Accurate Radar odometry (Fast-CFEAR) approach to estimate the vehicle pose consisting of 2-dimensional position and yaw from radar point clouds collected by mmWave radar sensor. Then, the pose estimation information is fed into an extend Kalman filter to perform beam tracking for the line-of-sight channel. Owing to the intrinsic robustness of mmWave radar sensing, the proposed SPEBT scheme is capable of operating reliably under extreme weather/illumination conditions and large-scale global navigation satellite systems (GNSS)-denied environments. The practical deployment of the SPEBT scheme is verified through rigorous testing on a real-world sensing dataset. Simulation results demonstrate that the proposed SPEBT scheme is capable of providing precise pose estimation information and accurate beam tracking output, while reducing the proportion of beam training overhead to less than 5% averagely.",
  "categories": [
    "eess.SP",
    "cs.RO"
  ],
  "primary_category": "eess.SP",
  "doi": "10.1109/GCWkshps58843.2023.10464790",
  "journal_ref": "IEEE Global Communications Conference Workshops (GC Wkshps) 2023",
  "arxiv_id": "2307.16117",
  "pdf_url": "https://arxiv.org/pdf/2307.16117v2",
  "comment": "An extended version of a conference submission. 7 pages, 5 figures",
  "num_versions": null,
  "size_before_bytes": 13869536,
  "size_after_bytes": 1529735
}