{
  "title": "On the properties of inverse Compton spectra generated by up-scattering a power-law distribution of target photons",
  "authors": [
    "Dmitry Khangulyan",
    "Felix Aharonian",
    "Andrew M. Taylor"
  ],
  "submission_date": "2023-07-24T01:40:43+00:00",
  "revised_dates": [],
  "abstract": "Relativistic electrons are an essential component in many astrophysical sources, and their radiation may dominate the high-energy bands. Inverse Compton (IC) emission is the radiation mechanism that plays the most important role in these bands. The basic properties of IC, such as the total and differential cross sections, have long been studied; the properties of the IC emission depend strongly not only on the emitting electron distribution but also on the properties of the target photons. This complicates the phenomenological studies of sources, where target photons are supplied from a broad radiation component. We study the spectral properties of IC emission generated by a power-law distribution of electrons on a power-law distribution of target photons. We approximate the resulting spectrum by a broken-power-law distribution and show that there can be up to three physically motivated spectral breaks. If the target photon spectrum extends to sufficiently low energies, $\\varepsilon_{\\mathrm{min}}< m_e^2c^4/E_{\\mathrm{max}}$ ($m_e$ and $c$ are electron mass and speed of light, respectively; $\\varepsilon_{\\mathrm{min}}$ and $E_{\\mathrm{max}}$ are the minimum/maximum energies of target photons and electrons, respectively), then the high energy part of the IC component has a spectral slope typical for the Thomson regime with an abrupt cutoff close to $E_{\\mathrm{max}}$. The spectra typical for the Klein-Nishina regime are formed above $m_e^2c^4/\\varepsilon_{\\mathrm{min}}$. If the spectrum of target photons features a cooling break, i.e., a change of the photon index by $0.5$ at $\\varepsilon_{\\mathrm{br}}$, then the transition to the Klein-Nishina regime proceeds through an intermediate change of the photon index by $0.5$ at $m_e^2c^4/\\varepsilon_{\\mathrm{br}}$.",
  "categories": [
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.HE",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12467",
  "pdf_url": null,
  "comment": "12 pages, 7 figures",
  "num_versions": null,
  "size_before_bytes": 2469215,
  "size_after_bytes": 88756
}