{
  "title": "Using power system modelling outputs to identify weather-induced extreme events in highly renewable systems",
  "authors": [
    "Aleksander Grochowicz",
    "Koen van Greevenbroek",
    "Hannah C. Bloomfield"
  ],
  "submission_date": "2023-07-25T14:14:58+00:00",
  "revised_dates": [
    "2024-06-21T01:32:54+00:00"
  ],
  "abstract": "In highly renewable power systems the increased weather dependence can result in new resilience challenges, such as renewable energy droughts, or a lack of sufficient renewable generation at times of high demand. The weather conditions responsible for these challenges have been well-studied in the literature. However, in reality multi-day resilience challenges are triggered by complex interactions between high demand, low renewable availability, electricity transmission constraints and storage dynamics. We show these challenges cannot be rigorously understood from an exclusively power systems, or meteorological, perspective. We propose a new method that uses electricity shadow prices - obtained by a European power system model based on 40 years of reanalysis data - to identify the most difficult periods driving system investments. Such difficult periods are driven by large-scale weather conditions such as low wind and cold temperature periods of various lengths associated with stationary high pressure over Europe. However, purely meteorological approaches fail to identify which events lead to the largest system stress over the multi-decadal study period due to the influence of subtle transmission bottlenecks and storage issues across multiple regions. These extreme events also do not relate strongly to traditional weather patterns (such as Euro-Atlantic weather regimes or the North Atlantic Oscillation index). We therefore compile a new set of weather patterns to define energy system stress events which include the impacts of electricity storage and large-scale interconnection. Without interdisciplinary studies combining state-of-the-art energy meteorology and modelling, further strive for adequate renewable power systems will be hampered.",
  "categories": [
    "physics.soc-ph",
    "eess.SY"
  ],
  "primary_category": "physics.soc-ph",
  "doi": "10.1088/1748-9326/ad374a",
  "journal_ref": "Environmental Research Letters, Volume 19, Number 5 (2024)",
  "arxiv_id": "2307.13520",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 74265750,
  "size_after_bytes": 1155336
}