{
  "title": "The Dark Energy Survey Supernova Program: Cosmological Biases from Host Galaxy Mismatch of Type Ia Supernovae",
  "authors": [
    "H. Qu",
    "M. Sako",
    "M. Vincenzi",
    "C. Sanchez",
    "D. Brout",
    "R. Kessler",
    "R. Chen",
    "T. Davis",
    "L. Galbany",
    "L. Kelsey",
    "J. Lee",
    "C. Lidman",
    "B. Popovic",
    "B. Rose",
    "D. Scolnic",
    "M. Smith",
    "M. Sullivan",
    "P. Wiseman",
    "T. M. C. Abbott",
    "M. Aguena",
    "O. Alves",
    "D. Bacon",
    "E. Bertin",
    "D. Brooks",
    "D. L. Burke",
    "A. Carnero Rosell",
    "J. Carretero",
    "L. N. da Costa",
    "M. E. S. Pereira",
    "H. T. Diehl",
    "P. Doel",
    "S. Everett",
    "I. Ferrero",
    "J. Frieman",
    "J. Garcia-Bellido",
    "G. Giannini",
    "D. Gruen",
    "R. A. Gruendl",
    "G. Gutierrez",
    "S. R. Hinton",
    "D. L. Hollowood",
    "K. Honscheid",
    "D. J. James",
    "K. Kuehn",
    "O. Lahav",
    "J. L. Marshall",
    "J. Mena-Fernandez",
    "F. Menanteau",
    "R. Miquel",
    "R. L. C. Ogando",
    "A. Palmese",
    "A. Pieres",
    "A. A. Plazas Malagon",
    "M. Raveri",
    "E. Sanchez",
    "I. Sevilla-Noarbe",
    "M. Soares-Santos",
    "E. Suchyta",
    "G. Tarle",
    "N. Weaverdyck",
    "DES Collaboration"
  ],
  "submission_date": "2023-07-25T17:59:10+00:00",
  "revised_dates": [
    "2024-02-26T01:52:08+00:00"
  ],
  "abstract": "Redshift measurements, primarily obtained from host galaxies, are essential for inferring cosmological parameters from type Ia supernovae (SNe Ia). Matching SNe to host galaxies using images is non-trivial, resulting in a subset of SNe with mismatched hosts and thus incorrect redshifts. We evaluate the host galaxy mismatch rate and resulting biases on cosmological parameters from simulations modeled after the Dark Energy Survey 5-Year (DES-SN5YR) photometric sample. For both DES-SN5YR data and simulations, we employ the directional light radius method for host galaxy matching. In our SN Ia simulations, we find that 1.7% of SNe are matched to the wrong host galaxy, with redshift difference between the true and matched host of up to 0.6. Using our analysis pipeline, we determine the shift in the dark energy equation of state parameter (Dw) due to including SNe with incorrect host galaxy matches. For SN Ia-only simulations, we find Dw = 0.0013 +/- 0.0026 with constraints from the cosmic microwave background (CMB). Including core-collapse SNe and peculiar SNe Ia in the simulation, we find that Dw ranges from 0.0009 to 0.0032 depending on the photometric classifier used. This bias is an order of magnitude smaller than the expected total uncertainty on w from the DES-SN5YR sample of around 0.03. We conclude that the bias on w from host galaxy mismatch is much smaller than the uncertainties expected from the DES-SN5YR sample, but we encourage further studies to reduce this bias through better host-matching algorithms or selection cuts.",
  "categories": [
    "astro-ph.CO"
  ],
  "primary_category": "astro-ph.CO",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13696",
  "pdf_url": null,
  "comment": "Accepted by ApJ",
  "num_versions": null,
  "size_before_bytes": 19628091,
  "size_after_bytes": 1279406
}