{
  "title": "Silicon Photonics Mode-Selective Phase Shifter",
  "authors": [
    "Seyed Mohammad Reza Safaee",
    "Kaveh",
    "Rahbardar Mojaver",
    "Guowu Zhang",
    "Odile Liboiron-Ladouceur"
  ],
  "submission_date": "2023-07-31T13:21:31+00:00",
  "revised_dates": [],
  "abstract": "A novel mode-selective thermo-optic phase shifter (MS-TOPS) enabled by subwavelength grating (SWG) structures is proposed and experimentally demonstrated on a 220 nm waveguide thick silicon photonics chip for the first two quasi-transverse electric modes (TE0, TE1). Mode-selective relative phase manipulation of modes unlocks several processing tasks in mode division multiplexing systems. This integrated solution provides a direct phase manipulation of modes without converting them to their fundamental modes. A Mach-Zehnder interferometer is deployed as a test structure incorporating the proposed MS-TOPS in one arm and a mode-insensitive thermo-optic phase shifter (MI-TOPS) in another. The effect of the SWG duty cycle ratio is investigated by both numerical simulations and experimental measurements. A mode-selectivity of 1.44 is experimentally demonstrated. In other words, the thermo-optic coefficient of TE0 is 44% larger than the one for TE1. The phase shifter's insertion loss is at most 2.5 dB and a worst-case crosstalk of -13.1 dB over a 40 nm wavelength range from 1520 to 1560 nm. A cascaded configuration of the proposed MS-TOPS and an MI-TOPS provides sufficient degrees of freedom to manipulate the relative phase of each mode independently. Potential numerous applications of such devices include optical switching, multimode quantum optical processors, and scaling-up conventional optical processors with a mode selective building block.",
  "categories": [
    "physics.optics",
    "physics.app-ph"
  ],
  "primary_category": "physics.optics",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16639",
  "pdf_url": "https://arxiv.org/pdf/2307.16639v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1676056,
  "size_after_bytes": 1017655
}