{
  "title": "Speed Limit: Obey, or Not Obey?",
  "authors": [
    "Zhengbing He",
    "Mirco Nanni",
    "Luca Pappalardo",
    "Paolo Santi",
    "Carlo Ratti"
  ],
  "submission_date": "2023-07-23T00:31:10+00:00",
  "revised_dates": [
    "2023-11-29T01:10:33+00:00"
  ],
  "abstract": "It is commonly expected that drivers maintain a driving speed that is lower than or around the posted speed limit, as failure to obey may result in safety risks and fines. By taking randomly selected road segments as examples, this study compares the percentages of speeding vehicles in five countries worldwide, namely, two European countries (Germany and Italy), two Asian countries (Japan and China), and one North American country (the United States). Contrary to expectations, our results show that more than 80% of drivers violate the posted speed limits in the studied road segments in Italy, Japan, and the United States. In particular, a significant portion (45.3%) of drivers in Italy exceed the posted speed limit by a substantial margin (30 km/h), while few speeding vehicles are observed in the road segment examined in China. Meanwhile, it is found that drivers on low-speed-limit roads are more likely to exceed the posted speed limit, particularly when there are fewer on-road vehicles. The comparison of different countries' speeding fines indicates that for the purpose of preventing speeding, increasing fines (as Italy has done) is less effective than enhancing supervision (as China has done). The findings remind law enforcement agencies and traffic authorities of the importance of the supervision of driver's behavior and the necessity of revisiting the rationale for the current speed limit settings.",
  "categories": [
    "physics.soc-ph",
    "stat.AP"
  ],
  "primary_category": "physics.soc-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12189",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 6721432,
  "size_after_bytes": 1424486
}