{
  "title": "Unravelling the fluorescence kinetics of light-harvesting proteins with simulated measurements",
  "authors": [
    "Callum Gray",
    "Lekshmi Kailas",
    "Peter G. Adams",
    "Christopher D. P. Duffy"
  ],
  "submission_date": "2023-07-26T08:49:13+00:00",
  "revised_dates": [],
  "abstract": "The plant light-harvesting pigment-protein complex LHCII is the major antenna sub-unit of PSII and is generally (though not universally) accepted to play a role in photoprotective energy dissipation under high light conditions, a process known Non-Photochemical Quenching (NPQ). The underlying mechanisms of energy trapping and dissipation within LHCII are still debated. Various proposed models differ considerably in their molecular and kinetic detail, but are often based on different interpretations of very similar transient absorption measurements of isolated complexes. Here we present a simulated measurement of the fluorescence decay kinetics of quenched LHCII aggregates to determine whether this relatively simple measurement can discriminate between different potential NPQ mechanisms. We simulate not just the underlying physics (excitation, energy migration, quenching and singlet-singlet annihilation) but also the signal detection and typical experimental data analysis. Comparing this to a selection of published fluorescence decay kinetics we find that: (1) Different proposed quenching mechanisms produce noticeably different fluorescence kinetics even at low (annihilation free) excitation density, though the degree of difference is dependent on pulse width. (2) Measured decay kinetics are consistent with most LHCII trimers becoming relatively slow excitation quenchers. A small sub-population of very fast quenchers produces kinetics which do not resemble any observed measurement. (3) It is necessary to consider at least two distinct quenching mechanisms in order to accurately reproduce experimental kinetics, supporting the idea that NPQ is not a simple binary switch switch.",
  "categories": [
    "q-bio.MN",
    "q-bio.BM",
    "q-bio.SC"
  ],
  "primary_category": "q-bio.MN",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14043",
  "pdf_url": null,
  "comment": "5 figures, original research article submitted to BBA-Bioenergetics",
  "num_versions": null,
  "size_before_bytes": 1607773,
  "size_after_bytes": 455060
}