{
  "title": "White dwarf spectral type-temperature distribution from Gaia-DR3 and the Virtual Observatory",
  "authors": [
    "S. Torres",
    "P. Cruz",
    "R. Murillo-Ojeda",
    "F. M. Jiménez-Esteban",
    "A. Rebassa-Mansergas",
    "E. Solano",
    "M. E. Camisassa",
    "R. Raddi",
    "J. Doliguez Le Lourec"
  ],
  "submission_date": "2023-07-25T16:30:18+00:00",
  "revised_dates": [],
  "abstract": "The characterization of white dwarf atmospheres is crucial for accurately deriving stellar parameters such as effective temperature, mass, and age. We aim to classify the population of white dwarfs up to 500 pc into hydrogen-rich or hydrogen-deficient atmospheres based on Gaia spectra and to derive an accurate spectral type-temperature distribution of white dwarfs as a function of the effective temperature for the largest observed unbiased sample of these objects. We took advantage of the recent Gaia low-resolution spectra available for 76,657 white dwarfs up to 500 pc. We calculated synthetic J-PAS narrow-band photometry and fitted the spectral energy distribution of each object with up-to-date models for hydrogen-rich and helium-rich white dwarf atmospheres. We estimated the probability for a white dwarf to have a hydrogen-rich atmosphere and validated the results using the Montreal White Dwarf Database. Finally, precise effective temperature values were derived for each object using La Plata evolutionary models. We have successfully classified a total of 65,310 white into DAs and non-DAs with an accuracy of 94%. An unbiased subsample of nearly 34,000 objects was built, from which we computed a precise spectral distribution spanning an effective temperature range from 5,500 to 40,000 K, while accounting for potential selection effects. Some characteristic features of the spectral evolution, such as the deficit of helium-rich stars at T_eff $\\approx$35,000-40,000 K and in the range 22,000 < T_eff < 25,000 K, as well as a gradual increase from 18,000K to T_eff $\\approx$7,000K, where the non-DA stars percentage reaches its maximum of 41%, followed by a decrease for cooler temperatures, are statistically significant. These findings will provide precise constraints for the proposed models of spectral evolution.",
  "categories": [
    "astro-ph.SR",
    "astro-ph.EP",
    "astro-ph.IM"
  ],
  "primary_category": "astro-ph.SR",
  "doi": "10.1051/0004-6361/202346977",
  "journal_ref": "A&A 677, A159 (2023)",
  "arxiv_id": "2307.13629",
  "pdf_url": null,
  "comment": "7 pages, 11 pages. Accepted for publication in A&A",
  "num_versions": null,
  "size_before_bytes": 810868,
  "size_after_bytes": 57643
}