{
  "title": "A Cascade Transformer-based Model for 3D Dose Distribution Prediction in Head and Neck Cancer Radiotherapy",
  "authors": [
    "Tara Gheshlaghi",
    "Shahabedin Nabavi",
    "Samire Shirzadikia",
    "Mohsen Ebrahimi Moghaddam",
    "Nima Rostampour"
  ],
  "submission_date": "2023-07-22T07:27:59+00:00",
  "revised_dates": [],
  "abstract": "Radiation therapy is the primary method used to treat cancer in the clinic. Its goal is to deliver a precise dose to the planning target volume (PTV) while protecting the surrounding organs at risk (OARs). However, the traditional workflow used by dosimetrists to plan the treatment is time-consuming and subjective, requiring iterative adjustments based on their experience. Deep learning methods can be used to predict dose distribution maps to address these limitations. The study proposes a cascade model for organs at risk segmentation and dose distribution prediction. An encoder-decoder network has been developed for the segmentation task, in which the encoder consists of transformer blocks, and the decoder uses multi-scale convolutional blocks. Another cascade encoder-decoder network has been proposed for dose distribution prediction using a pyramid architecture. The proposed model has been evaluated using an in-house head and neck cancer dataset of 96 patients and OpenKBP, a public head and neck cancer dataset of 340 patients. The segmentation subnet achieved 0.79 and 2.71 for Dice and HD95 scores, respectively. This subnet outperformed the existing baselines. The dose distribution prediction subnet outperformed the winner of the OpenKBP2020 competition with 2.77 and 1.79 for dose and DVH scores, respectively. The predicted dose maps showed good coincidence with ground truth, with a superiority after linking with the auxiliary segmentation task. The proposed model outperformed state-of-the-art methods, especially in regions with low prescribed doses.",
  "categories": [
    "eess.IV",
    "physics.med-ph"
  ],
  "primary_category": "eess.IV",
  "doi": "10.1088/1361-6560/ad209a",
  "journal_ref": "Physics in Medicine & Biology, Volume 69, Number 4, 2024",
  "arxiv_id": "2307.12005",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}