{
  "title": "Electron-induced non-monotonic pressure dependence of the lattice thermal conductivity of θ-TaN",
  "authors": [
    "Ashis Kundu",
    "Yani Chen",
    "Xiaolong Yang",
    "Fanchen Meng",
    "Jesús Carrete",
    "Mukul Kabir",
    "Georg K. H. Madsen",
    "Wu Li"
  ],
  "submission_date": "2023-07-28T08:59:18+00:00",
  "revised_dates": [
    "2024-03-19T05:49:28+00:00"
  ],
  "abstract": "Recent theoretical and experimental research suggests that $θ$-TaN is a semimetal with high thermal conductivity ($κ$), primarily due to the contribution of phonons ($κ_\\texttt{ph}$). By using first-principles calculations, we show a non-monotonic pressure dependence of the $κ$ of $θ$-TaN. $κ_\\texttt{ph}$ first increases until it reaches a maximum at around 60~GPa, and then decreases. This anomalous behaviour is a consequence of the competing pressure responses of phonon-phonon and phonon-electron interactions, in contrast to the known materials BAs and BP, where the non-monotonic pressure dependence is caused by the interplay between different phonon-phonon scattering channels. Although TaN has phonon dispersion features similar to BAs at ambient pressure, its response to pressure is different and an overall stiffening of the phonon branches takes place. Consequently, the relevant phonon-phonon scattering weakens as pressure increases. However, the increased electronic density of states near the Fermi level, and specifically the emergence of additional pockets of the Fermi surface at the high-symmetry L point in the Brillouin zone, leads to a substantial increase in phonon-electron scattering at high pressures, driving a decrease in $κ_{\\mathrm{ph}}$. At intermediate pressures ($\\sim$~20$-$70~GPa), the $κ$ of TaN surpasses that of BAs. Our work provides deeper insight into phonon transport in semimetals and metals where phonon-electron scattering is relevant.",
  "categories": [
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": "10.1103/PhysRevLett.132.116301",
  "journal_ref": "Phys. Rev. Lett. 132, 116301 (2024)",
  "arxiv_id": "2307.15407",
  "pdf_url": "https://arxiv.org/pdf/2307.15407v2",
  "comment": "6 pages, 4 figures",
  "num_versions": null,
  "size_before_bytes": 6950133,
  "size_after_bytes": 141800
}