{
  "title": "Strain stiffening universality in composite hydrogels and soft tissues",
  "authors": [
    "Jake Song",
    "Elad Deiss-Yehiely",
    "Serra Yesilata",
    "Gareth H. McKinley"
  ],
  "submission_date": "2023-07-21T16:42:18+00:00",
  "revised_dates": [],
  "abstract": "Soft biological tissues exhibit a remarkable resilience to large mechanical loads, a property which is associated with the strain stiffening capability of the biopolymer networks that structurally support the tissues. Yet, recent studies have shown that composite systems such as tissues and blood clots exhibit mechanical properties that contradict those of the polymer matrix - demonstrating stiffening in compression, but softening in shear and tension. The microscopic basis of this apparent paradox remains poorly understood. We show that composite hydrogels and tissues do indeed exhibit non-linear elastic stiffening in shear - which is governed by the stretching of the polymer chains in the matrix - and that it is driven by the same mechanism that drives compression stiffening. However, we show that the non-linear elastic stiffening in composite hydrogels and tissues is masked by mechanical dissipation arising from filler-polymer interactions known as the Mullins effect, and we introduce a method to characterize the non-linear elasticity of the composites in isolation from this overall strain softening response through large-amplitude oscillatory shear experiments. We present a comprehensive characterization of the non-linear elastic strain stiffening of composite hydrogels and soft tissues, and show that the strain stiffening in shear and compression are both governed by universal strain amplification factors that depend on essential properties of the composite system, such as the filler concentration and the filler-polymer interaction strength. These results elucidate the microscopic mechanisms governing the non-linear mechanics of tissues, which provides design principles for engineering tissue-mimetic soft materials, and have broad implications for cell-matrix mechanotransduction in living tissues under strain.",
  "categories": [
    "cond-mat.soft",
    "physics.bio-ph"
  ],
  "primary_category": "cond-mat.soft",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11687",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}