{
  "title": "Fate of homogeneous $\\mathbb{Z}_2$-symmetric scalar condensates",
  "authors": [
    "Wen-Yuan Ai",
    "Zi-Liang Wang"
  ],
  "submission_date": "2023-07-27T12:35:39+00:00",
  "revised_dates": [
    "2024-06-29T07:14:02+00:00"
  ],
  "abstract": "Dark matter, if represented by a $\\mathbb{Z}_2$-symmetric scalar field, can manifest as both particles and condensates. In this paper, we study the evolution of an oscillating homogeneous condensate of a $\\mathbb{Z}_2$-symmetric scalar field in a thermal plasma in an FLRW universe. We focus on the perturbative regime where the oscillation amplitude is sufficiently small so that parametric resonance is inefficient. This perturbative regime necessarily comprises the late stage of the condensate decay and determines its fate. The coupled coarse-grained equations of motion for the condensate, radiation, and spacetime are derived from first principles using nonequilibrium quantum field theory. We obtain analytical expressions for the relevant microscopic quantities that enter the equations of motion and solve the latter numerically. We find that there is always a nonvanishing relic abundance for a condensate with a $\\mathbb{Z}_2$ symmetry that is not spontaneously broken. This is because its decay rate decreases faster than the Hubble parameter at late times due to either the amplitude dependence or the temperature dependence in the condensate decay rate. Consequently, accounting for the condensate contribution to the overall dark matter relic density is essential for $\\mathbb{Z}_2$ scalar singlet dark matter.",
  "categories": [
    "hep-ph",
    "astro-ph.CO",
    "hep-th"
  ],
  "primary_category": "hep-ph",
  "doi": "10.1088/1475-7516/2024/06/075",
  "journal_ref": "JCAP 06 (2024) 075",
  "arxiv_id": "2307.14811",
  "pdf_url": "https://arxiv.org/pdf/2307.14811v2",
  "comment": "56 pages, 17 figures; v2: refs updated, minor changes, matches the version published in JCAP",
  "num_versions": null,
  "size_before_bytes": 4407820,
  "size_after_bytes": 2592653
}