{
  "title": "(How) Do pre-service teachers use YouTube features in the selection of instructional videos for physics teaching?",
  "authors": [
    "Philipp Bitzenbauer",
    "Tom Teußner",
    "Joaquin Veith",
    "Christoph Kulgemeyer"
  ],
  "submission_date": "2023-07-30T21:37:36+00:00",
  "revised_dates": [],
  "abstract": "This mixed-methods study examines how pre-service teachers select instructional videos on YouTube for physics teaching. It focuses on the role of surface features that YouTube provides (e.g., likes, views, thumbnails) and the comments underneath the videos in the decision-making process using videos on quantum physics topics as an example. The study consists of two phases: In phase 1, N = 24 (pre-service) physics teachers were randomly assigned to one of three groups, each covering a different quantum topic (entanglement, quantum tunnelling or quantum computing, respectively). From eight options provided, they selected a suitable video for teaching while their eye movements were tracked, and think-aloud data was collected. Phase 2 allowed participants to freely choose one YouTube video on a second quantum topic while thinking aloud. The results reveal a significant emphasis on video thumbnails during selection, with over one-third of the fixation time directed towards them. Think-aloud data confirms the importance of thumbnails in decision-making. A detailed analysis identifies that participants did not rely on (content-related) comments despite they have found to be significantly correlated with the videos' explaining quality. Instead, decisions were influenced by surface features and pragmatic factors such as channel familiarity. Retrospective reflections through a questionnaire support these observations. Building on the existing empirical evidence, a decision tree is proposed to help teachers identify high-quality videos considering duration, likes, comments, and interactions. The decision tree can serve as a hypothesis for future research and needs to be evaluated in terms of how it can help systematize the process of selecting high-quality YouTube videos for science teaching.",
  "categories": [
    "physics.ed-ph"
  ],
  "primary_category": "physics.ed-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16326",
  "pdf_url": "https://arxiv.org/pdf/2307.16326v1",
  "comment": "34 pages, 13 figures",
  "num_versions": null,
  "size_before_bytes": 2829578,
  "size_after_bytes": 403027
}