{
  "title": "Automated Preparation of Nanoscopic Structures: Graph-Based Sequence Analysis, Mismatch Detection, and pH-Consistent Protonation with Uncertainty Estimates",
  "authors": [
    "Katja-Sophia Csizi",
    "Markus Reiher"
  ],
  "submission_date": "2023-07-30T23:43:43+00:00",
  "revised_dates": [
    "2024-02-20T10:51:55+00:00"
  ],
  "abstract": "Structure and function in nanoscale atomistic assemblies are tightly coupled, and every atom with its specific position and even every electron will have a decisive effect on the electronic structure, and hence, on the molecular properties. Molecular simulations of nanoscopic atomistic structures therefore require accurately resolved three-dimensional input structures. If extracted from experiment, these structures often suffer from severe uncertainties, of which the lack of information on hydrogen atoms is a prominent example. Hence, experimental structures require careful review and curation, which is a time-consuming and error-prone process. Here, we present a fast and robust protocol for the automated structure analysis, and pH-consistent protonation, in short, ASAP. For biomolecules as a target, the ASAP protocol integrates sequence analysis and error assessment of a given input structure. ASAP allows for pKa prediction from reference data through Gaussian process regression including uncertainty estimation and connects to system-focused atomistic modeling described in (J. Chem. Theory Comput. 16, 2020, 1646). Although focused on biomolecules, ASAP can be extended to other nanoscopic objects, because most of its design elements rely on a general graph-based foundation guaranteeing transferability. The modular character of the underlying pipeline supports different degrees of automation, which allows for (i) efficient feedback loops for human-machine interaction with a low entrance barrier and for (ii) integration into autonomous procedures such as automated force field parametrizations. This facilitates fast switching of the pH-state through on-the-fly system-focused reparametrization during a molecular simulation at virtually no extra computational cost.",
  "categories": [
    "physics.chem-ph",
    "physics.bio-ph",
    "physics.data-an"
  ],
  "primary_category": "physics.chem-ph",
  "doi": "10.1002/jcc.27276",
  "journal_ref": null,
  "arxiv_id": "2307.16344",
  "pdf_url": "https://arxiv.org/pdf/2307.16344v2",
  "comment": "36 pages, 11 figures, 3 tables",
  "num_versions": null,
  "size_before_bytes": 14168798,
  "size_after_bytes": 211738
}