{
  "title": "Sub-second periodic radio oscillations in a microquasar",
  "authors": [
    "Pengfu Tian",
    "Ping Zhang",
    "Wei Wang",
    "Pei Wang",
    "Xiaohui Sun",
    "Jifeng Liu",
    "Bing Zhang",
    "Zigao Dai",
    "Feng Yuan",
    "Shuangnan Zhang",
    "Qingzhong Liu",
    "Peng Jiang",
    "Xuefeng Wu",
    "Zheng Zheng",
    "Jiashi Chen",
    "Di Li",
    "Zonghong Zhu",
    "Zhichen Pan",
    "Hengqian Gan",
    "Xiao Chen",
    "Na Sai"
  ],
  "submission_date": "2023-07-26T07:57:55+00:00",
  "revised_dates": [],
  "abstract": "Powerful relativistic jets are one of the ubiquitous features of accreting black holes in all scales. GRS 1915+105 is a well-known fast-spinning black-hole X-ray binary with a relativistic jet, termed as a ``microquasar'', as indicated by its superluminal motion of radio emission. It exhibits persistent x-ray activity over the last 30 years, with quasi-periodic oscillations of $\\sim 1-10$ Hz and 34 and 67 Hz in the x-ray band. These oscillations likely originate in the inner accretion disk, but other origins have been considered. Radio observations found variable light curves with quasi-periodic flares or oscillations with periods of $\\sim 20-50$ minutes. Here we report two instances of $\\sim$5 Hz transient periodic oscillation features from the source detected in the 1.05-1.45 GHz radio band that occurred in January 2021 and June 2022, respectively. Circular polarization was also observed during the oscillation phase.",
  "categories": [
    "astro-ph.HE",
    "astro-ph.SR"
  ],
  "primary_category": "astro-ph.HE",
  "doi": "10.1038/s41586-023-06336-6",
  "journal_ref": "2023, Nature, 621, 271-275",
  "arxiv_id": "2307.14015",
  "pdf_url": null,
  "comment": "The author version of the article which will appear in Nature on 26 July 2023, 32 pages including the extended data. The online publication version can be found at the following URL: https://www.nature.com/articles/s41586-023-06336-6",
  "num_versions": null,
  "size_before_bytes": 12328990,
  "size_after_bytes": 149408
}