{
  "title": "How Good is Google Bard's Visual Understanding? An Empirical Study on Open Challenges",
  "authors": [
    "Haotong Qin",
    "Ge-Peng Ji",
    "Salman Khan",
    "Deng-Ping Fan",
    "Fahad Shahbaz Khan",
    "Luc Van Gool"
  ],
  "submission_date": "2023-07-27T17:19:32+00:00",
  "revised_dates": [
    "2023-08-30T13:33:59+00:00"
  ],
  "abstract": "Google's Bard has emerged as a formidable competitor to OpenAI's ChatGPT in the field of conversational AI. Notably, Bard has recently been updated to handle visual inputs alongside text prompts during conversations. Given Bard's impressive track record in handling textual inputs, we explore its capabilities in understanding and interpreting visual data (images) conditioned by text questions. This exploration holds the potential to unveil new insights and challenges for Bard and other forthcoming multi-modal Generative models, especially in addressing complex computer vision problems that demand accurate visual and language understanding. Specifically, in this study, we focus on 15 diverse task scenarios encompassing regular, camouflaged, medical, under-water and remote sensing data to comprehensively evaluate Bard's performance. Our primary finding indicates that Bard still struggles in these vision scenarios, highlighting the significant gap in vision-based understanding that needs to be bridged in future developments. We expect that this empirical study will prove valuable in advancing future models, leading to enhanced capabilities in comprehending and interpreting fine-grained visual data. Our project is released on https://github.com/htqin/GoogleBard-VisUnderstand",
  "categories": [
    "cs.CV",
    "cs.AI",
    "cs.LG"
  ],
  "primary_category": "cs.CV",
  "doi": "10.1007/s11633-023-1469-x",
  "journal_ref": "Machine Intelligence Research. 20(5), October 2023, 605-613",
  "arxiv_id": "2307.15016",
  "pdf_url": "https://arxiv.org/pdf/2307.15016v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 3132978,
  "size_after_bytes": 643308
}