{
  "title": "De-confounding Representation Learning for Counterfactual Inference on Continuous Treatment via Generative Adversarial Network",
  "authors": [
    "Yonghe Zhao",
    "Qiang Huang",
    "Haolong Zeng",
    "Yun Pen",
    "Huiyan Sun"
  ],
  "submission_date": "2023-07-24T08:56:25+00:00",
  "revised_dates": [],
  "abstract": "Counterfactual inference for continuous rather than binary treatment variables is more common in real-world causal inference tasks. While there are already some sample reweighting methods based on Marginal Structural Model for eliminating the confounding bias, they generally focus on removing the treatment's linear dependence on confounders and rely on the accuracy of the assumed parametric models, which are usually unverifiable. In this paper, we propose a de-confounding representation learning (DRL) framework for counterfactual outcome estimation of continuous treatment by generating the representations of covariates disentangled with the treatment variables. The DRL is a non-parametric model that eliminates both linear and nonlinear dependence between treatment and covariates. Specifically, we train the correlations between the de-confounded representations and the treatment variables against the correlations between the covariate representations and the treatment variables to eliminate confounding bias. Further, a counterfactual inference network is embedded into the framework to make the learned representations serve both de-confounding and trusted inference. Extensive experiments on synthetic datasets show that the DRL model performs superiorly in learning de-confounding representations and outperforms state-of-the-art counterfactual inference models for continuous treatment variables. In addition, we apply the DRL model to a real-world medical dataset MIMIC and demonstrate a detailed causal relationship between red cell width distribution and mortality.",
  "categories": [
    "cs.LG",
    "cs.AI",
    "stat.ME"
  ],
  "primary_category": "cs.LG",
  "doi": "10.1007/s10618-024-01058-3",
  "journal_ref": null,
  "arxiv_id": "2307.12625",
  "pdf_url": null,
  "comment": "15 pages,4 figures. Data Min Knowl Disc (2024)",
  "num_versions": null,
  "size_before_bytes": 3678610,
  "size_after_bytes": 537229
}