{
  "title": "Synthesis of possible room temperature superconductor LK-99:Pb$_9$Cu(PO$_4$)$_6$O",
  "authors": [
    "Kapil Kumar",
    "N. K. Karn",
    "V. P. S. Awana"
  ],
  "submission_date": "2023-07-31T04:41:20+00:00",
  "revised_dates": [
    "2023-08-26T07:56:33+00:00"
  ],
  "abstract": "The quest for room-temperature superconductors has been teasing scientists and physicists, since its inception in 1911 itself. Several assertions have already been made about room temperature superconductivity but were never verified or reproduced across the labs. The cuprates were the earliest high transition temperature superconductors, and it seems that copper has done the magic once again. Last week, a Korean group synthesized a Lead Apatite-based compound LK-99, showing a T$_c$ of above 400$^\\circ$K. The signatures of superconductivity in the compound are very promising, in terms of resistivity (R = 0) and diamagnetism at T$_c$. Although, the heat capacity (C$_p$) did not show the obvious transition at T$_c$. Inspired by the interesting claims of above room temperature superconductivity in LK-99, in this article, we report the synthesis of polycrystalline samples of LK-99, by following the same heat treatment as reported in [1,2] by the two-step precursor method. The phase is confirmed through X-ray diffraction (XRD) measurements, performed after each heat treatment. The room temperature diamagnetism is not evidenced by the levitation of a permanent magnet over the sample or vice versa. Further measurements for the confirmation of bulk superconductivity on variously synthesized samples are underway. Our results on the present LK-99 sample, being synthesized at 925$^\\circ$C, as of now do not approve the appearance of bulk superconductivity at room temperature. Further studies with different heat treatments are though, yet underway.",
  "categories": [
    "cond-mat.supr-con",
    "cond-mat.mtrl-sci",
    "cond-mat.str-el"
  ],
  "primary_category": "cond-mat.supr-con",
  "doi": "10.1088/1361-6668/acf002",
  "journal_ref": "Superconductor Science and Technology 36, 10LT02 (2023)",
  "arxiv_id": "2307.16402",
  "pdf_url": "https://arxiv.org/pdf/2307.16402v2",
  "comment": "Short Commun.: 8pages Text + Figs: Comments/suggestion Welcome",
  "num_versions": null,
  "size_before_bytes": 1738306,
  "size_after_bytes": 1011778
}