{
  "title": "Factory-based Fault-tolerant Preparation of Quantum Polar Codes Encoding One logical Qubit",
  "authors": [
    "Ashutosh Goswami",
    "Mehdi Mhalla",
    "Valentin Savin"
  ],
  "submission_date": "2023-07-27T23:07:03+00:00",
  "revised_dates": [
    "2024-06-05T20:26:57+00:00"
  ],
  "abstract": "A fault-tolerant way to prepare logical code-states of Q1 codes, i.e., quantum polar codes encoding one qubit, has been recently proposed. The fault tolerance therein is guaranteed by an error detection gadget, where if an error is detected during the preparation, one discards entirely the preparation. Due to error detection, the preparation is probabilistic, and its success rate, referred to as the preparation rate, decreases rapidly with the code-length, preventing the preparation of code-states of large code-lengths. In this paper, to improve the preparation rate, we consider a factory preparation of Q1 code-states, where one attempts to prepare several copies of Q1 code-states in parallel. Using an extra scheduling step, we can avoid discarding the preparation entirely, every time an error is detected, hence, achieving an increased preparation rate in turn. We further provide a theoretical method to estimate preparation and logical error rates of Q1 codes, prepared using factory preparation, which is shown to tightly fit the Monte-Carlo simulation based numerical results. Therefore, our theoretical method is useful for providing estimates for large code-lengths, where Monte-Carlo simulations are practically not feasible. Our numerical results, for a circuit-level depolarizing noise model, indicate that the preparation rate increases significantly, especially for large code-length N. For example, for N = 256, it increases from 0.02\\% to 27\\% for a practically interesting physical error rate of p = 10^{-3}. Remarkably, a Q1 code with N = 256 achieves logical error rates around 10^{-11} and 10^{-15} for p = 10^{-3} and p = 3 x 10^{-4}, respectively. This corresponds to an improvement of about three orders of magnitude compared to a surface code with similar code-length and minimum distance, thus showing the promise of the proposed scheme for large-scale fault-tolerant quantum computing.",
  "categories": [
    "quant-ph"
  ],
  "primary_category": "quant-ph",
  "doi": "10.1103/PhysRevA.110.012438",
  "journal_ref": "Phys. Rev. A 110, 012438, 2024",
  "arxiv_id": "2307.15226",
  "pdf_url": "https://arxiv.org/pdf/2307.15226v2",
  "comment": "24 pages, 11 figures",
  "num_versions": null,
  "size_before_bytes": 5074497,
  "size_after_bytes": 713463
}