{
  "title": "On the use of mixed potential formulation for finite-element analysis of large-scale magnetization problems with large memory demand",
  "authors": [
    "Alexander Chervyakov"
  ],
  "submission_date": "2023-07-23T12:40:32+00:00",
  "revised_dates": [],
  "abstract": "The finite-element analysis of three-dimensional magnetostatic problems in terms of magnetic vector potential has proven to be one of the most efficient tools capable of providing the excellent quality results but becoming computationally expensive when employed to modeling of large-scale magnetization problems in the presence of applied currents and nonlinear materials due to subnational number of the model degrees of freedom. In order to achieve a similar quality of calculation at lower computational cost, we propose to use for modeling such problems the combination of magnetic vector and total scalar potentials as an alternative to magnetic vector potential formulation. The potentials are applied to conducting and nonconducting parts of the problem domain, respectively and coupled together across their common interfacing boundary. For nonconducting regions, the thin cuts are constructed to ensure their simply connectedness and therefore the consistency of the mixed formulation. The implementation in the finite-element method of both formulations is discussed in detail with difference between the two emphasized. The numerical performance of finite-element modeling in terms of combined potentials is assessed against the magnetic vector potential formulation for two magnetization models, the Helmholtz coil, and the dipole magnet. We show that mixed formulation can provide a substantial reduction in the computational cost as compared to its vector counterpart for a similar accuracy of both methods.",
  "categories": [
    "physics.comp-ph"
  ],
  "primary_category": "physics.comp-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12308",
  "pdf_url": null,
  "comment": "14 pages, 7 figure, 2 tables",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}