{
  "title": "Improved GALEX UV Photometry for 700,000 SDSS Galaxies",
  "authors": [
    "Chandler Osborne",
    "Samir Salim",
    "Mederic Boquien",
    "Mark Dickinson",
    "Stephane Arnouts"
  ],
  "submission_date": "2023-07-25T18:00:52+00:00",
  "revised_dates": [],
  "abstract": "The Galaxy Evolution Explorer (GALEX) satellite performed the first and only large-area UV survey, which in tandem with the Sloan Digital Sky Survey (SDSS) has facilitated modeling of the spectral energy distributions (SEDs) of low-redshift galaxies and the determination of various galaxy properties, in particular the star formation rate. However, the relatively crude angular resolution of GALEX (5\") made its images susceptible to blending of sources, resulting in potentially biased far-UV (FUV) and near-UV (NUV) pipeline photometry. To remedy this issue and take advantage of model-fit photometry, we use the EMphot software to obtain forced GALEX photometry for ~700,000 SDSS galaxies at z<0.3. Positional priors of target galaxies and potentially contaminating neighbors were taken from SDSS. New photometry is based on the best-fitting of three model profiles: optical-like, exponential and flat. New photometry mitigates blending present in the original pipeline catalogs, which affected 16% of galaxies at a level of >0.2 mag and 2% at a level of >1 mag. Pipeline NUV magnitudes are severely affected (>1 mag) when the neighbor is brighter than the target galaxy and within 10\", or when the neighbor is fainter and within ~3\" of the target. New photometry fixes edge-of-detector bias, which affected pipeline photometry by up to 0.1 mag in NUV. We present catalogs with new photometry for GALEX observations of different depths, corresponding to the all-sky imaging survey (AIS), medium imaging survey (MIS) and deep imaging survey (DIS). Catalogs feature combined magnitudes for multiple detections of the same galaxy in a survey.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13739",
  "pdf_url": null,
  "comment": "17 pages, 1 table, 15 figures, accepted to ApJS",
  "num_versions": null,
  "size_before_bytes": 7074547,
  "size_after_bytes": 511379
}