{
  "title": "Application of murexide as a capping agent for fabrication of magnetite anodes for supercapacitors: experimental and first-principle studies",
  "authors": [
    "Coulton Boucher",
    "Igor Zhitomirsky",
    "Oleg Rubel"
  ],
  "submission_date": "2023-07-29T00:29:20+00:00",
  "revised_dates": [],
  "abstract": "In this study, we investigate the effectiveness of murexide for surface modification of Fe$_3$O$_4$ nanoparticles to enhance the performance of multi-walled carbon nanotube-Fe$_3$O$_4$ supercapacitor anodes. Our experimental results demonstrate significant improvements in electrode performance when murexide is used as a capping or dispersing agent compared to the case with no additives. When murexide is used as a capping agent, we report a capacitance of 4.2 F cm$^{-2}$ from cyclic voltammetry analysis with good capacitance retention at high scan rate. From impedance measurements, we reveal a substantial decrease in the real part of impedance for samples prepared with murexide, indicating easier charge transfer at more negative electrode potentials, and reinforcing the role of murexide as a capping agent and charge transfer mediator. Density functional theory is used to investigate interactions between the murexide adsorbate and the Fe$_3$O$_4$ (001) surface, with a specific emphasis on adsorption strength, charge transfer, and electronic properties. This theoretical investigation uncovers a strong adsorption enthalpy of -4.5 eV, and allows us to identify the nature of chemical bonds between murexide and the surface, with significant charge transfer taking place between the Fe$_3$O$_4$ surface and murexide adsorbate. The transfer of electrons from the Fe$_3$O$_4$ surface to murexide is recognized as a vital component of the adsorption process. By examining the bonding nature of murexide on Fe$_3$O$_4$, this research study uncovers insights and proposes a novel bonding configuration of murexide that incorporates a combination of bridging and chelating bonding.",
  "categories": [
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": "10.1007/s10853-024-09524-5",
  "journal_ref": "J. Mater. Sci. 59, 5480-5497 (2024)",
  "arxiv_id": "2307.15845",
  "pdf_url": "https://arxiv.org/pdf/2307.15845v1",
  "comment": "30 pages, 11 figures, 1 table",
  "num_versions": null,
  "size_before_bytes": 2768709,
  "size_after_bytes": 73690
}