{
  "title": "A method to extract macroscopic interface data from microscale rough/porous wall flow fields",
  "authors": [
    "Vedanth N Kuchibhotla",
    "Sujit Kumar Sahoo",
    "Y. Sudhakar"
  ],
  "submission_date": "2023-07-25T15:56:00+00:00",
  "revised_dates": [
    "2023-09-22T00:16:17+00:00"
  ],
  "abstract": "Performing geometry-resolved simulations of flows over rough and porous walls is highly expensive due to their multiscale characteristics. Effective models that circumvent this difficulty are often used to investigate the interaction between the free-fluid and such complex walls. These models, by construction, employ an intrinsic averaging process and capture only macroscopic physical processes. However, physical experiments or direct simulations yield micro- and macroscale information, and isolating the macroscopic effect from them is crucial for rigorously validating the accuracy of effective models. Despite the increasing use of effective models, this aspect received the least attention in the literature. This paper presents an efficient averaging technique to extract macroscopic interface data from the flowfield obtained via direct simulations or physical experiments. The proposed methodology employs a combination of signal processing and polynomial interpolation techniques to capture the macroscopic information. Results from the ensemble averaging are used as the reference to quantify the accuracy of the proposed method. Compared to the ensemble averaging, the proposed method, while retaining accuracy, is cost-effective for rough and porous walls. To the best of our knowledge, this is the only averaging method that works for poroelastic walls, for which the ensemble averaging fails. Moreover, it applies equally to viscous- and inertia-dominated flows over irregular surfaces.",
  "categories": [
    "physics.flu-dyn"
  ],
  "primary_category": "physics.flu-dyn",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.13596",
  "pdf_url": null,
  "comment": "31 pages, 18 figures",
  "num_versions": null,
  "size_before_bytes": 4505306,
  "size_after_bytes": 1369975
}