{
  "title": "Sub-Doppler laser cooling and magnetic trapping of natural-abundance fermionic potassium",
  "authors": [
    "Mateusz Bocheński",
    "Mariusz Semczuk"
  ],
  "submission_date": "2023-07-31T08:01:15+00:00",
  "revised_dates": [
    "2024-05-07T10:32:29+00:00"
  ],
  "abstract": "We report on reaching sub-Doppler temperatures of $^{40}$K in a single-chamber setup using a dispenser-based potassium source with natural (0.012$\\%$ of $^{40}$K) isotopic composition. With gray molasses cooling on the $D_1$-line following a standard $D_2$-line magneto-optical trap, we obtain $3\\times10^5$ atoms at $\\sim$10~\\textmu K. We reach densities high enough to measure the temperature via absorption imaging using the time-of-flight method. Directly after sub-Doppler cooling we pump atoms into the $F=7/2$ hyperfine ground state and transfer a mixture of $m_F=-3/2,-5/2$ and $-7/2$ Zeeman states into the magnetic trap. We trap $5\\times10^4$ atoms with a lifetime of 0.6~s when the dispensers are heated up to maximize the atom number at a cost of deteriorated background gas pressure. When the dispensers have been off for a day and the magneto-optical trap loading rate has been increased by light induced atomic desorption we can magnetically trap $\\sim$$10^3$ atoms with a lifetime of 2.8~s. The background pressure-limited lifetime of 0.6~s is a reasonable starting point for proof-of-principle experiments with atoms and/or molecules in optical tweezers as well as for sympathetic cooling with another species if transport to a secondary chamber is implemented.\n  Our results show that unenriched potassium can be used to optimize experimental setups containing $^{40}$K in the initial stages of their construction, which can effectively extend the lifetime of enriched sources needed for proper experiments. Moreover, demonstration of sub-Doppler cooling and magnetic trapping of a relatively small number of potassium atoms might influence experiments with laser cooled radioactive isotopes of potassium.",
  "categories": [
    "physics.atom-ph",
    "cond-mat.quant-gas"
  ],
  "primary_category": "physics.atom-ph",
  "doi": "10.1088/1361-6455/ad2181",
  "journal_ref": null,
  "arxiv_id": "2307.16469",
  "pdf_url": "https://arxiv.org/pdf/2307.16469v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 3978761,
  "size_after_bytes": 970162
}