{
  "title": "Performance Comparison Between VoLTE and non-VoLTE Voice Calls During Mobility in Commercial Deployment: A Drive Test-Based Analysis",
  "authors": [
    "Rashed Hasan Ratul",
    "Muhammad Iqbal",
    "Jen-Yi Pan",
    "Mohammad Mahadi Al Deen",
    "Mohammad Tawhid Kawser",
    "Mohammad Masum Billah"
  ],
  "submission_date": "2023-07-23T18:22:51+00:00",
  "revised_dates": [],
  "abstract": "The optimization of network performance is vital for the delivery of services using standard cellular technologies for mobile communications. Call setup delay and User Equipment (UE) battery savings significantly influence network performance. Improving these factors is vital for ensuring optimal service delivery. In comparison to traditional circuit-switched voice calls, VoLTE (Voice over LTE) technology offers faster call setup durations and better battery-saving performance. To validate these claims, a drive test was carried out using the XCAL drive test tool to collect real-time network parameter details in VoLTE and non-VoLTE voice calls. The findings highlight the analysis of real-time network characteristics, such as the call setup delay calculation, battery-saving performance, and DRX mechanism. The study contributes to the understanding of network optimization strategies and provides insights for enhancing the quality of service (QoS) in mobile communication networks. Examining VoLTE and non-VoLTE operations, this research highlights the substantial energy savings obtained by VoLTE. Specifically, VoLTE saves approximately 60.76% of energy before the Service Request and approximately 38.97% of energy after the Service Request. Moreover, VoLTE to VoLTE calls have a 72.6% faster call setup delay than non-VoLTE-based LTE to LTE calls, because of fewer signaling messages required. Furthermore, as compared to non-VoLTE to non-VoLTE calls, VoLTE to non-VoLTE calls offer an 18.6% faster call setup delay. These results showcase the performance advantages of VoLTE and reinforce its potential for offering better services in wireless communication networks.",
  "categories": [
    "cs.NI",
    "eess.AS"
  ],
  "primary_category": "cs.NI",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12397",
  "pdf_url": null,
  "comment": "Accepted for presentation and Publication on the IEEE 10th International Conference on Electrical Engineering, Computer Science and Informatics (EECSI 2023)",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}