{
  "title": "A visit generation process for human mobility random graphs with location-specific latent-variables: from land use to travel demand",
  "authors": [
    "Fabio Vanni"
  ],
  "submission_date": "2023-07-26T13:22:23+00:00",
  "revised_dates": [],
  "abstract": "This research introduces a mathematical framework to comprehending human mobility patterns, integrating mathematical modeling and economic analysis. The study focuses on latent-variable networks, investigating the dynamics of human mobility using stochastic models. By examining actual origin-destination data, the research reveals scaling relations and uncovers the economic implications of mobility patterns, such as the income elasticity of travel demand. The mathematical analysis commences with the development of a stochastic model based on inhomogeneous random graphs to construct a visitation model with multipurpose drivers for travel demand. A directed multigraph with weighted edges is considered, incorporating trip costs and labels to represent factors like distance traveled and travel time. The study gains insights into the structural properties and dynamic correlations of human mobility networks, to derive analytical and computational solutions for key network metrics, including scale-free behavior of the strength and degree distribution, together with the estimation of assortativity and clustering coefficient. Additionally, the model's validity is assessed through a real-world case study of the New York metropolitan area. The analysis of this data exposes clear scaling relations in commuting patterns, confirming theoretical predictions and validating the efficacy of the mathematical model. The model further explains a series of scaling behaviors in origin-destination flows among areas of a region, successfully reproducing statistical regularities observed in real-world cases using extensive human mobility datasets. In particular, the model's application to estimating income elasticity of travel demand bears significant implications for urban and transport economics.",
  "categories": [
    "physics.soc-ph"
  ],
  "primary_category": "physics.soc-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14183",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 18194872,
  "size_after_bytes": 198403
}