{
  "title": "Count, Decode and Fetch: A New Approach to Handwritten Chinese Character Error Correction",
  "authors": [
    "Pengfei Hu",
    "Jiefeng Ma",
    "Zhenrong Zhang",
    "Jun Du",
    "Jianshu Zhang"
  ],
  "submission_date": "2023-07-30T15:19:55+00:00",
  "revised_dates": [],
  "abstract": "Recently, handwritten Chinese character error correction has been greatly improved by employing encoder-decoder methods to decompose a Chinese character into an ideographic description sequence (IDS). However, existing methods implicitly capture and encode linguistic information inherent in IDS sequences, leading to a tendency to generate IDS sequences that match seen characters. This poses a challenge when dealing with an unseen misspelled character, as the decoder may generate an IDS sequence that matches a seen character instead. Therefore, we introduce Count, Decode and Fetch (CDF), a novel approach that exhibits better generalization towards unseen misspelled characters. CDF is mainly composed of three parts: the counter, the decoder, and the fetcher. In the first stage, the counter predicts the number of each radical class without the symbol-level position annotations. In the second stage, the decoder employs the counting information and generates the IDS sequence step by step. Moreover, by updating the counting information at each time step, the decoder becomes aware of the existence of each radical. With the decomposed IDS sequence, we can determine whether the given character is misspelled. If it is misspelled, the fetcher under the transductive transfer learning strategy predicts the ideal character that the user originally intended to write. We integrate our method into existing encoder-decoder models and significantly enhance their performance.",
  "categories": [
    "cs.CV"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16253",
  "pdf_url": "https://arxiv.org/pdf/2307.16253v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 15488368,
  "size_after_bytes": 13702234
}