{
  "title": "Supersymmetric Quantum Mechanics of Hypergeometric-like Differential Operators",
  "authors": [
    "Tianchun Zhou"
  ],
  "submission_date": "2023-07-29T09:59:54+00:00",
  "revised_dates": [
    "2023-09-30T04:28:43+00:00"
  ],
  "abstract": "Systematic iterative algorithms of supersymmetric quantum mechanics (SUSYQM) type for solving the eigenequation of principal hypergeometric-like differential operator (HLDO) and for generating the eigenequation of associated HLDO itself as well its solutions are developed, without any input from traditional methods. These are initiated by devising two types of active supersymmetrization transformations and momentum operator maps, which work to transform the same eigenequation of HLDO in its two trivial asymmetric factorizations into two distinct supersymmetrically factorized Schrödinger equations. The rest iteration flows are completely controlled by repeatedly performing intertwining action and incorporating some generalized commutator relations to renormalize the superpartner equation of the eigenequation of present level into that of next level. These algorithms therefore provide a simple SUSYQM answer to the question regarding why there exist simultaneously a series of principal as well as associated eigenfunctions for the same HLDO, which boils down to two basic facts: two distinct types of quantum momentum kinetic energy operators and superpotentials are rooted in this operator; each initial superpotential can proliferate into a hierarchy of descendant ones in a shape-invariant fashion. The two active supersymmetrizations establish the isomorphisms between the nonstandard and standard coordinate representations of the SUSYQM algorithm either for principal HLDO or for its associated one, so these algorithms can be constructed in either coordinate representation with equal efficiency. Due to their relatively high efficiency, algebraic elementariness and logical independence, the iterative SUSYQM algorithms developed in this paper could become the hopefuls for supplanting some traditional methods for solving the eigenvalue problems of principal HLDOs and their associated cousins.",
  "categories": [
    "quant-ph",
    "hep-th",
    "math-ph"
  ],
  "primary_category": "quant-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15948",
  "pdf_url": "https://arxiv.org/pdf/2307.15948v2",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 710181,
  "size_after_bytes": 688755
}