{
  "title": "Increasing the Rate of Magnesium Intercalation Underneath Epitaxial Graphene on 6H-SiC(0001)",
  "authors": [
    "Jimmy C. Kotsakidis",
    "Marc Currie",
    "Antonija Grubišić-Čabo",
    "Anton Tadich",
    "Rachael L. Myers-Ward",
    "Matthew DeJarld",
    "Kevin M. Daniels",
    "Chang Liu",
    "Mark T. Edmonds",
    "Amadeo L. Vázquez de Parga",
    "Michael S. Fuhrer",
    "D. Kurt Gaskill"
  ],
  "submission_date": "2023-07-27T22:11:21+00:00",
  "revised_dates": [],
  "abstract": "Magnesium intercalated 'quasi-freestanding' bilayer graphene on 6H-SiC(0001) (Mg-QFSBLG) has many favorable properties (e.g., highly n-type doped, relatively stable in ambient conditions). However, intercalation of Mg underneath monolayer graphene is challenging, requiring multiple intercalation steps. Here, we overcome these challenges and subsequently increase the rate of Mg intercalation by laser patterning (ablating) the graphene to form micron-sized discontinuities. We then use low energy electron diffraction to verify Mg-intercalation and conversion to Mg-QFSBLG, and X-ray photoelectron spectroscopy to determine the Mg intercalation rate for patterned and non-patterned samples. By modeling Mg intercalation with the Verhulst equation, we find that the intercalation rate increase for the patterned sample is 4.5$\\pm$1.7. Since the edge length of the patterned sample is $\\approx$5.2 times that of the non-patterned sample, the model implies that the increased intercalation rate is proportional to the increase in edge length. Moreover, Mg intercalation likely begins at graphene discontinuities in pristine samples (not step edges or flat terraces), where the 2D-like crystal growth of Mg-silicide proceeds. Our laser patterning technique may enable the rapid intercalation of other atomic or molecular species, thereby expanding upon the library of intercalants used to modify the characteristics of graphene, or other 2D materials and heterostructures.",
  "categories": [
    "cond-mat.mtrl-sci",
    "cond-mat.mes-hall"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": "10.1002/admi.202101598",
  "journal_ref": "Advanced Materials Interfaces 8.23 (2021): 2101598",
  "arxiv_id": "2307.15214",
  "pdf_url": "https://arxiv.org/pdf/2307.15214v1",
  "comment": "24 pages, 4 figures",
  "num_versions": null,
  "size_before_bytes": 1317047,
  "size_after_bytes": 786521
}