{
  "title": "Holographic Complexity of Rotating Quantum Black Holes",
  "authors": [
    "Bin Chen",
    "Yuefeng Liu",
    "Boyang Yu"
  ],
  "submission_date": "2023-07-29T12:19:17+00:00",
  "revised_dates": [
    "2023-09-12T08:56:37+00:00"
  ],
  "abstract": "We study holographic complexity for the rotating quantum BTZ black holes (quBTZ), the BTZ black holes with corrections from bulk quantum fields. Using double holography, the combined system of backreacted rotating BTZ black holes with conformal matters, can be holographically described by the rotating AdS4 C-metric with the BTZ black hole living on a codimension-1 brane. We investigate both volume complexity and action complexity of rotating quBTZ, and pay special attention to their late-time behaviors. When the mass of BTZ black hole is not very small and the rotation is not very slow, we show that the late-time rates of the volume complexity and the action complexity agree with each other up to a factor 2 and reduce to the ones of BTZ at the leading classical order, and they both receive subleading quantum corrections. For the volume complexity, the leading quantum correction comes from the backreaction of comformal matter on the geometry, similar to the static quBTZ case. For the action complexity, unlike the static case, the Wheeler-de Witt (WdW) patch in computing the action complexity for the rotating black hole does not touch the black hole singularity such that the leading order result is in good match with the one of classical BTZ. However, when the mass of BTZ black hole is small or the rotation parameter a is small, the quantum correction to the action complexity could be significant such that the late-time slope of the action complexity of quBTZ deviates very much from the one of classical BTZ. Remarkably, we notice that the nonrotating limit $a \\to 0$ is singular and does not lead to the late-time slope of the action complexity for non-rotating quantum BTZ black hole. The similar phenomenon happens for higher dimensional rotating black holes.",
  "categories": [
    "hep-th"
  ],
  "primary_category": "hep-th",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15968",
  "pdf_url": "https://arxiv.org/pdf/2307.15968v2",
  "comment": "44 pages, 16 figures",
  "num_versions": null,
  "size_before_bytes": 3245624,
  "size_after_bytes": 378097
}