{
  "title": "Is the Moyal equation for the Wigner function a quantum analogue of the Liouville equation?",
  "authors": [
    "E. E. Perepelkin",
    "B. I. Sadovnikov",
    "N. G. Inozemtseva",
    "E. V. Burlakov",
    "P. V. Afonin"
  ],
  "submission_date": "2023-07-30T20:48:59+00:00",
  "revised_dates": [],
  "abstract": "The Moyal equation describes the evolution of the Wigner function of a quantum system in the phase space. The right-hand side of the equation contains an infinite series with coefficients proportional to powers of the Planck constant. There is an interpretation of the Moyal equation as a quantum analogue of the classical Liouville equation. Indeed, if one uses the notion of the classical passage to the limit as the Planck constant tends to zero, then formally the right-hand side of the Moyal equation tends to zero. As a result, the Moyal equation becomes the classical Liouville equation for the distribution function. In this paper, we show that the right side of the Moyal equation does not explicitly depend on the Planck constant, and all terms of the series can make a significant contribution. The transition between the classical and quantum descriptions is related not to the Planck constant, but to the spatial scale.\n  For a model quantum system with a potential in the form of a «quadratic funnel», an exact 3D solution of the Schrödinger equation is found and the corresponding Wigner function is constructed in the paper. Using trajectory analysis in the phase space, based on the representation of the right-hand side of the Moyal equation, it is shown that on the spatial microscale there is an infinite number of «trajectories» of the particle motion (thereby the concept of a trajectory is indefinite), and when passing to the macroscale, all «trajectories» concentrate around the classical trajectory.",
  "categories": [
    "quant-ph",
    "math-ph"
  ],
  "primary_category": "quant-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.16316",
  "pdf_url": "https://arxiv.org/pdf/2307.16316v1",
  "comment": "36 pages, 4 figures",
  "num_versions": null,
  "size_before_bytes": 1913961,
  "size_after_bytes": 1262539
}