{
  "title": "Bibliometric Analysis of Publisher and Journal Instructions to Authors on Generative-AI in Academic and Scientific Publishing",
  "authors": [
    "Conner Ganjavi",
    "Michael B. Eppler",
    "Asli Pekcan",
    "Brett Biedermann",
    "Andre Abreu",
    "Gary S. Collins",
    "Inderbir S. Gill",
    "Giovanni E. Cacciamani"
  ],
  "submission_date": "2023-07-21T21:47:51+00:00",
  "revised_dates": [],
  "abstract": "We aim to determine the extent and content of guidance for authors regarding the use of generative-AI (GAI), Generative Pretrained models (GPTs) and Large Language Models (LLMs) powered tools among the top 100 academic publishers and journals in science. The websites of these publishers and journals were screened from between 19th and 20th May 2023. Among the largest 100 publishers, 17% provided guidance on the use of GAI, of which 12 (70.6%) were among the top 25 publishers. Among the top 100 journals, 70% have provided guidance on GAI. Of those with guidance, 94.1% of publishers and 95.7% of journals prohibited the inclusion of GAI as an author. Four journals (5.7%) explicitly prohibit the use of GAI in the generation of a manuscript, while 3 (17.6%) publishers and 15 (21.4%) journals indicated their guidance exclusively applies to the writing process. When disclosing the use of GAI, 42.8% of publishers and 44.3% of journals included specific disclosure criteria. There was variability in guidance of where to disclose the use of GAI, including in the methods, acknowledgments, cover letter, or a new section. There was also variability in how to access GAI guidance and the linking of journal and publisher instructions to authors. There is a lack of guidance by some top publishers and journals on the use of GAI by authors. Among those publishers and journals that provide guidance, there is substantial heterogeneity in the allowable uses of GAI and in how it should be disclosed, with this heterogeneity persisting among affiliated publishers and journals in some instances. The lack of standardization burdens authors and threatens to limit the effectiveness of these regulations. There is a need for standardized guidelines in order to protect the integrity of scientific output as GAI continues to grow in popularity.",
  "categories": [
    "cs.DL",
    "cs.AI"
  ],
  "primary_category": "cs.DL",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11918",
  "pdf_url": null,
  "comment": "Pages 16, 1 figure, 2 tables",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}