{
  "title": "3DPortraitGAN: Learning One-Quarter Headshot 3D GANs from a Single-View Portrait Dataset with Diverse Body Poses",
  "authors": [
    "Yiqian Wu",
    "Hao Xu",
    "Xiangjun Tang",
    "Yue Shangguan",
    "Hongbo Fu",
    "Xiaogang Jin"
  ],
  "submission_date": "2023-07-27T11:02:36+00:00",
  "revised_dates": [
    "2023-08-21T06:35:44+00:00",
    "2025-07-09T01:53:09+00:00"
  ],
  "abstract": "3D-aware face generators are typically trained on 2D real-life face image datasets that primarily consist of near-frontal face data, and as such, they are unable to construct one-quarter headshot 3D portraits with complete head, neck, and shoulder geometry. Two reasons account for this issue: First, existing facial recognition methods struggle with extracting facial data captured from large camera angles or back views. Second, it is challenging to learn a distribution of 3D portraits covering the one-quarter headshot region from single-view data due to significant geometric deformation caused by diverse body poses. To this end, we first create the dataset 360째-Portrait-HQ (360째PHQ for short) which consists of high-quality single-view real portraits annotated with a variety of camera parameters (the yaw angles span the entire 360째 range) and body poses. We then propose 3DPortraitGAN, the first 3D-aware one-quarter headshot portrait generator that learns a canonical 3D avatar distribution from the 360째PHQ dataset with body pose self-learning. Our model can generate view-consistent portrait images from all camera angles with a canonical one-quarter headshot 3D representation. Our experiments show that the proposed framework can accurately predict portrait body poses and generate view-consistent, realistic portrait images with complete geometry from all camera angles.",
  "categories": [
    "cs.CV"
  ],
  "primary_category": "cs.CV",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14770",
  "pdf_url": "https://arxiv.org/pdf/2307.14770v3",
  "comment": "Accepted for publication in IEEE Transactions on Circuits and Systems for Video Technology",
  "num_versions": null,
  "size_before_bytes": 104252259,
  "size_after_bytes": 584665
}