{
  "title": "Bursty Star Formation Naturally Explains the Abundance of Bright Galaxies at Cosmic Dawn",
  "authors": [
    "Guochao Sun",
    "Claude-André Faucher-Giguère",
    "Christopher C. Hayward",
    "Xuejian Shen",
    "Andrew Wetzel",
    "Rachel K. Cochrane"
  ],
  "submission_date": "2023-07-28T04:52:07+00:00",
  "revised_dates": [
    "2023-09-10T10:40:12+00:00"
  ],
  "abstract": "Recent discoveries of a significant population of bright galaxies at cosmic dawn $\\left(z \\gtrsim 10\\right)$ have enabled critical tests of cosmological galaxy formation models. In particular, the bright end of the galaxy UV luminosity function (UVLF) appears higher than predicted by many models. Using approximately 25,000 galaxy snapshots at $8 \\leq z \\leq 12$ in a suite of FIRE-2 cosmological \"zoom-in'' simulations from the Feedback in Realistic Environments (FIRE) project, we show that the observed abundance of UV-bright galaxies at cosmic dawn is reproduced in these simulations with a multi-channel implementation of standard stellar feedback processes, without any fine-tuning. Notably, we find no need to invoke previously suggested modifications such as a non-standard cosmology, a top-heavy stellar initial mass function, or a strongly enhanced star formation efficiency. We contrast the UVLFs predicted by bursty star formation in these original simulations to those derived from star formation histories (SFHs) smoothed over prescribed timescales (e.g., 100 Myr). The comparison demonstrates that the strongly time-variable SFHs predicted by the FIRE simulations play a key role in correctly reproducing the observed, bright-end UVLFs at cosmic dawn: the bursty SFHs induce order-or-magnitude changes in the abundance of UV-bright ($M_\\mathrm{UV} \\lesssim -20$) galaxies at $z \\gtrsim 10$. The predicted bright-end UVLFs are consistent with both the spectroscopically confirmed population and the photometrically selected candidates. We also find good agreement between the predicted and observationally inferred integrated UV luminosity densities, which evolve more weakly with redshift in FIRE than suggested by some other models.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15305",
  "pdf_url": "https://arxiv.org/pdf/2307.15305v2",
  "comment": "12 pages, 4 figures + 1 table, ApJL accepted",
  "num_versions": null,
  "size_before_bytes": 8835682,
  "size_after_bytes": 958411
}