{
  "title": "Quantum parametric amplifiation of phonon-mediated magnon-spin interaction",
  "authors": [
    "Yan Wang",
    "Hui-Lai Zhang",
    "Jin-Lei Wu",
    "Jie Song",
    "Kun Yang",
    "Wei Qin",
    "Hui Jing",
    "Le-Man Kuang"
  ],
  "submission_date": "2023-07-22T02:33:28+00:00",
  "revised_dates": [],
  "abstract": "The recently developed hybrid magnonics provides new opportunities for advances in both the study of magnetism and the development of quantum information processing. However, engineering coherent quantum state transfer between magnons and specific information carriers, in particular, mechanical oscillators and solid-state spins, remains challenging due to the intrinsically weak interactions and the frequency mismatch between diffrent components. Here, we show how to strongly couple the magnon modes in a nanomagnet to the quantized mechanical motion (phonons) of a micromechanical cantilever in a hybrid tripartite system. The coherent and enhanced magnon-phonon coupling is engineered by introducing the quantum parametric amplifiation of the mechanical motion. With experimentally feasible parameters, we show that the mechanical parametric drive can be adjusted to drive the system into the strong-coupling regime and even the ultrastrong-coupling regime. Furthermore, we show the coherent state transfer between the nanomagnet and a nitrogen-vacancy center in the dispersive-coupling regime, with the magnon-spin interaction mediated by the virtually-excited squeezed phonons. The amplifid mechanical noise can hardly interrupt the coherent dynamics of the system even for low mechanical quality factors, which removes the requirement of applying additional engineered-reservoir techniques. Our work opens up prospects for developing novel quantum transducers, quantum memories and high-precision measurements.",
  "categories": [
    "quant-ph"
  ],
  "primary_category": "quant-ph",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11961",
  "pdf_url": null,
  "comment": "14 pages, 4 figures",
  "num_versions": null,
  "size_before_bytes": 14479808,
  "size_after_bytes": 1363373
}