{
  "title": "Earthquake detection capacity of the Dense Oceanfloor Network system for Earthquakes and Tsunamis (DONET)",
  "authors": [
    "K. Z. Nanjo",
    "Y. Yamamoto",
    "K. Ariyoshi",
    "H. Horikawa",
    "S. Yada",
    "N. Takahashi"
  ],
  "submission_date": "2023-07-28T03:26:33+00:00",
  "revised_dates": [
    "2023-09-22T00:05:57+00:00",
    "2024-03-07T01:58:06+00:00"
  ],
  "abstract": "We studied the earthquake detection capacity of DONET (Dense Oceanfloor Network system for Earthquakes and Tsunamis) operating in the Nankai Trough, a target region monitored for future megathrust earthquakes. The focus of this paper was to evaluate the impact on this capacity from the malfunction of parts of the network. For this purpose, the completeness magnitude, above which all earthquakes are considered to be detected by a seismic network, was used. Then, a catalog that includes events observed by DONET was used. We found spatiotemporal variability of completeness magnitude, ranging from values below 1 in one of the areas where stations are densely deployed to values above 2 at the periphery and outside of the DONET area. We conducted a simulation computation for cases of malfunction of densely distributed stations. The results showed that completeness estimates in the area near the malfunctioning stations were about 1 magnitude larger. This implies that malfunction repair and/or replacement with new stations would be desirable because they pronouncedly affect earthquake monitoring. We then demonstrated an example of how to use the information of completeness magnitude as prior knowledge to compute the b value of the Gutenberg-Richter distribution. The result indicates the b value as a proxy that can help to image stress heterogeneity when there is a magnitude-6 class slow slip event on the Nankai Trough plate boundary.",
  "categories": [
    "physics.geo-ph",
    "physics.data-an"
  ],
  "primary_category": "physics.geo-ph",
  "doi": "10.1007/s10950-024-10219-2",
  "journal_ref": null,
  "arxiv_id": "2307.15281",
  "pdf_url": "https://arxiv.org/pdf/2307.15281v3",
  "comment": "8 figures",
  "num_versions": null,
  "size_before_bytes": 12949899,
  "size_after_bytes": 7540413
}