{
  "title": "Critical fates induced by the interaction competition in three-dimensional tilted Dirac semimetals",
  "authors": [
    "Jing Wang",
    "Jie-Qiong Li",
    "Wen-Hao Bian",
    "Qiao-Chu Zhang",
    "Xiao-Yue Ren"
  ],
  "submission_date": "2023-07-25T12:06:56+00:00",
  "revised_dates": [
    "2023-08-29T00:21:00+00:00",
    "2023-11-21T01:24:15+00:00",
    "2023-12-13T01:25:53+00:00",
    "2025-10-07T00:48:42+00:00"
  ],
  "abstract": "The interplay among Coulomb interaction, electron-phonon coupling, and phonon-phonon coupling has a significant impact on the low-energy behavior of three-dimensional type-I tilted Dirac semimetals. To investigate this phenomenon, we construct an effective theory, calculate one-loop corrections arising from all these interactions, and establish the coupled energy-dependent flows of all associated interaction parameters by adopting the renormalization-group approach. Deciphering such coupled evolutions allows us to determine a series of low-energy critical properties for these materials. At first, we present the low-energy tendencies of all interaction parameters. The tilting parameter exhibits distinct tendencies that depend heavily upon the initial anisotropy of fermion velocities. In comparison, the latter is mainly dominated by its initial value but is less sensitive to the former. Variations in these two quantities drive certain interaction parameters toward the strong anisotropy in the low-energy regime, indicating the screened interaction in specific directions, and others toward an approximate isotropy. Additionally, we observe that the tendencies of interaction parameters can be qualitatively clustered into three distinct types of fixed points, accompanied by the potential instabilities that induce an interaction-driven phase transition to a certain superconducting state. Furthermore, approaching these fixed points leads to the critical behavior of physical quantities, such as the density of states, compressibility, and specific heat, which exhibit quite different from their noninteracting counterparts and even deviate slightly from Fermi-liquid behavior. Our investigation sheds light on the intricate relationship between different types of interactions in these semimetals and provides useful insights into their fundamental properties.",
  "categories": [
    "cond-mat.str-el",
    "cond-mat.mes-hall"
  ],
  "primary_category": "cond-mat.str-el",
  "doi": "10.1103/3mlr-ch8b",
  "journal_ref": "Phys. Rev. B 112, 115152 (2025)",
  "arxiv_id": "2307.13436",
  "pdf_url": null,
  "comment": "27 pages, 25 figures",
  "num_versions": null,
  "size_before_bytes": 73260087,
  "size_after_bytes": 774149
}