{
  "title": "Topological Insulator VxBi1.08-xSn0.02Sb0.9Te2S as a Promising n-type Thermoelectric Material",
  "authors": [
    "Lei Chen",
    "Weiyao Zhaoa",
    "Meng Li",
    "Guangsai Yang",
    "Lei Guo",
    "Abudulhakim Bake",
    "Peng Liu",
    "David Cortie",
    "Ren-Kui Zheng",
    "Zhenxiang Cheng",
    "Xiaolin Wang"
  ],
  "submission_date": "2023-07-25T10:30:24+00:00",
  "revised_dates": [],
  "abstract": "As one of the most important n-type thermoelectric (TE) materials, Bi2Te3 has been studied for decades, with efforts to enhance the thermoelectric performance based on element doping, band engineering, etc. In this study, we report a novel bulk-insulating topological material system as a replacement for n-type Bi2Te3 materials: V doped Bi1.08Sn0.02Sb0.9Te2S (V:BSSTS) . The V:BSSTS is a bulk insulator with robust metallic topological surface states. Furthermore, the bulk band gap can be tuned by the doping level of V, which is verified by magnetotransport measurements. Large linear magnetoresistance is observed in all samples. Excellent thermoelectric performance is obtained in the V:BSSTS samples, e.g., the highest figure of merit ZT of ~ 0.8 is achieved in the 2% V doped sample (denoted as V0.02) at 550 K. The high thermoelectric performance of V:BSSTS can be attributed to two synergistic effects: (1) the low conductive secondary phases Sb2S3, and V2S3 are believed to be important scattering centers for phonons, leading to lower lattice thermal conductivity; and (2) the electrical conductivity is increased due to the high-mobility topological surface states at the boundaries. In addition, by replacing one third of costly tellurium with abundant, low-cost, and less-toxic sulfur element, the newly produced BSSTS material is inexpensive but still has comparable TE performance to the traditional Bi2Te3-based materials, which offers a cheaper plan for the electronics and thermoelectric industries. Our results demonstrate that topological materials with unique band structures can provide a new platform in the search for new high performance TE materials.",
  "categories": [
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": "10.1016/j.jallcom.2022.165550",
  "journal_ref": "Journal of Alloys and Compounds 918 (2022): 165550",
  "arxiv_id": "2307.13395",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}