{
  "title": "Prospects for studying the mass and gas in protoclusters with future CMB observations",
  "authors": [
    "Anna Gardner",
    "Eric Baxter",
    "Srinivasan Raghunathan",
    "Weiguang Cui",
    "Daniel Ceverino"
  ],
  "submission_date": "2023-07-28T05:09:58+00:00",
  "revised_dates": [
    "2024-01-13T01:25:56+00:00"
  ],
  "abstract": "Protoclusters are the progenitors of massive galaxy clusters. Understanding the properties of these structures is important for building a complete picture of cluster formation and for understanding the impact of environment on galaxy evolution. Future cosmic microwave background (CMB) surveys may provide insight into the properties of protoclusters via observations of the thermal Sunyaev Zel'dovich (SZ) effect and gravitational lensing. Using realistic hydrodynamical simulations of protoclusters from the Three Hundred Project, we forecast the ability of CMB Stage 4-like (CMB-S4) experiments to detect and characterize protoclusters with observations of these two signals. For protoclusters that are the progenitors of clusters at $z = 0$ with $M_{200c} \\gtrsim 10^{15}\\,M_{\\odot}$ we find that the S4-Ultra deep survey has a roughly 20\\% chance of detecting the main halos in these structures with SNR > 5 at $z \\sim 2$ and a 10\\% chance of detecting them at $z \\sim 2.5$, where these probabilities include the impacts of noise, CMB foregrounds, and the different possible evolutionary histories of the structures. On the other hand, if protoclusters can be identified using alternative means, such as via galaxy surveys like LSST and Euclid, CMB-S4 will be able to obtain high signal-to-noise measurements of their stacked lensing and SZ signals, providing a way to measure their average mass and gas content. With a sample of 2700 protoclusters at $z = 3$, the CMB-S4 wide survey can measure the stacked SZ signal with a signal-to-noise of 7.2, and the stacked lensing signal with a signal-to-noise of 5.7. Future CMB surveys thus offer exciting prospects for understanding the properties of protoclusters.",
  "categories": [
    "astro-ph.CO",
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.CO",
  "doi": "10.21105/astro.2307.15309",
  "journal_ref": null,
  "arxiv_id": "2307.15309",
  "pdf_url": "https://arxiv.org/pdf/2307.15309v2",
  "comment": "13 pages, 10 figures; v2 matches version accepted by The Open Journal of Astrophysics",
  "num_versions": null,
  "size_before_bytes": 6170966,
  "size_after_bytes": 816403
}