{
  "title": "Optimization of Image Acquisition for Earth Observation Satellites via Quantum Computing",
  "authors": [
    "Antón Makarov",
    "Márcio M. Taddei",
    "Eneko Osaba",
    "Giacomo Franceschetto",
    "Esther Villar-Rodriguez",
    "Izaskun Oregi"
  ],
  "submission_date": "2023-07-26T18:00:02+00:00",
  "revised_dates": [],
  "abstract": "Satellite image acquisition scheduling is a problem that is omnipresent in the earth observation field; its goal is to find the optimal subset of images to be taken during a given orbit pass under a set of constraints. This problem, which can be modeled via combinatorial optimization, has been dealt with many times by the artificial intelligence and operations research communities. However, despite its inherent interest, it has been scarcely studied through the quantum computing paradigm. Taking this situation as motivation, we present in this paper two QUBO formulations for the problem, using different approaches to handle the non-trivial constraints. We compare the formulations experimentally over 20 problem instances using three quantum annealers currently available from D-Wave, as well as one of its hybrid solvers. Fourteen of the tested instances have been obtained from the well-known SPOT5 benchmark, while the remaining six have been generated ad-hoc for this study. Our results show that the formulation and the ancilla handling technique is crucial to solve the problem successfully. Finally, we also provide practical guidelines on the size limits of problem instances that can be realistically solved on current quantum computers.",
  "categories": [
    "quant-ph",
    "eess.IV"
  ],
  "primary_category": "quant-ph",
  "doi": "10.1007/978-3-031-48232-8_1",
  "journal_ref": "Proceedings of Intelligent Data Engineering and Automated Learning -- IDEAL 2023. Lecture Notes in Computer Science, vol 14404. Springer, Cham",
  "arxiv_id": "2307.14419",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1241867,
  "size_after_bytes": 321459
}