{
  "title": "Visibility graph-based covariance functions for scalable spatial analysis in non-convex domains",
  "authors": [
    "Brian Gilbert",
    "Abhirup Datta"
  ],
  "submission_date": "2023-07-21T23:47:17+00:00",
  "revised_dates": [
    "2023-08-02T00:06:45+00:00",
    "2024-05-30T00:57:47+00:00",
    "2024-07-09T00:50:48+00:00",
    "2024-08-29T00:03:43+00:00"
  ],
  "abstract": "We present a new method for constructing valid covariance functions of Gaussian processes for spatial analysis in irregular, non-convex domains such as bodies of water. Standard covariance functions based on geodesic distances are not guaranteed to be positive definite on such domains, while existing non-Euclidean approaches fail to respect the partially Euclidean nature of these domains where the geodesic distance agrees with the Euclidean distances for some pairs of points. Using a visibility graph on the domain, we propose a class of covariance functions that preserve Euclidean-based covariances between points that are connected in the domain while incorporating the non-convex geometry of the domain via conditional independence relationships. We show that the proposed method preserves the partially Euclidean nature of the intrinsic geometry on the domain while maintaining validity (positive definiteness) and marginal stationarity of the covariance function over the entire parameter space, properties which are not always fulfilled by existing approaches to construct covariance functions on non-convex domains. We provide useful approximations to improve computational efficiency, resulting in a scalable algorithm. We compare the performance of our method with those of competing state-of-the-art methods using simulation studies on synthetic non-convex domains. The method is applied to data regarding acidity levels in the Chesapeake Bay, showing its potential for ecological monitoring in real-world spatial applications on irregular domains.",
  "categories": [
    "stat.ME"
  ],
  "primary_category": "stat.ME",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11941",
  "pdf_url": null,
  "comment": "add GitHub link",
  "num_versions": null,
  "size_before_bytes": 28068022,
  "size_after_bytes": 591086
}