{
  "title": "Crowded No More: The Accuracy of the Hubble Constant Tested with High Resolution Observations of Cepheids by JWST",
  "authors": [
    "Adam G. Riess",
    "Gagandeep S. Anand",
    "Wenlong Yuan",
    "Stefano Casertano",
    "Andrew Dolphin",
    "Lucas M. Macri",
    "Louise Breuval",
    "Dan Scolnic",
    "Marshall Perrin",
    "Richard I. Anderson"
  ],
  "submission_date": "2023-07-28T20:55:50+00:00",
  "revised_dates": [],
  "abstract": "High-resolution JWST observations can test confusion-limited HST observations for a photometric bias that could affect extragalactic Cepheids and the determination of the Hubble constant. We present JWST NIRCAM observations in two epochs and three filters of >330 Cepheids in NGC4258 (which has a 1.5% maser-based geometric distance) and in NGC5584 (host of SNIa 2007af), near the median distance of the SH0ES HST SNIa host sample and with the best leverage among them to detect such a bias. JWST provides far superior source separation from line-of-sight companions than HST in the NIR to largely negate confusion or crowding noise at these wavelengths, where extinction is minimal. The result is a remarkable >2.5x reduction in the dispersion of the Cepheid P-L relations, from 0.45 to 0.17 mag, improving individual Cepheid precision from 20% to 7%. Two-epoch photometry confirmed identifications, tested JWST photometric stability, and constrained Cepheid phases. The P-L relation intercepts are in very good agreement, with differences (JWST-HST) of 0.00+/-0.03 and 0.02+/-0.03 mag for NGC4258 and NGC5584, respectively. The difference in the determination of H_0 between HST and JWST from these intercepts is 0.02+/-0.04 mag, insensitive to JWST zeropoints or count-rate non-linearity thanks to error cancellation between rungs. We explore a broad range of analysis variants (including passband combinations, phase corrections, measured detector offsets, and crowding levels) indicating robust baseline results. These observations provide the strongest evidence yet that systematic errors in HST Cepheid photometry do not play a significant role in the present Hubble Tension. Upcoming JWST observations of >12 SNIa hosts should further refine the local measurement of the Hubble constant.",
  "categories": [
    "astro-ph.CO"
  ],
  "primary_category": "astro-ph.CO",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15806",
  "pdf_url": "https://arxiv.org/pdf/2307.15806v1",
  "comment": "submitted to ApJ, comments welcome",
  "num_versions": null,
  "size_before_bytes": 12377389,
  "size_after_bytes": 1158572
}