{
  "title": "High-performance real-world optical computing trained by in situ gradient-based model-free optimization",
  "authors": [
    "Guangyuan Zhao",
    "Xin Shu",
    "Renjie Zhou"
  ],
  "submission_date": "2023-07-22T01:56:58+00:00",
  "revised_dates": [
    "2023-10-30T00:42:27+00:00",
    "2023-11-06T01:28:05+00:00",
    "2023-11-29T01:31:26+00:00",
    "2024-04-04T00:01:04+00:00",
    "2024-11-22T01:51:55+00:00"
  ],
  "abstract": "Optical computing systems provide high-speed and low-energy data processing but face deficiencies in computationally demanding training and simulation-to-reality gaps. We propose a gradient-based model-free optimization (G-MFO) method based on a Monte Carlo gradient estimation algorithm for computationally efficient in situ training of optical computing systems. This approach treats an optical computing system as a black box and back-propagates the loss directly to the optical computing weights' probability distributions, circumventing the need for a computationally heavy and biased system simulation. Our experiments on diffractive optical computing systems show that G-MFO outperforms hybrid training on the MNIST and FMNIST datasets. Furthermore, we demonstrate image-free and high-speed classification of cells from their marker-free phase maps. Our method's model-free and high-performance nature, combined with its low demand for computational resources, paves the way for accelerating the transition of optical computing from laboratory demonstrations to practical, real-world applications.",
  "categories": [
    "physics.optics",
    "cs.CV",
    "cs.ET",
    "cs.LG"
  ],
  "primary_category": "physics.optics",
  "doi": "10.1109/TPAMI.2024.3466853",
  "journal_ref": null,
  "arxiv_id": "2307.11957",
  "pdf_url": null,
  "comment": "The paper titled \"High-performance real-world optical computing trained by in situ gradient-based model-free optimization\" has been accepted at ICCP&TPAMI 2024. For more details, please visit the [project page](https://shuxin626.github.io/mfo_optical_computing/index.html)",
  "num_versions": null,
  "size_before_bytes": 25260851,
  "size_after_bytes": 2968954
}