{
  "title": "A Multi-Server Retrial Queueing Inventory System With Asynchronous Multiple Vacations",
  "authors": [
    "K. Jeganathan",
    "T. Harikrishnan",
    "K. Prasanna Lakshmi",
    "D. Nagarajan"
  ],
  "submission_date": "2023-07-23T03:16:06+00:00",
  "revised_dates": [
    "2023-07-31T00:12:05+00:00"
  ],
  "abstract": "This article deals with asynchronous server vacation and customer retrial facility in a multi-server queueing-inventory system. The Poisson process governs the arrival of a customer. The system is comprised of c identical servers, a finite-size waiting area, and a storage area containing S items. The service time is distributed exponentially. If each server finds that there are an insufficient number of customers and items in the system after the busy period, they start a vacation. Once the servers vacation is over and it recognizes there is no chance of getting busy, it goes into an idle state if the number of customers or items is not sufficient, otherwise, it will take another vacation. Furthermore, each server's vacation period occurs independently of the other servers. The system accepts a (s, Q) control policy for inventory replenishment. For the steady state analysis, the Marcel F Neuts and B Madhu Rao matrix geometric approximation approach is used owing to the structure of an infinitesimal generator matrix. The necessary stability condition and R matrix are to be computed and presented. After calculating the sufficient system performance measures, an expected total cost of the system is to be constructed and numerically incorporated with the parameters. Additionally, numerical analyses will be conducted to examine the waiting time of customers in the queue and in orbit, as well as the expected rate of customer loss.",
  "categories": [
    "math.OC"
  ],
  "primary_category": "math.OC",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12215",
  "pdf_url": null,
  "comment": "44 pages, 12 figures, 5 tables",
  "num_versions": null,
  "size_before_bytes": 5686013,
  "size_after_bytes": 4721629
}