{
  "title": "Quinpi: Integrating stiff hyperbolic systems with implicit high order finite volume schemes",
  "authors": [
    "Gabriella Puppo",
    "Matteo Semplice",
    "Giuseppe Visconti"
  ],
  "submission_date": "2023-07-27T08:18:04+00:00",
  "revised_dates": [
    "2023-12-22T14:05:39+00:00",
    "2024-04-24T17:09:14+00:00",
    "2024-07-16T13:19:21+00:00"
  ],
  "abstract": "Many interesting physical problems described by systems of hyperbolic conservation laws are stiff, and thus impose a very small time-step because of the restrictive CFL stability condition. In this case, one can exploit the superior stability properties of implicit time integration which allows to choose the time-step only from accuracy requirements, and thus avoid the use of small time-steps. We discuss an efficient framework to devise high order implicit schemes for stiff hyperbolic systems without tailoring it to a specific problem. The nonlinearity of high order schemes, due to space- and time-limiting procedures which control nonphysical oscillations, makes the implicit time integration difficult, e.g.~because the discrete system is nonlinear also on linear problems. This nonlinearity of the scheme is circumvented as proposed in (Puppo et al., Comm.~Appl.~Math.~\\& Comput., 2023) for scalar conservation laws, where a first order implicit predictor is computed to freeze the nonlinear coefficients of the essentially non-oscillatory space reconstruction, and also to assist limiting in time. In addition, we propose a novel conservative flux-centered a-posteriori time-limiting procedure using numerical entropy indicators to detect troubled cells. The numerical tests involve classical and artificially devised stiff problems using the Euler's system of gas-dynamics.",
  "categories": [
    "math.NA",
    "physics.comp-ph"
  ],
  "primary_category": "math.NA",
  "doi": "10.4208/cicp.OA-2023-0199",
  "journal_ref": "Communications in Computational Physics, Vol. 36 (2024), Iss. 1 : pp. 30-70",
  "arxiv_id": "2307.14685",
  "pdf_url": "https://arxiv.org/pdf/2307.14685v4",
  "comment": "39 pages, 9 figures, 6 tables",
  "num_versions": null,
  "size_before_bytes": 14238173,
  "size_after_bytes": 532564
}