{
  "title": "Expanding Boundaries: Cross-Media Routing for Seamless Underwater and Aerial Communication",
  "authors": [
    "Waqas Aman",
    "Flavio Giorgi",
    "Giulio Attenni",
    "Saif Al-Kuwari",
    "Elmehdi Illi",
    "Marwa Qaraqe",
    "Gaia Maselli",
    "Roberto Di Pietro"
  ],
  "submission_date": "2023-07-24T09:35:35+00:00",
  "revised_dates": [],
  "abstract": "The colossal evolution of wireless communication technologies over the past few years has driven increased interest in its integration in a variety of less-explored environments, such as the underwater medium. In this magazine paper, we present a comprehensive discussion on a novel concept of routing protocol known as cross-media routing, incorporating the marine and aerial interfaces. In this regard, we discuss the limitation of single-media routing and advocate the need for cross-media routing along with the current status of research development in this direction. To this end, we also propose a novel cross-media routing protocol known as bubble routing for autonomous marine systems where different sets of AUVs, USVs, and airborne nodes are considered for the routing problem. We evaluate the performance of the proposed routing protocol by using the two key performance metrics, i.e., packet delivery ratio (PDR) and end-to-end delay. Moreover, we delve into the challenges encountered in cross-media routing, unveiling exciting opportunities for future research and innovation. As wireless communication expands its horizons to encompass the underwater and aerial domains, understanding and addressing these challenges will pave the way for enhanced cross-media communication and exploration.",
  "categories": [
    "cs.NI",
    "cs.ET",
    "eess.SP"
  ],
  "primary_category": "cs.NI",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12643",
  "pdf_url": null,
  "comment": "Submitted to IEEE Communications Magazine",
  "num_versions": null,
  "size_before_bytes": 7731352,
  "size_after_bytes": 501847
}