{
  "title": "Rule By Example: Harnessing Logical Rules for Explainable Hate Speech Detection",
  "authors": [
    "Christopher Clarke",
    "Matthew Hall",
    "Gaurav Mittal",
    "Ye Yu",
    "Sandra Sajeev",
    "Jason Mars",
    "Mei Chen"
  ],
  "submission_date": "2023-07-24T16:55:37+00:00",
  "revised_dates": [],
  "abstract": "Classic approaches to content moderation typically apply a rule-based heuristic approach to flag content. While rules are easily customizable and intuitive for humans to interpret, they are inherently fragile and lack the flexibility or robustness needed to moderate the vast amount of undesirable content found online today. Recent advances in deep learning have demonstrated the promise of using highly effective deep neural models to overcome these challenges. However, despite the improved performance, these data-driven models lack transparency and explainability, often leading to mistrust from everyday users and a lack of adoption by many platforms. In this paper, we present Rule By Example (RBE): a novel exemplar-based contrastive learning approach for learning from logical rules for the task of textual content moderation. RBE is capable of providing rule-grounded predictions, allowing for more explainable and customizable predictions compared to typical deep learning-based approaches. We demonstrate that our approach is capable of learning rich rule embedding representations using only a few data examples. Experimental results on 3 popular hate speech classification datasets show that RBE is able to outperform state-of-the-art deep learning classifiers as well as the use of rules in both supervised and unsupervised settings while providing explainable model predictions via rule-grounding.",
  "categories": [
    "cs.CL",
    "cs.AI"
  ],
  "primary_category": "cs.CL",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.12935",
  "pdf_url": null,
  "comment": "ACL 2023 Main Conference",
  "num_versions": null,
  "size_before_bytes": 1483815,
  "size_after_bytes": 171499
}