{
  "title": "Axisymmetric membrane nano-resonators: A comparison of nonlinear reduced-order models",
  "authors": [
    "Safvan Palathingal",
    "Dominic Vella"
  ],
  "submission_date": "2023-07-28T16:33:21+00:00",
  "revised_dates": [
    "2024-12-01T14:46:04+00:00"
  ],
  "abstract": "The shift in the backbone of the frequency--response curve and the `jump-down' observed at a critical frequency observed in nano-resonators are caused by their nonlinear mechanical response. The shift and jump-down point are therefore often used to infer the mechanical properties that underlie the nonlinear response, particularly the resonator's stretching modulus. To facilitate this, the resonators's dynamics are often modelled using a Galerkin-type numerical approach or lumped ordinary differential equations like the Duffing equation, that incorporate an appropriate nonlinearity. To understand the source of the problem's nonlinearities, we first develop an axisymmetric but spatially-varying model of a membrane resonator subject to a uniform oscillatory load with linear damping. We then derive asymptotic solutions for the resulting partial differential equations (PDEs) using the Method of Multiple Scales (MS), which allows a systematic reduction to a Duffing-like equation with analytically determined coefficients. We also solve the PDEs numerically via the method of lines. By comparing the numerical solutions with the asymptotic results, we demonstrate that the numerical approach reveals a non-constant maximum compliance with increasing load, which contradicts the predictions of the MS analysis. In contrast, we show that combining a Galerkin decomposition with the Harmonic Balance Method accurately captures the non-constant maximum compliance and reliably predicts jump-down behaviour. We analyze the resulting frequency-response predictions derived from these methods. We also argue that fitting based on the jump-down point may be sensitive to noise and discuss strategies for fitting frequency-response curves from experimental data to theory that are robust to this.",
  "categories": [
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": "10.1016/j.ijnonlinmec.2024.104933",
  "journal_ref": "Int. J. Nonlin. Mech. 168, 104933 (2025)",
  "arxiv_id": "2307.15656",
  "pdf_url": "https://arxiv.org/pdf/2307.15656v2",
  "comment": "Revised version, with title change (among others) following review",
  "num_versions": null,
  "size_before_bytes": 11050385,
  "size_after_bytes": 143185
}