{
  "title": "Observation of photoassociation resonances in ultracold atom-molecule collisions",
  "authors": [
    "Jin Cao",
    "Bo-Yuan Wang",
    "Huan Yang",
    "Zhi-Jie Fan",
    "Zhen Su",
    "Jun Rui",
    "Bo Zhao",
    "Jian-Wei Pan"
  ],
  "submission_date": "2023-07-29T07:19:57+00:00",
  "revised_dates": [],
  "abstract": "Photoassociation of ultracold atoms is a resonant light-assisted collision process, in which two colliding atoms absorb a photon and form an excited molecule. Since the first observation about three decades ago, the photoassociation of ultracold atoms has made a significant impact on the study of ultracold atoms and molecules. Extending the photoassociation of atoms to the photoassociation of atom-molecule pairs or molecule-molecule pairs will offer many new opportunities in the study of precision polyatomic molecular spectroscopy, formation of ultracold polyatomic molecules, and quantum control of molecular collisions and reactions. However, the high density of states and the photoexcitation of the collision complex by the trapping laser make photoassociation into well-defined quantum states of polyatomic molecules extremely difficult. Here we report on the observation of photoassociation resonances in ultracold collisions between $^{23}$Na$^{40}$K molecules and $^{40}$K atoms. We perform photoassociation in a long-wavelength optical dipole trap to form deeply bound triatomic molecules in the electronically excited states. The atom-molecule Feshbach resonance is used to enhance the free-bound Franck-Condon overlap. The photoassociation into well-defined quantum states of excited triatomic molecules is identified by observing resonantly enhanced loss features. These loss features depend on the polarization of the photoassociation lasers, allowing us to assign the rotational quantum numbers. The observation of ultracold atom-molecule photoassociation resonances paves the way toward preparing ground-state triatomic molecules, provides a new high-resolution spectroscopy technique for polyatomic molecules, and is also important to atom-molecule Feshbach resonances.",
  "categories": [
    "physics.atom-ph",
    "cond-mat.quant-gas"
  ],
  "primary_category": "physics.atom-ph",
  "doi": "10.1103/PhysRevLett.132.093403",
  "journal_ref": "Physical Review Letters 132, 093403 (2024)",
  "arxiv_id": "2307.15917",
  "pdf_url": "https://arxiv.org/pdf/2307.15917v1",
  "comment": "8 pages, 4 figures",
  "num_versions": null,
  "size_before_bytes": 1243937,
  "size_after_bytes": 54574
}