{
  "title": "Ab initio investigation of laser-induced ultrafast demagnetization of L1$_0$ FePt: Intensity dependence and importance of electron coherence",
  "authors": [
    "M. S. Mrudul",
    "Peter M. Oppeneer"
  ],
  "submission_date": "2023-07-21T17:47:55+00:00",
  "revised_dates": [],
  "abstract": "We theoretically investigate the optically-induced demagnetization of ferromagnetic FePt using the time-dependent density functional theory (TDDFT). We compare the demagnetization mechanism in the perturbative and nonperturbative limits of light-matter interaction and show how the underlying mechanism of the ultrafast demagnetization depends on the driving laser intensity. Our calculations show that the femtosecond demagnetization in TDDFT is a longitudinal magnetization reduction and results from a nonlinear optomagnetic effect, akin to the inverse Faraday effect. The demagnetization scales quadratically with the electric field $E$ in the perturbative limit, i.e., $ΔM_z \\propto E^{2}$. Moreover, the magnetization dynamics happens dominantly at even multiples $nω_0$, ($n = 0, 2, \\cdots$) of the pump-laser frequency $ω_0$, whereas odd multiples of $ω_0$ do not contribute. We further investigate the demagnetization in conjunction to the optically-induced change of electron occupations and electron correlations. Correlations within the Kohn-Sham local-density framework are shown to have an appreciable yet distinct effect on the amount of demagnetization depending on the laser intensity. Comparing the ${ab~initio}$ computed demagnetizations with those calculated from spin occupations, we show that electronic coherence plays a dominant role in the demagnetization process, whereas interpretations based on the time-dependent occupation numbers poorly describe the ultrafast demagnetization.",
  "categories": [
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": "10.1103/PhysRevB.109.144418",
  "journal_ref": "Physical Review B 109, 144418 (2024)",
  "arxiv_id": "2307.11736",
  "pdf_url": null,
  "comment": "12 pages, 10 figures",
  "num_versions": null,
  "size_before_bytes": 906267,
  "size_after_bytes": 107127
}