{
  "title": "Still alive and kicking: A significant outburst in changing-look AGN Mrk 1018",
  "authors": [
    "R. Brogan",
    "M. Krumpe",
    "D. Homan",
    "T. Urrutia",
    "T. Granzer",
    "B. Husemann",
    "J. Neumann",
    "M. Gaspari",
    "S. P. Vaughan",
    "S. M. Croom",
    "F. Combes",
    "M. Pérez Torres",
    "A. Coil",
    "R. McElroy",
    "N. Winkel",
    "M. Singha"
  ],
  "submission_date": "2023-07-26T12:11:26+00:00",
  "revised_dates": [],
  "abstract": "Changing-look active galactic nuclei (CL-AGN) have been observed to change optical spectral type. Mrk 1018 is unique: first classified as a type 1.9 Seyfert galaxy, it transitioned to a type 1 before returning to its initial classification after approximately 30 years. We present a high-cadence monitoring programme that caught a major outburst in 2020. Due to sunblock, only the decline could be observed. We studied X-ray, UV, optical, and IR before and after the outburst to investigate the responses of the AGN structures. We derived a u'-band light curve of the AGN contribution alone. The flux increased by a factor of the order of 13. We confirmed this in other optical bands and determined the shape and speed of the decline in each waveband. The shapes of H beta and H alpha were analysed before and after the event. Two XMM-Newton observations from before and after the outburst were also exploited. The outburst is asymmetric, with a swifter rise than decline. The decline is best fit by a linear function, ruling out a tidal disruption event. The optical spectrum shows no change approximately 8 months before and 17 months after. The UV flux increased slightly after the outburst but the X-ray primary flux is unchanged. However, the 6.4 keV Iron line has doubled in strength. IR data taken 13 days after the observed optical peak show an increased emission level. Calculating the distance of the broad-line region and inner edge of the torus from the supermassive black hole can explain the multi-wavelength response to the outburst, in particular: i) the unchanged H beta and H alpha lines, ii) the unchanged primary X-ray spectral components, iii) the rapid and extended infrared response, as well as iv) the enhanced emission of the reflected 6.4 keV line. The outburst was due to a dramatic and short-lasting change in the intrinsic accretion rate. We discuss different models as potential causes.",
  "categories": [
    "astro-ph.HE"
  ],
  "primary_category": "astro-ph.HE",
  "doi": "10.1051/0004-6361/202346475",
  "journal_ref": "A&A 677, A116 (2023)",
  "arxiv_id": "2307.14139",
  "pdf_url": null,
  "comment": "Accepted for publication in A&A",
  "num_versions": null,
  "size_before_bytes": 1649282,
  "size_after_bytes": 319153
}