{
  "title": "Founding a mathematical diffusion model in linguistics. The case study of German syntactic features in the North-Eastern Italian dialects",
  "authors": [
    "I. Lazzizzera"
  ],
  "submission_date": "2023-07-26T16:49:11+00:00",
  "revised_dates": [
    "2023-09-26T00:28:24+00:00"
  ],
  "abstract": "The initial motivation for this work was the linguistic case of the spread of Germanic syntactic features into Romance dialects of North-Eastern Italy, which occurred after the immigration of German people to Tyrol during the High Middle Ages. To obtain a representation of the data over the territory suitable for a mathematical formulation, an interactive map is produced as a first step, using tools of what is called Geographic Data Science. A smooth two-dimensional surface G is introduced, expressing locally which fraction of territory uses a given German language feature: it is obtained by a piecewise cubic curvature minimizing interpolant of the discrete function that says if at any surveyed locality that feature is used or not. This surface G is thought of as the value at the present time of a function describing a diffusion-convection phenomenon in two dimensions (here said tidal mode), which is subjected in a very natural way to the same equation used in physics, introducing a contextual diffusivity concept: it is shown that with two different assumptions about diffusivity, solutions of this equation, evaluated at the present time, fit well with the data interpolated by G, thus providing two convincing different pictures of diffusion-convection in the case under study, albeit simplifications and approximations. Very importantly, it is shown that the linguistic diffusion model known to linguists as Schmidt waves can be counted among the solutions of the diffusion equation",
  "categories": [
    "cs.CL"
  ],
  "primary_category": "cs.CL",
  "doi": "10.1140/epjp/s13360-023-04498-w",
  "journal_ref": "Eur. Phys. J. Plus (2023) 138:833",
  "arxiv_id": "2307.14291",
  "pdf_url": null,
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 56615453,
  "size_after_bytes": 265061
}