{
  "title": "On the likelihoods of finding very metal-poor (and old) stars in the Milky Way's disc, bulge, and halo",
  "authors": [
    "Diego Sotillo-Ramos",
    "Maria Bergemann",
    "Jennifer K. S. Friske",
    "Annalisa Pillepich"
  ],
  "submission_date": "2023-07-26T18:00:02+00:00",
  "revised_dates": [],
  "abstract": "Recent observational studies have uncovered a small number of very metal-poor stars with cold kinematics in the Galactic disc and bulge. However, their origins remain enigmatic. We select a total of 138 Milky Way (MW) analogs from the TNG50 cosmological simulation based on their $z=0$ properties: disky morphology, stellar mass, and local environment. In order to make more predictive statements for the MW, we further limit the spatial volume coverage of stellar populations in galaxies to that targeted by the upcoming 4MOST high-resolution survey of the Galactic disc and bulge. We find that across all galaxies, $\\sim$20 per cent of very metal-poor (${\\rm [Fe/H]} < -2$) stars belong to the disk, with some analogs reaching 30 per cent. About 50$\\pm$10 per cent of the VMP disc stars are, on average, older than 12.5 Gyr and $\\sim$70$\\pm$10 per cent come from accreted satellites. A large fraction of the VMP stars belong to the halo ($\\sim$70) and have a median age of 12 Gyr. Our results with the TNG50 cosmological simulation confirm earlier findings with simulations of fewer individual galaxies, and suggest that the stellar disc of the Milky Way is very likely to host significant amounts of very- and extremely-metal-poor stars that, although mostly of ex situ origin, can also form in situ, reinforcing the idea of the existence of a primordial Galactic disc.",
  "categories": [
    "astro-ph.GA"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.1093/mnrasl/slad103",
  "journal_ref": null,
  "arxiv_id": "2307.14421",
  "pdf_url": null,
  "comment": "Accepted by MNRAS. 4 figures",
  "num_versions": null,
  "size_before_bytes": 3541944,
  "size_after_bytes": 1052216
}