{
  "title": "Not Hydro: Using Neural Networks to estimate galaxy properties on a Dark-Matter-Only simulation",
  "authors": [
    "Cristian Hernández Cuevas",
    "Roberto E. González",
    "Nelson D. Padilla"
  ],
  "submission_date": "2023-07-24T19:27:22+00:00",
  "revised_dates": [],
  "abstract": "Using data from TNG300-2, we train a neural network (NN) to recreate the stellar mass ($M^*$) and star formation rate (SFR) of central galaxies in a dark-matter-only simulation. We consider 12 input properties from the halo and sub-halo hosting the galaxy and the near environment. $M^*$ predictions are robust, but the machine does not fully reproduce its scatter. The same happens for SFR, but the predictions are not as good as for $M^*$. We chained neural networks, improving the predictions on SFR to some extent. For SFR, we time-averaged this value between $z=0$ and $z=0.1$, which improved results for $z=0$. Predictions of both variables have trouble reproducing values at lower and higher ends. We also study the impact of each input variable in the performance of the predictions using a leave-one-covariate-out approach, which led to insights about the physical and statistical relation between input variables. In terms of metrics, our machine outperforms similar studies, but the main discoveries in this work are not linked with the quality of the predictions themselves, but to how the predictions relate to the input variables. We find that previously studied relations between physical variables are meaningful to the machine. We also find that some merger tree properties strongly impact the performance of the machine. %We highlight the value of machine learning (ML) methods in helping understand the information contained in different variables, since with its help we were able to obtain useful insights resulting from studying the impact of input variables on the resulting behaviour of galaxy properties. We conclude that ML models are useful tools to understand the significance of physical different properties and their impact on target characteristics, as well as strong candidates for potential simulation methods.",
  "categories": [
    "astro-ph.GA",
    "astro-ph.CO"
  ],
  "primary_category": "astro-ph.GA",
  "doi": "10.1093/mnras/stad2112",
  "journal_ref": null,
  "arxiv_id": "2307.13092",
  "pdf_url": null,
  "comment": "17 pages, 16 figures, to be published in MNRAS",
  "num_versions": null,
  "size_before_bytes": 1984917,
  "size_after_bytes": 416729
}