{
  "title": "HDR: Interfaces in crystalline materials",
  "authors": [
    "Aurélien Vattré"
  ],
  "submission_date": "2023-07-27T01:06:13+00:00",
  "revised_dates": [
    "2024-01-22T15:19:14+00:00"
  ],
  "abstract": "Interfaces such as grain boundaries in polycrystalline as well as heterointerfaces in multiphase solids are ubiquitous in materials science and engineering. Far from being featureless dividing surfaces between neighboring crystals, elucidating features of solid-solid interfaces is challenging and requires theoretical and numerical strategies to describe the physical and mechanical characteristics of these internal interfaces. The first part of this manuscript is concerned with interface-dominated microstructures emerging from polymorphic structural (diffusionless) phase transformations. Under high hydrostatic compression and shock-wave conditions, the pressure-driven phase transitions and the formation of internal diffuse interfaces in iron are captured by a thermodynamically consistent framework for combining nonlinear elastoplasticity and multivariant phase-field approach at large strains. The calculations investigate the crucial role played by the plastic deformation in the morphological and microstructure evolution processes under high hydrostatic compression and shock-wave conditions. The second section is intended to describe such imperfect interfaces at a finer scale, for which the semicoherent interfaces are described by misfit dislocation networks that produce a lattice-invariant deformation which disrupts the uniformity of the lattice correspondence across the interfaces and thereby reduces coherency. For the past ten years, the constant effort has been devoted to combining the closely related Frank-Bilby and O-lattice techniques with the Stroh sextic formalism for the anisotropic elasticity theory of interfacial dislocation patterns. The structures and energetics are quantified and used for rapid computational design of interfaces with tailored misfit dislocation patterns, including the interface sink strength for radiation-induced point defects and semicoherent interfaces.",
  "categories": [
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14569",
  "pdf_url": null,
  "comment": "138 pages, 70 figures",
  "num_versions": null,
  "size_before_bytes": 41908010,
  "size_after_bytes": 1523970
}