{
  "title": "High-order Discontinuity Detection Physics-Informed Neural Network",
  "authors": [
    "Ruquan You",
    "Shuming Zhang",
    "Tinglin Kong",
    "Haiwang Li"
  ],
  "submission_date": "2023-07-29T03:05:03+00:00",
  "revised_dates": [],
  "abstract": "In order to solve the problem of the difficult direct measurement of temperature field in fluid machinery under high-speed compressible conditions, this study combines high-order finite difference numerical format, Weighted Essentially Non-Oscillatory (WENO) discontinuity detection, and traditional Physics-Informed Neural Network (PINN) to develop a high-order discontinuity detection PINN (Hodd-PINN) that can achieve temperature field inversion with a small number of measurement points. When dealing with pure convection problems, Hodd-PINN introduces a 7th-order discretization for the convection term, reducing an additional 9.7% error compared to traditional low-order discretization methods. When dealing with pure diffusion problems, Hodd-PINN introduces an 8th-order discretization for the diffusion term, reducing an additional 12.8% error compared to traditional low-order discretization methods. In addition, this paper develops a loss function based on WENO discontinuity detection technology, which helps eliminate false discontinuities, allowing Hodd-PINN to successfully identify sparse waves that are easily overlooked in PINN's predicted results, reducing the error by 24.2%. Through extensive testing, this paper points out that the Hodd-PINN, which incorporates high-order discretization and discontinuity detection technology, can further reduce the prediction error of PINN, effectively reducing the data requirement, and can effectively solve the problem of false discontinuities. This method has important value for the inversion of temperature and velocity fields in fluid machinery under high-speed compressible conditions.",
  "categories": [
    "physics.flu-dyn"
  ],
  "primary_category": "physics.flu-dyn",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.15877",
  "pdf_url": "https://arxiv.org/pdf/2307.15877v1",
  "comment": null,
  "num_versions": null,
  "size_before_bytes": 1057509,
  "size_after_bytes": 643552
}