{
  "title": "Advanced Monte Carlo simulation techniques to study polymers under equilibrium conditions",
  "authors": [
    "Monika Angwani",
    "Tushar Mahendrakar",
    "Kaustubh Rane"
  ],
  "submission_date": "2023-07-21T17:30:53+00:00",
  "revised_dates": [],
  "abstract": "The advances in materials and biological sciences have necessitated the use of molecular simulations to study polymers. The Markov chain Monte Carlo simulations enable the sampling of relevant microstates of polymeric systems by traversing paths that are impractical in molecular dynamics simulations. Several advances in applying Monte Carlo simulations to polymeric systems have been reported in recent decades. The proposed methods address sampling challenges encountered in studying different aspects of polymeric systems. Tracking the above advances has become increasingly challenging due to the extensive literature generated in the field. Moreover, the incorporation of new methods in the existing Monte Carlo simulation packages is cumbersome due to their complexity. Identifying the foundational algorithms that are common to different methods can significantly ease their implementation and make them accessible to the broader simulation community. The present chapter classifies the Monte Carlo methods for polymeric systems based on their objectives and standard features of their algorithms. We begin the article by providing an overview of advanced Monte Carlo techniques used for polymeric systems and their specific applications. We then classify the above techniques into two broad categories: 1) Monte Carlo moves and 2) Advanced sampling schemes. The former category is further divided to distinguish the Monte Carlo moves in the canonical and other ensembles. The advanced sampling schemes attempt to improve Monte Carlo sampling via approaches other than Monte Carlo moves. We use the above classification to identify common features of the methods and derive general expressions that explain their implementation. Such a strategy can help readers select the methods that are suitable for their study and develop computer programs that can be easily modified to implement new methods.",
  "categories": [
    "cond-mat.soft",
    "cond-mat.stat-mech"
  ],
  "primary_category": "cond-mat.soft",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.11722",
  "pdf_url": null,
  "comment": "22 pages, 4 figures, 2 tables",
  "num_versions": null,
  "size_before_bytes": 0,
  "size_after_bytes": 0
}