{
  "title": "Conditional Handover Modelling for Increased Contention Free Resource Use in 5G-Advanced",
  "authors": [
    "Jedrzej Stanczak",
    "Umur Karabulut",
    "Ahmad Awada"
  ],
  "submission_date": "2023-07-27T13:56:57+00:00",
  "revised_dates": [],
  "abstract": "This paper elaborates on Conditional Handover (CHO) modelling, aimed at maximizing the use of contention free random access (CFRA) during mobility. This is a desirable behavior as CFRA increases the chance of fast and successful handover. In CHO this may be especially challenging as the time between the preparation and the actual cell change can be significantly longer in comparison to non-conditional handover. Thus, new means to mitigate this issue need to be defined. We present the scheme where beam-specific measurement reporting can lead to CFRA resource updating prior to CHO execution. We have run system level simulations to confirm that the proposed solution increases the ratio of CFRA attempts during CHO. In the best-case scenario, we observe a gain exceeding 13%. We also show how the average delay of completing the handover is reduced. To provide the entire perspective, we present at what expense these gains can be achieved by analyzing the increased signaling overhead for updating the random access resources. The study has been conducted for various network settings and considering higher frequency ranges at which the user communicates with the network. Finally, we provide an outlook on future extensions of the investigated solution.",
  "categories": [
    "cs.NI"
  ],
  "primary_category": "cs.NI",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14870",
  "pdf_url": "https://arxiv.org/pdf/2307.14870v1",
  "comment": "6 pages, 7 figures. Accepted for presentation at the 2023 Annual IEEE International Symposium on Personal, Indoor and Mobile Radio Communications (IEEE PIMRC 2023), to be held in Toronto, Canada",
  "num_versions": null,
  "size_before_bytes": 900341,
  "size_after_bytes": 534790
}