{
  "title": "A relook at the GZK Neutrino-Photon Connection: Impact of Extra-galactic Radio Background & UHECR properties",
  "authors": [
    "Sovan Chakraborty",
    "Poonam Mehta",
    "Prantik Sarmah"
  ],
  "submission_date": "2023-07-28T16:58:21+00:00",
  "revised_dates": [
    "2024-01-11T19:00:11+00:00"
  ],
  "abstract": "Ultra-high energy cosmic rays (UHECRs) beyond the Greisen-Zatsepin-Kuzmin (GZK) cut-off provide us with a unique opportunity to understand the universe at extreme energies. Secondary GZK photons and GZK neutrinos associated with the same interaction are indeed interconnected and render access to multi-messenger analysis of UHECRs. The GZK photon flux is heavily attenuated due to the interaction with Cosmic Microwave Background (CMB) and the Extra-galactic Radio Background (ERB). The present estimate of the ERB comprising of several model uncertainties together with the ARCADE2 radio results in large propagation uncertainties in the GZK photon flux. On the other hand, the weakly interacting GZK neutrino flux is unaffected by these propagation effects. In this work, we make an updated estimate of the GZK photon and GZK neutrino fluxes considering a wide variation of both the production and propagation properties of the UHECR like, the spectral index, the cut-off energy of the primary spectrum, the distribution of sources and the uncertainties in the ERB estimation. We explore the detection prospects of the GZK fluxes with various present and upcoming UHECR and UHE neutrino detectors such as Auger, TA, GRAND, ANITA, ARA, IceCube and IceCube-Gen2. The predicted fluxes are found to be beyond the reach of the current detectors. In future, proposed IceCube-Gen2, Auger upgrade and GRAND experiments will have the sensitivity to the predicted GZK photon and GZK neutrino fluxes. Such detection can put constraints on the UHECR source properties and the propagation effects due to the ERB. We also propose an indirect limit on the GZK photon flux using the neutrino-photon connection for any future detection of GZK neutrinos by the IceCube-Gen2 detector. We find this limit to be consistent with our GZK flux predictions.",
  "categories": [
    "astro-ph.HE",
    "hep-ph"
  ],
  "primary_category": "astro-ph.HE",
  "doi": "10.1088/1475-7516/2024/01/058",
  "journal_ref": "JCAP01(2024)058",
  "arxiv_id": "2307.15667",
  "pdf_url": "https://arxiv.org/pdf/2307.15667v2",
  "comment": "Accepted for publication in JCAP",
  "num_versions": null,
  "size_before_bytes": 2227013,
  "size_after_bytes": 1437697
}