{
  "title": "Can Cold Jupiters Sculpt the Edge-of-the-Multis?",
  "authors": [
    "Nicole Sobski",
    "Sarah C. Millholland"
  ],
  "submission_date": "2023-07-26T17:19:15+00:00",
  "revised_dates": [],
  "abstract": "Compact systems of multiple close-in super-Earths/sub-Neptunes (\"compact multis\") are a ubiquitous outcome of planet formation. It was recently discovered that the outer edges of compact multis are located at smaller orbital periods than expected from geometric and detection biases alone, suggesting some truncation or transition in the outer architectures. Here we test whether this \"edge-of-the-multis\" might be explained in any part by distant giant planets in the outer regions ($\\gtrsim 1$ AU) of the systems. We investigate the dynamical stability of observed compact multis in the presence of hypothetical giant ($\\gtrsim 0.5 \\ M_{\\mathrm{Jup}}$) perturbing planets. We identify what parameters would be required for hypothetical perturbing planets if they were responsible for dynamically sculpting the outer edges of compact multis. \"Edge-sculpting\" perturbers are generally in the range $P\\sim100-500$ days for the average compact multi, with most between $P\\sim200-300$ days. Given the relatively close separation, we explore the detectability of the hypothetical edge-sculpting perturbing planets, finding that they would be readily detectable in transit and radial velocity data. We compare to observational constraints and find it unlikely that dynamical sculpting from distant giant planets contributes significantly to the edge-of-the-multis. However, this conclusion could be strengthened in future work by a more thorough analysis of the detection yields of the perturbing planets.",
  "categories": [
    "astro-ph.EP"
  ],
  "primary_category": "astro-ph.EP",
  "doi": null,
  "journal_ref": null,
  "arxiv_id": "2307.14309",
  "pdf_url": null,
  "comment": "15 pages, 5 figures, accepted for publication in ApJ",
  "num_versions": null,
  "size_before_bytes": 3836130,
  "size_after_bytes": 383521
}